Repository: Klipper3d/klipper-translations
Catalog: locales/*/LC_MESSAGES/Bed_Level.po
Languages: hu, it

source: Bed leveling (sometimes also referred to as "bed tramming") is critical to getting high quality prints. If a bed is not properly "leveled" it can lead to poor bed adhesion, "warping", and subtle problems throughout the print. This document serves as a guide to performing bed leveling in Klipper.
hu: A tárgyasztal szintezése (néha más néven "bed tramming") kritikus fontosságú a jó minőségű nyomatok előállításához. Ha a tárgyasztal nem megfelelően van "szintezve", az rossz tapadáshoz, "vetemedéshez" és finom problémákhoz vezethet a nyomtatás során. Ez a dokumentum útmutatóként szolgál a tárgyasztal szintezés Klipperben történő elvégzéséhez.
it: La livellatura del piatto è fondamentale per ottenere stampe di alta qualità. Se un piatto non è adeguatamente "livellato" può portare a una scarsa adesione sul piatto, a una "deformazione" e a problemi minori durante la stampa. Questo documento serve come guida per eseguire il livellamento del piatto in Klipper.

source: It's important to understand the goal of bed leveling. If the printer is commanded to a position `X0 Y0 Z10` during a print, then the goal is for the printer's nozzle to be exactly 10mm from the printer's bed. Further, should the printer then be commanded to a position of `X50 Z10` the goal is for the nozzle to maintain an exact distance of 10mm from the bed during that entire horizontal move.
hu: Fontos megérteni a tárgyasztal szintezésének célját. Ha a nyomtatót egy `X0 Y0 Z10` pozícióba irányítjuk a nyomtatás során, akkor a cél az, hogy a nyomtató fúvókája pontosan 10 mm-re legyen a nyomtató tárgyasztalától. Továbbá, ha a nyomtatót ezután a `X50 Z10` pozícióba irányítjuk, a cél az, hogy a fúvóka pontosan 10 mm távolságot tartson a tárgyasztaltól a teljes vízszintes mozgás során.
it: È importante comprendere l'obiettivo del livellamento del piatto. Se alla stampante viene comandata una posizione `X0 Y0 Z10` durante una stampa, l'obiettivo è che l'ugello della stampante si trovi esattamente a 10 mm dal piatto della stampante. Inoltre, se poi la stampante dovesse essere comandata in una posizione di `X50 Z10`, l'obiettivo è che l'ugello mantenga una distanza esatta di 10 mm dal piatto durante l'intero movimento orizzontale.

source: In order to get good quality prints the printer should be calibrated so that Z distances are accurate to within about 25 microns (.025mm). This is a small distance - significantly smaller than the width of a typical human hair. This scale can not be measured "by eye". Subtle effects (such as heat expansion) impact measurements at this scale. The secret to getting high accuracy is to use a repeatable process and to use a leveling method that leverages the high accuracy of the printer's own motion system.
hu: A jó minőségű nyomatok érdekében a nyomtatót úgy kell kalibrálni, hogy a Z távolságok körülbelül 25 mikron (.025 mm) pontosságúak legyenek. Ez egy kis távolság - lényegesen kisebb, mint egy átlagos emberi hajszál szélessége. Ez a méretarány nem mérhető "szemmel". Finom hatások (mint például a hőtágulás) befolyásolják az ilyen skálán végzett méréseket. A nagy pontosság elérésének titka az ismételhető folyamat és a nyomtató saját mozgásrendszerének nagy pontosságát kihasználó szintezési módszer alkalmazása.
it: Per ottenere stampe di buona qualità, la stampante deve essere calibrata in modo che le distanze Z siano precise entro circa 25 micron (0,025 mm). Questa è una piccola distanza, significativamente più piccola della larghezza di un tipico capello umano. Questa scala non può essere misurata "a occhio". Gli effetti sottili (come l'espansione del calore) influiscono sulle misurazioni a questa scala. Il segreto per ottenere un'elevata precisione è utilizzare un processo ripetibile e un metodo di livellamento che sfrutti l'elevata precisione del sistema di movimento della stampante.

source: Choose the appropriate calibration mechanism
hu: Válaszd ki a megfelelő kalibrációs mechanizmust
it: Scegliere il meccanismo di calibrazione appropriato

source: Different types of printers use different methods for performing bed leveling. All of them ultimately depend on the "paper test" (described below). However, the actual process for a particular type of printer is described in other documents.
hu: A különböző típusú nyomtatók különböző módszereket használnak a tárgyasztal szintezésének elvégzésére. Ezek mindegyike végső soron a "papírteszt" függvénye (lásd alább). Az adott nyomtatótípusra vonatkozó tényleges eljárást azonban más dokumentumok írják le.
it: Diversi tipi di stampanti utilizzano metodi diversi per eseguire il livellamento del piatto. Tutti alla fine dipendono dal "test cartaceo" (descritto di seguito). Tuttavia, il processo effettivo per un particolare tipo di stampante è descritto in altri documenti.

source: Prior to running any of these calibration tools, be sure to run the checks described in the [config check document](Config_checks.md). It is necessary to verify basic printer motion before performing bed leveling.
hu: A kalibrációs eszközök futtatása előtt feltétlenül futtasd a [Konfigurációs ellenőrzések dokumentumban](Config_checks.md) leírt ellenőrzéseket. A nyomtató alapvető mozgásának ellenőrzése szükséges a tárgyasztal szintezésének elvégzése előtt.
it: Prima di eseguire uno di questi strumenti di calibrazione, assicurarsi di eseguire i controlli descritti nel [documento check di configurazione](Config_checks.md). È necessario verificare il movimento di base della stampante prima di eseguire il livellamento del piatto.

source: For printers with an "automatic Z probe" be sure to calibrate the probe following the directions in the [Probe Calibrate](Probe_Calibrate.md) document. For delta printers, see the [Delta Calibrate](Delta_Calibrate.md) document. For printers with bed screws and traditional Z endstops, see the [Manual Level](Manual_Level.md) document.
hu: A "automatikus Z-szondával" rendelkező nyomtatók esetében a szondát mindenképpen kalibráld a [Probe Calibrate](Probe_Calibrate.md) dokumentumban található utasítások szerint. Delta nyomtatók esetében lásd a [Delta Calibrate](Delta_Calibrate.md) dokumentumot. Szintezőcsavarokkal és hagyományos Z végállással rendelkező nyomtatók esetében lásd a [Manual Level](Manual_Level.md) dokumentumot.
it: Per le stampanti con una "sonda Z automatica", assicurarsi di calibrare la sonda seguendo le istruzioni nel documento [Probe Calibrate](Probe_Calibrate.md). Per le stampanti delta, vedere il documento [Delta Calibrate](Delta_Calibrate.md). Per le stampanti con viti di fissaggio e fermi Z tradizionali, vedere il documento [Manual Level](Manual_Level.md).

source: During calibration it may be necessary to set the printer's Z `position_min` to a negative number (eg, `position_min = -2`). The printer enforces boundary checks even during calibration routines. Setting a negative number allows the printer to move below the nominal position of the bed, which may help when trying to determine the actual bed position.
hu: A kalibrálás során szükség lehet arra, hogy a nyomtató Z `position_min` értékét negatív számra állítsd be (pl. `position_min = -2`). A nyomtató a kalibrációs rutinok során is végrehajtja a határérték-ellenőrzést. A negatív szám beállítása lehetővé teszi, hogy a nyomtató a tárgyasztal névleges pozíciója alá mozogjon, ami segíthet a tárgyasztal tényleges pozíciójának meghatározásakor.
it: Durante la calibrazione potrebbe essere necessario impostare la Z `position_min` della stampante su un numero negativo (ad esempio, `position_min = -2`). La stampante applica i controlli dei confini anche durante le routine di calibrazione. L'impostazione di un numero negativo consente alla stampante di spostarsi al di sotto della posizione nominale del piatto, il che può aiutare quando si tenta di determinare la posizione effettiva del piatto.

source: The "paper test"
hu: A "papírteszt"
it: Il "test con la carta"

source: The primary bed calibration mechanism is the "paper test". It involves placing a regular piece of "copy machine paper" between the printer's bed and nozzle, and then commanding the nozzle to different Z heights until one feels a small amount of friction when pushing the paper back and forth.
hu: A tárgyasztal szintezésének elsődleges mechanizmusa a "papírteszt". Ennek során egy normál "fénymásolópapírt" helyezünk a nyomtató tárgyasztala és a fúvóka közé, majd a fúvókát különböző Z magasságba állítjuk, amíg a papír előre-hátra tolása közben egy kis súrlódást nem érzünk.
it: Il meccanismo primario di calibrazione del piatto primario è il "test della carta". Si tratta di posizionare un normale pezzo di "carta per fotocopiatrice" tra il piatto della stampante e l'ugello, quindi comandare l'ugello a diverse altezze Z finché non si avverte una piccola quantità di attrito quando si spinge la carta avanti e indietro.

source: It is important to understand the "paper test" even if one has an "automatic Z probe". The probe itself often needs to be calibrated to get good results. That probe calibration is done using this "paper test".
hu: Fontos megérteni a "papírtesztet" még akkor is, ha valakinek van "automatikus szintezője". Magát a szondát gyakran kalibrálni kell a jó eredmények eléréséhez. A szonda kalibrálása a "papírteszt" segítségével történik.
it: È importante comprendere il "test della carta" anche se si dispone di una "sonda Z automatica". La sonda stessa deve spesso essere calibrata per ottenere buoni risultati. La calibrazione della sonda viene eseguita utilizzando questo "test della carta".

source: The first step of the paper test is to inspect the printer's nozzle and bed. Make sure there is no plastic (or other debris) on the nozzle or bed.
hu: A papírteszt első lépése a nyomtató fúvókájának és tárgyasztalának ellenőrzése. Győződj meg róla, hogy nincs műanyag (vagy más törmelék) a fúvókán vagy a tárgyasztalon.
it: Il primo passaggio del test della carta consiste nell'ispezione dell'ugello e del piatto della stampante. Assicurati che non ci sia plastica (o altri detriti) sull'ugello o sul letto.

source: **Inspect the nozzle and bed to ensure no plastic is present!**
hu: **Ellenőrizd a fúvókát és a tárgyasztalt, hogy nincs-e benne/rajta műanyag!**
it: **Ispeziona l'ugello e il piatto per assicurarti che non sia presente plastica!**

source: If there is plastic on the nozzle then heat up the extruder and use a metal tweezers to remove that plastic. Wait for the extruder to fully cool to room temperature before continuing with the paper test. While the nozzle is cooling, use the metal tweezers to remove any plastic that may ooze out.
hu: Ha műanyag van a fúvókán, akkor melegítsd fel az extrudert, és egy fém csipesszel távolítsd el a műanyagot. Várd meg, amíg az extruder teljesen lehűl szobahőmérsékletűre, mielőtt folytatod a papírtesztet. Amíg a fúvóka hűl, a fémcsipesszel távolítsd el az esetlegesen kiszivárgó műanyagot.
it: Se c'è della plastica sull'ugello, riscalda l'estrusore e usa una pinzetta di metallo per rimuovere quella plastica. Attendere che l'estrusore si raffreddi completamente a temperatura ambiente prima di continuare con il test della carta. Mentre l'ugello si sta raffreddando, usa le pinzette di metallo per rimuovere la plastica che potrebbe fuoriuscire.

source: **Always perform the paper test when both nozzle and bed are at room temperature!**
hu: **A papírtesztet mindig akkor végezd el, amikor a fúvóka és a tárgyasztal szobahőmérsékleten van!**
it: **Esegui sempre il test della carta quando sia l'ugello che il letto sono a temperatura ambiente!**

source: It may seem odd to calibrate the distance at room temperature when the goal is to have a consistent distance when heated. However, if one calibrates when the nozzle is heated, it tends to impart small amounts of molten plastic on to the paper, which changes the amount of friction felt. That makes it harder to get a good calibration. Calibrating while the bed/nozzle is hot also greatly increases the risk of burning oneself. The amount of thermal expansion is stable, so it is easily accounted for later in the calibration process.
hu: Furcsának tűnhet, hogy a távolságot szobahőmérsékleten kalibráljuk, amikor a cél az, hogy melegítéskor egyenletes távolságot érjünk el. Ha azonban a fúvókát melegítve kalibráljuk, akkor hajlamos kis mennyiségű olvadt műanyagot juttatni a papírra, ami megváltoztatja az érzékelt súrlódás mértékét. Ez megnehezíti a jó kalibrációt. Ha a szintezés felfűtött állapotban történik, akkor nagymértékben megnő a megégés veszélye is. A hőtágulás mértéke stabil, így a kalibrálás során később könnyen figyelembe vehető.
it: Può sembrare strano calibrare la distanza a temperatura ambiente quando l'obiettivo è avere una distanza costante quando riscaldata. Tuttavia, se si calibra quando l'ugello è riscaldato, tende a rilasciare piccole quantità di plastica fusa alla carta, il che cambia la quantità di attrito sentito. Ciò rende più difficile ottenere una buona calibrazione. La calibrazione mentre il letto/ugello è caldo aumenta notevolmente anche il rischio di ustione. La quantità di espansione termica è stabile, quindi è facilmente contabilizzabile più avanti nel processo di calibrazione.

source: **Use an automated tool to determine precise Z heights!**
hu: **Automatizált eszközzel határozd meg a pontos Z magasságot!**
it: **Utilizza uno strumento automatizzato per determinare l'altezza Z precisa!**

source: Klipper has several helper scripts available (eg, MANUAL_PROBE, Z_ENDSTOP_CALIBRATE, PROBE_CALIBRATE, DELTA_CALIBRATE). See the documents [described above](#choose-the-appropriate-calibration-mechanism) to choose one of them.
hu: A Klipperben számos segédszkript áll rendelkezésre (pl. MANUAL_PROBE, Z_ENDSTOP_CALIBRATE, PROBE_CALIBRATE, DELTA_CALIBRATE). Lásd a dokumentumokat [fentebb leírva](#choose-the-appropriate-calibration-mechanism), hogy válassz közülük egyet.
it: Klipper ha diversi script di supporto disponibili (ad esempio, MANUAL_PROBE, Z_ENDSTOP_CALIBRATE, PROBE_CALIBRATE, DELTA_CALIBRATE). Consulta i documenti [descritti sopra](#scegli-il-meccanismo-di-calibrazione-appropriato) per sceglierne uno.

source: Run the appropriate command in the OctoPrint terminal window. The script will prompt for user interaction in the OctoPrint terminal output. It will look something like:
hu: Futtasd a megfelelő parancsot az OctoPrint konzoljában. A szkript az OctoPrint terminál kimenetén kéri a felhasználó beavatkozását. Valahogy így fog kinézni:
it: Eseguire il comando appropriato nella finestra del terminale di OctoPrint. Lo script richiederà l'interazione dell'utente nell'output del terminale OctoPrint. Sembrerà qualcosa come:

source: The current height of the nozzle (as the printer currently understands it) is shown between the "--> <--". The number to the right is the height of the last probe attempt just greater than the current height, and to the left is the last probe attempt less than the current height (or ?????? if no attempt has been made).
hu: A fúvóka aktuális magassága (ahogyan azt a nyomtató jelenleg értelmezi) a "--> <--" között jelenik meg. A jobb oldali szám a legutóbbi mérés magassága, amely éppen nagyobb, mint az aktuális magasság, a bal oldali pedig a legutóbbi mérés magassága, amely kisebb, mint az aktuális magasság (vagy ??????, ha nem történt kísérlet).
it: L'altezza attuale dell'ugello (come la intende attualmente la stampante) è mostrata tra "--> <--". Il numero a destra è l'altezza dell'ultimo tentativo di sonda appena maggiore dell'altezza attuale e a sinistra è l'ultimo tentativo di sonda inferiore all'altezza attuale (o ?????? se non è stato effettuato alcun tentativo).

source: Place the paper between the nozzle and bed. It can be useful to fold a corner of the paper so that it is easier to grab. (Try not to push down on the bed when moving the paper back and forth.)
hu: Helyezd a papírt a fúvóka és a tárgyasztal közé. Hasznos lehet a papír egyik sarkát behajtani, hogy könnyebb legyen megfogni. (Próbáld úgy, hogy ne nyomd le a tárgyasztalt, amikor a papírt előre-hátra mozgatod).
it: Metti la carta tra l'ugello e il letto. Può essere utile piegare un angolo della carta in modo che sia più facile da afferrare. (Cerca di non spingere il piatto quando muovi la carta avanti e indietro.)

source: Use the TESTZ command to request the nozzle to move closer to the paper. For example:
hu: A TESTZ paranccsal kérheted, hogy a fúvóka közelebb menjen a papírhoz. Például:
it: Utilizzare il comando TESTZ per richiedere all'ugello di avvicinarsi alla carta. Per esempio:

source: The TESTZ command will move the nozzle a relative distance from the nozzle's current position. (So, `Z=-.1` requests the nozzle to move closer to the bed by .1mm.) After the nozzle stops moving, push the paper back and forth to check if the nozzle is in contact with the paper and to feel the amount of friction. Continue issuing TESTZ commands until one feels a small amount of friction when testing with the paper.
hu: A TESTZ parancs a fúvókát az aktuális pozíciójától relatív távolságra mozgatja. (Tehát a `Z=-.1` azt kéri, hogy a fúvóka 0,1 mm-rel közelebb kerüljön a tárgyasztalhoz). Miután a fúvóka megállt, told előre-hátra a papírt, hogy ellenőrizd, hogy a fúvóka érintkezik-e a papírral, és hogy érezd a súrlódás mértékét. Folytasd a TESTZ parancsok kiadását mindaddig, amíg a papírral való tesztelésekkor nem érzel egy kis súrlódást.
it: Il comando TESTZ sposterà l'ugello di una distanza relativa dalla posizione corrente dell'ugello. (Quindi, `Z=-.1` richiede che l'ugello si avvicini al piatto di 0,1 mm.) Dopo che l'ugello ha smesso di muoversi, spingere la carta avanti e indietro per controllare se l'ugello è in contatto con la carta e per sentire la quantità di attrito. Continua a emettere comandi TESTZ finché non si avverte una piccola quantità di attrito durante il test con la carta.

source: If too much friction is found then one can use a positive Z value to move the nozzle up. It is also possible to use `TESTZ Z=+` or `TESTZ Z=-` to "bisect" the last position - that is to move to a position half way between two positions. For example, if one received the following prompt from a TESTZ command:
hu: Ha túl nagy a súrlódás, akkor egy pozitív Z értéket használhatunk a fúvóka felfelé mozgatására. Lehetőség van a `TESTZ Z=+` vagy a `TESTZ Z=-` használatára is, hogy "felezzük" az utolsó pozíciót - azaz két pozíció között félúton lévő pozícióba lépjünk. Például, ha a TESTZ parancs a következő felszólítást adná:
it: Se si trova troppo attrito, è possibile utilizzare un valore Z positivo per spostare l'ugello verso l'alto. È anche possibile utilizzare `TESTZ Z=+` o `TESTZ Z=-` per "sezionare in due" l'ultima posizione, ovvero per spostarsi in una posizione a metà strada tra due posizioni. Ad esempio, se si riceve il seguente prompt da un comando TESTZ:

source: Then a `TESTZ Z=-` would move the nozzle to a Z position of 0.180 (half way between 0.130 and 0.230). One can use this feature to help rapidly narrow down to a consistent friction. It is also possible to use `Z=++` and `Z=--` to return directly to a past measurement - for example, after the above prompt a `TESTZ Z=--` command would move the nozzle to a Z position of 0.130.
hu: Ezután egy `TESTZ Z=-` a fúvókát 0,180 Z pozícióba (a 0,130 és 0,230 közötti félútra) mozgatja. Ezt a funkciót arra lehet használni, hogy segítsen gyorsan leszűkíteni egy konzisztens súrlódást. A `Z=++` és `Z=--` parancsok használatával közvetlenül visszatérhetünk egy korábbi méréshez - például a fenti felszólítás után a `TESTZ Z=--` parancs a fúvókát a 0,130-as Z pozícióba mozgatná.
it: Quindi un `TESTZ Z=-` sposterebbe l'ugello in una posizione Z di 0,180 (a metà strada tra 0,130 e 0,230). È possibile utilizzare questa funzione per ridurre rapidamente a un attrito costante. È anche possibile usare `Z=++` e `Z=--` per tornare direttamente a una misurazione passata - per esempio, dopo il prompt sopra un comando `TESTZ Z=--` sposterebbe l'ugello su una Z posizione di 0,130.

source: After finding a small amount of friction run the ACCEPT command:
hu: Miután érzékelhető egy kis súrlódás, add ki az ACCEPT parancsot:
it: Dopo aver trovato una piccola quantità di attrito, eseguire il comando ACCETTA:

source: This will accept the given Z height and proceed with the given calibration tool.
hu: Ez elfogadja a megadott Z magasságot, és az adott kalibrációs eszközzel folytatja a munkát.
it: Questo accetterà l'altezza Z data e procederà con lo strumento di calibrazione fornito.

source: The exact amount of friction felt isn't crucial, just as the amount of thermal expansion and exact width of the paper isn't crucial. Just try to obtain the same amount of friction each time one runs the test.
hu: Az érzékelt súrlódás pontos mértéke nem döntő fontosságú, ahogyan a hőtágulás mértéke és a papír pontos szélessége sem döntő fontosságú. Csak próbálj meg minden egyes alkalommal ugyanannyi súrlódást elérni, amikor a tesztet lefuttatod.
it: L'esatta quantità di attrito percepito non è cruciale, così come la quantità di espansione termica e l'esatta larghezza della carta non sono cruciali. Cerca solo di ottenere la stessa quantità di attrito ogni volta che esegui il test.

source: If something goes wrong during the test, one can use the `ABORT` command to exit the calibration tool.
hu: Ha a teszt során valami rosszul megy, az `ABORT` paranccsal kiléphetünk a kalibrációs eszközből.
it: Se qualcosa va storto durante il test, è possibile utilizzare il comando `ABORT` per uscire dallo strumento di calibrazione.

source: Determining Thermal Expansion
hu: A hőtágulás meghatározása
it: Determinare l'espansione termica

source: This type of calculation is generally not needed as most users find the simple "paper test" provides good results.
hu: Ilyen típusú számításokra általában nincs szükség, mivel a legtöbb felhasználó szerint az egyszerű "papírteszt" jó eredményeket ad.
it: Questo tipo di calcolo generalmente non è necessario poiché la maggior parte degli utenti ritiene che il semplice "test cartaceo" fornisca buoni risultati.

source: The easiest way to make this calculation is to print a test object that has straight walls on all sides. The large hollow square found in [docs/prints/square.stl](prints/square.stl) can be used for this. When slicing the object, make sure the slicer uses the same layer height and extrusion widths for the first level that it does for all subsequent layers. Use a coarse layer height (the layer height should be around 75% of the nozzle diameter) and do not use a brim or raft.
hu: A számítás legegyszerűbben úgy végezhető el, ha kinyomtatunk egy olyan tesztobjektumot, amelynek minden oldalán egyenes falak vannak. Ehhez a [docs/prints/square.stl](prints/square.stl) fájlban található nagy, üreges négyzetet használhatjuk. Az objektum szeletelésekor győződj meg róla, hogy a szeletelő az első szinthez ugyanazt a rétegmagasságot és extrudálási szélességet használja, mint az összes további réteghez. Használj durva rétegmagasságot (a rétegmagasságnak a fúvóka átmérőjének körülbelül 75%-ának kell lennie), és ne használj peremet vagy szoknyát.
it: Il modo più semplice per eseguire questo calcolo è stampare un oggetto di prova con pareti dritte su tutti i lati. Il cubo vuoto che si trova in [docs/prints/square.stl](prints/square.stl) può essere usato per questo. Quando si fa lo slicing l'oggetto, assicurarsi che lo slicer utilizzi la stessa altezza del livello e la stessa larghezza di estrusione per il primo livello che utilizza per tutti i livelli successivi. Utilizzare un'altezza dello strato grossolana (l'altezza dello strato dovrebbe essere circa il 75% del diametro dell'ugello) e non utilizzare un bordo o una raft.
