Repository: Klipper3d/klipper-translations
Catalog: locales/*/LC_MESSAGES/Bootloader_Entry.po
Languages: hu

source: Bootloader Entry
hu: Bootloader belépés

source: Klipper can be instructed to reboot into a [Bootloader](Bootloaders.md) in one of the following ways:
hu: Klipper utasítható, hogy újraindítsa a [Bootloadert](Bootloaders.md) az alábbi módok egyikében:

source: Requesting the bootloader
hu: A bootloader kérése

source: Virtual Serial
hu: Virtuális sorozat

source: If a virtual (USB-ACM) serial port is in use, pulsing DTR while at 1200 baud will request the bootloader.
hu: Ha virtuális (USB-ACM) soros port van használatban, a DTR pulzálása 1200 baud mellett kéri a rendszerbetöltőt.

source: To enter the bootloader using python (using `flash_usb`):
hu: Belépés a bootloader-be python segítségével (using `flash_usb`):

source: > cd klipper/scripts > python3 -c 'import flash_usb as u; u.enter_bootloader("<DEVICE>")' Entering bootloader on <DEVICE>
hu: > cd klipper/scripts > python3 -c 'import flash_usb as u; u.enter_bootloader("<DEVICE>")' Bootloader belépése a <DEVICE> rendszeren

source: Where `<DEVICE>` is your serial device, such as `/dev/serial.by-id/usb-Klipper[...]` or `/dev/ttyACM0`
hu: Ahol `<DEVICE>` a soros eszköz, például `/dev/serial.by-id/usb-Klipper[...]` vagy `/dev/ttyACM0`

source: Note that if this fails, no output will be printed, success is indicated by printing `Entering bootloader on <DEVICE>`.
hu: Vedd figyelembe, hogy ha ez nem sikerül, nem jelenik meg a kimenet, a sikert az `Entering bootloader on <DEVICE>` kiírása jelzi.

source: `<Ctrl-A><Ctrl-P>` means holding `Ctrl`, pressing and releasing `a`, pressing and releasing `p`, then releasing `Ctrl`
hu: `<Ctrl-A><Ctrl-P>` azt jelenti, hogy lenyomva tartjuk a "Ctrl"-t, megnyomjuk és elengedjük az "a"-t, megnyomjuk és elengedjük a "p"-t, majd elengedjük a "Ctrl"-t

source: Physical serial
hu: Fizikai sorszám

source: If a physical serial port is being used on the MCU (even if a USB serial adapter is being used to connect to it), sending the string `<SPACE><FS><SPACE>Request Serial Bootloader!!<SPACE>~`.
hu: Ha az MCU-n fizikai soros portot használunk (még akkor is, ha USB soros adaptert használunk a csatlakozáshoz), akkor a `<SPACE><FS><SPACE>Request Serial Bootloader!!<SPACE>~` karakterlánc elküldése szükséges.

source: `<SPACE>` is an ASCII literal space, 0x20.
hu: A `<SPACE>` egy ASCII szóköz, 0x20.

source: `<FS>` is the ASCII File Separator, 0x1c.
hu: A `<FS>` az ASCII fájlelválasztó, 0x1c.

source: Note that this is not a valid message as per the [MCU Protocol](Protocol.md#micro-controller-interface), but sync characters(`~`) are still respected.
hu: Vedd figyelembe, hogy ez nem érvényes üzenet az [MCU protokoll](Protocol.md#micro-controller-interface) szerint, de a szinkronizáló karaktereket (`~`) továbbra is tiszteletben kell tartani.

source: Because this message must be the only thing in the "block" it is received in, prefixing an extra sync character can increase reliability if other tools were previously accessing the serial port.
hu: Mivel ennek az üzenetnek kell lennie az egyetlen dolognak abban a "blokkban", amelyben érkezik, egy extra szinkronizáló karakter előtaggal növelheted a megbízhatóságot, ha korábban más eszközök is hozzáfértek a soros porthoz.

source: Shell
hu: Parancsértelmező

source: Where `<DEVICE>` is your serial port, such as `/dev/ttyS0`, or `/dev/serial/by-id/gpio-serial2`, and
hu: Ahol `<DEVICE>` a Te soros portod, például `/dev/ttyS0`, vagy `/dev/serial/by-id/gpio-serial2` és

source: `<BAUD>` is the baud rate of the serial port, such as `115200`.
hu: `<BAUD>` a soros port buszsebessége, például `115200`.

source: If CANBUS is in use, a special [admin message](CANBUS_protocol.md#admin-messages) will request the bootloader. This message will be respected even if the device already has a nodeid, and will also be processed if the mcu is shutdown.
hu: Ha a CANBUS használatban van, egy speciális [admin üzenet](CANBUS_protocol.md#admin-messages) kéri a bootloadert. Ezt az üzenetet akkor is figyelembe veszi, ha az eszköznek már van nodeid-ja, és akkor is feldolgozza, ha az MCU le van kapcsolva.

source: This method also applies to devices operating in [CANBridge](CANBUS.md#usb-to-can-bus-bridge-mode) mode.
hu: Ez a módszer a [CANBridge](CANBUS.md#usb-to-can-bus-bridge-mode) üzemmódban működő eszközökre is vonatkozik.

source: Katapult's flashtool.py
hu: Katapult flashtool.py

source: Where `<CAN_IFACE>` is the can interface to use. If using `can0`, both the `-i` and `<CAN_IFACE>` may be omitted.
hu: Ahol `<CAN_IFACE>` a használni kívánt can-interfész. Ha a `can0`-t használjuk, az `-i` és a `<CAN_IFACE>` is elhagyható.

source: `<UUID>` is the UUID of your CAN device.
hu: A `<UUID>` a CAN-eszköz UUID-je.

source: See the [CANBUS Documentation](CANBUS.md#finding-the-canbus_uuid-for-new-micro-controllers) for information on finding the CAN UUID of your devices.
hu: Lásd a [CANBUS dokumentáció](CANBUS.md#finding-the-canbus_uuid-for-new-micro-controllers) című dokumentumot az eszközök CAN UUID-jének megtalálására vonatkozó információkért.

source: Entering the bootloader
hu: Belépés a bootloaderbe

source: When klipper receives one of the above bootloader requests:
hu: Amikor a klipper megkapja a fenti bootloader kérések egyikét:

source: If Katapult (formerly known as CANBoot) is available, klipper will request that Katapult stay active on the next boot, then reset the MCU (therefore entering Katapult).
hu: Ha a Katapult (korábbi nevén CANBoot) elérhető, a klipper kérni fogja, hogy a Katapult maradjon aktív a következő indításkor, majd visszaállítja az MCU-t (ezért belép a Katapultba).

source: If Katapult is not available, klipper will then try to enter a platform-specific bootloader, such as STM32's DFU mode([see note](#stm32-dfu-warning)).
hu: Ha a Katapult nem elérhető, akkor a klipper megpróbál egy platform-specifikus bootloaderbe belépni, például az STM32 DFU módjába([lásd megjegyzés](#stm32-dfu-warning)).

source: In short, Klipper will reboot to Katapult if installed, then a hardware specific bootloader if available.
hu: Röviden, a Klipper újraindítja a Katapultot, ha telepítve van, majd egy hardver-specifikus bootloadert, ha rendelkezésre áll.

source: For details about the specific bootloaders on various platforms see [Bootloaders](Bootloaders.md)
hu: A különböző platformok speciális bootloadereiről részletesen lásd [Bootloaderek](Bootloaders.md)

source: Notes
hu: Megjegyzések

source: STM32 DFU Warning
hu: STM32 DFU Figyelmeztetés

source: Note that on some boards, like the Octopus Pro v1, entering DFU mode can cause undesired actions (such as powering the heater while in DFU mode). It is recommended to disconnect heaters, and otherwise prevent undesired operations when using DFU mode. Consult the documentation for your board for more details.
hu: Ne feledd, hogy néhány lapon, mint például az Octopus Pro v1, a DFU módba való belépés nem kívánt műveleteket okozhat (például a fűtőberendezés bekapcsolása DFU módban). Javasoljuk, hogy a DFU mód használatakor a fűtőberendezéseket kapcsold ki, és más módon akadályozd meg a nemkívánatos műveleteket. További részletekért olvasd el az alaplap dokumentációját.
