Repository: Klipper3d/klipper-translations
Catalog: locales/*/LC_MESSAGES/CANBUS_Troubleshooting.po
Languages: hu

source: CANBUS Troubleshooting
hu: CANBUS Hibaelhárítás

source: This document provides information on troubleshooting communication issues when using [Klipper with CAN bus](CANBUS.md).
hu: Ez a dokumentum információt ad a hibaelhárítás kommunikációs problémáiról a [Klipper és CAN bus](CANBUS.md) használatakor.

source: Verify CAN bus wiring
hu: CAN-busz vezetékek ellenőrzése

source: The first step in troubleshooting communication issues is to verify the CAN bus wiring.
hu: A kommunikációs problémák hibaelhárításának első lépése a CAN-busz vezetékeinek ellenőrzése.

source: Be sure there are exactly two 120 Ohm [terminating resistors](CANBUS.md#terminating-resistors) on the CAN bus. If the resistors are not properly installed then messages may not be able to be sent at all or the connection may have sporadic instability.
hu: Győződj meg róla, hogy pontosan két 120 Ohm [lezáró ellenállás](CANBUS.md#terminating-resistors) van a CAN-buszon. Ha az ellenálások nem megfelelően vannak elhelyezve, akkor az üzenetek egyáltalán nem tudnak átmenni, vagy a kapcsolatnak sporadikus instabilitása lehet.

source: The CANH and CANL bus wiring should be twisted around each other. At a minimum, the wiring should have a twist every few centimeters. Avoid twisting the CANH and CANL wiring around power wires and ensure that power wires that travel parallel to the CANH and CANL wires do not have the same amount of twists.
hu: A CANH és a CANL buszvezetékeknek csavart érpároknak kell lennie. Vagy legalább pár centiméterenként csavarni kell az érpárokat. Kerüld el a CANH és a CANL vezetékek erős áramú vezetékekkel való kapcsolatát. Kerüld el és biztosítsd, hogy az erős áramú vezetékek, amelyek párhuzamosan futnak a CANH és a CANL vezetékekkel ne rendelkeznek azonos mennyiségű érpár csavarással.

source: Verify that all plugs and wire crimps on the CAN bus wiring are fully secured. Movement of the printer toolhead may jostle the CAN bus wiring causing a bad wire crimp or unsecured plug to result in intermittent communication errors.
hu: Ellenőrizd, hogy a CAN-busz kábelezésén lévő összes csatlakozó és vezetékrögzítő jól van rögzítve. A nyomtatófej mozgása megrázhatja a CAN-busz vezetékeit, ami egy rosszul rögzített vagy rögzítetlen csatlakozó miatt időszakos kommunikációs hibákat okozhat.

source: Check for incrementing bytes_invalid counter
hu: A bytes_invalid számláló növelésének ellenőrzése

source: The Klipper log file will report a `Stats` line once a second when the printer is active. These "Stats" lines will have a `bytes_invalid` counter for each micro-controller. This counter should not increment during normal printer operation (it is normal for the counter to be non-zero after a RESTART and it is not a concern if the counter increments once a month or so). If this counter increments on a CAN bus micro-controller during normal printing (it increments every few hours or more frequently) then it is an indication of a severe problem.
hu: A Klipper naplófájl másodpercenként egyszer jelent egy `Stats` sort, amikor a nyomtató aktív. Ezek a "Stats" sorok minden mikrokontroller esetében tartalmaznak egy `bytes_invalid` számlálót. Ennek a számlálónak nem szabad növekednie a nyomtató normál működése során (normális, hogy a számláló nem nulla az újraindítás után, és nem jelent gondot, ha a számláló havonta egyszer növekszik). Ha ez a számláló egy CAN-buszos mikrovezérlőn normál nyomtatás közben növekszik (néhány óránként vagy gyakrabban), akkor az súlyos problémára utal.

source: Incrementing `bytes_invalid` on a CAN bus connection is a symptom of reordered messages on the CAN bus. There are two known causes of reordered messages:
hu: A `bytes_invalid` növekedése egy CAN-busz kapcsolaton a CAN-buszon lévő átrendezett üzenetek tünete. Az újrarendezett üzeneteknek két ismert oka van:

source: Old versions of the popular candlight_firmware for USB CAN adapters had a bug that could cause reordered messages. If using a USB CAN adapter running this firmware then make sure to update to the latest firmware if incrementing `bytes_invalid` is observed.
hu: Az USB CAN-adapterek népszerű candlight_firmware-jének régi verzióiban volt egy hiba, amely átrendezett üzeneteket okozhatott. Ha ilyen firmware-t futtató USB CAN adaptert használsz, akkor mindenképpen frissítsd a legújabb firmware-re, ha a `bytes_invalid` növekedését észleled.

source: Some Linux kernel builds for embedded devices have been known to reorder CAN bus messages. It may be necessary to use an alternative Linux kernel or to use alternative hardware that supports mainstream Linux kernels that do not exhibit this problem.
hu: Néhány beágyazott eszközökhöz készült Linux kernelről ismert, hogy átrendezi a CAN-busz üzeneteket. Szükség lehet egy alternatív Linux kernel használatára, vagy olyan alternatív hardverek használatára, amelyek támogatják a mainstream Linux kerneleket, amelyek nem mutatják ezt a problémát.

source: Reordered messages is a severe problem that must be fixed. It will result in unstable behavior and can lead to confusing errors at any part of a print.
hu: Az átrendezett üzenetek súlyos problémát jelentenek, amelyet orvosolni kell. Ez instabil viselkedést eredményez, és zavaró hibákhoz vezethet a nyomtatás bármelyik részénél.

source: Obtaining candump logs
hu: Candump naplók beszerzése

source: The CAN bus messages sent to and from the micro-controller are handled by the Linux kernel. It is possible to capture these messages from the kernel for debugging purposes. A log of these messages may be of use in diagnostics.
hu: A mikrokontrollerhez küldött és onnan érkező CAN-busz üzeneteket a Linux kernel kezeli. Lehetőség van arra, hogy ezeket az üzeneteket a kernelből hibakeresés céljából rögzítsük. Ezen üzenetek naplózása hasznos lehet a diagnosztikában.

source: The Linux [can-utils](https://github.com/linux-can/can-utils) tool provides the capture software. It is typically installed on a machine by running:
hu: A Linux [can-utils](https://github.com/linux-can/can-utils) eszköz biztosítja a rögzítő szoftvert. Ezt általában a következő futtatásával telepíthetjük a gépre:

source: Once installed, one may obtain a capture of all CAN bus messages on an interface with the following command:
hu: A telepítés után a következő paranccsal az összes CAN-busz üzenetet rögzíthetjük egy interfészen:

source: One can view the resulting log file (`mycanlog` in the example above) to see each raw CAN bus message that was sent and received by Klipper. Understanding the content of these messages will likely require low-level knowledge of Klipper's [CANBUS protocol](CANBUS_protocol.md) and Klipper's [MCU commands](MCU_Commands.md).
hu: A kapott naplófájlban (a fenti példában a `mycanlog`) megtekinthetjük a Klipper által küldött és fogadott minden egyes nyers CAN-busz üzenetet. Ezen üzenetek tartalmának megértéséhez valószínűleg a Klipper [CANBUS protokoll](CANBUS_protocol.md) és a Klipper [MCU parancsok](MCU_Commands.md) alacsony szintű ismerete szükséges.

source: Parsing Klipper messages in a candump log
hu: Klipper üzenetek elemzése a candump naplóban

source: One may use the `parsecandump.py` tool to parse the low-level Klipper micro-controller messages contained in a candump log. Using this tool is an advanced topic that requires knowledge of Klipper [MCU commands](MCU_Commands.md). For example:
hu: A `parsecandump.py` eszközt használhatjuk a candump naplóban található alacsony szintű Klipper mikrokontroller üzenetek elemzésére. Ennek az eszköznek a használata haladó témakör, amelyhez a Klipper [MCU parancsok](MCU_Commands.md) ismerete szükséges. Például:

source: This tool produces output similar to the [parsedump tool](Debugging.md#translating-gcode-files-to-micro-controller-commands). See the documentation for that tool for information on generating the Klipper micro-controller data dictionary.
hu: Ez az eszköz a [parsedump eszközhöz](Debugging.md#translating-gcode-files-to-micro-controller-commands) hasonló kimenetet állít elő. A Klipper mikrokontroller adatszótár generálásával kapcsolatos információkért lásd az említett eszköz dokumentációját.

source: In the above example, `108` is the [CAN bus id](CANBUS_protocol.md#micro-controller-id-assignment). It is a hexadecimal number. The id `108` is assigned by Klipper to the first micro-controller. If the CAN bus has multiple micro-controllers on it, then the second micro-controller would be `10a`, the third would be `10c`, and so on.
hu: A fenti példában a "108" a [CAN-busz azonosítója](CANBUS_protocol.md#micro-controller-id-assignment). Ez egy hexadecimális szám. A Klipper a `108` azonosítót az első mikrokontrollerhez rendeli. Ha a CAN-buszon több mikrokontroller van, akkor a második mikrokontroller `10a`, a harmadik `10c`, és így tovább.

source: The candump log must be produced using the `-tz -Ddex` command-line arguments (for example: `candump -tz -Ddex can0,#FFFFFFFF`) in order to use the `parsecandump.py` tool.
hu: A candump naplót a `-tz -Ddex` parancssori argumentummal kell létrehozni (például: `candump -tz -Ddex can0,#FFFFFFFFFFFF`) a `parsecandump.py` eszköz használatához.

source: Using a logic analyzer on the canbus wiring
hu: Logikai analizátor használata a canbus kábelezésen

source: The [Sigrok Pulseview](https://sigrok.org/wiki/PulseView) software along with a low-cost [logic analyzer](https://en.wikipedia.org/wiki/Logic_analyzer) can be useful for diagnosing CAN bus signaling. This is an advanced topic likely only of interest to experts.
hu: A [Sigrok Pulseview](https://sigrok.org/wiki/PulseView) szoftver egy olcsó [logikai analizátorral](https://en.wikipedia.org/wiki/Logic_analyzer) együtt hasznos lehet a CAN-busz jelátvitelének diagnosztizálásához. Ez egy haladó téma, amely valószínűleg csak a szakértők számára érdekes.

source: One can often find "USB logic analyzers" for under $15 (US pricing as of 2023). These devices are often listed as "Saleae logic clones" or as "24MHz 8 channel USB logic analyzers".
hu: Gyakran találhatunk "USB logikai analizátorokat" 15 dollár alatti áron (amerikai árképzés 2023-tól). Ezek az eszközök gyakran "Saleae logic clones" vagy "24MHz-es 8 csatornás USB logikai analizátorok" néven szerepelnek.

source: The above picture was taken while using Pulseview with a "Saleae clone" logic analyzer. The Sigrok and Pulseview software was installed on a desktop machine (also install the "fx2lafw" firmware if that is packaged separately). The CH0 pin on the logic analyzer was routed to the CAN Rx line, the CH1 pin was wired to the CAN Tx pin, and GND was wired to GND. Pulseview was configured to only display the D0 and D1 lines (red "probe" icon center top toolbar). The number of samples was set to 5 million (top toolbar) and the sample rate was set to 24Mhz (top toolbar). The CAN decoder was added (yellow and green "bubble icon" right top toolbar). The D0 channel was labeled as RX and set to trigger on a falling edge (click on black D0 label at left). The D1 channel was labeled as TX (click on brown D1 label at left). The CAN decoder was configured for 1Mbit rate (click on green CAN label at left). The CAN decoder was moved to the top of the display (click and drag green CAN label). Finally, the capture was started (click "Run" at top left) and a packet was transmitted on the CAN bus (`cansend can0 123#121212121212`).
hu: A fenti kép a Pulseview használata közben készült egy "Saleae klón" logikai analizátorral. A Sigrok és a Pulseview szoftver egy asztali gépre lett telepítve (telepítsd az "fx2lafw" firmware-t is, ha az külön csomagban van). A logikai analizátor CH0 tűjét a CAN Rx tűre, a CH1 tűt a CAN Tx tűre, a GND-t pedig a GND-re vezettük. A Pulseview-t úgy konfiguráltuk, hogy csak a D0 és D1 vonalakat jelenítse meg (piros "szonda" ikon középső felső eszköztár). A minták számát 5 millióra (felső eszköztár), a mintavételi sebességet pedig 24Mhz-re (felső eszköztár) állítottuk be. A CAN dekódert hozzáadtuk (sárga és zöld "buborék ikon" jobb felső eszköztár). A D0 csatornát RX-ként jelöltük meg, és úgy állítottuk be, hogy csökkenő élre triggereljen (kattintsunk a bal oldali fekete D0 címkére). A D1 csatornát TX-ként jelöltük (kattintsunk a bal oldali barna D1 címkére). A CAN dekódert 1Mbit sebességre konfiguráltuk (kattints a bal oldali zöld CAN címkére). A CAN dekóder a kijelző tetejére került (kattints és húzd a zöld CAN címkét). Végül elindítottuk a rögzítést (kattintsunk a bal felső sarokban lévő "Run" gombra), és egy csomagot továbbítottunk a CAN-buszon (`cansend can0 123#121212121212`).

source: The logic analyzer provides an independent tool for capturing packets and verifying bit timing.
hu: A logikai analizátor független eszközt biztosít a csomagok rögzítéséhez és a bitek időzítésének ellenőrzéséhez.
