Repository: Klipper3d/klipper-translations
Catalog: locales/*/LC_MESSAGES/CANBUS_protocol.po
Languages: hu

source: Micro-controller id assignment
hu: Mikrokontroller azonosító hozzárendelése

source: Klipper uses only CAN 2.0A standard size CAN bus packets, which are limited to 8 data bytes and an 11-bit CAN bus identifier. In order to support efficient communication, each micro-controller is assigned at run-time a unique 1-byte CAN bus nodeid (`canbus_nodeid`) for general Klipper command and response traffic. Klipper command messages going from host to micro-controller use the CAN bus id of `canbus_nodeid * 2 + 256`, while Klipper response messages from micro-controller to host use `canbus_nodeid * 2 + 256 + 1`.
hu: A Klipper csak a CAN 2.0A szabványos méretű CAN-busz csomagokat használja, amelyek 8 adatbájtra és egy 11 bites CAN-busz azonosítóra korlátozódnak. A hatékony kommunikáció támogatása érdekében minden mikrokontrollerhez futáskor egy egyedi, 1 bájtos CAN-busz nodeid (`canbus_nodeid`) van rendelve az általános Klipper parancs és válaszforgalomhoz. A gazdagépről a mikrokontroller felé irányuló Klipper-parancsüzenetek a `canbus_nodeid * 2 + 256` CAN-busz azonosítót használják, míg a mikrokontrollerről a gazdagép felé irányuló Klipper-válaszüzenetek a `canbus_nodeid * 2 + 256 + 1` azonosítót.

source: Each micro-controller has a factory assigned unique chip identifier that is used during id assignment. This identifier can exceed the length of one CAN packet, so a hash function is used to generate a unique 6-byte id (`canbus_uuid`) from the factory id.
hu: Minden mikrokontroller rendelkezik egy gyárilag hozzárendelt egyedi chipazonosítóval, amelyet az azonosító hozzárendelése során használnak. Ez az azonosító meghaladhatja egy CAN csomag hosszát, ezért egy hash függvényt használunk arra, hogy a gyári azonosítóból egy egyedi 6 bájtos azonosítót (`canbus_uuid`) generáljunk.

source: Admin messages
hu: Rendszergazdai üzenetek

source: Admin messages are used for id assignment. Admin messages sent from host to micro-controller use the CAN bus id `0x3f0` and messages sent from micro-controller to host use the CAN bus id `0x3f1`. All micro-controllers listen to messages on id `0x3f0`; that id can be thought of as a "broadcast address".
hu: Az rendszergazdai üzeneteket az azonosító hozzárendeléséhez használják. A gazdagéptől a mikrokontrollerhez küldött admin üzenetek a CAN-buszon a `0x3f0`, a mikrokontrollerről a gazdagéphez küldött üzenetek pedig a CAN-buszon a `0x3f1` azonosítót használják. Minden mikrovezérlő a `0x3f0` azonosítón fogadja az üzeneteket; ez az azonosító egy "broadcast cím" -nek tekinthető.

source: CMD_QUERY_UNASSIGNED message
hu: CMD_QUERY_UNASSIGNED üzenet

source: This command queries all micro-controllers that have not yet been assigned a `canbus_nodeid`. Unassigned micro-controllers will respond with a RESP_NEED_NODEID response message.
hu: Ez a parancs lekérdezi az összes olyan mikrovezérlőt, amely még nem kapott `canbus_nodeid` azonosítót. A nem hozzárendelt mikrovezérlők RESP_NEED_NODEID válaszüzenettel válaszolnak.

source: The CMD_QUERY_UNASSIGNED message format is: `<1-byte message_id = 0x00>`
hu: A CMD_QUERY_UNASSIGNED üzenet formátuma: `<1-byte message_id = 0x00>`

source: This command assigns a `canbus_nodeid` to the micro-controller with a given `canbus_uuid`.
hu: Ez a parancs hozzárendel egy `canbus_nodeid` mikrokontrollert egy adott `canbus_uuid` mikrokontrollerhez.

source: RESP_NEED_NODEID message
hu: RESP_NEED_NODEID üzenet

source: Data Packets
hu: Adatcsomagok

source: The packet data in messages using the node's receive CAN bus id (`canbus_nodeid * 2 + 256`) are simply appended to a buffer, and when a complete [mcu protocol message](Protocol.md) is found its contents are parsed and processed. The data is treated as a byte stream - there is no requirement for the start of a Klipper message block to align with the start of a CAN bus packet.
hu: A csomópontot használó üzenetek csomagadatai (`canbus_nodeid * 2 + 256`) egyszerűen egy pufferbe kerülnek, és amikor egy teljes [mcu protokoll üzenet](Protocol.md) található, annak tartalmát elemezi és feldolgozza. Az adatokat bájtfolyamként kezeli. Nem követelmény, hogy a Klipper üzenetblokk kezdete egyezzen a CAN-buszcsomag kezdetével.

source: Similarly, mcu protocol message responses are sent from micro-controller to host by copying the message data into one or more packets with the node's transmit CAN bus id (`canbus_nodeid * 2 + 256 + 1`).
hu: Hasonlóképpen, az MCU protokoll üzenetválaszok a mikrokontrollerről a gazdagéphez úgy kerülnek elküldésre, hogy az üzenetadatokat egy vagy több csomagba másolják a csomópontnak a CAN-buszon való átvitelére vonatkozó azonosítójával (`canbus_nodeid * 2 + 256 + 1`).

source: CANBUS protocol
hu: CANBUS protokoll

source: This document describes the protocol Klipper uses to communicate over [CAN bus](https://en.wikipedia.org/wiki/CAN_bus). See <CANBUS.md> for information on configuring Klipper with CAN bus.
hu: Ez a dokumentum a Klipper által a [CAN-buszon](https://hu.wikipedia.org/wiki/CAN-busz) keresztül történő kommunikációhoz használt protokollt írja le. A Klipper CAN-busszal való konfigurálásával kapcsolatos információkért lásd a <CANBUS.md> című dokumentumot.

source: CMD_SET_KLIPPER_NODEID message
hu: CMD_SET_KLIPPER_NODEID üzenet

source: The CMD_SET_KLIPPER_NODEID message format is: `<1-byte message_id = 0x01><6-byte canbus_uuid><1-byte canbus_nodeid>`
hu: A CMD_SET_KLIPPER_NODEID üzenet formátuma: `<1-byte message_id = 0x01><6-byte canbus_uuid><1-byte canbus_nodeid>.`

source: The RESP_NEED_NODEID message format is: `<1-byte message_id = 0x20><6-byte canbus_uuid><1-byte set_klipper_nodeid = 0x01>`
hu: A RESP_NEED_NODEID üzenet formátuma: `<1-byte message_id = 0x20><6-byte canbus_uuid><1-byte set_klipper_nodeid = 0x01>.`

source: A micro-controller that has been assigned a nodeid via the CMD_SET_KLIPPER_NODEID command can send and receive data packets.
hu: A CMD_SET_KLIPPER_NODEID paranccsal nodeid-től kapott mikrokontroller adatcsomagokat küldhet és fogadhat.
