Repository: Klipper3d/klipper-translations
Catalog: locales/*/LC_MESSAGES/Command_Templates.po
Languages: pt_br, zh_hans

source: [gcode_macro QUERY_HTU21D] gcode: {% set sensor = printer["htu21d my_sensor"] %} M117 Temp:{sensor.temperature} Humidity:{sensor.humidity}
zh_hans: [gcode_macro QUERY_HTU21D] # 查询HTU21D gcode: {% set sensor = printer["htu21d my_sensor"] %} M117 Temp:{sensor.temperature} Humidity:{sensor.humidity}

source: [gcode_macro start_probe] variable_bed_temp: 0 gcode: # Save target temperature to bed_temp variable SET_GCODE_VARIABLE MACRO=start_probe VARIABLE=bed_temp VALUE={printer.heater_bed.target} # Disable bed heater M140 # Perform probe PROBE # Call finish_probe macro at completion of probe finish_probe [gcode_macro finish_probe] gcode: # Restore temperature M140 S{printer["gcode_macro start_probe"].bed_temp}
zh_hans: [gcode_macro start_probe] variable_bed_temp: 0 gcode: # 保存参数到bed_temp变量 SET_GCODE_VARIABLE MACRO=start_probe VARIABLE=bed_temp VALUE={printer.heater_bed.target} # 禁用热床 M140 # 进行探测 PROBE # 在结束时调用finish_probe脚本 finish_probe [gcode_macro finish_probe] gcode: # 恢复热床温度 M140 S{printer["gcode_macro start_probe"].bed_temp}

source: Commands templates
pt_br: Modelos de comandos
zh_hans: 命令模板

source: The "rawparams" variable
pt_br: A variável "rawparams"

source: The full unparsed parameters for the running macro can be access via the `rawparams` pseudo-variable.
pt_br: Os parâmetros completos não analisados para a macro em execução podem ser acessados por meio da pseudovariável `rawparams`.

source: The terminal will display the description when you use the `HELP` command or the autocomplete function.
pt_br: O terminal exibirá a descrição quando você usar o comando `HELP` ou a função de preenchimento automático.

source: Note that this will include any comments that were part of the original command.
pt_br: Observe que isso incluirá todos os comentários que faziam parte do comando original.

source: See the [sample-macros.cfg](../config/sample-macros.cfg) file for an example showing how to override the `M117` command using `rawparams`.
pt_br: Consulte o arquivo [sample-macros.cfg](../config/sample-macros.cfg) para obter um exemplo que mostra como substituir o comando `M117` usando `rawparams`.
