Repository: Klipper3d/klipper-translations
Catalog: locales/*/LC_MESSAGES/Command_Templates.po
Languages: pt_br, zh_hans

source: This document provides information on implementing G-Code command sequences in gcode_macro (and similar) config sections.
pt_br: Este documento fornece informações sobre a implementação de sequências de comando G-Code nas seções de configuração gcode_macro (e similares).
zh_hans: 本文档描述了 gcode_macro（和其他类似）配置分段中实现 G-Code 命令序列的方法。

source: G-Code Macro Naming
pt_br: Nomenclatura de macro de código G
zh_hans: G 代码宏命名

source: Case is not important for the G-Code macro name - MY_MACRO and my_macro will evaluate the same and may be called in either upper or lower case. If any numbers are used in the macro name then they must all be at the end of the name (eg, TEST_MACRO25 is valid, but MACRO25_TEST3 is not).
pt_br: As letras maiúsculas e minúsculas não são importantes para o nome da macro G-Code - MY_MACRO e my_macro avaliarão o mesmo e podem ser chamadas em letras maiúsculas ou minúsculas. Se algum número for usado no nome da macro, todos devem estar no final do nome (por exemplo, TEST_MACRO25 é válido, mas MACRO25_TEST3 não é).
zh_hans: G-Code 宏的名称大小写并不重要。比如，MY_MACRO 和 my_macro 是等效的，可以用大写或小写来调用。如果在宏的名称中使用任何数字，那么它们必须都在名称的末尾（例如，TEST_MACRO25是合法的，但MACRO25_TEST3是不合法的）。

source: Formatting of G-Code in the config
pt_br: Formatação do G-Code na configuração
zh_hans: 配置中 G 代码的格式

source: Indentation is important when defining a macro in the config file. To specify a multi-line G-Code sequence it is important for each line to have proper indentation. For example:
pt_br: O recuo é importante ao definir uma macro no arquivo de configuração. Para especificar uma sequência de código G de várias linhas, é importante que cada linha tenha a indentação adequada. Por exemplo:
zh_hans: 在配置文件中定义一个宏时需要注意缩进。在定义多行的G代码序列时每行都要有适当的缩进。例如：

source: Note how the `gcode:` config option always starts at the beginning of the line and subsequent lines in the G-Code macro never start at the beginning.
pt_br: Observe como a opção de configuração `gcode:` sempre começa no início da linha e as linhas subsequentes na macro G-Code nunca começam no início.
zh_hans: 请注意，`gcode:` 配置选项总是从行首开始，而 G-Code 宏中的后续行从不从行首开始。

source: Add a description to your macro
pt_br: Adicione uma descrição à sua macro
zh_hans: 向宏添加描述

source: To help identify the functionality a short description can be added. Add `description:` with a short text to describe the functionality. Default is "G-Code macro" if not specified. For example:
pt_br: Para ajudar a identificar a funcionalidade, uma breve descrição pode ser adicionada. Adicione `description:` com um texto curto para descrever a funcionalidade. O padrão é "macro G-Code" se não for especificado. Por exemplo:
zh_hans: 可以通过添加 `description:` 和简短的描述来帮助理解该功能。如果没有指定，默认为"G-Code macro"。例如：

source: Save/Restore state for G-Code moves
pt_br: Salvar/Restaurar estado para movimentos G-Code
zh_hans: 保存/恢复 G-Code 移动的状态

source: Unfortunately, the G-Code command language can be challenging to use. The standard mechanism to move the toolhead is via the `G1` command (the `G0` command is an alias for `G1` and it can be used interchangeably with it). However, this command relies on the "G-Code parsing state" setup by `M82`, `M83`, `G90`, `G91`, `G92`, and previous `G1` commands. When creating a G-Code macro it is a good idea to always explicitly set the G-Code parsing state prior to issuing a `G1` command. (Otherwise, there is a risk the `G1` command will make an undesirable request.)
pt_br: Infelizmente, a linguagem de comando G-Code pode ser difícil de usar. O mecanismo padrão para mover o cabeçote é através do comando `G1` (o comando `G0` é um alias para `G1` e pode ser usado de forma intercambiável com ele). No entanto, este comando depende da configuração do "estado de análise de código G" pelos comandos `M82`, `M83`, `G90`, `G91`, `G92` e `G1` anteriores. Ao criar uma macro G-Code, é uma boa ideia sempre definir explicitamente o estado de análise do G-Code antes de emitir um comando `G1`. (Caso contrário, existe o risco de o comando `G1` fazer uma solicitação indesejável.)
zh_hans: 不幸的是，G-Code 命令语言在使用上有些难度。移动工具头的标准机制是通过 `G1` 命令（`G0` 命令是 `G1` 的别名，它们互换使用）。然而，这个命令依赖于由`M82`、`M83`、`G90`、`G91`、`G92`, 以及先前的`G1`命令所设置的"G-Code解析状态"。在创建 G-Code 宏时，最好在发出`G1`命令之前，先明确 G-Code 解析状态。(否则，`G1` 命令就有可能提出一个不符合预期的请求。）

source: A common way to accomplish that is to wrap the `G1` moves in `SAVE_GCODE_STATE`, `G91`, and `RESTORE_GCODE_STATE`. For example:
pt_br: Uma maneira comum de conseguir isso é agrupar os movimentos `G1` em `SAVE_GCODE_STATE`, `G91` e `RESTORE_GCODE_STATE`. Por exemplo:
zh_hans: 实现这一目标的常见方法是将 `G1` 移动包装在 `SAVE_GCODE_STATE`、`G91`和`RESTORE_GCODE_STATE`中。例如：

source: The `G91` command places the G-Code parsing state into "relative move mode" and the `RESTORE_GCODE_STATE` command restores the state to what it was prior to entering the macro. Be sure to specify an explicit speed (via the `F` parameter) on the first `G1` command.
pt_br: O comando `G91` coloca o estado de análise G-Code em "modo de movimento relativo" e o comando `RESTORE_GCODE_STATE` restaura o estado ao que era antes de entrar na macro. Certifique-se de especificar uma velocidade explícita (através do parâmetro `F`) no primeiro comando `G1`.
zh_hans: `G91` 命令将G代码解析状态放入 "相对移动模式"，`RESTORE_GCODE_STATE` 命令将状态恢复到进入宏之前的状态。请确保在第一条`G1` 命令中指定一个明确的速度（通过`F` 参数）。

source: Template expansion
pt_br: Expansão do modelo
zh_hans: 模板扩展

source: The gcode_macro `gcode:` config section is evaluated using the Jinja2 template language. One can evaluate expressions at run-time by wrapping them in `{ }` characters or use conditional statements wrapped in `{% %}`. See the [Jinja2 documentation](http://jinja.pocoo.org/docs/2.10/templates/) for further information on the syntax.
pt_br: A seção de configuração gcode_macro `gcode:` é avaliada usando a linguagem de modelo Jinja2. Pode-se avaliar expressões em tempo de execução agrupando-as em caracteres `{ }` ou usando instruções condicionais agrupadas em `{% %}`. Consulte a [documentação do Jinja2](http://jinja.pocoo.org/docs/2.10/templates/) para obter mais informações sobre a sintaxe.
zh_hans: gcode_macro`gcode:` 配置部分是使用的是Jinja2模板语言。人们可以通过用`{ }` 字符包装来在运行时使用表达式，或者使用用`{% %}` 包装的条件语句。参考[Jinja2文档](http://jinja.pocoo.org/docs/2.10/templates/)以了解更多关于语法的信息。

source: An example of a complex macro:
pt_br: Um exemplo de uma macro complexa:
zh_hans: 一个更复杂的宏示例：

source: Macro parameters
pt_br: Parâmetros de macro
zh_hans: 宏观参数

source: It is often useful to inspect parameters passed to the macro when it is called. These parameters are available via the `params` pseudo-variable. For example, if the macro:
pt_br: Geralmente é útil inspecionar os parâmetros passados para a macro quando ela é chamada. Esses parâmetros estão disponíveis através da pseudo-variável `params`. Por exemplo, se a macro:
zh_hans: 当macro被调用时，检查传递给它的参数往往是有用的。这些参数可以通过`params` 伪变量（pseudo-variable）获得。类似于以下macro：

source: were invoked as `SET_PERCENT VALUE=.2` it would evaluate to `M117 Now at 20%`. Note that parameter names are always in upper-case when evaluated in the macro and are always passed as strings. If performing math then they must be explicitly converted to integers or floats.
pt_br: fossem invocados como `SET_PERCENT VALUE=.2` seria avaliado como `M117 Now at 20%`. Observe que os nomes dos parâmetros estão sempre em letras maiúsculas quando avaliados na macro e são sempre passados como strings. Se estiver executando matemática, eles devem ser explicitamente convertidos em números inteiros ou flutuantes.
zh_hans: 如果以`SET_PERCENT VALUE=.2` 的方式调用，则会评估为`M117 现在为 20%` 。需要注意的是在宏（macro）中进行评估时，参数名称始终使用大写字母，并且始终以字符串（strings）形式传递。如果执行数学运算，则必须明确地将其转换为整数（integers）或浮点数（floats）。

source: It's common to use the Jinja2 `set` directive to use a default parameter and assign the result to a local name. For example:
pt_br: É comum usar a diretiva `set` Jinja2 para usar um parâmetro padrão e atribuir o resultado a um nome local. Por exemplo:
zh_hans: 通常使用Jinja2的`set` 指令来使用一个默认参数，并将结果分配给一个本地名称。比如说：

source: The "printer" Variable
pt_br: A variável "impressora"
zh_hans: "printer"变量

source: It is possible to inspect (and alter) the current state of the printer via the `printer` pseudo-variable. For example:
pt_br: É possível inspecionar (e alterar) o estado atual da impressora através da pseudo-variável `printer`. Por exemplo:
zh_hans: 可以通过`printer` 的pseudo-variable来检查（和变更）打印机的当前状态。比如说：

source: Available fields are defined in the [Status Reference](Status_Reference.md) document.
pt_br: Os campos disponíveis são definidos no documento [Referência de estado](Status_Reference.md).
zh_hans: [Status Reference](Status_Reference.md) 文档中定义了可用字段。

source: Important! Macros are first evaluated in entirety and only then are the resulting commands executed. If a macro issues a command that alters the state of the printer, the results of that state change will not be visible during the evaluation of the macro. This can also result in subtle behavior when a macro generates commands that call other macros, as the called macro is evaluated when it is invoked (which is after the entire evaluation of the calling macro).
pt_br: Importante! As macros são primeiro avaliadas em sua totalidade e somente então os comandos resultantes são executados. Se uma macro emitir um comando que altere o estado da impressora, os resultados dessa mudança de estado não serão visíveis durante a avaliação da macro. Isso também pode resultar em um comportamento sutil quando uma macro gera comandos que chamam outras macros, pois a macro chamada é avaliada quando é invocada (que ocorre após toda a avaliação da macro de chamada).
zh_hans: 注意！宏会先被进行整体计算，然后所产生的命令才会被执行。如果一个宏发出的命令改变了打印机的状态，那么在评估宏的过程中，该状态改变的结果将在执行时不可见。当一个宏产生调用其他宏的命令时，这也可能导致微妙的行为，因为被调用的宏在被调用时才被评估（这是在调用宏的整体计算过程之后）。

source: By convention, the name immediately following `printer` is the name of a config section. So, for example, `printer.fan` refers to the fan object created by the `[fan]` config section. There are some exceptions to this rule - notably the `gcode_move` and `toolhead` objects. If the config section contains spaces in it, then one can access it via the `[ ]` accessor - for example: `printer["generic_heater my_chamber_heater"].temperature`.
pt_br: Por convenção, o nome imediatamente após `printer` é o nome de uma seção de configuração. Então, por exemplo, `printer.fan` refere-se ao objeto fan criado pela seção de configuração `[fan]`. Existem algumas exceções a esta regra - principalmente os objetos `gcode_move` e `toolhead`. Se a seção de configuração contiver espaços, então é possível acessá-la por meio do acessador `[ ]` - por exemplo: `printer["generic_heater my_chamber_heater"].temperature`.
zh_hans: 按照惯例，紧跟在`printer` 后面的名称是一个配置分段的名称。因此，例如，`printer.fan` 指的是由`[fan]` 配置分段创建的风扇对象。这条规则有一些例外 - 特别是`gcode_move` 和`toolhead` 对象。如果配置分段包含空格，那么可以通过`[ ]` 访问器访问它--例如：`printer["generic_heater my_chamber_heater"].temperature` 。

source: Note that the Jinja2 `set` directive can assign a local name to an object in the `printer` hierarchy. This can make macros more readable and reduce typing. For example:
pt_br: Observe que a diretiva Jinja2 `set` pode atribuir um nome local a um objeto na hierarquia `printer`. Isso pode tornar as macros mais legíveis e reduzir a digitação. Por exemplo:
zh_hans: 请注意，Jinja2的`set` 指令可以为`printer` 层次结构中的一个对象指定一个本地名称。这可以改善宏的可读性并减少键入量。例如：

source: Actions
pt_br: Ações
zh_hans: 行动

source: There are some commands available that can alter the state of the printer. For example, `{ action_emergency_stop() }` would cause the printer to go into a shutdown state. Note that these actions are taken at the time that the macro is evaluated, which may be a significant amount of time before the generated g-code commands are executed.
pt_br: Existem alguns comandos disponíveis que podem alterar o estado da impressora. Por exemplo, `{ action_emergency_stop() }` faria com que a impressora entrasse em estado de desligamento. Observe que essas ações são executadas no momento em que a macro é avaliada, o que pode levar um tempo significativo antes que os comandos do g-code gerados sejam executados.
zh_hans: 有一些可用的命令可以改变打印机的状态。例如，`{ action_emergency_stop() }` 将导致打印机进入关闭状态。请注意，这些动作会在宏被评估的时候执行，这可能是在生成的G代码命令被执行之前的一段相当长的时间。

source: Available "action" commands:
pt_br: Comandos de "ação" disponíveis:
zh_hans: 可用的“动作”命令：

source: `action_respond_info(msg)`: Write the given `msg` to the /tmp/printer pseudo-terminal. Each line of `msg` will be sent with a "// " prefix.
pt_br: `action_respond_info(msg)`: Escreva a `msg` fornecida no pseudo-terminal /tmp/printer. Cada linha de `msg` será enviada com um prefixo "//".
zh_hans: `action_respond_info(msg)`：将给定的 `msg` 写入 /tmp/printer 伪终端。 `msg` 的每一行都会以“//”前缀发送。

source: `action_raise_error(msg)`: Abort the current macro (and any calling macros) and write the given `msg` to the /tmp/printer pseudo-terminal. The first line of `msg` will be sent with a "!! " prefix and subsequent lines will have a "// " prefix.
pt_br: `action_raise_error(msg)`: Aborte a macro atual (e quaisquer macros de chamada) e escreva a `msg` fornecida no pseudo-terminal /tmp/printer. A primeira linha de `msg` será enviada com um prefixo "!! " e as linhas subseqüentes terão um prefixo "//".
zh_hans: `action_raise_error(消息)`：终止当前宏（以及任何调用的宏），并将给定的`消息` 写到 /tmp/printer 伪终端。`msg` 的第一行将以"！！"为前缀发送，随后几行将以"//"为前缀。

source: `action_emergency_stop(msg)`: Transition the printer to a shutdown state. The `msg` parameter is optional, it may be useful to describe the reason for the shutdown.
pt_br: `action_emergency_stop(msg)`: Faz a transição da impressora para um estado de desligamento. O parâmetro `msg` é opcional, pode ser útil para descrever o motivo do desligamento.
zh_hans: `action_emergency_stop(消息)`：将打印机过渡到关机状态。`消息` 参数是可选的，可以用来描述关机的原因。

source: `action_call_remote_method(method_name)`: Calls a method registered by a remote client. If the method takes parameters they should be provided via keyword arguments, ie: `action_call_remote_method("print_stuff", my_arg="hello_world")`
pt_br: `action_call_remote_method(method_name)`: Chama um método registrado por um cliente remoto. Se o método receber parâmetros, eles devem ser fornecidos por meio de argumentos de palavra-chave, por exemplo: `action_call_remote_method("print_stuff", my_arg="hello_world")`
zh_hans: `action_call_remote_method(方法名)`：调用一个由远程客户端注册的方法。如果该方法需要参数，应通过关键字参数提供，即：`action_call_remote_method("print_stuff", 参数="hello_world")`

source: Variables
pt_br: Variáveis
zh_hans: 变量

source: The SET_GCODE_VARIABLE command may be useful for saving state between macro calls. Variable names may not contain any upper case characters. For example:
pt_br: O comando SET_GCODE_VARIABLE pode ser útil para salvar o estado entre chamadas de macro. Os nomes das variáveis não podem conter caracteres maiúsculos. Por exemplo:
zh_hans: SET_GCODE_VARIABLE 命令可以在宏调用之间保存状态。变量名不能包含任何大写字符。例如：

source: Be sure to take the timing of macro evaluation and command execution into account when using SET_GCODE_VARIABLE.
pt_br: Certifique-se de levar em consideração o tempo de avaliação de macro e execução de comando ao usar SET_GCODE_VARIABLE.
zh_hans: 在使用SET_GCODE_VARIABLE时，一定要考虑到宏评估和命令执行的时间顺序。

source: Delayed Gcodes
pt_br: Códigos G atrasados
zh_hans: 延迟G代码

source: The [delayed_gcode] configuration option can be used to execute a delayed gcode sequence:
pt_br: A opção de configuração [delayed_gcode] pode ser usada para executar uma sequência de gcode atrasada:
zh_hans: [delayed_gcode]配置分段可以用来执行一个延迟的G代码序列：

source: When the `load_filament` macro above executes, it will display a "Load Complete!" message after the extrusion is finished. The last line of gcode enables the "clear_display" delayed_gcode, set to execute in 10 seconds.
pt_br: Quando a macro `load_filament` acima for executada, ela exibirá uma mensagem "Load Complete!" mensagem após a conclusão da extrusão. A última linha do gcode habilita o delay_gcode "clear_display", definido para ser executado em 10 segundos.
zh_hans: 当上面的`load_filament` 宏执行时，它将在挤出结束后显示一个 "Load Complete!"的信息。最后一行G代码启用 "clear_display "delayed_gcode，设置为10秒后执行。

source: The `initial_duration` config option can be set to execute the delayed_gcode on printer startup. The countdown begins when the printer enters the "ready" state. For example, the below delayed_gcode will execute 5 seconds after the printer is ready, initializing the display with a "Welcome!" message:
pt_br: A opção de configuração `initial_duration` pode ser definida para executar o delay_gcode na inicialização da impressora. A contagem regressiva começa quando a impressora entra no estado "pronta". Por exemplo, o delay_gcode abaixo será executado 5 segundos depois que a impressora estiver pronta, inicializando a exibição com um "Bem-vindo!" mensagem:
zh_hans: `initial_duration` 配置选项可以被设置为在打印机启动时执行 delayed_gcode。倒计时从打印机进入"ready"（准备）状态时开始。例如，下面的 delayed_gcode 将在打印机准备好后5秒执行，以 "Welcome！"的信息初始化显示屏：

source: Its possible for a delayed gcode to repeat by updating itself in the gcode option:
pt_br: É possível que um gcode atrasado se repita atualizando-se na opção gcode:
zh_hans: 延迟G代码可以通过在G代码选项中更新自己来重复自生：

source: The above delayed_gcode will send "// Extruder Temp: [ex0_temp]" to Octoprint every 2 seconds. This can be canceled with the following gcode:
pt_br: O delay_gcode acima enviará "// Extruder Temp: [ex0_temp]" para Octoprint a cada 2 segundos. Isso pode ser cancelado com o seguinte gcode:
zh_hans: 上述delayed_gcode将每2秒向Octoprint发送 "// Extruder Temp: [ex0_temp]"。这可以用下面的gcode取消：

source: Menu templates
zh_hans: 菜单模板

source: If a [display config section](Config_Reference.md#display) is enabled, then it is possible to customize the menu with [menu](Config_Reference.md#menu) config sections.
pt_br: Se uma [seção de configuração de exibição](Config_Reference.md#display) estiver ativada, é possível personalizar o menu com as seções de configuração [menu](Config_Reference.md#menu).
zh_hans: 如果启用了[display配置分段](Config_Reference.md#display)，那么就可以用[menu](Config_Reference.md#menu)配置分段自定义菜单。

source: The following read-only attributes are available in menu templates:
pt_br: Os seguintes atributos somente leitura estão disponíveis em modelos de menu:
zh_hans: 以下只读属性在菜单模板中可用：

source: `menu.width` - element width (number of display columns)
pt_br: `menu.width` - largura do elemento (número de colunas de exibição)
zh_hans: `menu.width` - 元素宽度（显示列数）

source: `menu.ns` - element namespace
pt_br: `menu.ns` - namespace do elemento
zh_hans: `menu.ns` - 元素命名空间

source: `menu.event` - name of the event that triggered the script
pt_br: `menu.event` - nome do evento que acionou o script
zh_hans: `menu.event` - 触发脚本的事件名称

source: `menu.input` - input value, only available in input script context
pt_br: `menu.input` - valor de entrada, disponível apenas no contexto do script de entrada
zh_hans: `menu.input` - 输入值，仅在输入脚本上下文中可用

source: The following actions are available in menu templates:
pt_br: As seguintes ações estão disponíveis nos modelos de menu:
zh_hans: 以下操作在菜单模板中可用：

source: `menu.back(force, update)`: will execute menu back command, optional boolean parameters `<force>` and `<update>`.
pt_br: `menu.back(force, update)`: executará o comando de voltar ao menu, parâmetros booleanos opcionais `<force>` e `<update>`.
zh_hans: `menu.back(force, update)`：将执行菜单返回命令，可选的布尔参数有`<force>`（强制）和`<update>`（更新）。

source: When `<force>` is set True then it will also stop editing. Default value is False.
pt_br: Quando `<force>` for definido como True, ele também interromperá a edição. O valor padrão é Falso.
zh_hans: 当 `<force>` 设置为 True 时，它也将停止编辑。默认值为 False。

source: When `<update>` is set False then parent container items are not updated. Default value is True.
pt_br: Quando `<atualizar>` é definido como falso, os itens do contêiner pai não são atualizados. O valor padrão é Verdadeiro.
zh_hans: 当`<update>` 被设置为False，那么父级容器项目就不会被更新。默认值是True。

source: `menu.exit(force)` - will execute menu exit command, optional boolean parameter `<force>` default value False.
pt_br: `menu.exit(force)` - executará o comando de saída do menu, parâmetro booleano opcional `<force>` valor padrão False.
zh_hans: `menu.exit(force)` - 将执行菜单退出命令，可选的布尔参数有`<force>`（强制）默认值 False。

source: Save Variables to disk
pt_br: Salvar Variáveis no disco
zh_hans: 保存变量到磁盘

source: If a [save_variables config section](Config_Reference.md#save_variables) has been enabled, `SAVE_VARIABLE VARIABLE=<name> VALUE=<value>` can be used to save the variable to disk so that it can be used across restarts. All stored variables are loaded into the `printer.save_variables.variables` dict at startup and can be used in gcode macros. to avoid overly long lines you can add the following at the top of the macro:
pt_br: Se uma [seção de configuração save_variables](Config_Reference.md#save_variables) tiver sido habilitada, `SAVE_VARIABLE VARIABLE=<nome> VALUE=<valor>` pode ser usado para salvar a variável no disco para que possa ser usada nas reinicializações. Todas as variáveis armazenadas são carregadas no dict `printer.save_variables.variables` na inicialização e podem ser usadas em macros gcode. para evitar linhas excessivamente longas, você pode adicionar o seguinte na parte superior da macro:
zh_hans: 如果启用了[save_variables配置分段](Config_Reference.md#save_variables)，`SAVE_VARIABLE VARIABLE=<名称> VALUE=<值>`可以用来将变量保存到磁盘，以便在重新启动时使用。所有存储的变量在启动时会被加载到`printer.save_variables.variables` dict 变量中，可以在G代码宏中使用。为避免行数过长，可以在宏的顶部添加以下内容：

source: As an example, it could be used to save the state of 2-in-1-out hotend and when starting a print ensure that the active extruder is used, instead of T0:
pt_br: Como exemplo, poderia ser usado para salvar o estado de hotend 2-in-1-out e ao iniciar uma impressão garantir que o extrusor ativo seja usado, em vez de T0:
zh_hans: 例如，它可以用来保存2进1出热端的状态，当开始打印时，确保使用活跃的挤出机，而不是T0：

source: [gcode_macro blink_led] gcode: SET_PIN PIN=my_led VALUE=1 G4 P2000 SET_PIN PIN=my_led VALUE=0
zh_hans: [gcode_macro blink_led] gcode: SET_PIN PIN=my_led VALUE=1 #亮灯 G4 P2000 # 等待2000毫秒 SET_PIN PIN=my_led VALUE=0 #关灯

source: [gcode_macro blink_led] description: Blink my_led one time gcode: SET_PIN PIN=my_led VALUE=1 G4 P2000 SET_PIN PIN=my_led VALUE=0
pt_br: [gcode_macro blink_led] descrição: Piscar my_led uma vez gcode: SET_PIN PIN=my_led VALUE=1 G4 P2000 SET_PIN PIN=my_led VALUE=0
zh_hans: [gcode_macro blink_led] #闪灯 description: Blink my_led one time # 简介：闪一下my_led gcode: SET_PIN PIN=my_led VALUE=1 #亮灯 G4 P2000 # 等待2000毫秒 SET_PIN PIN=my_led VALUE=0 #关灯

source: [gcode_macro MOVE_UP] gcode: SAVE_GCODE_STATE NAME=my_move_up_state G91 G1 Z10 F300 RESTORE_GCODE_STATE NAME=my_move_up_state
pt_br: [gcode_macro MOVE_UP] gcode: SAVE_GCODE_STATE NOME=my_move_up_state G91 G1 Z10 F300 RESTORE_GCODE_STATE NOME=my_move_up_state
zh_hans: [gcode_macro MOVE_UP] # 向上移动 gcode: SAVE_GCODE_STATE NAME=my_move_up_state # 保存名称为my_move_up_state的G代码状态 G91 # 相对模式 G1 Z10 F300 # 慢慢往上移动 10mm，5mm/s RESTORE_GCODE_STATE NAME=my_move_up_state # 恢复名称为my_move_up_state的G代码状态

source: [gcode_macro SET_PERCENT] gcode: M117 Now at { params.VALUE|float * 100 }%
pt_br: [gcode_macro SET_PERCENT] gcode: M117 Agora em { params.VALUE|float * 100 }%
zh_hans: [gcode_macro SET_PERCENT] # 设置百分比 gcode: M117 Now at { params.VALUE|float * 100 }% # 现在在VALUE* 100的百分比

source: [gcode_macro SET_BED_TEMPERATURE] gcode: {% set bed_temp = params.TEMPERATURE|default(40)|float %} M140 S{bed_temp}
zh_hans: [gcode_macro SET_BED_TEMPERATURE] # 设置热床温度 gcode: {% set bed_temp = params.TEMPERATURE|default(40)|float %} # 热床温度=params.TEMPERATURE或者默认40 M140 S{bed_temp} # 设置热床温度为bed_temp

source: [gcode_macro slow_fan] gcode: M106 S{ printer.fan.speed * 0.9 * 255}
zh_hans: [gcode_macro slow_fan] # 降低风速 gcode: M106 S{ printer.fan.speed * 0.9 * 255}
