Repository: Klipper3d/klipper-translations
Catalog: locales/*/LC_MESSAGES/Config_Reference.po
Languages: hu, it

source: [extruder] step_pin: dir_pin: enable_pin: microsteps: rotation_distance: #full_steps_per_rotation: #gear_ratio: # See the "stepper" section for a description of the above # parameters. If none of the above parameters are specified then no # stepper will be associated with the nozzle hotend (though a # SYNC_EXTRUDER_MOTION command may associate one at run-time). nozzle_diameter: # Diameter of the nozzle orifice (in mm). This parameter must be # provided. filament_diameter: # The nominal diameter of the raw filament (in mm) as it enters the # extruder. This parameter must be provided. #max_extrude_cross_section: # Maximum area (in mm^2) of an extrusion cross section (eg, # extrusion width multiplied by layer height). This setting prevents # excessive amounts of extrusion during relatively small XY moves. # If a move requests an extrusion rate that would exceed this value # it will cause an error to be returned. The default is: 4.0 * # nozzle_diameter^2 #instantaneous_corner_velocity: 1.000 # The maximum instantaneous velocity change (in mm/s) of the # extruder during the junction of two moves. The default is 1mm/s. #max_extrude_only_distance: 50.0 # Maximum length (in mm of raw filament) that a retraction or # extrude-only move may have. If a retraction or extrude-only move # requests a distance greater than this value it will cause an error # to be returned. The default is 50mm. #max_extrude_only_velocity: #max_extrude_only_accel: # Maximum velocity (in mm/s) and acceleration (in mm/s^2) of the # extruder motor for retractions and extrude-only moves. These # settings do not have any impact on normal printing moves. If not # specified then they are calculated to match the limit an XY # printing move with a cross section of 4.0*nozzle_diameter^2 would # have. #pressure_advance: 0.0 # The amount of raw filament to push into the extruder during # extruder acceleration. An equal amount of filament is retracted # during deceleration. It is measured in millimeters per # millimeter/second. The default is 0, which disables pressure # advance. #pressure_advance_smooth_time: 0.040 # A time range (in seconds) to use when calculating the average # extruder velocity for pressure advance. A larger value results in # smoother extruder movements. This parameter may not exceed 200ms. # This setting only applies if pressure_advance is non-zero. The # default is 0.040 (40 milliseconds). # # The remaining variables describe the extruder heater. heater_pin: # PWM output pin controlling the heater. This parameter must be # provided. #max_power: 1.0 # The maximum power (expressed as a value from 0.0 to 1.0) that the # heater_pin may be set to. The value 1.0 allows the pin to be set # fully enabled for extended periods, while a value of 0.5 would # allow the pin to be enabled for no more than half the time. This # setting may be used to limit the total power output (over extended # periods) to the heater. The default is 1.0. sensor_type: # Type of sensor - common thermistors are "EPCOS 100K B57560G104F", # "ATC Semitec 104GT-2", "ATC Semitec 104NT-4-R025H42G", "Generic # 3950","Honeywell 100K 135-104LAG-J01", "NTC 100K MGB18-104F39050L32", # "SliceEngineering 450", and "TDK NTCG104LH104JT1". See the # "Temperature sensors" section for other sensors. This parameter # must be provided. sensor_pin: # Analog input pin connected to the sensor. This parameter must be # provided. #pullup_resistor: 4700 # The resistance (in ohms) of the pullup attached to the thermistor. # This parameter is only valid when the sensor is a thermistor. The # default is 4700 ohms. #smooth_time: 1.0 # A time value (in seconds) over which temperature measurements will # be smoothed to reduce the impact of measurement noise. The default # is 1 seconds. control: # Control algorithm (either pid or watermark). This parameter must # be provided. pid_Kp: pid_Ki: pid_Kd: # The proportional (pid_Kp), integral (pid_Ki), and derivative # (pid_Kd) settings for the PID feedback control system. Klipper # evaluates the PID settings with the following general formula: # heater_pwm = (Kp*error + Ki*integral(error) - Kd*derivative(error)) / 255 # Where "error" is "requested_temperature - measured_temperature" # and "heater_pwm" is the requested heating rate with 0.0 being full # off and 1.0 being full on. Consider using the PID_CALIBRATE # command to obtain these parameters. The pid_Kp, pid_Ki, and pid_Kd # parameters must be provided for PID heaters. #max_delta: 2.0 # On 'watermark' controlled heaters this is the number of degrees in # Celsius above the target temperature before disabling the heater # as well as the number of degrees below the target before # re-enabling the heater. The default is 2 degrees Celsius. #pwm_cycle_time: 0.100 # Time in seconds for each software PWM cycle of the heater. It is # not recommended to set this unless there is an electrical # requirement to switch the heater faster than 10 times a second. # The default is 0.100 seconds. #min_extrude_temp: 170 # The minimum temperature (in Celsius) at which extruder move # commands may be issued. The default is 170 Celsius. min_temp: max_temp: # The maximum range of valid temperatures (in Celsius) that the # heater must remain within. This controls a safety feature # implemented in the micro-controller code - should the measured # temperature ever fall outside this range then the micro-controller # will go into a shutdown state. This check can help detect some # heater and sensor hardware failures. Set this range just wide # enough so that reasonable temperatures do not result in an error. # These parameters must be provided.
hu: [extruder] step_pin: dir_pin: enable_pin: microsteps: rotation_distance: #full_steps_per_rotation: #gear_ratio: # A fenti paraméterek leírását lásd a "léptető" részben. Ha a fenti paraméterek # egyike sincs megadva, akkor nem lesz léptetőmotor társítva a nyomtatófejhez # (bár a SYNC_EXTRUDER_MOTION parancs futás közben társíthat egyet). nozzle_diameter: # A fúvóka nyílásának átmérője (mm-ben). Ezt a paramétert meg kell adni. filament_diameter: # A nyers szál névleges átmérője (mm-ben), amikor az extruderbe kerül. # Ezt a paramétert meg kell adni. #max_extrude_cross_section: # Az extrudálási keresztmetszet maximális területe (mm^2-ben) (pl. az # extrudálási szélesség szorozva a réteg magasságával). Ez a beállítás # megakadályozza a túlzott mértékű extrudálást viszonylag kis XY mozgások # során. Ha egy áthelyezés olyan kihúzási sebességet kér, amely meghaladja # ezt az értéket, akkor hibaüzenet jelenik meg. # Az alapértelmezett érték: 4.0 * nozzle_diameter^2 #instantaneous_corner_velocity: 1.000 # Az extruder maximális pillanatnyi sebességváltozása (mm/mp-ben) # két mozgás találkozásánál. Az alapértelmezett 1 mm/mp. #max_extrude_only_distance: 50.0 # Maximális hossza (a nyers nyomtatószálnak mm-ben), amely egy # visszahúzás vagy csak extrudálás esetén lehetséges. Ha egy visszahúzás # vagy csak extrudálási mozgás ennél az értéknél nagyobb távolságot kér, # hibaüzenetet ad vissza. Az alapértelmezett érték 50 mm. #max_extrude_only_velocity: #max_extrude_only_accel: # Az extrudermotor maximális sebessége (mm/mp-ben) és gyorsulása # (mm/mp^2-en) a visszahúzásokhoz és a csak extrudált mozgásokhoz. # Ezek a beállítások nincsenek hatással a normál nyomtatási sebességekre. # Ha nincs megadva, akkor a számítások megfelelnek a 4.0*nozzle_diameter^2 # keresztmetszetű XY nyomtatási mozgás határának. #pressure_advance: 0.0 # Az extruder gyorsítása során a nyomtatófejbe nyomandó nyers szál # mennyisége. A lassítás során azonos mennyiségű izzószál húzódik vissza. # Mérete milliméter per milliméter/másodperc. # Az alapértelmezett érték 0, ami letiltja a nyomásnövelést. #pressure_advance_smooth_time: 0.040 # Időtartomány (másodpercben), amelyet az extruder átlagos sebességének # kiszámításához használnak a nyomás előtoláshoz. A nagyobb érték simább # extrudermozgásokat eredményez. Ez a paraméter nem haladhatja meg a # 200 ezredmásodpercet. Ez a beállítás csak akkor érvényes, ha a # pressure_advance értéke nem nulla. # Az alapértelmezett érték 0,040 (40 ezredmásodperc). # # A fennmaradó változók az extruder fűtését írják le. heater_pin: # PWM kimeneti érintkező, amely a fűtést vezérli. # Ezt a paramétert meg kell adni. #max_power: 1.0 # Az a maximális teljesítmény (0,0 és 1,0 közötti értékben kifejezve), amelyre a # heater_pin beállítható. Az 1,0 érték lehetővé teszi, hogy a tűt hosszabb ideig # teljesen engedélyezettre lehessen állítani, míg a 0,5 érték legfeljebb a fele # ideig engedélyezi a tűt. Ezzel a beállítással korlátozható a fűtőkészülék teljes # kimenő teljesítménye (hosszabb ideig). Az alapértelmezett érték 1.0. sensor_type: # Érzékelő típusa. Általános termisztorok: „EPCOS 100K B57560G104F”, # „ATC Semitec 104GT-2”, „ATC Semitec 104NT-4-R025H42G”, „Generic 3950”, # „Honeywell 100K 135-JGBC10K135-1010LAG18 -104F39050L32", # "SliceEngineering 450" és "TDK NTCG104LH104JT1". További érzékelőkért # lásd a "Hőmérséklet-érzékelők" részt. Ezt a paramétert meg kell adni. sensor_pin: # Analóg bemeneti érintkező csatlakozik az érzékelőhöz. # Ezt a paramétert meg kell adni. #pullup_resistor: 4700 # A termisztorhoz csatlakoztatott felhúzó ellenállása (ohmban). # Ez a paraméter csak akkor érvényes, ha az érzékelő termisztor. # Az alapértelmezett érték 4700 ohm. #smooth_time: 1.0 # Egy időérték (másodpercben), amely alatt a hőmérsékletmérés simításra kerül # a mérési zaj hatásának csökkentése érdekében. # Az alapértelmezett érték 1 másodperc. control: # Vezérlési algoritmus (pid vagy watermark). Ezt a paramétert meg kell adni. pid_Kp: pid_Ki: pid_Kd: # Az arányos (pid_Kp), az integrál (pid_Ki) és a derivált (pid_Kd) beállításai a PID # visszacsatolás vezérlő rendszerhez. A Klipper a PID beállításokat a következő # általános képlettel értékeli ki: heater_pwm = (Kp*error+ Ki*integral(error) vagy # Kd*derivative(error)) / 255 Ahol az „error” a „requested_temperature és # measured_temperature” és a „heater_pwm” a kért fűtési sebesség 0,0 teljes # kikapcsolt és 1,0 teljes bekapcsolva. Fontolja meg a PID_CALIBRATE parancs # használatát a paraméterek lekéréséhez. A pid_Kp, pid_Ki és pid_Kd # paramétereket meg kell adni a PID fűtőberendezésekhez. #max_delta: 2.0 # A „watermark” vezérlésű fűtőberendezéseken ez a fűtőelem kikapcsolása # előtti célhőmérséklet feletti Celsius-fokkal, valamint a fűtőelem újbóli # bekapcsolása előtti célhőmérséklet alatti fokok száma. # Az alapértelmezett érték 2 Celsius-fok. #pwm_cycle_time: 0.100 # Idő másodpercben a fűtőelem minden szoftveres PWM-ciklusához. # Nem ajánlott ezt beállítani, hacsak nincs elektromos követelmény # a fűtőelem másodpercenkénti 10-nél gyorsabb kapcsolására. # Az alapértelmezett érték 0,100 másodperc. #min_extrude_temp: 170 # Az a minimális hőmérséklet (Celsiusban), amelyen az extruder mozgatási # parancsai kiadhatók. Az alapértelmezett érték 170 Celsius. min_temp: max_temp: # Az érvényes hőmérsékletek maximális tartománya (Celsiusban), amelyen # belül a fűtőelemnek maradnia kell. Ez egy, a mikrovezérlő kódjában # beépített biztonsági funkciót vezérel. Ha a mért hőmérséklet ezen a # tartományon kívül esik, akkor a mikrovezérlő leállási állapotba kerül. # Ez az ellenőrzés segíthet bizonyos fűtő és érzékelő hardverhibák észlelésében. # Állítsa be ezt a tartományt elég szélesre, hogy a normális hőmérséklet ne # okozzon hibát. Ezeket a paramétereket meg kell adni.
it: [extruder] step_pin: dir_pin: enable_pin: microsteps: rotation_distance: #full_steps_per_rotation: #gear_ratio: # Vedere la sezione "stepper" per una descrizione di quanto sopra # Se nessuno dei parametri precedenti è specificato, nessuno stepper # sarà associato all'hotend dell'ugello (sebbene un comando # SYNC_EXTRUDER_MOTION possa associarne uno in fase di esecuzione). nozzle_diameter: # Diametro dell'orifizio dell'ugello (in mm). Questo parametro deve essere fornito. filament_diameter:: # Il diametro nominale del filamento grezzo (in mm) quando # entra nell'estrusore. Questo parametro deve essere fornito. #max_extrude_cross_section: # Area massima (in mm^2) di una sezione trasversale dell'estrusione # (ad es. larghezza dell'estrusione moltiplicata per l'altezza dello strato). # Questa impostazione previene quantità eccessive di estrusione # durante spostamenti XY relativamente piccoli. # Se un movimento richiede una velocità di estrusione che supererebbe questo valore # causerà la restituzione di un errore. L'impostazione predefinita # è: 4.0 * diametro_ugello^2 instantaneous_corner_velocity: 1.000 # La variazione di velocità istantanea massima (in mm/s) del # estrusore durante il collegamento di due movimenti. Il valore predefinito è 1 mm/s. #max_extrude_only_distance: 50.0 # Lunghezza massima (in mm di filamento grezzo) che può avere un movimento # di retrazione o di sola estrusione. Se uno spostamento di retrazione # o di sola estrusione richiede una distanza maggiore di questo valore, # verrà restituito un errore. Il valore predefinito è 50 mm. #max_extrude_only_velocity: #max_extrude_only_accel: # Velocità massima (in mm/s) e accelerazione (in mm/s^2) del # motore estrusore per retrazioni e movimenti di sola estrusione. # Queste impostazioni non hanno alcun impatto sui normali movimenti di stampa. # Se non specificati, vengono calcolati per corrispondere al limite che avrebbe # un movimento di stampa XY con una sezione trasversale di 4,0*diametro_ugello^2. #pressure_advance: 0.0 # La quantità di filamento grezzo da spingere nell'estrusore durante # accelerazione dell'estrusore. Una uguale quantità di filamento viene # retratta durante la decelerazione. Si misura in millimetri per # millimetro/secondo. Il valore predefinito è 0, che disabilita l'avanzamento della pressione. #pressure_advance_smooth_time: 0,040 # Un intervallo di tempo (in secondi) da utilizzare per calcolare la velocità media # dell'estrusore per l'avanzamento della pressione. Un valore maggiore si traduce # in movimenti più fluidi dell'estrusore. Questo parametro non può superare i 200 ms. # Questa impostazione si applica solo se pressure_advance è diverso da zero. # Il valore predefinito è 0,040 (40 millisecondi). # # Le restanti variabili descrivono il riscaldatore dell'estrusore. heater_pin: # Pin di uscita PWM che controlla il riscaldatore. Questo parametro deve essere fornito. #max_power: 1.0 # La potenza massima (espressa come un valore compreso tra 0,0 e 1,0) a cui # può essere impostato il riscaldatore_pin. Il valore 1.0 consente di impostare il pin # completamente abilitato per periodi prolungati, mentre un valore di 0,5 # consentirebbe di abilitare il pin per non più della metà del tempo. Questo # l'impostazione può essere utilizzata per limitare la potenza totale # (per periodi prolungati) al riscaldatore. L'impostazione predefinita è 1.0. sensor_type: # Tipo di sensore - i termistori comuni sono "EPCOS 100K B57560G104F", # "ATC Semitec 104GT-2", "ATC Semitec 104NT-4-R025H42G", "Generico # 3950","Honeywell 100K 135-104LAG-J01", "NTC 100K MGB18-104F39050L32", # "SliceEngineering 450" e "TDK NTCG104LH104JT1". Vedere la sezione # "Sensori di temperatura" per altri sensori. Questo parametro deve essere fornito. sensor_pin: # Pin di ingresso analogico collegato al sensore. Questo parametro deve essere fornito. #pullup_resistor: 4700 # La resistenza (in ohm) del pullup collegato al termistore. Questo parametro # è valido solo quando il sensore è un termistore. Il valore predefinito è 4700 ohm. #smooth_time: 1.0 # Un valore di tempo (in secondi) durante il quale le misurazioni della # temperatura verranno uniformate per ridurre l'impatto del rumore # di misurazione. Il valore predefinito è 1 secondo. control: # Algoritmo di controllo (pid o filigrana). Questo parametro deve # essere fornito. pid_Kp: pid_Ki: pid_Kd: # Il proporzionale (pid_Kp), l'integrale (pid_Ki) e la derivata # (pid_Kd) impostazioni per il sistema di controllo del feedback PID. Klipper # valuta le impostazioni PID con la seguente formula generale: # riscaldatore_pwm = (Kp*errore + Ki*integrale(errore) - Kd*derivato(errore)) / 255 # Dove "errore" è "temperatura_richiesta - temperatura_misurata" # e "heater_pwm" è la velocità di riscaldamento richiesta con 0,0 completamente # off e 1.0 completamente on. Prendi in considerazione l'utilizzo di PID_CALIBRATE # comando per ottenere questi parametri. pid_Kp, pid_Ki e pid_Kd # i parametri devono essere forniti per i riscaldatori PID. #delta_max: 2.0 # Sui riscaldatori controllati questo è il numero di gradi in # Celsius al di sopra della temperatura target prima di disattivare il riscaldatore # così come il numero di gradi sotto il target prima # riattivare il riscaldatore. L'impostazione predefinita è 2 gradi Celsius. #pwm_cycle_time: 0,100 # Tempo in secondi per ogni ciclo PWM software del riscaldatore. # non è consigliabile impostarlo a meno che non ci sia necessario come # requisito accendere il riscaldatore più velocemente di 10 volte al secondo. # Il valore predefinito è 0,100 secondi. #min_extrude_temp: 170 # La temperatura minima (in gradi Celsius) alla quale possono essere # impartiti comandi all'estrusore. L'impostazione predefinita è 170 gradi Celsius. min_temp: max_temp: # L'intervallo massimo di temperature valide (in gradi Celsius) in cui # il riscaldatore deve rimanere all'interno. Questo controlla una funzione di sicurezza # implementata nel codice del microcontrollore , la temperatura # non cadrà mai al di fuori di questo intervallo, altrimenti il microcontrollore # entrerà in uno stato di arresto. Questo controllo può aiutare a rilevarne alcuni # guasti hardware del riscaldatore e del sensore. Imposta questo intervallo solo in modo ampio # abbastanza in modo che temperature ragionevoli non si traducano in un errore. # Questi parametri devono essere forniti.

source: LEDs
hu: LED-ek

source: Support for LEDs (and LED strips) controlled via micro-controller PWM pins (one may define any number of sections with an "led" prefix). See the [command reference](G-Codes.md#led) for more information.
hu: A mikrokontroller PWM tűin keresztül vezérelt LED-ek (és LED-csíkok) támogatása (a "led" előtaggal tetszőleges számú szekciót definiálhatunk). További információkért lásd a [parancs hivatkozást](G-Codes.md#led).
it: Supporto per LED (e strisce LED) controllati tramite pin PWM del microcontrollore (si può definire un numero qualsiasi di sezioni con un prefisso "led"). Per ulteriori informazioni, vedere [command reference](G-Codes.md#led).

source: [led my_led] #red_pin: #green_pin: #blue_pin: #white_pin: # The pin controlling the given LED color. At least one of the above # parameters must be provided. #cycle_time: 0.010 # The amount of time (in seconds) per PWM cycle. It is recommended # this be 10 milliseconds or greater when using software based PWM. # The default is 0.010 seconds. #hardware_pwm: False # Enable this to use hardware PWM instead of software PWM. When # using hardware PWM the actual cycle time is constrained by the # implementation and may be significantly different than the # requested cycle_time. The default is False. #initial_RED: 0.0 #initial_GREEN: 0.0 #initial_BLUE: 0.0 #initial_WHITE: 0.0 # Sets the initial LED color. Each value should be between 0.0 and # 1.0. The default for each color is 0.
hu: [led my_led] #red_pin: #green_pin: #blue_pin: #white_pin: # Az adott LED színt vezérlő tű. A fenti paraméterek közül legalább # egyet meg kell adni. #cycle_time: 0.010 # Az idő (másodpercben) PWM ciklusonként. Szoftver alapú PWM # használata esetén ajánlott ez 10 ezredmásodperc vagy több. # Az alapértelmezett érték 0,010 másodperc. #hardware_pwm: False # Engedélyezze ezt a hardveres PWM használatához a szoftveres # PWM helyett. Hardveres PWM használatakor a tényleges ciklusidőt # a megvalósítás korlátozza, és jelentősen eltérhet a kért ciklusidőtől. # Az alapértelmezett érték False. #initial_RED: 0.0 #initial_GREEN: 0.0 #initial_BLUE: 0.0 #initial_WHITE: 0.0 # Beállítja a LED kezdeti színét. Mindegyik értéknek 0,0 és 1,0 között # kell lennie. Minden szín alapértelmezett értéke 0.
it: [led my_led] #red_pin: #green_pin: #blue_pin: #white_pin: # Il pin che controlla il colore del LED specificato. Deve essere fornito # almeno uno dei parametri sopra indicati. #cycle_time: 0.010 # La quantità di tempo (in secondi) per ciclo PWM. Si consiglia che sia # pari o superiore a 10 millisecondi quando si utilizza il PWM basato # su software. Il valore predefinito è 0,010 secondi. #hardware_pwm: False # Abilitare questa opzione per utilizzare PWM hardware anziché PWM # software. Quando si utilizza l'hardware PWM, il tempo di ciclo effettivo # è vincolato dall'implementazione e può essere notevolmente diverso # dal tempo di ciclo richiesto. L'impostazione predefinita è Falso. #initial_RED: 0.0 #initial_GREEN: 0.0 #initial_BLUE: 0.0 #initial_WHITE: 0.0 # Imposta il colore iniziale del LED. Ciascun valore deve essere # compreso tra 0,0 e 1,0. Il valore predefinito per ogni colore è 0.

source: Neopixel (aka WS2812) LED support (one may define any number of sections with a "neopixel" prefix). See the [command reference](G-Codes.md#led) for more information.
hu: Neopixel (más néven WS2812) LED támogatás (tetszőleges számú szekciót definiálhatunk "neopixel" előtaggal). További információkért lásd a [parancs hivatkozást](G-Codes.md#led).
it: Supporto LED Neopixel (aka WS2812) (si può definire un numero qualsiasi di sezioni con un prefisso "neopixel"). Per ulteriori informazioni, vedere [riferimento comando](G-Codes.md#led).

source: Dotstar (aka APA102) LED support (one may define any number of sections with a "dotstar" prefix). See the [command reference](G-Codes.md#led) for more information.
hu: Dotstar (más néven APA102) LED-támogatás (tetszőleges számú szekciót lehet definiálni "dotstar" előtaggal). További információkért lásd a [parancs hivatkozást](G-Codes.md#led).
it: Supporto LED Dotstar (conosciuti anche come APA102) (si può definire un numero qualsiasi di sezioni con un prefisso "dotstar"). Per ulteriori informazioni, vedere [command reference](G-Codes.md#led).

source: [dotstar my_dotstar] data_pin: # The pin connected to the data line of the dotstar. This parameter # must be provided. clock_pin: # The pin connected to the clock line of the dotstar. This parameter # must be provided. #chain_count: # See the "neopixel" section for information on this parameter. #initial_RED: 0.0 #initial_GREEN: 0.0 #initial_BLUE: 0.0 # See the "led" section for information on these parameters.
hu: [dotstar my_dotstar] data_pin: # A pont a dotstar adatvonalához csatlakozik. # Ezt a paramétert meg kell adni. clock_pin: # A dotstar időjel vonalához csatlakoztatott tű. # Ezt a paramétert meg kell adni. #chain_count: # A paraméterrel kapcsolatos információkért lásd a "neopixel" részt. #initial_RED: 0.0 #initial_GREEN: 0.0 #initial_BLUE: 0.0 # Ezen paraméterek leírásáról nézd meg a "LED" részt.
it: [dotstar my_dotstar] data_pin: # Il pin connesso alla data line del dotstar. Questo parametro # deve essere fornito. clock_pin: # Il pin connesso alla clock line del dotstar. Questo parametro # deve essere fornito. #chain_count: # Vedere la sezione "neopixel" per informazioni su questo parametro. #initial_RED: 0.0 #initial_GREEN: 0.0 #initial_BLUE: 0.0 # Vedere la sezione "led" per informazioni su questo parametro.
