Repository: Klipper3d/klipper-translations
Catalog: locales/*/LC_MESSAGES/Config_Reference.po
Languages: hu, it

source: [firmware_retraction] #retract_length: 0 # The length of filament (in mm) to retract when G10 is activated, # and to unretract when G11 is activated (but see # unretract_extra_length below). The default is 0 mm. #retract_speed: 20 # The speed of retraction, in mm/s. The default is 20 mm/s. #unretract_extra_length: 0 # The length (in mm) of *additional* filament to add when # unretracting. #unretract_speed: 10 # The speed of unretraction, in mm/s. The default is 10 mm/s.
hu: [firmware_retraction] #retract_length: 0 # A G10 aktiválásakor visszahúzandó szál hossza (mm-ben), # és a G11 aktiválásakor visszahúzandó (de lásd: G11). # unretract_extra_length alább). Az alapértelmezett érték 0 mm. #retract_speed: 20 # A behúzás sebessége mm/mp-ben. # Az alapértelmezett érték 20 mm/mp. #unretract_extra_length: 0 # Az *additional* szál hossza (mm-ben), amelyet hozzáadunk, # a visszahúzás feloldásakor. #unretract_speed: 10 # A visszahúzás feloldásának sebessége mm/mp-ben. # Az alapértelmezett érték 10 mm/mp.
it: [firmware_retraction] #retract_length: 0 # La lunghezza del filamento (in mm) da ritrarre quando G10 # è attivato e da ritrarre quando G11 è attivato (ma vedere # unretract_extra_length di seguito). I# l valore predefinito è 0 mm. #retract_speed: 20 # La velocità di retrazione, in mm/s. # Il valore predefinito è 20 mm/s. #unretract_extra_length: 0 # La lunghezza (in mm) del filamento *aggiuntivo* da # sommare quando non si ritrae. #unretract_speed: 10 # La velocità di srotolamento, in mm/s. # Il valore predefinito è 10 mm/s.

source: [gcode_arcs] #resolution: 1.0 # An arc will be split into segments. Each segment's length will # equal the resolution in mm set above. Lower values will produce a # finer arc, but also more work for your machine. Arcs smaller than # the configured value will become straight lines. The default is # 1mm.
hu: [gcode_arcs] #resolution: 1.0 # Egy ív szegmensekre lesz felosztva. Minden szegmens hossza # megegyezik a fent beállított felbontással, mm-ben. Az alacsonyabb # értékek finomabb ívet eredményeznek, de több munkát is végeznek # a gépen. A beállított értéknél kisebb ívek egyenesekké válnak. # Az alapértelmezett érték 1 mm.
it: [gcode_arcs] #resolution: 1.0 # Un arco sarà diviso in segmenti. La lunghezza di ciascun segmento # sarà uguale alla risoluzione in mm impostata sopra. Valori più bassi # produrranno un arco più fine, ma anche più lavoro per la tua macchina. # Archi più piccoli del valore configurato diventerà linee rette. # L'impostazione predefinita è # 1mm.

source: [respond] #default_type: echo # Sets the default prefix of the "M118" and "RESPOND" output to one # of the following: # echo: "echo: " (This is the default) # command: "// " # error: "!! " #default_prefix: echo: # Directly sets the default prefix. If present, this value will # override the "default_type".
hu: [respond] #default_type: echo # Beállítja az "M118" és a "RESPOND" kimenet alapértelmezett előtagját # a következők egyikére: # echo: "echo: " (Ez az alapértelmezett) # command: "// " # error: "!! " #default_prefix: echo: # Közvetlenül beállítja az alapértelmezett előtagot. Ha jelen van, ez az # érték felülírja a „default_type” értéket.
it: [respond] #default_type: echo # Imposta il prefisso predefinito dell'output "M118" e "RESPOND" su uno dei seguenti: # echo: "echo: " (Questa è l'impostazione predefinita) # command: "// " # error: "!! " #default_prefix: echo: # Imposta direttamente il prefisso predefinito. Se presente # questo valore sovrascriverà il "default_type".

source: [input_shaper] #shaper_freq_x: 0 # A frequency (in Hz) of the input shaper for X axis. This is # usually a resonance frequency of X axis that the input shaper # should suppress. For more complex shapers, like 2- and 3-hump EI # input shapers, this parameter can be set from different # considerations. The default value is 0, which disables input # shaping for X axis. #shaper_freq_y: 0 # A frequency (in Hz) of the input shaper for Y axis. This is # usually a resonance frequency of Y axis that the input shaper # should suppress. For more complex shapers, like 2- and 3-hump EI # input shapers, this parameter can be set from different # considerations. The default value is 0, which disables input # shaping for Y axis. #shaper_type: mzv # A type of the input shaper to use for both X and Y axes. Supported # shapers are zv, mzv, zvd, ei, 2hump_ei, and 3hump_ei. The default # is mzv input shaper. #shaper_type_x: #shaper_type_y: # If shaper_type is not set, these two parameters can be used to # configure different input shapers for X and Y axes. The same # values are supported as for shaper_type parameter. #damping_ratio_x: 0.1 #damping_ratio_y: 0.1 # Damping ratios of vibrations of X and Y axes used by input shapers # to improve vibration suppression. Default value is 0.1 which is a # good all-round value for most printers. In most circumstances this # parameter requires no tuning and should not be changed.
hu: [input_shaper] #shaper_freq_x: 0 # A bemeneti változó frekvenciája (Hz-ben) az X tengelyhez. Ez általában # az X tengely rezonanciafrekvenciája, amelyet a bemeneti változóknak # el kell nyomnia. Bonyolultabb változók, például 2- és 3-hullámos EI # bemeneti változók esetén ez a paraméter különböző szempontok # alapján állítható be. Az alapértelmezett érték 0, ami letiltja az X # tengely bemeneti változását. #shaper_freq_y: 0 # Az Y tengely bemeneti változójának frekvenciája (Hz-ben). Ez általában # az Y tengely rezonanciafrekvenciája, amelyet a bemeneti változóknak # el kell nyomnia. Bonyolultabb változók, például 2- és 3-hullámos EI # bemeneti változók esetén ez a paraméter különböző szempontok # alapján állítható be. Az alapértelmezett érték 0, ami letiltja az Y # tengely bemeneti változását. #shaper_type: mzv # A bemeneti változók típusa az X és az Y tengelyekhez. A támogatott # változók a zv, mzv, zvd, ei, 2hump_ei és 3hump_ei. Az alapértelmezett # bemeneti változó az mzv. #shaper_type_x: #shaper_type_y: # Ha a shaper_type nincs beállítva, akkor ez a két paraméter használható # különböző bemeneti változók konfigurálására az X és Y tengelyekhez. # Ugyanazok az értékek támogatottak, mint a shaper_type paraméternél. #damping_ratio_x: 0,1 #damping_ratio_y: 0,1 # Az X és Y tengely rezgésének csillapítási arányai, amelyeket a bemeneti # változók használnak a rezgéselnyomás javítására. Az alapértelmezett # érték 0,1, ami a legtöbb nyomtató számára jó általános érték. A legtöbb # esetben ez a paraméter nem igényel hangolást, és nem szabad # megváltoztatni.
it: [input_shaper] #shaper_freq_x: 0 # Una frequenza (in Hz) dell'input shaper per l'asse X. Questa è # solitamente una frequenza di risonanza dell'asse X che l'input # shaper dovrebbe sopprimere. Per shaper più complessi, come # shaper di input EI a 2 e 3 gobbe, questo parametro può essere # impostato in base a diverse considerazioni. # Il valore predefinito è 0, che disabilita la modellatura dell'input # per l'asse X. #shaper_freq_y: 0 # Una frequenza (in Hz) dell'input shaper per l'asse Y. Questa è # solitamente una frequenza di risonanza dell'asse Y che l'input # shaper dovrebbe sopprimere. Per shaper più complessi, come # shaper di input EI a 2 e 3 gobbe, questo parametro può essere # impostato in base a diverse considerazioni. Il valore predefinito # è 0, che disabilita la modellatura dell'input per l'asse Y. #shaper_type: mzv # Un tipo di input shaper da utilizzare per entrambi gli assi X e Y. # Gli shaper supportati sono zv, mzv, zvd, ei, 2hump_ei e # 3hump_ei. L'impostazione predefinita è mzv input shaper. #shaper_type_x: #shaper_type_y: # Se shaper_type non è impostato, questi due parametri possono # essere utilizzati per configurare diversi shaper di input per gli # assi X e Y. Sono supportati gli stessi valori del parametro # shaper_type. #damping_ratio_x: 0.1 #damping_ratio_y: 0.1 # Rapporti di smorzamento delle vibrazioni degli assi X e Y # utilizzati dagli shaper di input per migliorare la soppressione # delle vibrazioni. Il valore predefinito è 0,1, un buon valore per la # maggior parte delle stampanti. Nella maggior parte dei casi # questo parametro non richiede ottimizzazione e # non deve essere modificato.

source: [board_pins my_aliases] mcu: mcu # A comma separated list of micro-controllers that may use the # aliases. The default is to apply the aliases to the main "mcu". aliases: aliases_<name>: # A comma separated list of "name=value" aliases to create for the # given micro-controller. For example, "EXP1_1=PE6" would create an # "EXP1_1" alias for the "PE6" pin. However, if "value" is enclosed # in "<>" then "name" is created as a reserved pin (for example, # "EXP1_9=<GND>" would reserve "EXP1_9"). Any number of options # starting with "aliases_" may be specified.
hu: [board_pins my_aliases] mcu: mcu # Az álneveket használó mikrovezérlők vesszővel elválasztott listája. # Az alapértelmezés szerint az álneveket a fő "mcu"-ra kell alkalmazni. aliases: aliases_<name>: # A "name=value" álnevek vesszővel elválasztott listája, amelyet az # adott mikrovezérlőhöz kell létrehozni. Például az "EXP1_1=PE6" # egy "EXP1_1" álnevet hoz létre a "PE6" tűhöz. Ha azonban a "value" # a "<>" közé van zárva, akkor a "name" lefoglalt tűként jön létre # (például az "EXP1_9=<GND>" az "EXP1_9"-et foglalná le). Bármilyen # számú "aliases_" karakterrel kezdődő opció megadható.

source: [stepper_z1] #step_pin: #dir_pin: #enable_pin: #microsteps: #rotation_distance: # See the "stepper" section for the definition of the above parameters. #endstop_pin: # If an endstop_pin is defined for the additional stepper then the # stepper will home until the endstop is triggered. Otherwise, the # stepper will home until the endstop on the primary stepper for the # axis is triggered.
hu: [stepper_z1] #step_pin: #dir_pin: #enable_pin: #microsteps: #rotation_distance: # A fenti paraméterek meghatározásához lásd a "léptető" részt. #endstop_pin: # Ha egy endstop_pin definiálva van a kiegészítő léptetőhöz, akkor # a léptető visszatér, amíg az végállás ki nem vált. Ellenkező esetben # a léptető mindaddig visszatér, amíg a tengely elsődleges # léptetőjének végálláskapcsolója ki nem vált.
it: [stepper_z1] #step_pin: #dir_pin: #enable_pin: #microsteps: #rotation_distance: # Vedere la sezione "stepper" per la definizione dei parametri di cui sopra. #endstop_pin: # Se viene definito un endstop_pin per lo stepper aggiuntivo, lo stepper # si fermerà fino all'attivazione dell'endstop. In caso contrario, lo stepper # si fermerà fino a quando non verrà attivato il finecorsa sullo stepper # primario per l'asse.

source: [dual_carriage] axis: # The axis this extra carriage is on (either x or y). This parameter # must be provided. #step_pin: #dir_pin: #enable_pin: #microsteps: #rotation_distance: #endstop_pin: #position_endstop: #position_min: #position_max: # See the "stepper" section for the definition of the above parameters.
hu: [dual_carriage] axis: # Azon a tengelyen, amelyen ez az extra kocsi van (X vagy Y). # Ezt a paramétert meg kell adni. #step_pin: #dir_pin: #enable_pin: #microsteps: #rotation_distance: #endstop_pin: #position_endstop: #position_min: #position_max: # A fenti paraméterek meghatározásához lásd a "léptető" részt.
it: [dual_carriage] axis: # L'asse su cui si trova questo carrello aggiuntivo (x o y). Questo parametro # deve essere fornito #step_pin: #dir_pin: #enable_pin: #microsteps: #rotation_distance: #endstop_pin: #position_endstop: #position_min: #position_max: # Vedere la sezione "stepper" per la definizione dei parametri di cui sopra.

source: [manual_stepper my_stepper] #step_pin: #dir_pin: #enable_pin: #microsteps: #rotation_distance: # See the "stepper" section for a description of these parameters. #velocity: # Set the default velocity (in mm/s) for the stepper. This value # will be used if a MANUAL_STEPPER command does not specify a SPEED # parameter. The default is 5mm/s. #accel: # Set the default acceleration (in mm/s^2) for the stepper. An # acceleration of zero will result in no acceleration. This value # will be used if a MANUAL_STEPPER command does not specify an ACCEL # parameter. The default is zero. #endstop_pin: # Endstop switch detection pin. If specified, then one may perform # "homing moves" by adding a STOP_ON_ENDSTOP parameter to # MANUAL_STEPPER movement commands.
hu: [manual_stepper my_stepper] #step_pin: #dir_pin: #enable_pin: #microsteps: #rotation_distance: # A paraméterek leírását lásd a "léptető" részben. #velocity: # Állítsa be a léptető alapértelmezett sebességét (mm/mp-ben). # Ezt az értéket használja a rendszer, ha a MANUAL_STEPPER parancs nem # ad meg SPEED paramétert. Az alapértelmezett érték 5 mm/mp. #accel: # Állítsa be a léptető alapértelmezett gyorsulását (mm/mp^2-en). A nulla # gyorsulás nem eredményez gyorsulást. Ezt az értéket használja a rendszer, # ha a MANUAL_STEPPER parancs nem ad meg ACCEL paramétert. # Az alapértelmezett érték 0. #endstop_pin: # Végálláskapcsoló csatlakozási tű. Ha meg van adva, akkor egy # STOP_ON_ENDSTOP paraméter hozzáadásával a MANUAL_STEPPER # mozgásparancsokhoz "kezdőpont felvételi mozgások" hajthatók végre.
it: [manual_stepper my_stepper] #step_pin: #dir_pin: #enable_pin: #microsteps: #rotation_distance: # Vedere la sezione "stepper" per una descrizione di questi parametri. #velocity: # Impostare la velocità predefinita (in mm/s) per lo stepper. Questo # valore verrà utilizzato se un comando MANUAL_STEPPER non specifica # un parametro SPEED. Il valore predefinito è 5 mm/s. #accel: # Imposta l'accelerazione predefinita (in mm/s^2) per lo stepper. # Un'accelerazione pari a zero non risulterà in nessuna accelerazione. # Questo valore verrà utilizzato se un comando MANUAL_STEPPER non # specifica un parametro ACCEL. Il valore predefinito è zero. #endstop_pin: # Pin di rilevamento interruttore di fine corsa. Se specificato, è possibile # eseguire "movimenti di riferimento" aggiungendo un parametro # STOP_ON_ENDSTOP ai comandi di movimento MANUAL_STEPPER.

source: [verify_heater heater_config_name] #max_error: 120 # The maximum "cumulative temperature error" before raising an # error. Smaller values result in stricter checking and larger # values allow for more time before an error is reported. # Specifically, the temperature is inspected once a second and if it # is close to the target temperature then an internal "error # counter" is reset; otherwise, if the temperature is below the # target range then the counter is increased by the amount the # reported temperature differs from that range. Should the counter # exceed this "max_error" then an error is raised. The default is # 120. #check_gain_time: # This controls heater verification during initial heating. Smaller # values result in stricter checking and larger values allow for # more time before an error is reported. Specifically, during # initial heating, as long as the heater increases in temperature # within this time frame (specified in seconds) then the internal # "error counter" is reset. The default is 20 seconds for extruders # and 60 seconds for heater_bed. #hysteresis: 5 # The maximum temperature difference (in Celsius) to a target # temperature that is considered in range of the target. This # controls the max_error range check. It is rare to customize this # value. The default is 5. #heating_gain: 2 # The minimum temperature (in Celsius) that the heater must increase # by during the check_gain_time check. It is rare to customize this # value. The default is 2.
hu: [verify_heater heater_config_name] #max_error: 120 # A maximális „halmozott hőmérsékleti hiba” a hiba emelése előtt. # A kisebb értékek szigorúbb ellenőrzést eredményeznek, a nagyobb # értékek pedig több időt biztosítanak a hibajelentés előtt. # Pontosabban, a hőmérsékletet másodpercenként egyszer ellenőrzik, # és ha közel van a célhőmérséklethez, akkor a belső "hibaszámláló" # nullázódik. Ellenkező esetben, ha a hőmérséklet a céltartomány alatt # van, akkor a számlálót annyival növeljük, amennyivel a jelentett # hőmérséklet eltér ettől a tartománytól. Ha a számláló meghaladja ezt # a "max_error" értéket, hibaüzenet jelenik meg. # Az alapértelmezett érték 120. #check_gain_time: # Ez szabályozza a fűtőelem ellenőrzését a kezdeti fűtés során. # A kisebb értékek szigorúbb ellenőrzést eredményeznek, a nagyobb # értékek pedig több időt biztosítanak a hibajelentés előtt. # Pontosabban, a kezdeti fűtés során, amíg a fűtőelem hőmérséklete # ezen időkereten belül (másodpercben van megadva) megemelkedik, # a belső "hibaszámláló" nullázódik. Az alapértelmezett érték 20 # másodperc az extruder-eknél és 60 másodperc a heater_bed # esetében. #hysteresis: 5 # A maximális hőmérséklet-különbség (Celsius fokban) a # célhőmérséklethez képest, amely a cél tartományában van. Ez # szabályozza a max_error tartomány ellenőrzését. Ritka az érték # testreszabása. Az alapértelmezett érték 5. #heating_gain: 2 # Az a minimális hőmérséklet (Celsiusban), amellyel a fűtésnek # növelnie kell a check_gain_time ellenőrzés során. # Ritka az érték testreszabása. Az alapértelmezett érték 2.
it: [verify_heater heater_config_name] #max_error: 120 # Il massimo "errore di temperatura cumulativo" prima di generare un # errore. Valori più piccoli comportano un controllo più rigoroso e valori # più grandi consentono più tempo prima che venga segnalato un errore. # Nello specifico la temperatura viene osservata una volta al secondo e # se è prossima alla temperatura target viene azzerato un "contatore errori" # interno; in caso contrario, se la temperatura è inferiore all'intervallo target, # il contatore viene aumentato della quantità in cui la temperatura riportata # differisce da tale intervallo. Se il contatore supera questo "errore_max", # viene generato un errore. Il valore predefinito è 120. #check_gain_time: # Questo controlla la verifica del riscaldatore durante il riscaldamento # iniziale. Valori più piccoli comportano un controllo più rigoroso e valori # più grandi consentono più tempo prima che venga segnalato un errore. # In particolare, durante il riscaldamento iniziale, fintanto che il riscaldatore # aumenta di temperatura entro questo intervallo di tempo (specificato in # secondi), il "contatore errori" interno viene azzerato. Il valore predefinito # è 20 secondi per gli estrusori e 60 secondi per heater_bed. #hysteresis: 5 # La differenza di temperatura massima (in gradi Celsius) rispetto a una # temperatura target considerata nell'intervallo del target. Questo controlla # nell'intervallo max_error. È raro personalizzare questo valore. # L'impostazione predefinita è 5. #heating_gain: 2 # La temperatura minima (in gradi Celsius) di cui il riscaldatore deve # aumentare durante il check_gain_time. È raro personalizzare questo valore. # L'impostazione predefinita è 2.

source: [homing_heaters] #steppers: # A comma separated list of steppers that should cause heaters to be # disabled. The default is to disable heaters for any homing/probing # move. # Typical example: stepper_z #heaters: # A comma separated list of heaters to disable during homing/probing # moves. The default is to disable all heaters. # Typical example: extruder, heater_bed
hu: [homing_heaters] #steppers: # A fűtőelemek vesszővel elválasztott listája, amelyek miatt le kell # tiltani a fűtést. Az alapértelmezés az, hogy letiltja a fűtőelemeket # minden indítási/mérési lépéshez. # Tipikus példa: stepper_z #heaters: # A fűtőtestek vesszővel elválasztott listája, amelyet le kell tiltani # az elhelyezési/mérési lépések során. Az alapértelmezett az összes # fűtőelem letiltása. Tipikus példa: extruder, heater_bed
it: [homing_heaters] #steppers: # Un elenco separato da virgole di stepper che dovrebbero causare # la disattivazione dei riscaldatori. L'impostazione predefinita è # disabilitare i riscaldatori per qualsiasi spostamento di homing/sonda. # Esempio tipico: stepper_z #heaters: # Un elenco separato da virgole di riscaldatori da disabilitare # durante i movimenti di homing/probing. L'impostazione # predefinita è disabilitare tutti i riscaldatori. # Esempio tipico: estrusore, letto riscaldatore

source: [thermistor my_thermistor] #temperature1: #resistance1: #temperature2: #resistance2: #temperature3: #resistance3: # Three resistance measurements (in Ohms) at the given temperatures # (in Celsius). The three measurements will be used to calculate the # Steinhart-Hart coefficients for the thermistor. These parameters # must be provided when using Steinhart-Hart to define the # thermistor. #beta: # Alternatively, one may define temperature1, resistance1, and beta # to define the thermistor parameters. This parameter must be # provided when using "beta" to define the thermistor.
hu: [thermistor my_thermistor] #temperature1: #resistance1: #temperature2: #resistance2: #temperature3: #resistance3: # Három ellenállásmérés (ohmban) adott hőmérsékleten (Celsiusban). # A három mérést a termisztor Steinhart-Hart együtthatóinak # kiszámításához használjuk fel. Ezeket a paramétereket meg kell adni, # ha Steinhart-Hartot használunk a termisztor meghatározásához. #beta: # Alternatív megoldásként a temperature1, resistance1, és beta # megadható a termisztor paramétereinek meghatározásához. Ezt a # paramétert akkor kell megadni, ha "beta"-t használ a termisztor # meghatározásához.
it: [thermistor my_thermistor] #temperature1: #resistance1: #temperature2: #resistance2: #temperature3: #resistance3: # Tre misure di resistenza (in Ohm) alle temperature date (in Celsius). # Le tre misurazioni verranno utilizzate per calcolare i coefficienti di # Steinhart-Hart per il termistore. Questi parametri devono essere # forniti quando si utilizza Steinhart-Hart per definire il termistore. #beta: # In alternativa, è possibile definire temperatura1, resistenza1 e beta # per definire i parametri del termistore. Questo parametro deve # essere fornito quando si utilizza "beta" per definire il termistore.

source: [adc_temperature my_sensor] #temperature1: #voltage1: #temperature2: #voltage2: #... # A set of temperatures (in Celsius) and voltages (in Volts) to use # as reference when converting a temperature. A heater section using # this sensor may also specify adc_voltage and voltage_offset # parameters to define the ADC voltage (see "Common temperature # amplifiers" section for details). At least two measurements must # be provided. #temperature1: #resistance1: #temperature2: #resistance2: #... # Alternatively one may specify a set of temperatures (in Celsius) # and resistance (in Ohms) to use as reference when converting a # temperature. A heater section using this sensor may also specify a # pullup_resistor parameter (see "extruder" section for details). At # least two measurements must be provided.
hu: [adc_temperature my_sensor] #temperature1: #voltage1: #temperature2: #voltage2: #... # Hőmérsékletek (Celsiusban) és feszültségek (V-ban) készlete referenciaként # a hőmérséklet konvertálásakor. Az érzékelőt használó fűtőrész az adc_voltage # és a voltage_offset paramétereket is megadhatja az ADC feszültség meghatározásához # (a részletekért lásd a "Általános hőmérsékleterősítők" részt). # Legalább két mérést kell megadni. #temperature1: #resistance1: #temperature2: #resistance2: #... # Alternatívaként megadhatunk egy sorban hőmérsékletet (Celsiusban) is # és ellenállást (Ohmban), hogy referenciaként használhassuk, amikor átalakítunk egy # hőmérsékletet. Ezt az érzékelőt használó fűtőszekcióban megadhatunk egy # pullup_resistor paramétert (a részleteket lásd az "extruder" szakaszban). # A címen legalább két mérést kell megadni.
