Repository: Klipper3d/klipper-translations
Catalog: locales/*/LC_MESSAGES/Config_checks.po
Languages: hu, it, ru

source: This document provides a list of steps to help confirm the pin settings in the Klipper printer.cfg file. It is a good idea to run through these steps after following the steps in the [installation document](Installation.md).
hu: Ez a dokumentum a Klipper printer.cfg fájl tű beállításainak megerősítéséhez szükséges lépések listáját tartalmazza. Célszerű ezeket a lépéseket a [telepítési dokumentum](Installation.md) lépéseinek követése után végrehajtani.
it: Questo documento fornisce una lista di step per confermare le impostazioni dei pin nel file printer.cfg di Klipper. È una buona idea eseguire questi passi dopo aver seguito i passi nel [documento di installazione](Installation.md).
ru: В этом документе приведен список действий, которые помогут подтвердить настройки выводов (pin) в файле Klipper printer.cfg. Рекомендуется выполнить эти шаги после выполнения шагов, описанных в [документе по установке](Installation.md).

source: During this guide, it may be necessary to make changes to the Klipper config file. Be sure to issue a RESTART command after every change to the config file to ensure that the change takes effect (type "restart" in the Octoprint terminal tab and then click "Send"). It's also a good idea to issue a STATUS command after every RESTART to verify that the config file is successfully loaded.
hu: Az útmutató során szükség lehet a Klipper konfigurációs fájljának módosítására. Ügyeljen arra, hogy a konfigurációs fájl minden módosítása után adjon ki egy RESTART parancsot, hogy megbizonyosodjon arról, hogy a változtatás érvénybe lép (írja be a "restart" kifejezést az Octoprint terminál lapjára, majd kattintson a "Küldés" gombra). Az is jó ötlet, hogy minden RESTART után kiad egy STATUS parancsot a konfigurációs fájl sikeres betöltésének ellenőrzésére.
it: In alcuni passaggi di questa guida, potrebbe essere necessario modificare il file di configurazione di Klipper. Assicuratevi di dare il comando RESTART, dopo ogni modifica al file di configurazione, per accertarsi che le modifiche abbiano effetto(scrivere "restart" nella scheda del terminale di Octoprint e cliccare su INVIA). E' anche consigliabile utilizzare il comando STATUS, dopo ogni RESTART, per verificare che il file di configurazione sia stato caricato correttamente.
ru: Во время работы с этим руководством может потребоваться внести изменения в конфигурационный файл Klipper. Обязательно выполняйте команду RESTART после каждого изменения в файле конфигурации, чтобы убедиться, что изменение вступило в силу (введите «restart» на вкладке терминала Octoprint, а затем нажмите «Отправить»). Также рекомендуется запускать команду STATUS после каждого RESTART, чтобы убедиться, что файл конфигурации успешно загружен.

source: Verify temperature
hu: Ellenőrizze a hőmérsékletet
it: Verificare le temperature
ru: Проверить температуру

source: Start by verifying that temperatures are being properly reported. Navigate to the Octoprint temperature tab.
hu: Kezdje azzal, hogy ellenőrzi, a hőmérséklet megfelelően van-e jelentve. Lépjen az Octoprint hőmérséklet lapjára.
it: Iniziare verificando che le temperature siano correttamente riportate. Navigare alla scheda temperature di Octoprint.
ru: Начните с проверки правильности регистрации температуры. Перейдите на вкладку температуры Octoprint.

source: ![octoprint-temperature](img/octoprint-temperature.png)
it: eseguire l'istruzione ![octoprint-temperature](img/octoprint-temperature.png)

source: Verify that the temperature of the nozzle and bed (if applicable) are present and not increasing. If it is increasing, remove power from the printer. If the temperatures are not accurate, review the "sensor_type" and "sensor_pin" settings for the nozzle and/or bed.
hu: Ellenőrizze, hogy a fúvóka és az ágy hőmérséklete (ha van) jelen van-e, és nem emelkedik. Ha növekszik, kapcsolja ki a nyomtatót. Ha a hőmérsékletek nem pontosak, tekintse át a fúvóka és/vagy ágy "sensor_type" és "sensor_pin" beállításait.
it: Verificare che la temperatura dell' ugello e del piatto(se presente) siano presenti e non stiano aumentando. Se stessero aumentando staccare l'alimentazione alla stampante. Se le temperature non sono precise, rivedere le impostazioni "sensor_type" e "sensor_pin" per l'ugello e/o il piatto.
ru: Убедитесь, что температура сопла и стола (если применимо) присутствует и не повышается. Если он увеличивается, отключите питание принтера. Если температуры неточны, проверьте настройки «sensor_type» и «sensor_pin» для сопла и/или стола.

source: Verify M112
hu: Ellenőrzés M112
it: Verificare M112
ru: Проверить M112

source: Navigate to the Octoprint terminal tab and issue an M112 command in the terminal box. This command requests Klipper to go into a "shutdown" state. It will cause Octoprint to disconnect from Klipper - navigate to the Connection area and click on "Connect" to cause Octoprint to reconnect. Then navigate to the Octoprint temperature tab and verify that temperatures continue to update and the temperatures are not increasing. If temperatures are increasing, remove power from the printer.
hu: Navigáljon az Octoprint terminál fülre, és adjon ki egy M112 parancsot a terminálmezőben. Ez a parancs arra kéri a Klippert, hogy lépjen "leállási" állapotba. Ennek hatására az Octoprint megszakítja a kapcsolatot a Klipperrel. Navigáljon a Connection (Kapcsolat) területre, és kattintson a "Kapcsolódás" gombra, hogy az Octoprint újra csatlakozzon. Ezután navigáljon az Octoprint hőmérséklet fülre, és ellenőrizze, hogy a hőmérsékletek továbbra is frissülnek-e, és a hőmérsékletek nem emelkednek-e. Ha a hőmérsékletek emelkednek, kapcsolja le a nyomtatót a hálózatról.
it: Selezionare la scheda terminale e dare il comando M112 nel riquadro del terminale. Questo comando richiede a Klipper di porsi in uno stato di spengimento. Questo causerà la disconnessione di Octoprint da Klipper - selezionate il menu connessione e premete il pulsante "Connetti" per far riconnettere Octoprint. Selezionate poi la scheda temperatura e verificate che le temperature si stiano aggiornando e che non stiano aumentando. Se stanno aumentando, staccate l'alimentazione della stampante.
ru: Перейдите на вкладку терминала Octoprint и введите команду M112 в терминале. Эта команда требует от Klipper перейти в состояние «выключения». Это приведет к отключению Octoprint от Klipper — перейдите в область «Подключение» и нажмите «Подключиться», чтобы вызвать повторное подключение Octoprint. Затем перейдите на вкладку температуры Octoprint и убедитесь, что температура продолжает обновляться и не повышается. Если температура повышается, отключите питание принтера.

source: The M112 command causes Klipper to go into a "shutdown" state. To clear this state, issue a FIRMWARE_RESTART command in the Octoprint terminal tab.
hu: Az M112 parancs hatására a Klipper "leállítás" állapotba kerül. Ennek az állapotnak a törléséhez adjon ki egy FIRMWARE_RESTART parancsot az Octoprint terminál lapon.
it: Il comando M112 mette Klipper in uno stato di spegnimento. Per farlo uscire da questo stato, dare il comando FIRMWARE_RESTART nella scheda terminale di Octoprint.
ru: Команда M112 переводит Klipper в состояние «отключения». Чтобы сбросить это состояние, введите команду FIRMWARE_RESTART на вкладке терминала Octoprint.

source: Verify heaters
hu: Ellenőrizze a fűtőtesteket
it: Verifica il riscaldamento
ru: Проверка нагревателей

source: Navigate to the Octoprint temperature tab and type in 50 followed by enter in the "Tool" temperature box. The extruder temperature in the graph should start to increase (within about 30 seconds or so). Then go to the "Tool" temperature drop-down box and select "Off". After several minutes the temperature should start to return to its initial room temperature value. If the temperature does not increase then verify the "heater_pin" setting in the config.
hu: Navigáljon az Octoprint hőmérséklet fülre, és írja be az 50-et, majd nyomjon Entert az "Eszköz" hőmérséklet mezőbe. Az extruder hőmérsékletének a grafikonon növekednie kell (körülbelül 30 másodpercen belül). Ezután lépjen a "Eszköz" hőmérséklet legördülő mezőbe, és válassza az "Off" lehetőséget. Néhány perc múlva a hőmérsékletnek el kell kezdenie visszaesni a kezdeti hőmérséklet felé. Ha a hőmérséklet nem emelkedik, akkor ellenőrizze a "heater_pin" beállítását a konfigurációs fájban.
it: Passare alla pagina della temperatura su Octoprint . Nella casella della temperatura "Tool", digitare 50 seguito dal tasto enter .La temperatura dell'estrusore indicata nel grafico, dovrebbe iniziare ad aumentare (entro 30 secondi circa). Quindi vai alla casella a scorrimento della temperatura "Tool" e seleziona "Off". Dopo alcuni minuti la temperatura dovrebbe tornare al valore di temperatura ambiente iniziale. Se la temperatura non aumenta, verifica l'impostazione "heater_pin" nella configurazione.
ru: Перейдите на вкладку температуры Octoprint и введите 50, а затем введите в поле температуры «Инструмент». Температура экструдера на графике должна начать увеличиваться (примерно через 30 секунд). Затем перейдите в раскрывающийся список температуры «Инструмент» и выберите «Выкл.». Через несколько минут температура должна начать возвращаться к исходному значению комнатной температуры. Если температура не увеличивается, проверьте настройку «heater_pin» в конфигурации.

source: If the printer has a heated bed then perform the above test again with the bed.
hu: Ha a nyomtató fűtött ággyal rendelkezik, akkor végezze el a fenti vizsgálatot az ágynál is.
it: Se la stampante ha il piatto riscaldato, eseguire nuovamente il test indicato in precedenza.
ru: Если в принтере есть стол с подогревом, повторите вышеуказанный тест со столом.

source: Verify stepper motor enable pin
hu: A léptetőmotor engedélyező tű ellenőrzése
it: Verificare il pin di abilitazione del motore passo-passo
ru: Проверьте пин включения шагового двигателя

source: Verify that all of the printer axes can manually move freely (the stepper motors are disabled). If not, issue an M84 command to disable the motors. If any of the axes still can not move freely, then verify the stepper "enable_pin" configuration for the given axis. On most commodity stepper motor drivers, the motor enable pin is "active low" and therefore the enable pin should have a "!" before the pin (for example, "enable_pin: !ar38").
hu: Ellenőrizze, hogy a nyomtató minden tengelye manuálisan szabadon mozog-e (a léptetőmotorok ki vannak kapcsolva). Ha nem, adjon ki egy M84 parancsot a motorok letiltására. Ha valamelyik tengely még mindig nem tud szabadon mozogni, akkor ellenőrizze a léptető "enable_pin" konfigurációt az adott tengelyhez. A legtöbb hagyományos léptetőmotor meghajtónál a motor engedélyező tű "active low", ezért az engedélyező tű előtt egy "!" jelnek kell állnia (például "enable_pin: !ar38").
it: Verificare che tutti gli assi della stampante possano muoversi manualmente in modo libero (con i motori passo-passo sono disabilitati). In caso contrario, inserire un comando M84 per disabilitare i motori. Se uno degli assi non può ancora muoversi in modo libero, verificare la configurazione "enable_pin" del driver del motore passo-passo corrispondente. Sulla maggior parte dei driver per motori passo-passo, il pin di abilitazione del motore è "attivo basso" e quindi il pin di abilitazione dovrebbe avere un "!" prima del pin (ad esempio, "enable_pin: !ar38").

source: Verify endstops
hu: Végállások ellenőrzése
it: Verificare i finecorsa
ru: Проверить концевики

source: Manually move all the printer axes so that none of them are in contact with an endstop. Send a QUERY_ENDSTOPS command via the Octoprint terminal tab. It should respond with the current state of all of the configured endstops and they should all report a state of "open". For each of the endstops, rerun the QUERY_ENDSTOPS command while manually triggering the endstop. The QUERY_ENDSTOPS command should report the endstop as "TRIGGERED".
hu: Kézzel mozgassa az összes nyomtatótengelyt úgy, hogy egyikük se érintkezzen végállással. Küldjön QUERY_ENDSTOPS parancsot az Octoprint terminál lapján keresztül. A nyomtatónak válaszolnia kell az összes konfigurált végállás aktuális állapotával, és mindegyiknek "open" állapotot kell jeleznie. Az egyes végleállások esetében futtassa újra a QUERY_ENDSTOPS parancsot, miközben manuálisan indítja el a végleállást. A QUERY_ENDSTOPS parancsnak jeleznie kell a végállást, mint "TRIGGERED".
it: Spostare manualmente tutti gli assi della stampante in modo che nessuno di essi sia a contatto con un riscontro. Invia un comando QUERY_ENDSTOPS tramite la pagina del terminale Octoprint. Dovrebbe visualizzare lo stato corrente di tutti i finecorsa configurati e gli stessi dovrebbero essere nello stato di "aperto". Per ciascuno degli finecorsa, eseguire nuovamente il comando QUERY_ENDSTOPS mentre si attiva manualmente il finecorsa corrispondente. Il comando QUERY_ENDSTOPS riporta il segnale finecorsa come "TRIGGERED".

source: If the endstop appears inverted (it reports "open" when triggered and vice-versa) then add a "!" to the pin definition (for example, "endstop_pin: ^!ar3"), or remove the "!" if there is already one present.
hu: Ha a végállás inverznek tűnik (a kiváltáskor "open" jelzést ad, és fordítva), akkor adjunk hozzá egy "!" -t a tű definícióhoz (például "endstop_pin: ^!ar3"), vagy távolítsuk el a "!" -t, ha már van ilyen.
it: Se il finecorsa è invertito (viene indicato "aperto" quando è attivato e viceversa), aggiungere un "!" alla definizione del pin (ad esempio, "endstop_pin: ^!ar3"), oppure togliere "!" se ce è presente.
ru: Если конечный упор отображается перевернутым (при срабатывании он сообщает «открыто» и наоборот), добавьте «!» к определению контакта (например, «endstop_pin: ^! ar3») или удалите «!», если он уже присутствует.

source: If the endstop does not change at all then it generally indicates that the endstop is connected to a different pin. However, it may also require a change to the pullup setting of the pin (the '^' at the start of the endstop_pin name - most printers will use a pullup resistor and the '^' should be present).
hu: Ha a végállás egyáltalán nem változik, akkor ez általában azt jelzi, hogy a végállás egy másik tűhöz van csatlakoztatva. Azonban az is előfordulhat, hogy a tű "pullup" beállításának megváltoztatására van szükség (a '^' az endstop_pin név elején, a legtöbb nyomtató "pullup" ellenállást használ, és a '^' -nek jelen kell lennie).
it: Se il segnale del finecorsa non cambia , può significare che il fine corsa è collegato a un pin diverso. Tuttavia, potrebbe essere necessaria una modifica all'impostazione pullup del pin (il '^' all'inizio del istruzione "endstop_pin".La maggior parte delle stampanti utilizzano un resistore pullup e l'istruzione '^' dovrebbe essere presente).
ru: Если концевой упор вообще не меняется, это обычно указывает на то, что концевой упор подключен к другому контакту. Однако может также потребоваться изменение настройки подтягивания вывода (символ «^» в начале имени endstop_pin — в большинстве принтеров используется подтягивающий резистор, и символ «^» должен присутствовать).

source: Verify stepper motors
hu: Léptetőmotorok ellenőrzése
it: Verificare i motori passo-passo
ru: Проверка шаговых двигателей

source: Use the STEPPER_BUZZ command to verify the connectivity of each stepper motor. Start by manually positioning the given axis to a midway point and then run `STEPPER_BUZZ STEPPER=stepper_x`. The STEPPER_BUZZ command will cause the given stepper to move one millimeter in a positive direction and then it will return to its starting position. (If the endstop is defined at position_endstop=0 then at the start of each movement the stepper will move away from the endstop.) It will perform this oscillation ten times.
hu: A STEPPER_BUZZ parancs segítségével ellenőrizze az egyes léptetőmotorok csatlakozását. Kezdje az adott tengely kézi pozicionálásával egy középső pontra, majd futtassa a `STEPPER_BUZZ STEPPER=stepper_x` parancsot. A STEPPER_BUZZ parancs hatására az adott stepper egy millimétert mozdul pozitív irányba, majd visszatér a kiindulási helyzetébe. (Ha a végállást a position_endstop=0 értéken definiáljuk, akkor minden egyes mozgás kezdetén a léptető a végállástól távolodik). Ezt a mozgást tízszer fogja végrehajtani.
it: Utilizzare il comando STEPPER_BUZZ per verificare le connessioni di ciascun motore passo-passo. Inizia posizionando manualmente in un punto intermedio, quindi esegui l'istruzione `STEPPER_BUZZ STEPPER=stepper_x`. Il comando STEPPER_BUZZ farà muovere il motore passo-passo di un millimetro in direzione avanti e poi tornerà in posizione iniziale. (Se il finecorsa è definito come position_endstop=0, all'inizio di ogni movimento lo motore passo-passo si allontanerà dal finecorsa.) Eseguirà questa movimento oscillatorio per dieci volte.
ru: Используйте команду STEPPER_BUZZ для проверки подключения каждого шагового двигателя. Начните с ручного позиционирования данной оси в средней точке, а затем запустите `STEPPER_BUZZ STEPPER=stepper_x`. Команда STEPPER_BUZZ заставит данный шаговый двигатель переместиться на один миллиметр в положительном направлении, а затем вернется в исходное положение. (Если конечная остановка определена как position_endstop=0, то в начале каждого движения шаговый двигатель будет удаляться от конечной остановки.) Это колебание будет выполняться десять раз.

source: If the stepper does not move at all, then verify the "enable_pin" and "step_pin" settings for the stepper. If the stepper motor moves but does not return to its original position then verify the "dir_pin" setting. If the stepper motor oscillates in an incorrect direction, then it generally indicates that the "dir_pin" for the axis needs to be inverted. This is done by adding a '!' to the "dir_pin" in the printer config file (or removing it if one is already there). If the motor moves significantly more or significantly less than one millimeter then verify the "rotation_distance" setting.
hu: Ha a léptető egyáltalán nem mozog, akkor ellenőrizze az "enable_pin" és "step_pin" beállításokat a léptetőnél. Ha a léptetőmotor mozog, de nem tér vissza az eredeti helyzetébe, akkor ellenőrizze a "dir_pin" beállítást. Ha a léptetőmotor helytelen irányban mozog, akkor ez általában azt jelzi, hogy a tengely "dir_pin" beállítását meg kell fordítani. Ezt úgy lehet megtenni, hogy a nyomtató konfigurációs fájlban a "dir_pin" értékhez hozzáadunk egy '!' jelet (vagy eltávolítjuk, ha már van ilyen). Ha a motor egy milliméternél lényegesen többet vagy lényegesen kevesebbet mozog, akkor ellenőrizze a "rotation_distance" beállítást.
it: Se il motore passo-passo non si muove , verifica le impostazioni "enable_pin" e "step_pin" sul driver. Se il motore passo-passo si muove ma non torna nella sua posizione originale, verificare l'impostazione "dir_pin". Se il motore passo-passo oscilla in una direzione errata, generalmente sta a significare che è necessario invertire il "dir_pin" del l'asse. Questo viene fatto aggiungendo un istruzione '!' alla "dir_pin" nel file di configurazione della stampante (o rimuovendolo se ne esiste già presente). Se il motore passo-passo si muove di più o di meno di un millimetro, verificare l'impostazione "rotation_distance".
ru: Если шаговый двигатель вообще не двигается, проверьте настройки "enable_pin" и "step_pin" для шагового двигателя. Если шаговый двигатель перемещается, но не возвращается в исходное положение, проверьте настройку «dir_pin». Если шаговый двигатель колеблется в неправильном направлении, это обычно указывает на то, что «dir_pin» для оси необходимо инвертировать. Это делается путем добавления '!' в «dir_pin» в файле конфигурации принтера (или удалив его, если он уже есть). Если двигатель перемещается значительно больше или значительно меньше одного миллиметра, проверьте настройку «rotation_distance».

source: Run the above test for each stepper motor defined in the config file. (Set the STEPPER parameter of the STEPPER_BUZZ command to the name of the config section that is to be tested.) If there is no filament in the extruder then one can use STEPPER_BUZZ to verify the extruder motor connectivity (use STEPPER=extruder). Otherwise, it's best to test the extruder motor separately (see the next section).
hu: Futtassa a fenti tesztet a konfigurációs fájlban definiált minden egyes léptetőmotorra. (Állítsa a STEPPER_BUZZ parancs STEPPER paraméterét a tesztelendő konfigurációs szakasz nevére). Ha nincs nyomtatószál az extruderben, akkor a STEPPER_BUZZ paranccsal ellenőrizheti az extruder motor csatlakozását (használja a STEPPER=extruder parancsot). Ellenkező esetben a legjobb ha az extruder motort külön teszteljük (lásd a következő szakaszt).
it: Eseguire il test sopra descritto per ogni motore passo-passo definito nel file di configurazione. (Impostare il parametro STEPPER del comando STEPPER_BUZZ sul nome della sezione di configurazione da testare.) Se non è presente il filamento nell'estrusore, è possibile utilizzare STEPPER_BUZZ per verificare la connessione del motore dell'estrusore (usare STEPPER=estrusore). In caso contrario, è meglio testare il motore dell'estrusore per conto suo (vedere la sezione successiva).
ru: Запустите приведенный выше тест для каждого шагового двигателя, указанного в файле конфигурации. (Установите параметр STEPPER команды STEPPER_BUZZ на имя проверяемого раздела конфигурации.) Если в экструдере нет нити, можно использовать STEPPER_BUZZ для проверки подключения двигателя экструдера (используйте STEPPER=extruder). В противном случае лучше протестировать двигатель экструдера отдельно (см. следующий раздел).

source: After verifying all endstops and verifying all stepper motors the homing mechanism should be tested. Issue a G28 command to home all axes. Remove power from the printer if it does not home properly. Rerun the endstop and stepper motor verification steps if necessary.
hu: Az összes végállás és léptetőmotor ellenőrzése után a célba állítási mechanizmust tesztelni kell. Adjon ki egy G28 parancsot az összes tengely alaphelyzetbe állításához. Ha a nyomtató nem állítható be megfelelően, kapcsolja ki a nyomtatót. Ha szükséges, ismételje meg a végállás és a léptetőmotorok ellenőrzését.
it: Dopo aver verificato tutti i finecorsa e aver verificato tutti i motori passo-passo, è necessario testare il sistema di homing. Scrivere un comando G28 per portare a home tutti gli assi. Rimuovere l'alimentazione dalla stampante se l'istruzione non funziona correttamente. Se necessario, ripetere i passaggi di verifica del finecorsa e del motore passo-passo.
ru: После проверки всех концевых упоров и проверки всех шаговых двигателей следует проверить механизм возврата в исходное положение. Введите команду G28 для возврата всех осей в исходное положение. Отключите питание принтера, если он не возвращается в исходное положение должным образом. При необходимости повторите этапы проверки концевого упора и шагового двигателя.

source: Verify extruder motor
hu: Extruder motor ellenőrzése
it: Verificare il motore dell'estrusore
ru: Проверка двигатель экструдера
