Repository: Klipper3d/klipper-translations
Catalog: locales/*/LC_MESSAGES/Config_Reference.po
Languages: hu, it

source: [printer] kinematics: delta max_z_velocity: # For delta printers this limits the maximum velocity (in mm/s) of # moves with z axis movement. This setting can be used to reduce the # maximum speed of up/down moves (which require a higher step rate # than other moves on a delta printer). The default is to use # max_velocity for max_z_velocity. #max_z_accel: # This sets the maximum acceleration (in mm/s^2) of movement along # the z axis. Setting this may be useful if the printer can reach higher # acceleration on XY moves than Z moves (eg, when using input shaper). # The default is to use max_accel for max_z_accel. #minimum_z_position: 0 # The minimum Z position that the user may command the head to move # to. The default is 0. delta_radius: # Radius (in mm) of the horizontal circle formed by the three linear # axis towers. This parameter may also be calculated as: # delta_radius = smooth_rod_offset - effector_offset - carriage_offset # This parameter must be provided. #print_radius: # The radius (in mm) of valid toolhead XY coordinates. One may use # this setting to customize the range checking of toolhead moves. If # a large value is specified here then it may be possible to command # the toolhead into a collision with a tower. The default is to use # delta_radius for print_radius (which would normally prevent a # tower collision). # The stepper_a section describes the stepper controlling the front # left tower (at 210 degrees). This section also controls the homing # parameters (homing_speed, homing_retract_dist) for all towers. [stepper_a] position_endstop: # Distance (in mm) between the nozzle and the bed when the nozzle is # in the center of the build area and the endstop triggers. This # parameter must be provided for stepper_a; for stepper_b and # stepper_c this parameter defaults to the value specified for # stepper_a. arm_length: # Length (in mm) of the diagonal rod that connects this tower to the # print head. This parameter must be provided for stepper_a; for # stepper_b and stepper_c this parameter defaults to the value # specified for stepper_a. #angle: # This option specifies the angle (in degrees) that the tower is # at. The default is 210 for stepper_a, 330 for stepper_b, and 90 # for stepper_c. # The stepper_b section describes the stepper controlling the front # right tower (at 330 degrees). [stepper_b] # The stepper_c section describes the stepper controlling the rear # tower (at 90 degrees). [stepper_c] # The delta_calibrate section enables a DELTA_CALIBRATE extended # g-code command that can calibrate the tower endstop positions and # angles. [delta_calibrate] radius: # Radius (in mm) of the area that may be probed. This is the radius # of nozzle coordinates to be probed; if using an automatic probe # with an XY offset then choose a radius small enough so that the # probe always fits over the bed. This parameter must be provided. #speed: 50 # The speed (in mm/s) of non-probing moves during the calibration. # The default is 50. #horizontal_move_z: 5 # The height (in mm) that the head should be commanded to move to # just prior to starting a probe operation. The default is 5.
hu: [printer] kinematics: delta max_z_velocity: # A delta nyomtatóknál ez korlátozza a Z tengely mozgásának maximális # sebességét (mm/mp-ben). Ezzel a beállítással csökkenthető a fel/le # mozgások maximális sebessége (amely nagyobb lépésszámot igényel, # mint a deltanyomtatók egyéb mozgásai). Az alapértelmezett érték a # max_velocity használata a max_z_velocity értékhez. #max_z_accel: # Ez beállítja a Z tengely mentén történő mozgás maximális gyorsulását # (mm/mp^2-en). Ennek beállítása akkor lehet hasznos, ha a nyomtató # nagyobb gyorsulást tud elérni XY mozgásnál, mint Z mozgásnál (pl. # bemeneti alakformáló használatakor). # Az alapértelmezés szerinti értéke a max_accel a max_z_accel értékhez. #minimum_z_position: 0 # Az a minimális Z pozíció, amelybe a felhasználó utasíthatja a fejet, # hogy mozogjon. Az alapértelmezett érték 0. delta_radius: # A három lineáris tengely torony által alkotott vízszintes kör sugara # (mm-ben). Ez a paraméter a következőképpen is kiszámítható: # delta_radius = smooth_rod_offset - effector_offset - carriage_offset. # Ezt a paramétert meg kell adni. #print_radius: # Az érvényes XY nyomtatófej koordináták sugara (mm-ben). Ezzel a # beállítással testreszabható a nyomtatófej mozgások tartomány # ellenőrzése. Ha itt nagy értéket adunk meg, akkor lehetséges lehet # a nyomtatófejet toronnyal való ütközésre utasítani. # Az alapértelmezett a delta_radius a print_radius értékhez (ami # általában megakadályozza a torony ütközését). # A stepper_a szakasz a bal első tornyot vezérlő léptetőt írja le # (210 fokban). Ez a szakasz az összes toronyhoz tartozó kezdőpont # paramétereket (homing_speed, homing_retract_dist) is szabályozza. [stepper_a] position_endstop: # Távolság (mm-ben) a fúvóka és az ágy között, ha a fúvóka az építési # terület közepén van, és a végütköző kiold. Ezt a paramétert meg kell # adni a stepper_a; a stepper_b és a stepper_c esetén ez a paraméter # alapértelmezett értéke a stepper_a paraméterben megadott érték. arm_length: # A tornyot a nyomtatófejjel összekötő átlós rúd hossza (mm-ben). # Ezt a paramétert meg kell adni a stepper_a; a stepper_b és a stepper_c # esetén ez a paraméter alapértelmezett értéke a stepper_a # paraméterben megadott érték. #angle: # Ez az opció azt a szöget adja meg (fokban), amelyben a torony áll. # Az alapértelmezett érték 210 a stepper_a, 330 a stepper_b és # 90 a stepper_c. # A stepper_b szakasz a jobb első tornyot vezérlő léptetőt írja le # (330 fokban). [stepper_b] # A stepper_c szakasz a hátsó tornyot vezérlő léptetőt írja le (90 fokban). [stepper_c] # A delta_calibrate szakasz lehetővé teszi a DELTA_CALIBRATE # kiterjesztett G-kód parancsot, amely képes kalibrálni a torony # végállásának pozícióit és szögeit. [delta_calibrate] radius: # A vizsgálható terület sugara (mm-ben). Ez a vizsgálandó # fúvókakoordináták sugara; Ha XY eltolású automata szondát használ, # akkor válasszon elég kicsi sugarat, hogy a szonda mindig az ágy fölé # férjen. Ezt a paramétert meg kell adni. #speed: 50 # A nem szondázás sebessége (mm/mp-ben) mozog a kalibrálás során. # Az alapértelmezett érték 50. #horizontal_move_z: 5 # Az a magasság (mm-ben), ameddig a fejnek el kell mozdulnia # közvetlenül a szondaművelet megkezdése előtt. # Az alapértelmezett érték 5.
it: [printer] kinematics: delta max_z_velocity: # Per le stampanti delta questo limita la velocità massima (in mm/s) dei # movimenti con movimento dell'asse z. Questa impostazione può essere # utilizzata per ridurre la velocità massima dei movimenti su/giù (che # richiedono una velocità di incremento maggiore rispetto ad altri # movimenti su una stampante delta). L'impostazione predefinita è # utilizzare max_velocity per max_z_velocity. #max_z_accel: # Imposta l'accelerazione massima (in mm/s^2) del movimento lungo # l'asse z. L'impostazione può essere utile se la stampante può # raggiungere un'accelerazione maggiore sui movimenti XY rispetto ai # movimenti Z (ad esempio, quando si utilizza l'input shaper). # L'impostazione predefinita è utilizzare max_accel per max_z_accel. #minimum_z_position: 0 # La posizione Z minima in cui l'utente può comandare alla testa di # spostarsi. Il valore predefinito è 0. delta_radius: # Raggio (in mm) del cerchio orizzontale formato dalle tre torri ad # asse lineare. Questo parametro può anche essere calcolato come: # delta_radius = smooth_rod_offset - effector_offset - carriage_offset # Questo parametro deve essere fornito. #print_radius: # Il raggio (in mm) delle coordinate XY della testa di stampa valide. # È possibile utilizzare questa impostazione per personalizzare il # controllo dell'intervallo dei movimenti della testa. Se qui # viene specificato un valore elevato, potrebbe essere possibile # comandare la collisione della testa di stampa con una torre. # L'impostazione predefinita è usare delta_radius per print_radius # (che normalmente impedirebbe una collisione con torri). # La sezione stepper_a descrive lo stepper che controlla la torre # anteriore sinistra (a 210 gradi). Questa sezione controlla anche i # parametri di homing (velocità di homing, homing retract_dist) # per tutte le torri. [stepper_a] position_endstop: # Distanza (in mm) tra l'ugello e il piatto quando l'ugello si trova al # centro dell'area di costruzione e si attiva il finecorsa. Questo # parametro deve essere fornito per stepper_a; per stepper_b e # stepper_c questo parametro è predefinito sul valore specificato # per stepper_a. arm_length: # Lunghezza (in mm) dell'asta diagonale che collega questa torre # alla testa di stampa. Questo parametro deve essere fornito per # stepper_a; per stepper_b e stepper_c questo parametro è predefinito sul valore specificato per stepper_a. #angle: # Questa opzione specifica l'angolo (in gradi) a cui si trova la torre. # Il valore predefinito è 210 per stepper_a, 330 per stepper_b e 90 # per stepper_c. # La sezione stepper_b descrive lo stepper che controlla la torre # anteriore destra (a 330 gradi). [stepper_b] # La sezione stepper_c descrive lo stepper che controlla la torre # posteriore (a 90 gradi). [stepper_c] # La sezione delta_calibrate abilita un comando G-code esteso # DELTA_CALIBRATE in grado di calibrare le posizioni e gli angoli # dei finecorsa della torre. [delta_calibrate] radius: # Raggio (in mm) dell'area che può essere sondata. Questo è # il raggio delle coordinate dell'ugello da sondare; se si utilizza # una sonda automatica con un offset XY, scegliere un raggio # sufficientemente piccolo in modo che la sonda si adatti sempre # al piatto. Questo parametro deve essere fornito. #speed: 50 # La velocità (in mm/s) degli spostamenti senza probing durante # la calibrazione. Il valore predefinito è 50. #horizontal_move_z: 5 # L'altezza (in mm) a cui la testa deve essere comandata di # spostarsi appena prima di avviare un'operazione di sonda. # L'impostazione predefinita è 5.

source: BMP280/BME280/BME680 two wire interface (I2C) environmental sensors. Note that these sensors are not intended for use with extruders and heater beds, but rather for monitoring ambient temperature (C), pressure (hPa), relative humidity and in case of the BME680 gas level. See [sample-macros.cfg](../config/sample-macros.cfg) for a gcode_macro that may be used to report pressure and humidity in addition to temperature.
hu: BMP280/BME280/BME680 kétvezetékes interfész (I2C) környezeti érzékelők. Vegye figyelembe, hogy ezeket az érzékelőket nem extruderekkel és fűtőágyakkal való használatra szánják, hanem a környezeti hőmérséklet (C), a nyomás (hPa), a relatív páratartalom és a BME680 esetében a gázszint ellenőrzésére. Lásd [sample-macros.cfg](../config/sample-macros.cfg) egy gcode_macro-t, amely a hőmérséklet mellett a nyomás és a páratartalom mérésére is használható.
it: Sensori ambientali BMP280/BME280/BME680 con interfaccia I2C. Si noti che questi sensori non sono destinati all'uso con estrusori e letti riscaldanti, ma piuttosto per il monitoraggio della temperatura ambiente (C), della pressione (hPa), dell'umidità relativa (%)e di livello del gas per il BME680. Vedere [sample-macros.cfg](../config/sample-macros.cfg) per una gcode_macro che può essere utilizzata per riportare la pressione e l'umidità oltre alla temperatura.

source: [tmc2130 stepper_x] cs_pin: # The pin corresponding to the TMC2130 chip select line. This pin # will be set to low at the start of SPI messages and raised to high # after the message completes. This parameter must be provided. #spi_speed: #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # See the "common SPI settings" section for a description of the # above parameters. #chain_position: #chain_length: # These parameters configure an SPI daisy chain. The two parameters # define the stepper position in the chain and the total chain length. # Position 1 corresponds to the stepper that connects to the MOSI signal. # The default is to not use an SPI daisy chain. #interpolate: True # If true, enable step interpolation (the driver will internally # step at a rate of 256 micro-steps). This interpolation does # introduce a small systemic positional deviation - see # TMC_Drivers.md for details. The default is True. run_current: # The amount of current (in amps RMS) to configure the driver to use # during stepper movement. This parameter must be provided. #hold_current: # The amount of current (in amps RMS) to configure the driver to use # when the stepper is not moving. Setting a hold_current is not # recommended (see TMC_Drivers.md for details). The default is to # not reduce the current. #sense_resistor: 0.110 # The resistance (in ohms) of the motor sense resistor. The default # is 0.110 ohms. #stealthchop_threshold: 0 # The velocity (in mm/s) to set the "stealthChop" threshold to. When # set, "stealthChop" mode will be enabled if the stepper motor # velocity is below this value. The default is 0, which disables # "stealthChop" mode. #driver_IHOLDDELAY: 8 #driver_TPOWERDOWN: 0 #driver_TBL: 1 #driver_TOFF: 4 #driver_HEND: 7 #driver_HSTRT: 0 #driver_PWM_AUTOSCALE: True #driver_PWM_FREQ: 1 #driver_PWM_GRAD: 4 #driver_PWM_AMPL: 128 #driver_SGT: 0 # Set the given register during the configuration of the TMC2130 # chip. This may be used to set custom motor parameters. The # defaults for each parameter are next to the parameter name in the # above list. #diag0_pin: #diag1_pin: # The micro-controller pin attached to one of the DIAG lines of the # TMC2130 chip. Only a single diag pin should be specified. The pin # is "active low" and is thus normally prefaced with "^!". Setting # this creates a "tmc2130_stepper_x:virtual_endstop" virtual pin # which may be used as the stepper's endstop_pin. Doing this enables # "sensorless homing". (Be sure to also set driver_SGT to an # appropriate sensitivity value.) The default is to not enable # sensorless homing.
hu: [tmc2130 stepper_x] cs_pin: # A TMC2130 chip kiválasztási vonalának megfelelő tű. Ez a tű alacsony # értékre lesz állítva az SPI-üzenetek elején, és az üzenet befejezése # után magasra lesz húzva. Ezt a paramétert meg kell adni. #spi_speed: #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # A fenti paraméterek leírását az „általános SPI-beállítások” részben # találja. #chain_position: #chain_length: # Ezek a paraméterek egy SPI-láncot konfigurálnak. A két paraméter # határozza meg a léptető pozícióját a láncban és a teljes lánchosszt. # Az 1. pozíció a MOSI jelhez csatlakozó léptetőnek felel meg. # Az alapértelmezés szerint nem használ SPI-láncot. #interpolate: True # Ha True, engedélyezze a lépésinterpolációt (az illesztőprogram # belsőleg 256 mikrolépéses sebességgel léptet). Ez az interpoláció egy # kis szisztémás pozícióeltérést vezet be. A részletekért lásd: # TMC_Drivers.md. Az alapértelmezett érték True. run_current: # Az áramerősség (amper RMS-ben) a motorvezérlő konfigurálásához a # léptetőmotor mozgása során. Ezt a paramétert meg kell adni. #hold_current: # Az az áramerősség (amper RMS-ben), amelyet a motorvezérlőnek akkor # kell leadni, amikor a léptetőmotor nem mozog. A hold_current beállítása # nem ajánlott (a részletekért lásd: TMC_Drivers.md). Az alapértelmezett # az, hogy nem csökkenti az áramerősséget. #sense_resistor: 0.110 # A motor érzékelő ellenállásának ellenállása (ohmban). # Az alapértelmezett érték 0,110 ohm. #stealthchop_threshold: 0 # A „StealthChop” küszöbérték beállításához szükséges sebesség # (mm/mp-ben). Ha be van állítva, a "StealthChop" mód engedélyezve # lesz, ha a léptetőmotor sebessége ez alatt az érték alatt van. # Az alapértelmezett érték 0, ami letiltja a "StealthChop" módot. #driver_IHOLDDELAY: 8 #driver_TPOWERDOWN: 0 #driver_TBL: 1 #driver_TOFF: 4 #driver_HEND: 7 #driver_HSTRT: 0 #driver_PWM_AUTOSCALE: True #driver_PWM_FREQ: 1 #driver_PWM_GRAD: 4 #driver_PWM_AMPL: 128 #driver_SGT: 0 # Állítsa be a megadott regisztert a TMC2130 chip konfigurációja során. # Ez egyéni motorparaméterek beállítására használható. # Az egyes paraméterek alapértelmezett értékei a paraméter neve mellett # találhatók a fenti listában. #diag0_pin: #diag1_pin: # A mikrovezérlő tűje a TMC2130 chip egyik DIAG tűjéhez csatlakozik. # Csak egyetlen DIAG tűt kell megadni. A tű "active low", ezért # általában "^!" előtagja van. Ennek beállítása egy # „tmc2130_stepper_x:virtual_endstop” virtuális tűt hoz létre, amely a # léptető endstop_pin-jeként használható. Ez lehetővé teszi az # „érzékelő nélküli kezdőpont felvétel” funkciót. (Győződjön meg arról, # hogy a driver_SGT-t is megfelelő érzékenységi értékre állítja be.) # Az alapértelmezés az, hogy nem engedélyezi az érzékelő nélküli # kezdőpont felvételt.
it: [tmc2130 stepper_x] cs_pin: # Il pin collegato al pin di selezione del chip TMC2130. # Questo pin verrà impostato su basso all'inizio dei messaggi SPI e # portato su alto al termine del messaggio. Questo parametro deve # essere fornito. #spi_speed: #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # Vedere la sezione "impostazioni comuni SPIi" per una descrizione # dei parametri di cui sopra. #chain_position: #chain_length: # Questi parametri configurano una daisy chain SPI. I due parametri # definiscono la posizione dello stepper nella catena e la lunghezza totale # della catena. La posizione 1 corrisponde allo stepper che si collega al # segnale MOSI. L'impostazione predefinita è di non utilizzare un # collegamento a margherita SPI. #interpolate: True # Se True, abilita l'interpolazione del passo (il driver eseguirà un passo # intero attraverso 256 micropassi). Questa interpolazione introduce una # piccola deviazione posizionale sistemica - vedi TMC_Drivers.md per i # dettagli. L'impostazione predefinita è True. run_current: # La quantità di corrente (in ampere RMS) con cui configurare il driver e utilizzare durante il movimento passo-passo. Questo parametro deve essere fornito. #hold_current: # La quantità di corrente (in ampere RMS) con cui configurare il driver da # utilizzare quando lo stepper non è in movimento. L'impostazione di # hold_current non è consigliata (consultare TMC_Drivers.md per i # dettagli). L'impostazione predefinita è di non ridurre la corrente. #sense_resistor: 0.110 # La resistenza (in ohm) del resistore di rilevamento del motore. # Il valore predefinito è 0,110 ohm. #stealthchop_threshold: 0 # La velocità (in mm/s) su cui impostare la soglia "stealthChop". Se # impostata, la modalità "stealthChop" sarà abilitata se la velocità del # motore passo-passo è inferiore a questo valore. Il valore predefinito # è 0, che disabilita la modalità "stealthChop". #driver_IHOLDDELAY: 8 #driver_TPOWERDOWN: 0 #driver_TBL: 1 #driver_TOFF: 4 #driver_HEND: 7 #driver_HSTRT: 0 #driver_PWM_AUTOSCALE: True #driver_PWM_FREQ: 1 #driver_PWM_GRAD: 4 #driver_PWM_AMPL: 128 #driver_SGT: 0 # Impostare il registro dato durante la configurazione del chip # TMC2130. Può essere utilizzato per impostare parametri motore # personalizzati. I valori predefiniti per ciascun parametro sono # accanto al nome del parametro nell'elenco precedente. #diag0_pin: #diag1_pin: # Il pin del microcontrollore collegato a una delle linee DIAG del # chip TMC2130. È necessario specificare un solo pin diag. Il pin è # "attivo basso" ed è quindi normalmente preceduto da "^!". # L'impostazione di questo crea un pin virtuale # "tmc2130_stepper_x:virtual_endstop" che può essere utilizzato # come endstop_pin dello stepper. In questo modo si abilita # l'"homing sensorless". (Assicurarsi di impostare anche driver_SGT # su un valore di sensibilità appropriato.) L'impostazione predefinita # è di non abilitare l'homing sensorless.
