Repository: Klipper3d/klipper-translations
Catalog: locales/*/LC_MESSAGES/Config_Reference.po
Languages: hu, it

source: [heater_fan my_nozzle_fan] #pin: #max_power: #shutdown_speed: #cycle_time: #hardware_pwm: #kick_start_time: #off_below: #tachometer_pin: #tachometer_ppr: #tachometer_poll_interval: # See the "fan" section for a description of the above parameters. #heater: extruder # Name of the config section defining the heater that this fan is # associated with. If a comma separated list of heater names is # provided here, then the fan will be enabled when any of the given # heaters are enabled. The default is "extruder". #heater_temp: 50.0 # A temperature (in Celsius) that the heater must drop below before # the fan is disabled. The default is 50 Celsius. #fan_speed: 1.0 # The fan speed (expressed as a value from 0.0 to 1.0) that the fan # will be set to when its associated heater is enabled. The default # is 1.0
hu: [heater_fan my_nozzle_fan] #pin: #max_power: #shutdown_speed: #cycle_time: #hardware_pwm: #kick_start_time: #off_below: #tachometer_pin: #tachometer_ppr: #tachometer_poll_interval: # A fenti paraméterek leírását lásd a „ventilátor” részben. #heater: extruder # A ventilátorhoz társított fűtést meghatározó konfigurációs szakasz # neve. Ha itt megadja a fűtőelemek vesszővel elválasztott nevét, # akkor a ventilátor engedélyezve lesz, ha valamelyik adott fűtőtest # engedélyezve van. Az alapértelmezett érték az "extruder". #heater_temp: 50.0 # Az a hőmérséklet (Celsiusban), amely alá a fűtőelemnek le kell # süllyednie, mielőtt a ventilátort letiltják. # Az alapértelmezett érték 50 Celsius. #fan_speed: 1.0 # A ventilátor sebessége (0,0 és 1,0 közötti értékként kifejezve), # amelyre a ventilátor be lesz állítva, amikor a hozzá tartozó # fűtőberendezés engedélyezve van. Az alapértelmezett érték 1.0

source: [fan_generic extruder_partfan] #pin: #max_power: #shutdown_speed: #cycle_time: #hardware_pwm: #kick_start_time: #off_below: #tachometer_pin: #tachometer_ppr: #tachometer_poll_interval: # See the "fan" section for a description of the above parameters.
hu: [fan_generic extruder_partfan] #pin: #max_power: #shutdown_speed: #cycle_time: #hardware_pwm: #kick_start_time: #off_below: #tachometer_pin: #tachometer_ppr: #tachometer_poll_interval: # A fenti paraméterek leírását lásd a „ventilátor” részben.

source: [servo my_servo] pin: # PWM output pin controlling the servo. This parameter must be # provided. #maximum_servo_angle: 180 # The maximum angle (in degrees) that this servo can be set to. The # default is 180 degrees. #minimum_pulse_width: 0.001 # The minimum pulse width time (in seconds). This should correspond # with an angle of 0 degrees. The default is 0.001 seconds. #maximum_pulse_width: 0.002 # The maximum pulse width time (in seconds). This should correspond # with an angle of maximum_servo_angle. The default is 0.002 # seconds. #initial_angle: # Initial angle (in degrees) to set the servo to. The default is to # not send any signal at startup. #initial_pulse_width: # Initial pulse width time (in seconds) to set the servo to. (This # is only valid if initial_angle is not set.) The default is to not # send any signal at startup.
hu: [servo my_servo] pin: # PWM kimeneti érintkező, amely a szervót vezérli. # Ezt a paramétert meg kell adni. #maximum_servo_angle: 180 # A maximális szög (fokban), amelyre ez a szervó beállítható. # Az alapértelmezett érték 180 fok. #minimum_pulse_width: 0.001 # A minimális impulzusszélesség ideje (másodpercben). # Ennek 0 fokos szögnek kell megfelelnie. # Az alapértelmezett érték 0,001 másodperc. #maximum_pulse_width: 0.002 # A maximális impulzusszélesség ideje (másodpercben). # Ennek meg kell felelnie a maximum_servo_angle szögnek. # Az alapértelmezett érték 0,002 másodperc. #initial_angle: # Kezdeti szög (fokban) a szervó beállításához. # Az alapértelmezett az, hogy indításkor nem küld jelet. #initial_pulse_width: # A kezdeti impulzusszélesség (másodpercben) a szervó beállításához. # (Ez csak akkor érvényes, ha a initial_angle nincs beállítva.) # Az alapértelmezés az, hogy indításkor nem küld jelet.
it: [servo my_servo] pin: # Pin di uscita PWM che controlla il servo. Questo parametro deve # essere fornito. #maximum_servo_angle: 180 # L'angolo massimo (in gradi) a cui questo servo può essere impostato. # L'impostazione predefinita è 180 gradi. #minimum_pulse_width: 0.001 # La durata minima dell'impulso (in secondi). Questo dovrebbe # corrispondere a un angolo di 0 gradi. Il valore predefinito è 0.001 secondi. #maximum_pulse_width: 0.002 # La durata massima dell'impulso (in secondi). Questo dovrebbe # corrispondere a un angolo di maximum_servo_angle. Il valore # predefinito è 0.002 secondi. #initial_angle: # Angolo iniziale (in gradi) su cui impostare il servo. L'impostazione # predefinita è di non inviare alcun segnale all'avvio. #initial_pulse_width: # Durata iniziale dell'impulso (in secondi) su cui impostare il servo. # (Questo è valido solo se initial_angle non è impostato.) # L'impostazione predefinita è di non inviare alcun segnale all'avvio.

source: [gcode_button my_gcode_button] pin: # The pin on which the button is connected. This parameter must be # provided. #analog_range: # Two comma separated resistances (in Ohms) specifying the minimum # and maximum resistance range for the button. If analog_range is # provided then the pin must be an analog capable pin. The default # is to use digital gpio for the button. #analog_pullup_resistor: # The pullup resistance (in Ohms) when analog_range is specified. # The default is 4700 ohms. #press_gcode: # A list of G-Code commands to execute when the button is pressed. # G-Code templates are supported. This parameter must be provided. #release_gcode: # A list of G-Code commands to execute when the button is released. # G-Code templates are supported. The default is to not run any # commands on a button release.
hu: [gcode_button my_gcode_button] pin: # Az a tű, amelyre a gomb csatlakozik. Ezt a paramétert meg kell adni. #analog_range: # Két vesszővel elválasztott ellenállás (ohmban), amely meghatározza # a gomb minimális és maximális ellenállási tartományát. Ha meg van # adva az analog_range, akkor a lábnak analóg-képes tűnek kell lennie. # Az alapértelmezett a digitális GPIO használata a gombhoz. #analog_pullup_resistor: # A felhúzási ellenállás (ohmban), ha az analog_range meg van adva. # Az alapértelmezett érték 4700 ohm. #press_gcode: # A gomb megnyomásakor végrehajtandó G-kód parancsok listája. # A G-kód sablonok támogatottak. Ezt a paramétert meg kell adni. #release_gcode: # A gomb elengedésekor végrehajtandó G-kód parancsok listája. # A G-kód sablonok támogatottak. Az alapértelmezés szerint nem # futnak le parancsok a gombok felengedésekor.
it: [gcode_button my_gcode_button] pin: # Il pin su cui è collegato il pulsante. Questo parametro deve essere fornito. #analog_range: # Due resistenze separate da virgole (in Ohm) che specificano l'intervallo # di resistenza minimo e massimo per il pulsante. Se viene fornito # analog_range, il pin deve essere un pin con capacità analogica. # L'impostazione predefinita è utilizzare digital gpio per il pulsante. #analog_pullup_resistor: # La resistenza di pullup (in Ohm) quando è specificato analog_range. # Il valore predefinito è 4700 ohm. #press_gcode: # Un elenco di comandi G-Code da eseguire quando si preme il pulsante. # I modelli G-Code sono supportati. Questo parametro deve essere fornito. #release_gcode: # Un elenco di comandi G-Code da eseguire quando il pulsante viene # rilasciato. I modelli G-Code sono supportati. L'impostazione predefinita # è di non eseguire alcun comando al rilascio di un pulsante.

source: [output_pin my_pin] pin: # The pin to configure as an output. This parameter must be # provided. #pwm: False # Set if the output pin should be capable of pulse-width-modulation. # If this is true, the value fields should be between 0 and 1; if it # is false the value fields should be either 0 or 1. The default is # False. #static_value: # If this is set, then the pin is assigned to this value at startup # and the pin can not be changed during runtime. A static pin uses # slightly less ram in the micro-controller. The default is to use # runtime configuration of pins. #value: # The value to initially set the pin to during MCU configuration. # The default is 0 (for low voltage). #shutdown_value: # The value to set the pin to on an MCU shutdown event. The default # is 0 (for low voltage). #maximum_mcu_duration: # The maximum duration a non-shutdown value may be driven by the MCU # without an acknowledge from the host. # If host can not keep up with an update, the MCU will shutdown # and set all pins to their respective shutdown values. # Default: 0 (disabled) # Usual values are around 5 seconds. #cycle_time: 0.100 # The amount of time (in seconds) per PWM cycle. It is recommended # this be 10 milliseconds or greater when using software based PWM. # The default is 0.100 seconds for pwm pins. #hardware_pwm: False # Enable this to use hardware PWM instead of software PWM. When # using hardware PWM the actual cycle time is constrained by the # implementation and may be significantly different than the # requested cycle_time. The default is False. #scale: # This parameter can be used to alter how the 'value' and # 'shutdown_value' parameters are interpreted for pwm pins. If # provided, then the 'value' parameter should be between 0.0 and # 'scale'. This may be useful when configuring a PWM pin that # controls a stepper voltage reference. The 'scale' can be set to # the equivalent stepper amperage if the PWM were fully enabled, and # then the 'value' parameter can be specified using the desired # amperage for the stepper. The default is to not scale the 'value' # parameter.
hu: [output_pin my_pin] pin: # A kimenetként konfigurálandó tű. Ezt a paramétert meg kell adni. #pwm: False # Állítsa be, hogy a kimeneti lábnak képesnek kell lennie # impulzusszélesség-modulációra. Ha ez True, az értékmezőknek 0 és 1 # között kell lenniük. Ha False, az értékmezők értéke 0 vagy 1 legyen. # Az alapértelmezett érték False. #static_value: # Ha ez be van állítva, akkor a tű ehhez az értékhez lesz rendelve indításkor, # és a tű nem módosítható működés közben. Egy statikus tű valamivel # kevesebb RAM-ot használ a mikrokontrollerben. # Az alapértelmezett a lábak futásidejű konfigurációja. #value: # Az az érték, amelyre az MCU konfigurálása során először be kell állítani a tűt. # Az alapértelmezett érték 0 (alacsony feszültség esetén). #shutdown_value: # Az az érték, amelyre a tűt be kell állítani egy MCU leállási eseménynél. # Az alapértelmezett érték 0 (alacsony feszültség esetén). #maximum_mcu_duration: # A nem-leállítási érték maximális időtartama az MCU által a gazdagéptől # érkező nyugtázás nélkül hajtható végre. Ha a gazdagép nem tud lépést # tartani a frissítéssel, az MCU leáll, és az összes érintkezőt a megfelelő # leállítási értékre állítja. Az alapértelmezett érték: 0 (letiltva) # A szokásos értékek 5 másodperc körüliek. #cycle_time: 0.100 # Az idő (másodpercben) PWM ciklusonként. Szoftver alapú PWM használata # esetén ajánlott 10 ezredmásodperc vagy több. # Az alapértelmezett érték 0,100 másodperc a PWM lábak esetén. #hardware_pwm: False # Engedélyezze ezt a hardveres PWM használatához a szoftveres PWM helyett. # Hardveres PWM használatakor a tényleges ciklusidőt a megvalósítás # korlátozza, és jelentősen eltérhet a kért ciklusidőtől. # Az alapértelmezett érték False. #scale: # Ezzel a paraméterrel módosítható a 'value' és 'shutdown_value' paraméterek # értelmezése a PWM lábak esetében. Ha meg van adva, akkor az 'value' # paraméternek 0,0 és 'scale' között kell lennie. Ez hasznos lehet olyan PWM # láb konfigurálásakor, amely a léptető feszültség referenciaértékét vezérli. # A 'scale' beállítható az egyenértékű léptető áramerősségre, ha a PWM teljesen # engedélyezett volt, majd az 'value' paraméter megadható a léptető kívánt # áramerősségével. # Az alapértelmezés szerint nem skálázzuk a 'value' paramétert.
it: [output_pin my_pin] pin: # Il pin da configurare come output. # Questo parametro deve essere fornito. #pwm: False # Impostare se il pin di uscita deve essere in grado di modulare la # larghezza di impulso PWM. Se questo è True, i campi del valore # dovrebbero essere compresi tra 0 e 1; se è False i campi del valore # devono essere 0 o 1. Il valore predefinito è False. #static_value: # Se è valorizzato, il pin viene assegnato a questo valore all'avvio e # il pin non può essere modificato durante il runtime. Un pin statico # utilizza una ram leggermente inferiore nel microcontrollore. # L'impostazione predefinita prevede l'utilizzo della configurazione # di runtime dei pin. #value: # Il valore su cui impostare inizialmente il pin durante la # configurazione dell'MCU. Il valore predefinito è 0 (per bassa tensione). #shutdown_value: # Il valore su cui impostare il pin su un evento di arresto dell'MCU. # Il valore predefinito è 0 (per bassa tensione). #maximum_mcu_duration: # La durata massima di un valore di non spegnimento può essere # determinato dall'MCU senza un riconoscimento da parte dell'host. # Se l'host non riesce a tenere il passo con un aggiornamento, l'MCU # si spegnerà e imposterà tutti i pin sui rispettivi valori di spegnimento. # Default: 0 (disabilitato) I valori abituali sono circa 5 secondi. #cycle_time: 0.100 # La quantità di tempo (in secondi) per ciclo PWM. Si consiglia di # essere pari o superiore a 10 millisecondi quando si utilizza il PWM # basato su software. Il valore predefinito è 0.100 secondi per i pin pwm. #hardware_pwm: False # Abilitare questa opzione per utilizzare PWM hardware anziché PWM # software. Quando si utilizza l'hardware PWM, il tempo di ciclo effettivo # è vincolato dall'implementazione e può essere notevolmente diverso # dal tempo di ciclo richiesto. L'impostazione predefinita è Falso. #scale: # Questo parametro può essere utilizzato per modificare il modo in cui # i parametri 'value' e 'shutdown_value' vengono interpretati per i pin # pwm. Se fornito, il parametro 'value' deve essere compreso tra 0.0 e # 'scale'. Questo può essere utile quando si configura un pin PWM che # controlla un riferimento di tensione stepper. La "scala" può essere # impostata sull'amperaggio dello stepper equivalente se il PWM fosse # completamente abilitato, quindi il parametro "value" può essere # specificato utilizzando l'amperaggio desiderato per lo stepper. # L'impostazione predefinita è di non ridimensionare il parametro 'value'.

source: [static_digital_output my_output_pins] pins: # A comma separated list of pins to be set as GPIO output pins. The # pin will be set to a high level unless the pin name is prefaced # with "!". This parameter must be provided.
hu: [static_digital_output my_output_pins] pins: # A GPIO kimeneti tűként beállítandó tűk vesszővel elválasztott # listája. A gomb tűje magas szintre lesz állítva, hacsak a tű neve # előtt nem szerepel "!". Ezt a paramétert meg kell adni.
it: [static_digital_output my_output_pins] pins: # Un elenco separato da virgole di pin da impostare come pin di # output GPIO. Il pin verrà impostato su un livello alto a meno che il # nome del pin non sia preceduto da "!". Questo parametro deve # essere fornito.

source: [multi_pin my_multi_pin] pins: # A comma separated list of pins associated with this alias. This # parameter must be provided.
hu: [multi_pin my_multi_pin] pins: # Az ehhez az álnévhez társított tűk vesszővel elválasztott listája. # Ezt a paramétert meg kell adni.
it: [multi_pin my_multi_pin] pins: # Un elenco separato da virgole di pin associati a questo alias. # Questo parametro deve essere fornito.

source: [tmc2209 stepper_x] uart_pin: #tx_pin: #select_pins: #interpolate: True run_current: #hold_current: #sense_resistor: 0.110 #stealthchop_threshold: 0 # See the "tmc2208" section for the definition of these parameters. #uart_address: # The address of the TMC2209 chip for UART messages (an integer # between 0 and 3). This is typically used when multiple TMC2209 # chips are connected to the same UART pin. The default is zero. #driver_IHOLDDELAY: 8 #driver_TPOWERDOWN: 20 #driver_TBL: 2 #driver_TOFF: 3 #driver_HEND: 0 #driver_HSTRT: 5 #driver_PWM_AUTOGRAD: True #driver_PWM_AUTOSCALE: True #driver_PWM_LIM: 12 #driver_PWM_REG: 8 #driver_PWM_FREQ: 1 #driver_PWM_GRAD: 14 #driver_PWM_OFS: 36 #driver_SGTHRS: 0 # Set the given register during the configuration of the TMC2209 # chip. This may be used to set custom motor parameters. The # defaults for each parameter are next to the parameter name in the # above list. #diag_pin: # The micro-controller pin attached to the DIAG line of the TMC2209 # chip. The pin is normally prefaced with "^" to enable a pullup. # Setting this creates a "tmc2209_stepper_x:virtual_endstop" virtual # pin which may be used as the stepper's endstop_pin. Doing this # enables "sensorless homing". (Be sure to also set driver_SGTHRS to # an appropriate sensitivity value.) The default is to not enable # sensorless homing.
hu: [tmc2209 stepper_x] uart_pin: #tx_pin: #select_pins: #interpolate: True run_current: #hold_current: #sense_resistor: 0.110 #stealthchop_threshold: 0 # A paraméterek meghatározásához lásd a "TMC2208" részt. #uart_address: # A TMC2209 chip címe UART üzenetekhez (0 és 3 közötti egész szám). # Ezt általában akkor használják, ha több TMC2209 chip csatlakozik # ugyanahhoz az UART érintkezőhöz. Az alapértelmezett érték nulla. #driver_IHOLDDELAY: 8 #driver_TPOWERDOWN: 20 #driver_TBL: 2 #driver_TOFF: 3 #driver_HEND: 0 #driver_HSTRT: 5 #driver_PWM_AUTOGRAD: True #driver_PWM_AUTOSCALE: True #driver_PWM_LIM: 12 #driver_PWM_REG: 8 #driver_PWM_FREQ: 1 #driver_PWM_GRAD: 14 #driver_PWM_OFS: 36 #driver_SGTHRS: 0 # Állítsa be a megadott regisztert a TMC2209 chip konfigurációja során. # Ez egyéni motorparaméterek beállítására használható. # Az egyes paraméterek alapértelmezett értékei a paraméter neve # mellett találhatók a fenti listában. #diag_pin: # A TMC2209 chip DIAG tűjéhez csatlakoztatott mikrovezérlő tűje. # A tű előtagja általában "^"-vel történik, hogy lehetővé tegye a # felhúzást. Ennek beállítása egy # "tmc2209_stepper_x:virtual_endstop" virtuális tűt hoz létre, # amely a léptető endstop_pin-jeként használható. Ez lehetővé teszi a # "végálláskapcsoló nélküli kezdőpont felvételt". (Győződjön meg arról, # hogy a driver_SGTHRS-t is megfelelő érzékenységi értékre állítja be.) # Alapértelmezés szerint nincs engedélyezve a végálláskapcsoló nélküli # kezdőpont felvételt.
it: [tmc2209 stepper_x] uart_pin: #tx_pin: #select_pins: #interpolate: True run_current: #hold_current: #sense_resistor: 0.110 #stealthchop_threshold: 0 # Vedere la sezione "tmc2208" per la definizione di questi parametri. #uart_address: # L'indirizzo del chip TMC2209 per i messaggi UART (un numero intero # compreso tra 0 e 3). Viene in genere utilizzato quando più chip TMC2209 # sono collegati allo stesso pin UART. Il valore predefinito è zero #driver_IHOLDDELAY: 8 #driver_TPOWERDOWN: 20 #driver_TBL: 2 #driver_TOFF: 3 #driver_HEND: 0 #driver_HSTRT: 5 #driver_PWM_AUTOGRAD: True #driver_PWM_AUTOSCALE: True #driver_PWM_LIM: 12 #driver_PWM_REG: 8 #driver_PWM_FREQ: 1 #driver_PWM_GRAD: 14 #driver_PWM_OFS: 36 #driver_SGTHRS: 0 # Impostare il registro dato durante la configurazione del chip TMC2209. # Può essere utilizzato per impostare parametri motore personalizzati. I # valori predefiniti per ciascun parametro sono accanto al nome del # parametro nell'elenco precedente. #diag_pin: # Il pin del microcontrollore collegato alla linea DIAG del chip TMC2209. # Il pin è normalmente preceduto da "^" per abilitare un pullup. # L'impostazione di questo crea un pin virtuale "tmc2209_stepper_x:virtual_endstop" # che può essere utilizzato come endstop_pin dello stepper. In questo modo # si abilita l'"homing sensorless". (Assicurarsi di impostare anche driver_SGTHRS # su un valore di sensibilità appropriato.) L'impostazione predefinita è di non # abilitare l'homing sensorless.

source: [ad5206 my_digipot] enable_pin: # The pin corresponding to the AD5206 chip select line. This pin # will be set to low at the start of SPI messages and raised to high # after the message completes. This parameter must be provided. #spi_speed: #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # See the "common SPI settings" section for a description of the # above parameters. #channel_1: #channel_2: #channel_3: #channel_4: #channel_5: #channel_6: # The value to statically set the given AD5206 channel to. This is # typically set to a number between 0.0 and 1.0 with 1.0 being the # highest resistance and 0.0 being the lowest resistance. However, # the range may be changed with the 'scale' parameter (see below). # If a channel is not specified then it is left unconfigured. #scale: # This parameter can be used to alter how the 'channel_x' parameters # are interpreted. If provided, then the 'channel_x' parameters # should be between 0.0 and 'scale'. This may be useful when the # AD5206 is used to set stepper voltage references. The 'scale' can # be set to the equivalent stepper amperage if the AD5206 were at # its highest resistance, and then the 'channel_x' parameters can be # specified using the desired amperage value for the stepper. The # default is to not scale the 'channel_x' parameters.
hu: [ad5206 my_digipot] enable_pin: # Az AD5206 chip kiválasztási vonalának megfelelő pin. Ez a pin # az SPI-üzenetek elején alacsonyra lesz állítva, és magasra emelkedik # az üzenet befejezése után. Ezt a paramétert meg kell adni. #spi_speed: #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # Lásd az "általános SPI-beállítások" című leírást a # fenti paraméterek megadásához. #channel_1: #channel_2: #channel_3: #channel_4: #channel_5: #channel_6: # Az adott AD5206 csatorna statikus beállítására szolgáló érték. Ez # általában 0,0 és 1,0 közötti számra van állítva, ahol az 1,0 a # legnagyobb ellenállás és 0,0 a legkisebb ellenállás. Azonban, # a tartomány megváltoztatható a 'scale' paraméterrel (lásd alább). # Ha egy csatorna nincs megadva, akkor konfigurálatlanul marad. #scale: # Ezzel a paraméterrel módosítható a 'channel_x' paraméter # értelmezése. Ha megadja, akkor a 'channel_x' paramétereknek # 0,0 és 'scale' között kell lennie. Ez akkor lehet hasznos, ha az # AD5206 a léptető feszültség referenciák beállítására szolgál. A „mérleg” tud # egyenértékű léptető áramerősséget állítani, ha az AD5206 értéken lenne # a legnagyobb ellenállása, majd a 'channel_x' paraméterek lehetnek # megadva a léptető kívánt amperértékével. Az # alapértelmezés szerint nem skálázza a 'channel_x' paramétereket.
