Repository: Klipper3d/klipper-translations
Catalog: locales/*/LC_MESSAGES/Config_Reference.po
Languages: hu, it

source: [display] lcd_type: # The type of LCD chip in use. This may be "hd44780", "hd44780_spi", # "st7920", "emulated_st7920", "uc1701", "ssd1306", or "sh1106". # See the display sections below for information on each type and # additional parameters they provide. This parameter must be # provided. #display_group: # The name of the display_data group to show on the display. This # controls the content of the screen (see the "display_data" section # for more information). The default is _default_20x4 for hd44780 # displays and _default_16x4 for other displays. #menu_timeout: # Timeout for menu. Being inactive this amount of seconds will # trigger menu exit or return to root menu when having autorun # enabled. The default is 0 seconds (disabled) #menu_root: # Name of the main menu section to show when clicking the encoder # on the home screen. The defaults is __main, and this shows the # the default menus as defined in klippy/extras/display/menu.cfg #menu_reverse_navigation: # When enabled it will reverse up and down directions for list # navigation. The default is False. This parameter is optional. #encoder_pins: # The pins connected to encoder. 2 pins must be provided when using # encoder. This parameter must be provided when using menu. #encoder_steps_per_detent: # How many steps the encoder emits per detent ("click"). If the # encoder takes two detents to move between entries or moves two # entries from one detent, try changing this. Allowed values are 2 # (half-stepping) or 4 (full-stepping). The default is 4. #click_pin: # The pin connected to 'enter' button or encoder 'click'. This # parameter must be provided when using menu. The presence of an # 'analog_range_click_pin' config parameter turns this parameter # from digital to analog. #back_pin: # The pin connected to 'back' button. This parameter is optional, # menu can be used without it. The presence of an # 'analog_range_back_pin' config parameter turns this parameter from # digital to analog. #up_pin: # The pin connected to 'up' button. This parameter must be provided # when using menu without encoder. The presence of an # 'analog_range_up_pin' config parameter turns this parameter from # digital to analog. #down_pin: # The pin connected to 'down' button. This parameter must be # provided when using menu without encoder. The presence of an # 'analog_range_down_pin' config parameter turns this parameter from # digital to analog. #kill_pin: # The pin connected to 'kill' button. This button will call # emergency stop. The presence of an 'analog_range_kill_pin' config # parameter turns this parameter from digital to analog. #analog_pullup_resistor: 4700 # The resistance (in ohms) of the pullup attached to the analog # button. The default is 4700 ohms. #analog_range_click_pin: # The resistance range for a 'enter' button. Range minimum and # maximum comma-separated values must be provided when using analog # button. #analog_range_back_pin: # The resistance range for a 'back' button. Range minimum and # maximum comma-separated values must be provided when using analog # button. #analog_range_up_pin: # The resistance range for a 'up' button. Range minimum and maximum # comma-separated values must be provided when using analog button. #analog_range_down_pin: # The resistance range for a 'down' button. Range minimum and # maximum comma-separated values must be provided when using analog # button. #analog_range_kill_pin: # The resistance range for a 'kill' button. Range minimum and # maximum comma-separated values must be provided when using analog # button.
hu: [display] lcd_type: # A használt LCD chip típusa. Ez lehet "hd44780", "hd44780_spi", "st7920", # "emulated_st7920", "uc1701", "ssd1306" vagy "sh1106". Az egyes # típusokról és az általuk biztosított további paraméterekről az alábbi # képernyőszakaszokban talál információkat. # Ezt a paramétert meg kell adni. #display_group: # A kijelzőn megjelenítendő display_data csoport neve. Ez szabályozza a # képernyő tartalmát (további információért lásd a „display_data” részt). # Az alapértelmezett _default_20x4 a hd44780-as kijelzőknél és a # _default_16x4 a többi képernyőnél. #menu_timeout: # Időkorlát a menühöz. Ha ennyi másodpercig inaktív, az automatikusan # kilép a menüből, vagy visszatér a főmenübe, ha az automatikus indítás # engedélyezve van. Az alapértelmezett 0 másodperc (letiltva) #menu_root: # A főmenü rész neve, amely akkor jelenik meg, amikor a kódolóra kattint # a kezdőképernyőn. Az alapértelmezett érték a __main, és ez a # klippy/extras/display/menu.cfg fájlban meghatározott alapértelmezett # menüket mutatja. #menu_reverse_navigation: # Ha engedélyezve van, a listában történő navigáció fel és lefelé irányát # váltja. Az alapértelmezett érték False. Ez a paraméter nem kötelező. #encoder_pins: # A kódolóhoz csatlakoztatott érintkezők. A kódoló használatakor 2 # érintkezőt kell biztosítani. Ezt a paramétert a menü használatakor kell # megadni. #encoder_steps_per_detent: # Hány lépést ad ki a kódoló reteszelésenként ("kattintás"). Ha a # kódolónak két reteszre van szüksége a bejegyzések közötti mozgáshoz, # vagy két bejegyzést mozgat meg egy rögzítésből, próbálja meg ezt # megváltoztatni. A megengedett értékek 2 (féllépcsős) vagy # 4 (teljes lépés). Az alapértelmezett érték a 4. #click_pin: # Az „Enter” gombhoz vagy a kódoló „kattintásához” csatlakoztatott tű. # Ezt a paramétert a menü használatakor kell megadni. # Az „analog_range_click_pin” konfigurációs paraméter jelenléte ezt a # paramétert digitálisról analógra változtatja. #back_pin: # A „vissza” gombhoz csatlakoztatott tű. Ez a paraméter nem kötelező, # a menü enélkül is használható. Az „analog_range_back_pin” # konfigurációs paraméter jelenléte ezt a paramétert digitálisról # analógra változtatja. #up_pin: # A tű a „fel” gombhoz csatlakozik. Ezt a paramétert kódoló nélküli menü # használatakor kell megadni. Az „analog_range_up_pin” konfigurációs # paraméter jelenléte ezt a paramétert digitálisról analógra változtatja. #down_pin: # A tű a „le” gombhoz csatlakozik. Ezt a paramétert kódoló nélküli menü # használatakor kell megadni. Az „analog_range_down_pin” konfigurációs # paraméter jelenléte ezt a paramétert digitálisról analógra változtatja. #kill_pin: # A tű a „kill” gombhoz csatlakozik. Ez a gomb vészleállítást hív. # Az „analog_range_kill_pin” konfigurációs paraméter jelenléte ezt a # paramétert digitálisról analógra változtatja. #analog_pullup_resistor: 4700 # Az analóg gombhoz csatlakoztatott felhúzó ellenállása (ohmban). # Az alapértelmezett érték 4700 ohm. #analog_range_click_pin: # Az „Enter” gomb ellenállási tartománya. # Analóg gomb használata esetén a tartomány minimális és # maximális értékeit vesszővel elválasztva kell megadni. #analog_range_back_pin: # A „vissza” gomb ellenállási tartománya. # Analóg gomb használata esetén a tartomány minimális és # maximális értékeit vesszővel elválasztva kell megadni. #analog_range_up_pin: # A „fel” gomb ellenállási tartománya. # Analóg gomb használata esetén a tartomány minimális és # maximális értékeit vesszővel elválasztva kell megadni. #analog_range_down_pin: # A „le” gomb ellenállási tartománya. # Analóg gomb használata esetén a tartomány minimális és # maximális értékeit vesszővel elválasztva kell megadni. #analog_range_kill_pin: # A „kill” gomb ellenállási tartománya. # Analóg gomb használata esetén a tartomány minimális és # maximális értékeit vesszővel elválasztva kell megadni.

source: sensor_type: # One of "EPCOS 100K B57560G104F", "ATC Semitec 104GT-2", # "ATC Semitec 104NT-4-R025H42G", "Generic 3950", # "Honeywell 100K 135-104LAG-J01", "NTC 100K MGB18-104F39050L32", # "SliceEngineering 450", or "TDK NTCG104LH104JT1" sensor_pin: # Analog input pin connected to the thermistor. This parameter must # be provided. #pullup_resistor: 4700 # The resistance (in ohms) of the pullup attached to the thermistor. # The default is 4700 ohms. #inline_resistor: 0 # The resistance (in ohms) of an extra (not heat varying) resistor # that is placed inline with the thermistor. It is rare to set this. # The default is 0 ohms.
hu: sensor_type: # Az egyik "EPCOS 100K B57560G104F", "ATC Semitec 104GT-2", # "ATC Semitec 104NT-4-R025H42G", "Generic 3950", # "Honeywell 100K 135-104LAG-J01", "NTC 100K MGB18-104F39050L32", # "SliceEngineering 450", vagy "TDK NTCG104LH104JT1" sensor_pin: # Analóg bemeneti érintkező csatlakozik a termisztorhoz. # Ezt a paramétert meg kell adni. #pullup_resistor: 4700 # A termisztorhoz csatlakoztatott felhúzó ellenállása (ohmban). # Az alapértelmezett érték 4700 ohm. #inline_resistor: 0 # A termisztorral egy vonalban elhelyezett extra (nem hőváltozó) # ellenállás ellenállása (ohmban). Ritka az ilyen beállítás. # Az alapértelmezett érték 0 ohm.
it: sensor_type: # Uno di "EPCOS 100K B57560G104F", "ATC Semitec 104GT-2", # "ATC Semitec 104NT-4-R025H42G", "Generic 3950", # "Honeywell 100K 135-104LAG-J01", "NTC 100K MGB18-104F39050L32", # "SliceEngineering 450", o "TDK NTCG104LH104JT1" sensor_pin: # Pin di ingresso analogico collegato al termistore. # Questo parametro deve essere fornito. #pullup_resistor: 4700 # La resistenza (in ohm) del pullup collegato al termistore. # Il valore predefinito è 4700 ohm. #inline_resistor: 0 # La resistenza (in ohm) di un resistore aggiuntivo (non a variazione di # calore) posizionato in linea con il termistore. È raro impostare questo. # Il valore predefinito è 0 ohm.

source: sensor_type: LM75 #i2c_address: # Default is 72 (0x48). Normal range is 72-79 (0x48-0x4F) and the 3 # low bits of the address are configured via pins on the chip # (usually with jumpers or hard wired). #i2c_mcu: #i2c_bus: #i2c_speed: # See the "common I2C settings" section for a description of the # above parameters. #lm75_report_time: # Interval in seconds between readings. Default is 0.8, with minimum # 0.5.
hu: sensor_type: LM75 #i2c_address: # Az alapértelmezett 72 (0x48). A normál tartomány 72-79 (0x48-0x4F), # és a cím 3 alacsony bitje a chipen található érintkezőkön keresztül # van konfigurálva (általában jumperekkel vagy áthidaló vezetékekkel). #i2c_mcu: #i2c_bus: #i2c_speed: # A fenti paraméterek leírását lásd az "általános I2C beállítások" # részben. #lm75_report_time: # A leolvasások közötti intervallum másodpercben. # Az alapértelmezett érték 0,8 de a minimum érték 0,5.
it: sensor_type: LM75 #i2c_address: # Il valore predefinito è 72 (0x48). L'intervallo normale è 72-79 # (0x48-0x4F) e i 3 bit bassi dell'indirizzo sono configurati tramite # pin sul chip (di solito con ponticelli o cablati). #i2c_mcu: #i2c_bus: #i2c_speed: # Vedere la sezione "impostazioni comuni I2C" per una descrizione # dei parametri di cui sopra. #lm75_report_time: # Intervallo in secondi tra le letture. Il valore predefinito è 0.8 # con il minimo 0.5.

source: Hall filament width sensor (see [Hall Filament Width Sensor](Hall_Filament_Width_Sensor.md)).
hu: Hall szálszélesség érzékelő (lásd [Hall szálszélesség érzékelő](Hall_Filament_Width_Sensor.md)).
it: Sensore di larghezza del filamento ad effetto Hall (vedere [Sensore di larghezza del filamento Hall](Hall_Filament_Width_Sensor.md)).

source: Replicape support - see the [beaglebone guide](Beaglebone.md) and the [generic-replicape.cfg](../config/generic-replicape.cfg) file for an example.
hu: Replicape támogatás. Lásd a [beaglebone útmutatót](Beaglebone.md) és a [generic-replicape.cfg](../config/generic-replicape.cfg) fájlt egy példáért.
it: Supporto per Replicape: vedere la [guida beaglebone](Beaglebone.md) e il file [generic-replicape.cfg](../config/generic-replicape.cfg) per un esempio.

source: [stepper_x] step_pin: # Step GPIO pin (triggered high). This parameter must be provided. dir_pin: # Direction GPIO pin (high indicates positive direction). This # parameter must be provided. enable_pin: # Enable pin (default is enable high; use ! to indicate enable # low). If this parameter is not provided then the stepper motor # driver must always be enabled. rotation_distance: # Distance (in mm) that the axis travels with one full rotation of # the stepper motor (or final gear if gear_ratio is specified). # This parameter must be provided. microsteps: # The number of microsteps the stepper motor driver uses. This # parameter must be provided. #full_steps_per_rotation: 200 # The number of full steps for one rotation of the stepper motor. # Set this to 200 for a 1.8 degree stepper motor or set to 400 for a # 0.9 degree motor. The default is 200. #gear_ratio: # The gear ratio if the stepper motor is connected to the axis via a # gearbox. For example, one may specify "5:1" if a 5 to 1 gearbox is # in use. If the axis has multiple gearboxes one may specify a comma # separated list of gear ratios (for example, "57:11, 2:1"). If a # gear_ratio is specified then rotation_distance specifies the # distance the axis travels for one full rotation of the final gear. # The default is to not use a gear ratio. #step_pulse_duration: # The minimum time between the step pulse signal edge and the # following "unstep" signal edge. This is also used to set the # minimum time between a step pulse and a direction change signal. # The default is 0.000000100 (100ns) for TMC steppers that are # configured in UART or SPI mode, and the default is 0.000002 (which # is 2us) for all other steppers. endstop_pin: # Endstop switch detection pin. If this endstop pin is on a # different mcu than the stepper motor then it enables "multi-mcu # homing". This parameter must be provided for the X, Y, and Z # steppers on cartesian style printers. #position_min: 0 # Minimum valid distance (in mm) the user may command the stepper to # move to. The default is 0mm. position_endstop: # Location of the endstop (in mm). This parameter must be provided # for the X, Y, and Z steppers on cartesian style printers. position_max: # Maximum valid distance (in mm) the user may command the stepper to # move to. This parameter must be provided for the X, Y, and Z # steppers on cartesian style printers. #homing_speed: 5.0 # Maximum velocity (in mm/s) of the stepper when homing. The default # is 5mm/s. #homing_retract_dist: 5.0 # Distance to backoff (in mm) before homing a second time during # homing. Set this to zero to disable the second home. The default # is 5mm. #homing_retract_speed: # Speed to use on the retract move after homing in case this should # be different from the homing speed, which is the default for this # parameter #second_homing_speed: # Velocity (in mm/s) of the stepper when performing the second home. # The default is homing_speed/2. #homing_positive_dir: # If true, homing will cause the stepper to move in a positive # direction (away from zero); if false, home towards zero. It is # better to use the default than to specify this parameter. The # default is true if position_endstop is near position_max and false # if near position_min.
hu: [stepper_x] step_pin: # Lépés GPIO tű (magasan aktiválva). Ezt a paramétert meg kell adni. dir_pin: # Irány GPIO tű (magas pozitív irányt jelez). Ezt a paramétert meg kell adni. enable_pin: # Engedélyezett tű (az alapértelmezett engedélyezés magas; használja a # "!" jelet az engedélyezés alacsony szintjének jelzésére). Ha ez a # paraméter nincs megadva, akkor a léptetőmotor meghajtót mindig # engedélyezni kell. rotation_distance: # Az a távolság (mm-ben), amelyet a tengely megtesz a léptetőmotor egy # teljes fordulatával (vagy végső sebességfokozattal, ha a gear_ratio meg # van adva). Ezt a paramétert meg kell adni. microsteps: # A léptetőmotor-vezérlő által használt mikrolépések száma. # Ezt a paramétert meg kell adni. #full_steps_per_rotation: 200 # A léptetőmotor egy fordulatához tartozó teljes lépések száma. Állítsa ezt # 200-ra 1,8 fokos léptetőmotor esetén, vagy 400-ra 0,9 fokos motor esetén. # Az alapértelmezett érték 200. #gear_ratio: # Az áttétel, ha a léptetőmotor egy sebességváltón keresztül csatlakozik a # tengelyhez. Például megadhatja az "5:1" értéket, ha 5:1 sebességváltót # használnak. Ha a tengely több sebességváltóval rendelkezik, megadhat # egy vesszővel elválasztott áttételi listát (például "57:11, 2:1"). Ha a # gear_ratio meg van adva, akkor a rotation_distance azt a távolságot # határozza meg, amelyet a tengely megtesz a végső fogaskerék egy teljes # fordulatánál. Az alapértelmezés szerint nem használ áttételi arányt. #step_pulse_duration: # A minimális idő a léptető impulzus jel éle és a következő "lépésköz" jel # éle között. Ez a lépés impulzus és az irányváltó jel közötti minimális idő # beállítására is használható. Az alapértelmezett érték 0,000000100 (100 ns) # az UART vagy SPI módban konfigurált TMC léptetők esetében, és az # alapértelmezett 0,000002 (ami 2us) az összes többi léptető esetében. endstop_pin: # Végálláskapcsoló érzékelési tű. Ha ez a végütköző tű más MCU-n van, # mint a léptetőmotor, akkor engedélyezi a "multi-mcu homing"-ot. # Ezt a paramétert meg kell adni a derékszögű nyomtatók X, Y és Z # léptetőihez. #position_min: 0 # Minimális érvényes távolság (mm-ben), amelyre a felhasználó utasíthatja # a léptetőt, hogy mozogjon. Az alapértelmezett érték 0 mm. position_endstop: # A végálláskapcsoló helye (mm-ben). # Ezt a paramétert meg kell adni a derékszögű nyomtatók X, Y és Z # léptetőihez. position_max: # Maximális érvényes távolság (mm-ben), amelyre a felhasználó utasíthatja # a léptetőt, hogy mozogjon. Ezt a paramétert meg kell adni a derékszögű # nyomtatók X, Y és Z léptetőihez. #homing_speed: 5.0 # A léptető maximális sebessége (mm/mp-ben) kezdőpont felvételkor. # Az alapértelmezett érték 5 mm/mp. #homing_retract_dist: 5.0 # Távolság a visszalépésig (mm-ben), mielőtt másodszor is beállítaná. # Állítsa ezt nullára a második kezdőpont felvétel letiltásához. # Az alapértelmezett érték 5 mm. #homing_retract_speed: # Sebesség, amelyet a visszahúzásnál kell használni a kezdőpont felvétel # után arra az esetre, ha ez eltérne a beállítási sebességtől, amely ehhez a # paraméterhez az alapértelmezett. #second_homing_speed: # A léptető sebessége (mm/mp-ben) a második kezdőpont felvétel # végrehajtásakor. Az alapértelmezés a homing_speed/2. #homing_positive_dir: # Ha ez True, a kezdőpont felvétel hatására a léptető pozitív irányba mozdul # el (el a nullától) ha False, akkor kezdőpontra a nulla felé. Jobb az # alapértelmezettet használni, mint ezt a paramétert megadni. # Az alapértelmezett érték True, ha a position_endstop a position_max # közelében van, és False, ha a position_min közelében van.
it: [stepper_x] step_pin: # Pin GPIO Step (attivato in alto) . Questo parametro deve essere fornito. dir_pin: # Pin GPIO di direzione (alto indica una direzione positiva). # Questo parametro deve essere fornito. enable_pin: # Pin GPIO di abilitazione (l'impostazione predefinita è abilita alto; usa ! # per indicare abilita basso). Se questo parametro non viene fornito, il # driver del motore passo-passo deve essere sempre abilitato. rotation_distance: # Distanza (in mm) che l'asse percorre con una rotazione completa del # motore passo-passo (o viene specificata la marcia finale del rapporto di # trasmissione). Questo parametro deve essere fornito. microsteps: # Il numero di micropassi utilizzati dal driver del motore passo-passo. # Questo parametro deve essere fornito. #full_steps_per_rotation: 200 # Il numero di passi completi per una rotazione del motore passo-passo. # Impostarlo su 200 per un motore passo-passo da 1.8 gradi o su 400 per # un motore da 0.9 gradi. Il valore predefinito è 200. #gear_ratio: # Il rapporto di trasmissione se il motore passo-passo è collegato all'asse # tramite un riduttore. Ad esempio, si può specificare "5:1" se è in uso un # riduttore 5 a 1. Se l'asse ha più riduttori, è possibile specificare un elenco # di rapporti di trasmissione separati da virgole (ad esempio, "57:11, 2:1"). # Se viene specificato gear_ratio, rotation_distance specifica la distanza # percorsa dall'asse per una rotazione completa dell'ingranaggio finale. # L'impostazione predefinita è di non utilizzare un rapporto di trasmissione. #step_pulse_duration: # Il tempo minimo tra il fronte del segnale dell'impulso del passo e il # successivo fronte del segnale "non passo". Viene utilizzato anche per # impostare il tempo minimo tra un impulso di passo e un segnale di cambio # di direzione. L'impostazione predefinita è 0.000000100 (100ns) per gli # stepper TMC configurati in modalità UART o SPI e l'impostazione # predefinita è 0.000002 (che è 2us) per tutti gli altri stepper. endstop_pin: # Pin di rilevamento interruttore di fine corsa. Se questo pin di fine corsa # si trova su un mcu diverso dal motore passo-passo, abilita il # "homing multi-mcu". Questo parametro deve essere fornito per gli # stepper X, Y e Z su stampanti in stile cartesiano. #position_min: 0 # Distanza minima valida (in mm) alla quale l'utente può comandare # il movimento dello stepper. Il valore predefinito è 0 mm. position_endstop: # Posizione del finecorsa (in mm). Questo parametro deve essere fornito # per gli stepper X, Y e Z su stampanti in stile cartesiano. position_max: # Distanza massima valida (in mm) alla quale l'utente può comandare lo # spostamento dello stepper. Questo parametro deve essere fornito per # gli stepper X, Y e Z su stampanti in stile cartesiano. #homing_speed: 5.0 # Velocità massima (in mm/s) dello stepper durante l'homing. # Il valore predefinito è 5 mm/s. #homing_retract_dist: 5.0 # Distanza dall'arretramento (in mm) prima della corsa di riferimento # una seconda volta durante la corsa di riferimento. Impostalo a zero per # disabilitare la seconda casa. Il valore predefinito è 5 mm. #homing_retract_speed: # Velocità da utilizzare nella corsa di ritorno dopo l'homing nel caso in # cui questa dovesse essere diversa dalla velocità di homing, che è # l'impostazione predefinita per questo parametro #second_homing_speed: # Velocità (in mm/s) dello stepper durante l'esecuzione del secondo # homing. L'impostazione predefinita è homing_speed/2. #homing_positive_dir: # Se true, l'homing farà muovere lo stepper in una direzione positiva # (allontanandosi da zero); se falso, home verso zero. È meglio utilizzare # l'impostazione predefinita piuttosto che specificare questo parametro. # Il valore predefinito è true se position_endstop è vicino a position_max # false se vicino a position_min.
