Repository: Klipper3d/klipper-translations
Catalog: locales/*/LC_MESSAGES/Config_Reference.po
Languages: hu, it

source: This document is a reference for options available in the Klipper config file.
hu: Ez a dokumentum a Klipper konfigurációs fájlban elérhető beállítások referenciája.
it: Questo documento è un riferimento per le opzioni disponibili nel file di configurazione di Klipper.

source: The descriptions in this document are formatted so that it is possible to cut-and-paste them into a printer config file. See the [installation document](Installation.md) for information on setting up Klipper and choosing an initial config file.
hu: Az ebben a dokumentumban található leírások úgy vannak formázva, hogy kivághatóak és beilleszthetőek legyenek egy nyomtató konfigurációs fájljába. A Klipper beállításával és a kezdeti konfigurációs fájl kiválasztásával kapcsolatos információkért lásd a [telepítési dokumentumot](Installation.md).
it: Le descrizioni in questo documento sono formattate in modo che sia possibile tagliarle e incollarle in un file di configurazione della stampante. Consulta il [documento di installazione](Installation.md) per informazioni sulla configurazione di Klipper e sulla scelta di un file di configurazione iniziale.

source: Micro-controller configuration
hu: Mikrokontroller konfiguráció
it: Configurazione del microcontrollore

source: Format of micro-controller pin names
hu: A mikrokontroller tű neveinek formátuma
it: Formato dei nomi dei pin del microcontrollore

source: Many config options require the name of a micro-controller pin. Klipper uses the hardware names for these pins - for example `PA4`.
hu: Számos konfigurációs beállításhoz egy mikrokontroller-tű nevére van szükség. A Klipper a hardveres neveket használja ezekhez a csapokhoz - például `PA4`.
it: Molte opzioni di configurazione richiedono il nome di un pin del microcontrollore. Klipper usa i nomi hardware per questi pin, ad esempio "PA4".

source: Pin names may be preceded by `!` to indicate that a reverse polarity should be used (eg, trigger on low instead of high).
hu: A tű nevek előtt `!` állhat, hogy jelezze ilyenkor fordított polaritást használ (pl. magas helyett alacsony értéken történő trigger).
it: I nomi dei pin possono essere preceduti da `!` per indicare che deve essere utilizzata una polarità inversa (ad esempio, trigger su basso anziché alto).

source: Input pins may be preceded by `^` to indicate that a hardware pull-up resistor should be enabled for the pin. If the micro-controller supports pull-down resistors then an input pin may alternatively be preceded by `~`.
hu: A bemeneti tűk előtt `^` jelezheti, hogy a tűhöz hardveres pull-up ellenállást kell engedélyezni. Ha a mikrokontroller támogatja a pull-down ellenállásokat, akkor egy bemeneti tű előtt `~` állhat.
it: I pin di input possono essere preceduti da `^` per indicare che un resistore di pull-up hardware deve essere abilitato per il pin. Se il microcontrollore supporta resistori pull-down, un pin di ingresso può in alternativa essere preceduto da `~`.

source: Note, some config sections may "create" additional pins. Where this occurs, the config section defining the pins must be listed in the config file before any sections using those pins.
hu: Megjegyzés: egyes konfigurációs szakaszok további tűket hozhatnak létre. Ahol ez előfordul, ott a tűket definiáló konfigurációs szekciót a konfigurációs fájlban az ezeket a tűket használó szekciók előtt kell felsorolni.
it: Nota, alcune sezioni di configurazione potrebbero "creare" pin aggiuntivi. Quando ciò si verifica, la sezione di configurazione che definisce i pin deve essere elencata nel file di configurazione prima di qualsiasi sezione che utilizza tali pin.

source: Configuration of the primary micro-controller.
hu: Az elsődleges mikrokontroller konfigurálása.
it: Configurazione del microcontrollore primario.

source: Additional micro-controllers (one may define any number of sections with an "mcu" prefix). Additional micro-controllers introduce additional pins that may be configured as heaters, steppers, fans, etc.. For example, if an "[mcu extra_mcu]" section is introduced, then pins such as "extra_mcu:ar9" may then be used elsewhere in the config (where "ar9" is a hardware pin name or alias name on the given mcu).
hu: További mikrovezérlők (az "mcu" előtaggal tetszőleges számú szekciót lehet definiálni). A további mikrovezérlők további tűket vezetnek be, amelyek fűtőberendezésként, léptetőberendezésként, ventilátorként stb. konfigurálhatók. Például, ha egy "[mcu extra_mcu]" szekciót vezetünk be, akkor az olyan tűket, mint az "extra_mcu:ar9" a konfigurációban máshol is használhatók (ahol "ar9" az adott mcu hardveres tű neve vagy álneve).
it: Microcontrollori aggiuntivi (si può definire un numero qualsiasi di sezioni con un prefisso "mcu"). Microcontrollori aggiuntivi introducono pin aggiuntivi che possono essere configurati come riscaldatori, stepper, ventole, ecc. Ad esempio, se viene introdotta una sezione "[mcu extra_mcu]", i pin come "extra_mcu:ar9" possono quindi essere utilizzati altrove nella configurazione (dove "ar9" è un nome pin hardware o un nome alias sul dato mcu).

source: Common kinematic settings
hu: Közös kinematikai beállítások
it: Impostazioni cinematiche comuni

source: The printer section controls high level printer settings.
hu: A nyomtató szakasz a nyomtató magas szintű beállításait vezérli.
it: La sezione printer controlla le impostazioni di alto livello della stampante.

source: Stepper motor definitions. Different printer types (as specified by the "kinematics" option in the [printer] config section) require different names for the stepper (eg, `stepper_x` vs `stepper_a`). Below are common stepper definitions.
hu: Léptetőmotor meghatározások. A különböző nyomtatótípusok (a [printer] config szakasz "kinematika" opciója által meghatározottak szerint) eltérő neveket igényelnek a léptető számára (pl. `stepper_x` vs `stepper_a`). Az alábbiakban a stepperek általános definíciói következnek.
it: Definizioni di motori passo-passo. Diversi tipi di stampante (come specificato dall'opzione "cinematica" nella sezione di configurazione [stampante]) richiedono nomi diversi per lo stepper (ad esempio, `stepper_x` vs `stepper_a`). Di seguito sono riportate le definizioni comuni di stepper.

source: Cartesian Kinematics
hu: Cartesian Kinematika
it: Cinematica cartesiana

source: See [example-cartesian.cfg](../config/example-cartesian.cfg) for an example cartesian kinematics config file.
hu: Lásd [example-cartesian.cfg](../config/example-cartesian.cfg) egy példa cartesian kinematika konfigurációs fájlhoz.
it: Vedere [example-cartesian.cfg](../config/example-cartesian.cfg) per un file di configurazione della cinematica cartesiana di esempio.

source: Only parameters specific to cartesian printers are described here - see [common kinematic settings](#common-kinematic-settings) for available parameters.
hu: Itt csak a cartesian nyomtatókra jellemző paraméterek kerülnek leírásra. A rendelkezésre álló paramétereket lásd a [általános kinematikai beállítások](#common-kinematic-settings) pontban.
it: Qui sono descritti solo i parametri specifici delle stampanti cartesiane - vedere [impostazioni cinematiche comuni](#impostazioni-cinema-comuni) per i parametri disponibili.

source: Linear Delta Kinematics
hu: Lineáris delta kinematika
it: Cinematica Delta lineare

source: See [example-delta.cfg](../config/example-delta.cfg) for an example linear delta kinematics config file. See the [delta calibrate guide](Delta_Calibrate.md) for information on calibration.
hu: Lásd az [example-delta.cfg](../config/example-delta.cfg) példát a lineáris delta kinematika konfigurációs fájljához. A kalibrálással kapcsolatos információkért lásd a [delta kalibrációs útmutató](Delta_Calibrate.md) dokumentumot.
it: Vedere [example-delta.cfg](../config/example-delta.cfg) per un file di configurazione della cinematica delta lineare di esempio. Consultare la [guida alla calibrazione delta](Delta_Calibrate.md) per informazioni sulla calibrazione.

source: Only parameters specific to linear delta printers are described here - see [common kinematic settings](#common-kinematic-settings) for available parameters.
hu: Itt csak a lineáris delta nyomtatókra jellemző paraméterek kerülnek leírásra. A rendelkezésre álló paramétereket lásd az [általános kinematikai beállítások](#common-kinematic-settings) pontban.
it: Qui vengono descritti solo i parametri specifici per le stampanti delta lineari - vedere [impostazioni cinematiche comuni](#impostazioni-cinematica-comune) per i parametri disponibili.

source: CoreXY Kinematics
hu: CoreXY Kinematika
it: Cinematica CoreXY

source: See [example-corexy.cfg](../config/example-corexy.cfg) for an example corexy (and h-bot) kinematics file.
hu: Lásd [example-corexy.cfg](../config/example-corexy.cfg) egy példa corexy (és h-bot) kinematikai fájlt.
it: Vedere [example-corexy.cfg](../config/example-corexy.cfg) per un file cinematico corexy (e h-bot) di esempio.

source: Only parameters specific to corexy printers are described here - see [common kinematic settings](#common-kinematic-settings) for available parameters.
hu: Itt csak a CoreXY nyomtatókra jellemző paraméterek kerülnek leírásra. A rendelkezésre álló paramétereket lásd az [általános kinematikai beállítások](#common-kinematic-settings) pontban.
it: Qui sono descritti solo i parametri specifici per le stampanti corexy - vedere [impostazioni cinematiche comuni](#impostazioni-cinema-comune) per i parametri disponibili.

source: CoreXZ Kinematics
hu: CoreXZ Kinematika
it: Cinematica CoreXZ

source: See [example-corexz.cfg](../config/example-corexz.cfg) for an example corexz kinematics config file.
hu: Lásd [example-corexz.cfg](../config/example-corexz.cfg) egy példa CoreXZ kinematikai konfigurációs fájlhoz.
it: Vedere [example-corexz.cfg](../config/example-corexz.cfg) per un file di configurazione della cinematica corexz di esempio.

source: Only parameters specific to corexz printers are described here - see [common kinematic settings](#common-kinematic-settings) for available parameters.
hu: Itt csak a CoreXZ nyomtatókra jellemző paraméterek kerülnek leírásra. A rendelkezésre álló paramétereket lásd az [általános kinematikai beállítások](#common-kinematic-settings) pontban.
it: Qui sono descritti solo i parametri specifici per le stampanti corexz - vedere [impostazioni cinematiche comuni](#impostazioni-cinema-comune) per i parametri disponibili.

source: Hybrid-CoreXY Kinematics
hu: Hybrid-CoreXY Kinematika
it: Cinematica Hybrid-CoreXY

source: See [example-hybrid-corexy.cfg](../config/example-hybrid-corexy.cfg) for an example hybrid corexy kinematics config file.
hu: Lásd az [example-hybrid-corexy.cfg](../config/example-hybrid-corexy.cfg) példát egy hibrid CoreXY kinematikai konfigurációs fájlhoz.
it: Vedere [example-hybrid-corexy.cfg](../config/example-hybrid-corexy.cfg) per un file di configurazione della cinematica corexy ibrida di esempio.

source: This kinematic is also known as Markforged kinematic.
hu: Ez a kinematika Markforged kinematikaként is ismert.
it: Questa cinematica è anche nota come cinematica Markforged.

source: Only parameters specific to hybrid corexy printers are described here see [common kinematic settings](#common-kinematic-settings) for available parameters.
hu: Itt csak a hibrid CoreXY nyomtatókra jellemző paramétereket írjuk le, a rendelkezésre álló paramétereket lásd az [általános kinematikai beállítások](#common-kinematic-settings) pontban.
it: Qui vengono descritti solo i parametri specifici delle stampanti corexy ibride, vedere [impostazioni cinematiche comuni](#impostazioni-cinematica-comune) per i parametri disponibili.

source: Hybrid-CoreXZ Kinematics
hu: Hybrid-CoreXZ Kinematika
it: Cinematica Hybrid-CoreXZ

source: See [example-hybrid-corexz.cfg](../config/example-hybrid-corexz.cfg) for an example hybrid corexz kinematics config file.
hu: Lásd az [example-hybrid-corexz.cfg](../config/example-hybrid-corexz.cfg) példát egy hibrid CoreXZ kinematikai konfigurációs fájlhoz.
it: Vedere [example-hybrid-corexz.cfg](../config/example-hybrid-corexz.cfg) per un file di configurazione della cinematica corexz ibrido di esempio.

source: Polar Kinematics
hu: Polar Kinematika
it: Cinematica polare

source: See [example-polar.cfg](../config/example-polar.cfg) for an example polar kinematics config file.
hu: Lásd az [example-polar.cfg](../config/example-polar.cfg) egy példa a Polar kinematika konfigurációs fájljához.
it: Vedere [example-polar.cfg](../config/example-polar.cfg) per un file di configurazione della cinematica polare di esempio.

source: Only parameters specific to polar printers are described here - see [common kinematic settings](#common-kinematic-settings) for available parameters.
hu: Itt csak a Polar nyomtatókra jellemző paraméterek kerülnek leírásra. A rendelkezésre álló paramétereket lásd az [általános kinematikai beállítások](#common-kinematic-settings) pontban.
it: Qui sono descritti solo i parametri specifici per le stampanti polari - vedere [impostazioni cinematiche comuni](#impostazioni-cinema-comuni) per i parametri disponibili.

source: Rotary delta Kinematics
hu: Forgó delta Kinematika

source: See [example-rotary-delta.cfg](../config/example-rotary-delta.cfg) for an example rotary delta kinematics config file.
hu: Lásd az [example-rotary-delta.cfg](../config/example-rotary-delta.cfg) egy példa a forgó delta kinematika konfigurációs fájljához.

source: Only parameters specific to rotary delta printers are described here - see [common kinematic settings](#common-kinematic-settings) for available parameters.
hu: Itt csak a forgó delta nyomtatókra jellemző paraméterek kerülnek leírásra. A rendelkezésre álló paramétereket lásd az [általános kinematikai beállítások](#common-kinematic-settings) pontban.
it: Qui vengono descritti solo i parametri specifici delle stampanti delta rotative - vedere [impostazioni cinematiche comuni](#impostazioni-cinematica-comune) per i parametri disponibili.

source: ROTARY DELTA KINEMATICS ARE A WORK IN PROGRESS. Homing moves may timeout and some boundary checks are not implemented.
hu: A FORGÓ DELTA KINEMATIKA MÉG FOLYAMATBAN VAN. A célkövető mozgások időzítettek lehetnek, és néhány határellenőrzés nincs implementálva.

source: Cable winch Kinematics
hu: Kábelcsörlős Kinematika

source: See the [example-winch.cfg](../config/example-winch.cfg) for an example cable winch kinematics config file.
hu: Lásd az [example-winch.cfg](../config/example-winch.cfg) egy példát a kábelcsörlős kinematika konfigurációs fájljához.

source: Only parameters specific to cable winch printers are described here - see [common kinematic settings](#common-kinematic-settings) for available parameters.
hu: Itt csak a kábelcsörlős nyomtatókra jellemző paraméterek kerülnek leírásra. A rendelkezésre álló paramétereket lásd az [általános kinematikai beállítások](#common-kinematic-settings) pontban.
it: Qui sono descritti solo i parametri specifici per le stampanti cavo verricello - vedere [impostazioni comuni cinematiche](#common-kinematic-settings) per i parametri disponibili.

source: None Kinematics
hu: Nincs Kinematika
it: Nessuna cinematica

source: It is possible to define a special "none" kinematics to disable kinematic support in Klipper. This may be useful for controlling devices that are not typical 3d-printers or for debugging purposes.
hu: Lehetőség van egy speciális "none" kinematika definiálására a Klipper kinematikai támogatásának kikapcsolásához. Ez hasznos lehet olyan eszközök vezérléséhez, amelyek nem tipikus 3D nyomtatók, vagy hibakeresési célok.
it: È possibile definire una cinematica speciale "none" per disabilitare il supporto cinematico in Klipper. Questo può essere utile per controllare dispositivi che non sono le tipiche stampanti 3D o per scopi di debug.

source: Common extruder and heated bed support
hu: Közös extruder és fűtött ágy támogatás
it: Supporto per estrusore e piatto riscaldato comuni

source: The heater_bed section describes a heated bed. It uses the same heater settings described in the "extruder" section.
hu: A heater_bed szakasz egy fűtött ágyat ír le. Ugyanazokat a fűtési beállításokat használja, amelyeket az "extruder" szakaszban leírtunk.
it: La sezione heater_bed descrive un piatto riscaldato. Utilizza le stesse impostazioni del riscaldatore descritte nella sezione "extruder".

source: Bed level support
hu: Ágyszint támogatás
it: Supporto livellamento del piatto

source: Mesh Bed Leveling. One may define a bed_mesh config section to enable move transformations that offset the z axis based on a mesh generated from probed points. When using a probe to home the z-axis, it is recommended to define a safe_z_home section in printer.cfg to home toward the center of the print area.
hu: Ágy Háló Kiegyenlítés. Definiálhatunk egy bed_mesh konfigurációs szakaszt, hogy engedélyezzük a Z tengelyt eltoló mozgatási transzformációkat a mért pontokból generált háló alapján. Ha szondát használunk a Z-tengely alaphelyzetbe állítására, ajánlott a printer.cfg fájlban egy safe_z_home szakaszt definiálni a nyomtatási terület közepére történő alaphelyzetbe állításhoz.
it: Mesh Bed Leveling. Si può definire una sezione di configurazione bed_mesh per abilitare trasformazioni di spostamento che sfalsano l'asse z in base a una mesh generata da punti sondati. Quando si utilizza una sonda per la posizione di riferimento sull'asse z, si consiglia di definire una sezione safe_z_home in printer.cfg per la posizione di riferimento verso il centro dell'area di stampa.

source: Visual Examples:
hu: Vizuális példák:
it: Esempi visivi:

source: Bed tilt compensation. One may define a bed_tilt config section to enable move transformations that account for a tilted bed. Note that bed_mesh and bed_tilt are incompatible; both cannot be defined.
hu: Ágydőlés kompenzáció. Definiálhatunk egy bed_tilt config szekciót, hogy lehetővé tegyük a ferde ágyat figyelembe vevő mozgástranszformációkat. Vegye figyelembe, hogy a bed_mesh és a bed_tilt nem kompatibilisek. Mindkettő nem definiálható.
it: Compensazione dell'inclinazione del piatto. Si può definire una sezione di configurazione bed_tilt per abilitare le trasformazioni di movimento che tengono conto di un piatto inclinato. Nota che bed_mesh e bed_tilt sono incompatibili; entrambi non possono essere definiti.

source: Tool to help adjust bed leveling screws. One may define a [bed_screws] config section to enable a BED_SCREWS_ADJUST g-code command.
hu: Szerszám az ágy szintbeállító csavarok beállításához. Meghatározható egy [bed_screws] config szakasz a BED_SCREWS_ADJUST G-kód parancs engedélyezéséhez.
it: Strumento per aiutare a regolare le viti di livellamento del letto. Si può definire una sezione di configurazione [bed_screws] per abilitare un comando g-code BED_SCREWS_ADJUST.

source: Tool to help adjust bed screws tilt using Z probe. One may define a screws_tilt_adjust config section to enable a SCREWS_TILT_CALCULATE g-code command.
hu: Eszköz az ágycsavarok dőlésszögének beállításához Z-szondával. Meghatározható egy screws_tilt_adjust konfigurációs szakasz a SCREWS_TILT_CALCULATE G-kód parancsal.
it: Strumento per aiutare a regolare l'inclinazione delle viti del piatto utilizzando la sonda Z. Si può definire una sezione di configurazione Screws_tilt_adjust per abilitare un comando g-code SCREWS_TILT_CALCULATE.

source: Moving gantry leveling using 4 independently controlled Z motors. Corrects hyperbolic parabola effects (potato chip) on moving gantry which is more flexible. WARNING: Using this on a moving bed may lead to undesirable results. If this section is present then a QUAD_GANTRY_LEVEL extended G-Code command becomes available. This routine assumes the following Z motor configuration:
hu: Mozgó állvány szintezése 4 egymástól függetlenül vezérelt Z-motorral. Korrigálja a hiperbolikus parabola hatását (krumplichip) a mozgó portálon, amely rugalmasabb. FIGYELMEZTETÉS: Mozgó ágyon történő használata nemkívánatos eredményekhez vezethet. Ha ez a szakasz jelen van, akkor elérhetővé válik a QUAD_GANTRY_LEVEL kiterjesztett G-kód parancs. Ez a rutin a következő Z motor konfigurációt feltételezi:

source: Customized homing
hu: Testreszabott kezdőpont felvétel
it: Homing personalizzato

source: Homing override. One may use this mechanism to run a series of g-code commands in place of a G28 found in the normal g-code input. This may be useful on printers that require a specific procedure to home the machine.
hu: Kezdőpont felvétel felülbírálása. Ezt a mechanizmust arra lehet használni, hogy a normál G-kód bemenetben található G28 helyett egy sor G-kód parancsot futtassunk. Ez olyan nyomtatóknál lehet hasznos, amelyeknél a gép beindításához speciális eljárásra van szükség.
it: Homing Override. Si può utilizzare questo meccanismo per eseguire una serie di comandi g-code al posto di un G28 che si trova nel normale input di g-code. Questo può essere utile su stampanti che richiedono una procedura specifica per l'home della macchina.

source: Stepper phase adjusted endstops. To use this feature, define a config section with an "endstop_phase" prefix followed by the name of the corresponding stepper config section (for example, "[endstop_phase stepper_z]"). This feature can improve the accuracy of endstop switches. Add a bare "[endstop_phase]" declaration to enable the ENDSTOP_PHASE_CALIBRATE command.
hu: Léptető fázissal beállított végállások. A funkció használatához definiáljon egy konfigurációs részt egy "endstop_phase" előtaggal, amelyet a megfelelő stepper konfigurációs rész neve követ (például "[endstop_phase stepper_z]"). Ez a funkció javíthatja a végálláskapcsolók pontosságát. Adjon hozzá egy csupasz "[endstop_phase]" deklarációt az ENDSTOP_PHASE_CALIBRATE parancs engedélyezéséhez.
it: Finecorsa regolati in fase stepper. Per utilizzare questa funzione, definire una sezione di configurazione con un prefisso "endstop_phase" seguito dal nome della corrispondente sezione di configurazione dello stepper (ad esempio, "[endstop_phase stepper_z]"). Questa funzione può migliorare la precisione degli interruttori di fine corsa. Aggiungi una semplice dichiarazione "[endstop_phase]" per abilitare il comando ENDSTOP_PHASE_CALIBRATE.

source: G-Code macros and events
hu: G-kód makrók és események
it: Macro ed eventi G-Code

source: G-Code macros (one may define any number of sections with a "gcode_macro" prefix). See the [command template guide](Command_Templates.md) for more information.
hu: G-kód makrók (a "gcode_macro" előtaggal tetszőleges számú szakasz definiálható). További információkért lásd a [parancssablonok útmutatóját](Command_Templates.md).
it: Macro G-Code (è possibile definire un numero qualsiasi di sezioni con un prefisso "gcode_macro"). Per ulteriori informazioni, consulta la [Guida ai modelli di comando](Command_Templates.md).

source: Idle timeout. An idle timeout is automatically enabled - add an explicit idle_timeout config section to change the default settings.
hu: Üresjárati időtúllépés. Az üresjárati időtúllépés automatikusan engedélyezve van. Az alapértelmezett beállítások módosításához adjon hozzá egy explicit idle_timeout konfigurációs szakaszt.
it: Timeout di inattività. Viene automaticamente abilitato un timeout di inattività: aggiungi una sezione di configurazione di idle_timeout esplicita per modificare le impostazioni predefinite.

source: Optional G-Code features
hu: Választható G-kód funkciók
it: Funzionalità opzionali G-Code
