Repository: Klipper3d/klipper-translations
Catalog: locales/*/LC_MESSAGES/Config_Reference.po
Languages: hu, it

source: [quad_gantry_level] #gantry_corners: # A newline separated list of X, Y coordinates describing the two # opposing corners of the gantry. The first entry corresponds to Z, # the second to Z2. This parameter must be provided. #points: # A newline separated list of four X, Y points that should be probed # during a QUAD_GANTRY_LEVEL command. Order of the locations is # important, and should correspond to Z, Z1, Z2, and Z3 location in # order. This parameter must be provided. For maximum accuracy, # ensure your probe offsets are configured. #speed: 50 # The speed (in mm/s) of non-probing moves during the calibration. # The default is 50. #horizontal_move_z: 5 # The height (in mm) that the head should be commanded to move to # just prior to starting a probe operation. The default is 5. #max_adjust: 4 # Safety limit if an adjustment greater than this value is requested # quad_gantry_level will abort. #retries: 0 # Number of times to retry if the probed points aren't within # tolerance. #retry_tolerance: 0 # If retries are enabled then retry if largest and smallest probed # points differ more than retry_tolerance.
hu: [quad_gantry_level] #gantry_corners: # Az X, Y koordináták új sorral elválasztott listája, amely leírja a portál # két ellentétes sarkát. Az első bejegyzés a Z-nek, a második a Z2-nek # felel meg. Ezt a paramétert meg kell adni. #points: # Egy új sorral elválasztott lista négy X, Y pontból, amelyeket meg kell # vizsgálni a QUAD_GANTRY_LEVEL parancs során. A helyek sorrendje # fontos, és sorrendben meg kell egyeznie a Z, Z1, Z2 és Z3 helyekkel. # Ezt a paramétert meg kell adni. A maximális pontosság érdekében # győződjön meg arról, hogy a szonda eltolása be van állítva. #speed: 50 # A nem mérési mozgások sebessége (mm/mp-ben) mozog a kalibráláskor. # Az alapértelmezett érték 50. #horizontal_move_z: 5 # Az a magasság (mm-ben), ameddig a fejnek el kell mozdulnia közvetlenül # a mérés megkezdése előtt. Az alapértelmezett érték 5. #max_adjust: 4 # Biztonsági korlát, ha ennél az értéknél nagyobb korrekciót kérnek, # a quad_gantry_level megszakad. #retries: 0 # Az újrapróbálkozások száma, ha a vizsgált pontok nincsenek a # tűréshatáron belül. #retry_tolerance: 0 # Ha az újrapróbálkozás engedélyezve van, próbálkozzon újra, ha a # legnagyobb és a legkisebb vizsgált pont jobban eltér, # mint a retry_tolerance értéke.

source: Safe Z homing. One may use this mechanism to home the Z axis at a specific X, Y coordinate. This is useful if the toolhead, for example has to move to the center of the bed before Z can be homed.
hu: Biztonságos Z kezdőpont felvétel. Ezzel a mechanizmussal a Z tengelyt egy adott X, Y koordinátára lehet állítani. Ez akkor hasznos, ha például a nyomtatófejnek az ágy közepére kell mozognia, mielőtt a Z-tengelyt kezdőpontpba irányítaná.
it: Homing Z sicuro. Si può utilizzare questo meccanismo per posizionare l'asse Z su una specifica coordinata X, Y. Ciò è utile se la testa portautensili, ad esempio, deve spostarsi al centro del letto prima che Z possa essere riposizionato.

source: [safe_z_home] home_xy_position: # A X, Y coordinate (e.g. 100, 100) where the Z homing should be # performed. This parameter must be provided. #speed: 50.0 # Speed at which the toolhead is moved to the safe Z home # coordinate. The default is 50 mm/s #z_hop: # Distance (in mm) to lift the Z axis prior to homing. This is # applied to any homing command, even if it doesn't home the Z axis. # If the Z axis is already homed and the current Z position is less # than z_hop, then this will lift the head to a height of z_hop. If # the Z axis is not already homed the head is lifted by z_hop. # The default is to not implement Z hop. #z_hop_speed: 20.0 # Speed (in mm/s) at which the Z axis is lifted prior to homing. The # default is 20mm/s. #move_to_previous: False # When set to True, the X and Y axes are reset to their previous # positions after Z axis homing. The default is False.
hu: [safe_z_home] home_xy_position: # Egy X, Y koordináta (pl. 100, 100), ahol a Z kezdőpont felvételt végre # kell hajtani. Ezt a paramétert meg kell adni. #speed: 50.0 # Az a sebesség, amellyel a nyomtatófej a biztonságos Z # kezdőkoordinátára kerül. Az alapértelmezett érték 50 mm/mp #z_hop: # Távolság (mm-ben) a Z tengely felemeléséhez a beállítás előtt. # Ez minden irányadó parancsra vonatkozik, még akkor is, ha nem a # Z tengelyre irányul. Ha a Z tengely már be van állítva, és az aktuális # Z pozíció kisebb, mint z_hop, akkor ez a fejet z_hop magasságba # emeli. Ha a Z tengely még nincs elhelyezve, a fejet a z_hop felemeli. # Az alapértelmezett az, hogy nem valósítja meg a Z ugrást. #z_hop_speed: 20.0 # Sebesség (mm/mp-ben), amellyel a Z tengely megemelkedik a # kezdőpont felvétel előtt. Az alapértelmezett érték 20mm/mp. #move_to_previous: False # Ha True értékre van állítva, az X és Y tengelyek visszaállnak korábbi # pozíciójukra a Z tengely homályosítása után. # Az alapértelmezett érték False.

source: [adxl345] cs_pin: # The SPI enable pin for the sensor. This parameter must be provided. #spi_speed: 5000000 # The SPI speed (in hz) to use when communicating with the chip. # The default is 5000000. #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # See the "common SPI settings" section for a description of the # above parameters. #axes_map: x, y, z # The accelerometer axis for each of the printer's X, Y, and Z axes. # This may be useful if the accelerometer is mounted in an # orientation that does not match the printer orientation. For # example, one could set this to "y, x, z" to swap the X and Y axes. # It is also possible to negate an axis if the accelerometer # direction is reversed (eg, "x, z, -y"). The default is "x, y, z". #rate: 3200 # Output data rate for ADXL345. ADXL345 supports the following data # rates: 3200, 1600, 800, 400, 200, 100, 50, and 25. Note that it is # not recommended to change this rate from the default 3200, and # rates below 800 will considerably affect the quality of resonance # measurements.
hu: [adxl345] cs_pin: # Az érzékelő SPI engedélyező tűje. Ezt a paramétert meg kell adni. #spi_speed: 5000000 # A chippel való kommunikáció során használandó SPI sebesség (hz-ben). # Az alapértelmezett érték 5000000. #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # Lásd az "általános SPI-beállítások" című szakaszt a # fenti paraméterek leírásához. #axes_map: x, y, z # A gyorsulásmérő a nyomtató X, Y és Z tengelyeihez kell. # Ez akkor lehet hasznos, ha a gyorsulásmérő olyan # orientációban van beszerelve, amely nem egyezik a nyomtatóéval. # Ebben az esetében például beállíthatjuk ezt az "Y, X, Z" értékre, # hogy felcseréljük az X és Y tengelyeket. Lehetőség van arra is, hogy # negáljunk egy tengelyt, ha a gyorsulásmérő iránya fordított # (pl. "X, Z, -Y"). Az alapértelmezett érték "X, Y, Z",. #rate: 3200 # Kimeneti adatátviteli sebesség az ADXL345 esetében. Az ADXL345 # a következő sebességeket támogatja: 3200, 1600, 800, 400, 200, # 100, 50 és 25. Vegye figyelembe, hogy nem ajánlott megváltoztatni # ezt a sebességet az alapértelmezett 3200-ról, és a 800 alatti # sebességek jelentősen befolyásolják a rezonancia mérés # eredményeinek minőségét.

source: # The "replicape" config section adds "replicape:stepper_x_enable" # virtual stepper enable pins (for steppers X, Y, Z, E, and H) and # "replicape:power_x" PWM output pins (for hotbed, e, h, fan0, fan1, # fan2, and fan3) that may then be used elsewhere in the config file. [replicape] revision: # The replicape hardware revision. Currently only revision "B3" is # supported. This parameter must be provided. #enable_pin: !gpio0_20 # The replicape global enable pin. The default is !gpio0_20 (aka # P9_41). host_mcu: # The name of the mcu config section that communicates with the # Klipper "linux process" mcu instance. This parameter must be # provided. #standstill_power_down: False # This parameter controls the CFG6_ENN line on all stepper # motors. True sets the enable lines to "open". The default is # False. #stepper_x_microstep_mode: #stepper_y_microstep_mode: #stepper_z_microstep_mode: #stepper_e_microstep_mode: #stepper_h_microstep_mode: # This parameter controls the CFG1 and CFG2 pins of the given # stepper motor driver. Available options are: disable, 1, 2, # spread2, 4, 16, spread4, spread16, stealth4, and stealth16. The # default is disable. #stepper_x_current: #stepper_y_current: #stepper_z_current: #stepper_e_current: #stepper_h_current: # The configured maximum current (in Amps) of the stepper motor # driver. This parameter must be provided if the stepper is not in a # disable mode. #stepper_x_chopper_off_time_high: #stepper_y_chopper_off_time_high: #stepper_z_chopper_off_time_high: #stepper_e_chopper_off_time_high: #stepper_h_chopper_off_time_high: # This parameter controls the CFG0 pin of the stepper motor driver # (True sets CFG0 high, False sets it low). The default is False. #stepper_x_chopper_hysteresis_high: #stepper_y_chopper_hysteresis_high: #stepper_z_chopper_hysteresis_high: #stepper_e_chopper_hysteresis_high: #stepper_h_chopper_hysteresis_high: # This parameter controls the CFG4 pin of the stepper motor driver # (True sets CFG4 high, False sets it low). The default is False. #stepper_x_chopper_blank_time_high: #stepper_y_chopper_blank_time_high: #stepper_z_chopper_blank_time_high: #stepper_e_chopper_blank_time_high: #stepper_h_chopper_blank_time_high: # This parameter controls the CFG5 pin of the stepper motor driver # (True sets CFG5 high, False sets it low). The default is True.
hu: # A "replicape" konfigurációs rész hozzáadja a # "replicape:stepper_x_enable" virtuális léptetőt engedélyező tűket # (X, Y, Z, E és H léptetőkhöz) és a "replicape:power_x" PWM kimeneti # tűket (hotbed, e, h, fan0, fan1 számára , fan2 és fan3), a # konfigurációs fájlhoz amelyet ezután máshol is használhatunk. [replicape] revision: # A replikált hardververzió. Jelenleg csak a "B3" verzió támogatott. # Ezt a paramétert meg kell adni. #enable_pin: !gpio0_20 # A globális engedélyezési PIN replikája. # Az alapértelmezett !gpio0_20 (más néven P9_41). host_mcu: # Az MCU konfigurációs szakasz neve, amely kommunikál a Klipper # "linux folyamat" MCU példányával. Ezt a paramétert meg kell adni. #standstill_power_down: False # Ez a paraméter vezérli a CFG6_ENN vonalat az összes # léptetőmotoron. A True az engedélyezési sorokat "nyitásra" állítja. # Az alapértelmezett érték False. #stepper_x_microstep_mode: #stepper_y_microstep_mode: #stepper_z_microstep_mode: #stepper_e_microstep_mode: #stepper_h_microstep_mode: # Ez a paraméter az adott léptetőmotor meghajtó CFG1 és CFG2 # érintkezőit vezérli. A választható lehetőségek a következők: # disable, 1, 2, spread2, 4, 16, spread4, spread16, stealth4 és # stealth16. Az alapértelmezett érték a disable. #stepper_x_current: #stepper_y_current: #stepper_z_current: #stepper_e_current: #stepper_h_current: # A léptetőmotor meghajtójának konfigurált maximális árama # (amperben). Ezt a paramétert akkor kell megadni, ha a léptető # nincs letiltási módban. #stepper_x_chopper_off_time_high: #stepper_y_chopper_off_time_high: #stepper_z_chopper_off_time_high: #stepper_e_chopper_off_time_high: #stepper_h_chopper_off_time_high: # Ez a paraméter a léptetőmotor meghajtó CFG0 lábát vezérli # (a True a CFG0 értéket magasra, a False pedig alacsonyra állítja). # Az alapértelmezett érték False. #stepper_x_chopper_hysteresis_high: #stepper_y_chopper_hysteresis_high: #stepper_z_chopper_hysteresis_high: #stepper_e_chopper_hysteresis_high: #stepper_h_chopper_hysteresis_high: # Ez a paraméter a léptetőmotor meghajtó CFG4 lábát vezérli # (a True a CFG4 értéket magasra, a False pedig alacsonyra állítja). # Az alapértelmezett érték False. #stepper_x_chopper_blank_time_high: #stepper_y_chopper_blank_time_high: #stepper_z_chopper_blank_time_high: #stepper_e_chopper_blank_time_high: #stepper_h_chopper_blank_time_high: # Ez a paraméter a léptetőmotor meghajtó CFG5 lábát vezérli # (a True a CFG5 értéket magasra, a False pedig alacsonyra állítja). # Az alapértelmezett érték True.
it: # La sezione di configurazione "replicape" aggiunge i pin di abilitazione # dello stepper virtuale "replicape: stepper_x_enable" (per stepper X, Y, Z, # E e H) e i pin di uscita PWM "replicape: power_x" (per hotbed, e, h, fan0, # fan1 , fan2 e fan3) che possono quindi essere utilizzati altrove nel file # di configurazione. [replicape] revision: # La revisione dell'hardware di replicape. Attualmente è supportata solo # la revisione "B3". Questo parametro deve essere fornito. #enable_pin: !gpio0_20 # Il pin di abilitazione globale dei replicape. L'impostazione predefinita # è !gpio0_20 (aka P9_41). host_mcu: # Il nome della sezione mcu config che comunica con l'istanza mcu # "linux process" di Klipper. Questo parametro deve essere fornito. #standstill_power_down: False # Questo parametro controlla la linea CFG6_ENN su tutti i motori # passo-passo. True imposta le righe di abilitazione su "open". # L'impostazione predefinita è Falso. #stepper_x_microstep_mode: #stepper_y_microstep_mode: #stepper_z_microstep_mode: #stepper_e_microstep_mode: #stepper_h_microstep_mode: # Questo parametro controlla i pin CFG1 e CFG2 del driver del motore # passo-passo specificato. Le opzioni disponibili sono: disabilita, 1, 2, # spread2, 4, 16, spread4, spread16, stealth4 e stealth16. L'impostazione # predefinita è disabilitata. #stepper_x_current: #stepper_y_current: #stepper_z_current: #stepper_e_current: #stepper_h_current: # La corrente massima configurata (in Amp) del driver del motore # passo-passo. Questo parametro deve essere fornito se lo stepper non # è in modalità disabilitazione. #stepper_x_chopper_off_time_high: #stepper_y_chopper_off_time_high: #stepper_z_chopper_off_time_high: #stepper_e_chopper_off_time_high: #stepper_h_chopper_off_time_high: # Questo parametro controlla il pin CFG0 del driver del motore # passo-passo (True imposta CFG0 alto, False lo imposta basso). # L'impostazione predefinita è False. #stepper_x_chopper_hysteresis_high: #stepper_y_chopper_hysteresis_high: #stepper_z_chopper_hysteresis_high: #stepper_e_chopper_hysteresis_high: #stepper_h_chopper_hysteresis_high: # Questo parametro controlla il pin CFG4 del driver del motore # passo-passo (True imposta CFG4 alto, False lo imposta basso). # L'impostazione predefinita è False. #stepper_x_chopper_blank_time_high: #stepper_y_chopper_blank_time_high: #stepper_z_chopper_blank_time_high: #stepper_e_chopper_blank_time_high: #stepper_h_chopper_blank_time_high: # Questo parametro controlla il pin CFG5 del driver del motore # passo-passo (True imposta CFG5 alto, False lo imposta basso). # L'impostazione predefinita è True.

source: See the [bed mesh guide](Bed_Mesh.md) and [command reference](G-Codes.md#bed_mesh) for additional information.
hu: További információkért lásd az [ágyháló útmutató](Bed_Mesh.md) és a [parancsreferencia](G-Codes.md#bed_mesh) dokumentumokat.
it: Per ulteriori informazioni, vedere la [bed mesh guide](Bed_Mesh.md) e [riferimento del comando](G-Codes.md#bed_mesh).

source: See the [command reference](G-Codes.md#bed_tilt) for additional information.
hu: További információkért lásd a [parancsreferencia](G-Codes.md#bed_tilt) dokumentumot.
it: Per ulteriori informazioni, vedere [riferimento comando](G-Codes.md#bed_tilt).

source: See the [leveling guide](Manual_Level.md#adjusting-bed-leveling-screws) and [command reference](G-Codes.md#bed_screws) for additional information.
hu: További információkért lásd a [szintezési útmutató](Manual_Level.md#adjusting-bed-leveling-screws) és a [parancs hivatkozás](G-Codes.md#bed_screws) dokumentumot.
it: Per ulteriori informazioni, vedere la [guida al livellamento](Manual_Level.md#adjusting-bed-leveling-screws) e il [riferimento al comando](G-Codes.md#bed_screws).

source: See the [leveling guide](Manual_Level.md#adjusting-bed-leveling-screws-using-the-bed-probe) and [command reference](G-Codes.md#screws_tilt_adjust) for additional information.
hu: További információkért lásd a [szintezési útmutató](Manual_Level.md#adjusting-bed-leveling-screws-using-the-bed-probe) és a [parancs hivatkozás](G-Codes.md#screws_tilt_adjust) dokumentumot.
it: Per ulteriori informazioni, vedere la [guida al livellamento](Manual_Level.md#adjusting-bed-leveling-screws-using-the-bed-probe) e [riferimento al comando](G-Codes.md#screws_tilt_adjust).

source: Multiple Z stepper tilt adjustment. This feature enables independent adjustment of multiple z steppers (see the "stepper_z1" section) to adjust for tilt. If this section is present then a Z_TILT_ADJUST extended [G-Code command](G-Codes.md#z_tilt) becomes available.
hu: Többszörös Z léptető dőlésszög beállítása. Ez a funkció lehetővé teszi több Z léptető független beállítását (lásd a "stepper_z1" szakaszt) a dőlés beállításához. Ha ez a szakasz jelen van, akkor elérhetővé válik a Z_TILT_ADJUST kiterjesztett [G-kód parancs](G-Codes.md#z_tilt).
it: Regolazione multipla dell'inclinazione dello stepper Z. Questa funzione consente la regolazione indipendente di più stepper z (vedere la sezione "stepper_z1") per regolare l'inclinazione. Se questa sezione è presente, diventa disponibile un [comando G-Code](G-Codes.md#z_tilt) esteso Z_TILT_ADJUST.

source: Printer Skew Correction. It is possible to use software to correct printer skew across 3 planes, xy, xz, yz. This is done by printing a calibration model along a plane and measuring three lengths. Due to the nature of skew correction these lengths are set via gcode. See [Skew Correction](Skew_Correction.md) and [Command Reference](G-Codes.md#skew_correction) for details.
hu: Nyomtató ferdeségkorrekció. Lehetőség van a nyomtató ferdeségének szoftveres korrekciójára 3 síkban: XY, XZ, YZ. Ez úgy történik, hogy egy kalibrációs modellt nyomtatunk egy sík mentén, és három hosszúságot mérünk. A ferdeségkorrekció jellegéből adódóan ezeket a hosszokat G-kódal kell beállítani. Lásd a [Ferdeség korrekció](Skew_Correction.md) és a [Parancs hivatkozás](G-Codes.md#skew_correction) című fejezetekben található részleteket.
it: Correzione dell'inclinazione della stampante. È possibile utilizzare il software per correggere l'inclinazione della stampante su 3 piani, xy, xz, yz. Questo viene fatto stampando un modello di calibrazione lungo un piano e misurando tre lunghezze. A causa della natura della correzione dell'inclinazione, queste lunghezze vengono impostate tramite gcode. Per i dettagli, vedere [Correzione inclinazione](Correzione_inclinazione.md) e [Command Reference](G-Codes.md#correzione_inclinazione).

source: See the [endstop phases guide](Endstop_Phase.md) and [command reference](G-Codes.md#endstop_phase) for additional information.
hu: További információkért lásd a [végállási fázisok útmutató](Endstop_Phase.md) és a [Parancs hivatkozás](G-Codes.md#endstop_phase) dokumentumot.
it: Per ulteriori informazioni, vedere la [endstop phases guide](Endstop_Phase.md) e [command reference](G-Codes.md#endstop_phase).

source: Execute a gcode on a set delay. See the [command template guide](Command_Templates.md#delayed-gcodes) and [command reference](G-Codes.md#delayed_gcode) for more information.
hu: Egy G-kód végrehajtása beállított késleltetéssel. További információkért lásd a [parancssablon útmutató](Command_Templates.md#delayed-gcodes) és a [Parancs hivatkozás](G-Codes.md#delayed_gcode) dokumentumot.
it: Esegui un gcode con un ritardo impostato. Per ulteriori informazioni, consulta la [Guida template dei comandi](Command_Templates.md#delayed-gcodes) e [riferimento al comando](G-Codes.md#delayed_gcode).

source: Support saving variables to disk so that they are retained across restarts. See [command templates](Command_Templates.md#save-variables-to-disk) and [G-Code reference](G-Codes.md#save_variables) for further information.
hu: A változók lemezre mentésének támogatása, hogy azok az újraindítások során is megmaradjanak. További információkért lásd [Parancs hivatkozás](Command_Templates.md#save-variables-to-disk) és a [G-kód hivatkozás](G-Codes.md#save_variables) dokumentumot.
it: Supporta il salvataggio delle variabili su disco in modo che vengano mantenute durante i riavvii. Per ulteriori informazioni, vedere [template dei comandi](Command_Templates.md#save-variables-to-disk) e [G-Code reference](G-Codes.md#save_variables).

source: See the [command reference](G-Codes.md#sdcard_loop) for supported commands. See the [sample-macros.cfg](../config/sample-macros.cfg) file for a Marlin compatible M808 G-Code macro.
hu: A támogatott parancsokat lásd a [Parancs hivatkozásban](G-Codes.md#sdcard_loop). Vagy lásd a [sample-macros.cfg](../config/sample-macros.cfg) fájlt egy Marlin kompatibilis M808 G-kód makróért.
it: Consulta il [command reference](G-Codes.md#sdcard_loop) per i comandi supportati. Vedere il file [sample-macros.cfg](../config/sample-macros.cfg) per una macro M808 G-Code compatibile con Marlin.

source: Support manually moving stepper motors for diagnostic purposes. Note, using this feature may place the printer in an invalid state - see the [command reference](G-Codes.md#force_move) for important details.
hu: Támogatja a lépegetőmotorok kézi mozgatását diagnosztikai célokra. Figyelem, ennek a funkciónak a használata a nyomtatót érvénytelen állapotba hozhatja. A fontos részletekért lásd a [Parancs hivatkozás](G-Codes.md#force_move) dokumentumot.
it: Supporta lo spostamento manuale dei motori passo-passo per scopi diagnostici. Nota, l'utilizzo di questa funzione potrebbe mettere la stampante in uno stato non valido - vedere il [command reference](G-Codes.md#force_move) per dettagli importanti.

source: Pause/Resume functionality with support of position capture and restore. See the [command reference](G-Codes.md#pause_resume) for more information.
hu: Szüneteltetési/folytatási funkció a pozíció rögzítésének és visszaállításának támogatásával. További információért lásd a [Parancs hivatkozás](G-Codes.md#pause_resume) dokumentumot.
it: Funzionalità di Pause/Resume con supporto di acquisizione e ripristino della posizione. Per ulteriori informazioni, vedere [riferimento comando](G-Codes.md#pause_resume).

source: Firmware filament retraction. This enables G10 (retract) and G11 (unretract) GCODE commands issued by many slicers. The parameters below provide startup defaults, although the values can be adjusted via the SET_RETRACTION [command](G-Codes.md#firmware_retraction)), allowing per-filament settings and runtime tuning.
hu: Firmware szál visszahúzás. Ez lehetővé teszi a G10 (visszahúzás) és G11 (visszahúzás megszüntetése) G-kód parancsokat, amelyeket sok szeletelő program használ. Az alábbi paraméterek az indítási alapértelmezett értékeket adják meg, bár az értékek a SET_RETRACTION [parancs](G-Codes.md#firmware_retraction)) segítségével módosíthatók, lehetővé téve a szálankénti beállításokat és a futásidejű hangolást.
it: Retrazione del filamento del firmware. Ciò abilita i comandi GCODE G10 (ritiro) e G11 (non ritirati) emessi da molti slicer. I parametri seguenti forniscono le impostazioni predefinite di avvio, sebbene i valori possano essere regolati tramite il [comando] SET_RETRACTION (G-Codes.md#firmware_retraction)), consentendo l'impostazione e l'ottimizzazione del filamento a runtime.

source: Enable the "M118" and "RESPOND" extended [commands](G-Codes.md#respond).
hu: Engedélyezze az "M118" és "RESPOND" kiterjesztett [parancsokat](G-Codes.md#respond).
it: Abilita i comandi estesi "M118" e "RESPOND" [commands](G-Codes.md#respond).
