Repository: Klipper3d/klipper-translations
Catalog: locales/*/LC_MESSAGES/Config_Reference.po
Languages: hu, it

source: [pca9533 my_pca9533] #i2c_address: 98 # The i2c address that the chip is using on the i2c bus. Use 98 for # the PCA9533/1, 99 for the PCA9533/2. The default is 98. #i2c_mcu: #i2c_bus: #i2c_speed: # See the "common I2C settings" section for a description of the # above parameters. #initial_RED: 0.0 #initial_GREEN: 0.0 #initial_BLUE: 0.0 #initial_WHITE: 0.0 # See the "led" section for information on these parameters.
hu: [pca9533 my_pca9533] #i2c_address: 98 # Az I2C cím, amelyet a chip az I2C buszon használ. # Használja a 98-at a PCA9533/1-hez, a 99-et a PCA9533/2-hez. # Az alapértelmezett érték 98. #i2c_mcu: #i2c_bus: #i2c_speed: # A fenti paraméterek leírását lásd az "általános I2C beállítások" # részben. #initial_RED: 0.0 #initial_GREEN: 0.0 #initial_BLUE: 0.0 #initial_WHITE: 0.0 # Ezen paraméterek leírásáról nézd meg a "LED" részt.
it: [pca9533 my_pca9533] #i2c_address: 98 # L'indirizzo i2c utilizzato dal chip sul bus i2c. Utilizzare 98 per # PCA9533/1, 99 per PCA9533/2. Il valore predefinito è 98. #i2c_mcu: #i2c_bus: #i2c_speed: # Vedere la sezione "impostazioni comuni I2C" per una # descrizione dei parametri di cui sopra. #initial_RED: 0.0 #initial_GREEN: 0.0 #initial_BLUE: 0.0 #initial_WHITE: 0.0 # Vedere la sezione "led" per informazioni su questi parametri.

source: [pca9632 my_pca9632] #i2c_address: 98 # The i2c address that the chip is using on the i2c bus. This may be # 96, 97, 98, or 99. The default is 98. #i2c_mcu: #i2c_bus: #i2c_speed: # See the "common I2C settings" section for a description of the # above parameters. #scl_pin: #sda_pin: # Alternatively, if the pca9632 is not connected to a hardware I2C # bus, then one may specify the "clock" (scl_pin) and "data" # (sda_pin) pins. The default is to use hardware I2C. #color_order: RGBW # Set the pixel order of the LED (using a string containing the # letters R, G, B, W). The default is RGBW. #initial_RED: 0.0 #initial_GREEN: 0.0 #initial_BLUE: 0.0 #initial_WHITE: 0.0 # See the "led" section for information on these parameters.
hu: [pca9632 my_pca9632] #i2c_address: 98 # Az I2C cím, amelyet a chip az I2C buszon használ. # Ez lehet 96, 97, 98 vagy 99. Az alapértelmezett érték 98. #i2c_mcu: #i2c_bus: #i2c_speed: # A fenti paraméterek leírását lásd az "általános I2C beállítások" # részben. #scl_pin: #sda_pin: # Alternatív megoldásként, ha a pca9632 nincs hardveres I2C # buszhoz csatlakoztatva, akkor megadhatja az "óra" (scl_pin) # és "data" (sda_pin) érintkezőket. # Az alapértelmezés a hardveres I2C használata. #color_order: RGBW # Állítsa be a LED pixelsorrendjét (egy R, G, B, W betűket # tartalmazó sztring segítségével). Az alapértelmezett az RGBW. #initial_RED: 0.0 #initial_GREEN: 0.0 #initial_BLUE: 0.0 #initial_WHITE: 0.0 # Ezen paraméterek leírásáról nézd meg a "LED" részt.
it: [pca9632 my_pca9632] #i2c_address: 98 # L'indirizzo i2c utilizzato dal chip sul bus i2c. Può essere 96, # 97, 98 o 99. Il valore predefinito è 98. #i2c_mcu: #i2c_bus: #i2c_speed: # Vedere la sezione "impostazioni I2C comuni" per una # descrizione dei parametri di cui sopra. #scl_pin: #sda_pin: # In alternativa, se il pca9632 non è collegato a un bus I2C # hardware, è possibile specificare i pin "clock" (pin scl) e "data" # (pin sda). L'impostazione predefinita prevede l'utilizzo # dell'hardware I2C. #color_order: RGBW # Impostare l'ordine dei pixel del LED (usando una stringa # contenente le lettere R, G, B, W). L'impostazione predefinita # è RGBW. #initial_RED: 0.0 #initial_GREEN: 0.0 #initial_BLUE: 0.0 #initial_WHITE: 0.0 # Vedere la sezione "led" per informazioni su questi parametri.

source: Additional servos, buttons, and other pins
hu: További szervók, gombok és egyéb tűk
it: Servocomandi aggiuntivi, pulsanti e altri pin

source: Display data text "macros" (one may define any number of sections with a display_template prefix). See the [command templates](Command_Templates.md) document for information on template evaluation.
hu: Megjelenített adatok szövege "makrók" (tetszőleges számú szakasz definiálható display_template előtaggal). A sablonok kiértékelésével kapcsolatos információkért lásd a [parancssablonok](Command_Templates.md) dokumentumot.
it: Visualizza il testo dei dati "macro" (è possibile definire un numero qualsiasi di sezioni con un prefisso display_template). Per informazioni sul template, vedere il documento [template di comandi](Command_Templates.md).

source: This feature allows one to reduce repetitive definitions in display_data sections. One may use the builtin `render()` function in display_data sections to evaluate a template. For example, if one were to define `[display_template my_template]` then one could use `{ render('my_template') }` in a display_data section.
hu: Ez a funkció lehetővé teszi az ismétlődő definíciók csökkentését a display_data szakaszokban. A sablon kiértékelésére a beépített `render()` függvényt használhatjuk a display_data szakaszokban. Ha például definiálnánk `[display_template my_template]`, akkor használhatnánk a `{ render('my_template') }` függvényt a display_data szakaszban.
it: Questa funzione consente di ridurre le definizioni ripetitive nelle sezioni display_data. Si può usare la funzione incorporata `render()` nelle sezioni display_data per valutare un template. Per esempio, se si dovesse definire `[display_template my_template]` allora si potrebbe usare `{ render('my_template') }` in una sezione display_data.

source: This feature can also be used for continuous LED updates using the [SET_LED_TEMPLATE](G-Codes.md#set_led_template) command.
hu: Ez a funkció a [SET_LED_TEMPLATE](G-Codes.md#set_led_template) parancs segítségével folyamatos LED-frissítésre is használható.
it: Questa funzione può essere utilizzata anche per aggiornamenti LED continui utilizzando il comando [SET_LED_TEMPLATE](G-Codes.md#set_led_template).

source: [display_template my_template_name] #param_<name>: # One may specify any number of options with a "param_" prefix. The # given name will be assigned the given value (parsed as a Python # literal) and will be available during macro expansion. If the # parameter is passed in the call to render() then that value will # be used during macro expansion. For example, a config with # "param_speed = 75" might have a caller with # "render('my_template_name', param_speed=80)". Parameter names may # not use upper case characters. text: # The text to return when the this template is rendered. This field # is evaluated using command templates (see # docs/Command_Templates.md). This parameter must be provided.
hu: [display_template my_template_name] #param_<name>: # A "param_" előtaggal tetszőleges számú beállítás megadható. A megadott # névhez a rendszer hozzárendeli a megadott értéket (Python literálként # elemzi), és a makróbővítés során elérhető lesz. Ha a paraméter átadásra # kerül a render() hívásban, akkor ez az érték lesz felhasználva a # makróbővítés során. Például egy "param_speed = 75" konfigurációban # előfordulhat, hogy a hívó "render('my_template_name', param_speed=80)". # A paraméternevek nem tartalmazhatnak nagybetűket. text: # A sablon megjelenítésekor visszaadandó szöveg. Ennek a mezőnek a # kiértékelése parancssablonok segítségével történik (lásd: # docs/Command_Templates.md). Ezt a paramétert meg kell adni.

source: Magnetic hall angle sensor support for reading stepper motor angle shaft measurements using a1333, as5047d, or tle5012b SPI chips. The measurements are available via the [API Server](API_Server.md) and [motion analysis tool](Debugging.md#motion-analysis-and-data-logging). See the [G-Code reference](G-Codes.md#angle) for available commands.
hu: Mágneses Hall-szögérzékelő támogatása A1333, AS5047D vagy TLE5012B SPI-chipek használatával a léptetőmotorok szögtengelyének méréseinek leolvasásához. A mérések az [API Szerver](API_Server.md) és a [mozgáselemző eszköz](Debugging.md#motion-analysis-and-data-logging) segítségével érhetők el. A rendelkezésre álló parancsokat lásd a [G-kód hivatkozásban](G-Codes.md#angle).
it: Supporto per sensore magnetico Hall per la lettura delle misurazioni dell'angolo del motore passo-passo utilizzando i chip SPI a1333, as5047d o tle5012b. Le misurazioni sono disponibili tramite [Server API](API_Server.md) e [strumento di analisi del movimento](Debugging.md#motion-analysis-and-data-logging). Vedere il [Riferimento G-Code](G-Codes.md#angle) per i comandi disponibili.

source: [angle my_angle_sensor] sensor_type: # The type of the magnetic hall sensor chip. Available choices are # "a1333", "as5047d", and "tle5012b". This parameter must be # specified. #sample_period: 0.000400 # The query period (in seconds) to use during measurements. The # default is 0.000400 (which is 2500 samples per second). #stepper: # The name of the stepper that the angle sensor is attached to (eg, # "stepper_x"). Setting this value enables an angle calibration # tool. To use this feature, the Python "numpy" package must be # installed. The default is to not enable angle calibration for the # angle sensor. cs_pin: # The SPI enable pin for the sensor. This parameter must be provided. #spi_speed: #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # See the "common SPI settings" section for a description of the # above parameters.
hu: [angle my_angle_sensor] sensor_type: # A mágneses Hall érzékelő chip típusa. A választható lehetőségek: # „a1333”, „as5047d” és „tle5012b”. Ezt a paramétert meg kell adni. #sample_period: 0.000400 # A mérések során használandó lekérdezési időszak (másodpercben). # Az alapértelmezett érték 0,000400 (ami másodpercenként # 2500 minta). #stepper: # Annak a léptetőnek a neve, amelyhez a szögérzékelő csatlakoztatva # van (pl. "stepper_x"). Ennek az értéknek a beállítása engedélyezi a # szögkalibráló eszközt. A funkció használatához telepíteni kell a # Python "numpy" csomagot. Az alapértelmezett beállítás nem # engedélyezi a szögérzékelő szögkalibrálását. cs_pin: # Az érzékelő SPI engedélyező tűje. Ezt a paramétert meg kell adni. #spi_speed: #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # A fenti paraméterek leírását az „általános SPI-beállítások” # részben találja.

source: [screws_tilt_adjust] #screw1: # The (X, Y) coordinate of the first bed leveling screw. This is a # position to command the nozzle to so that the probe is directly # above the bed screw (or as close as possible while still being # above the bed). This is the base screw used in calculations. This # parameter must be provided. #screw1_name: # An arbitrary name for the given screw. This name is displayed when # the helper script runs. The default is to use a name based upon # the screw XY location. #screw2: #screw2_name: #... # Additional bed leveling screws. At least two screws must be # defined. #speed: 50 # The speed (in mm/s) of non-probing moves during the calibration. # The default is 50. #horizontal_move_z: 5 # The height (in mm) that the head should be commanded to move to # just prior to starting a probe operation. The default is 5. #screw_thread: CW-M3 # The type of screw used for bed level, M3, M4 or M5 and the # direction of the knob used to level the bed, clockwise decrease # counter-clockwise decrease. # Accepted values: CW-M3, CCW-M3, CW-M4, CCW-M4, CW-M5, CCW-M5. # Default value is CW-M3, most printers use an M3 screw and # turning the knob clockwise decrease distance.
hu: [screws_tilt_adjust] #screw1: # Az első ágykiegyenlítő csavar (X, Y) koordinátája. Ez a helyzet a fúvóka # utasításához úgy, hogy a szonda közvetlenül az ágycsavar felett # legyen (vagy a lehető legközelebb, miközben továbbra is az ágy felett # van). Ez a számításoknál használt alapcsavar. # Ezt a paramétert meg kell adni. #screw1_name: # Az adott csavar tetszőleges neve. Ez a név jelenik meg a segédszkript # futtatásakor. Az alapértelmezés szerint a név a a csavar X-Y # helyére épül. #screw2: #screw2_name: #... # További ágykiegyenlítő csavarok. # Legalább két csavart kell meghatározott. #speed: 50 # A kalibrálás során a nem mérő mozgások sebessége (mm/mp-ben). # Az alapértelmezett érték 50. #horizontal_move_z: 5 # A magasság (mm-ben), ahová a fejnek el kell mozdulnia. # Közvetlenül a szondaművelet megkezdése előtt. # Az alapértelmezett érték 5. #screw_thread: CW-M3 # Az ágy szintjéhez használt csavar típusa, M3, M4 vagy M5, valamint az # ágy szintbeállításához használt gomb iránya, az óramutató járásával # megegyező irányú csökkenés az óramutató járásával ellentétes irányú # csökkenés. Elfogadott értékek: CW-M3, CCW-M3, CW-M4, CCW-M4, # CW-M5, CCW-M5. Az alapértelmezett érték CW-M3, a legtöbb nyomtató # M3-as csavart és a gombot az óramutató járásával megegyező irányba # forgatva csökken a távolság.
it: [screws_tilt_adjust] #screw1: # La coordinata (X, Y) della prima vite di livellamento del piatto. Questa # è una posizione in cui comandare l'ugello in modo che la sonda sia # direttamente sopra la vite del piatto (o il più vicino possibile mentre si # trova ancora sopra il piatto). Questa è la vite di base utilizzata nei calcoli. # Questo parametro deve essere fornito. #screw1_name: # Un nome arbitrario per la vite data. Questo nome viene visualizzato # quando viene eseguito lo script di supporto. L'impostazione predefinita # prevede l'utilizzo di un nome basato sulla posizione XY della vite. #screw2: #screw2_name: #... # Viti di livellamento del piatto aggiuntive. Devono essere definite # almeno due viti. #speed: 50 # La velocità (in mm/s) degli spostamenti senza probing durante la # calibrazione. Il valore predefinito è 50. #horizontal_move_z: 5 # L'altezza (in mm) a cui la testa deve essere spostata appena prima # di avviare un'operazione di sonda. L'impostazione predefinita è 5. #screw_thread: CW-M3 # Il tipo di vite utilizzata per il livello del piatto, M3, M4 o M5 e la # direzione della manopola utilizzata per livellare il letto, in senso orario # decrementa in senso antiorario decrementa. Valori accettati: CW-M3, # CCW-M3, CW-M4, CCW-M4, CW-M5, CCW-M5. Il valore predefinito è # CW-M3, la maggior parte delle stampanti utilizza una vite M3 e # ruotando la manopola in senso orario diminuisce la distanza.

source: [resonance_tester] #probe_points: # A list of X, Y, Z coordinates of points (one point per line) to test # resonances at. At least one point is required. Make sure that all # points with some safety margin in XY plane (~a few centimeters) # are reachable by the toolhead. #accel_chip: # A name of the accelerometer chip to use for measurements. If # adxl345 chip was defined without an explicit name, this parameter # can simply reference it as "accel_chip: adxl345", otherwise an # explicit name must be supplied as well, e.g. "accel_chip: adxl345 # my_chip_name". Either this, or the next two parameters must be # set. #accel_chip_x: #accel_chip_y: # Names of the accelerometer chips to use for measurements for each # of the axis. Can be useful, for instance, on bed slinger printer, # if two separate accelerometers are mounted on the bed (for Y axis) # and on the toolhead (for X axis). These parameters have the same # format as 'accel_chip' parameter. Only 'accel_chip' or these two # parameters must be provided. #max_smoothing: # Maximum input shaper smoothing to allow for each axis during shaper # auto-calibration (with 'SHAPER_CALIBRATE' command). By default no # maximum smoothing is specified. Refer to Measuring_Resonances guide # for more details on using this feature. #min_freq: 5 # Minimum frequency to test for resonances. The default is 5 Hz. #max_freq: 133.33 # Maximum frequency to test for resonances. The default is 133.33 Hz. #accel_per_hz: 75 # This parameter is used to determine which acceleration to use to # test a specific frequency: accel = accel_per_hz * freq. Higher the # value, the higher is the energy of the oscillations. Can be set to # a lower than the default value if the resonances get too strong on # the printer. However, lower values make measurements of # high-frequency resonances less precise. The default value is 75 # (mm/sec). #hz_per_sec: 1 # Determines the speed of the test. When testing all frequencies in # range [min_freq, max_freq], each second the frequency increases by # hz_per_sec. Small values make the test slow, and the large values # will decrease the precision of the test. The default value is 1.0 # (Hz/sec == sec^-2).
hu: [resonance_tester] #probe_points: # A rezonanciák teszteléséhez szükséges pontok X, Y, Z koordinátáinak # listája (soronként egy pont). Legalább egy pont szükséges. # Győződjön meg róla, hogy minden pont az X-Y síkban némi # biztonsági tartalékkal rendelkezik és (~ néhány centiméter) # elérhetőek a nyomtatófejjel. #accel_chip: # A mérésekhez használt gyorsulásmérő chip neve. Ha adxl345 chipet # explicit név nélkül definiálták, ez a paraméter egyszerűen # hivatkozhat rá "accel_chip: adxl345"-ként, ellenkező esetben egy # "accel_chip: adxl345" paramétert kell megadni. Explicit nevet is meg # kell adni, pl. "accel_chip: adxl345" my_chip_név". # Vagy ezt, vagy a következő két paramétert kell beállítani. #accel_chip_x: #accel_chip_y: # Az egyes tengelyek méréséhez használandó gyorsulásmérő chipek # neve. Hasznos lehet például ágyazó-csúszó nyomtatónál, ha két # külön gyorsulásmérő van felszerelve az ágyra (az Y tengelyhez) és a # nyomtatófejre (az X tengelyhez). Ezek a paraméterek ugyanolyan # formátumúak, mint az "accel_chip" paraméter. Csak az 'accel_chip' # vagy ez a két paramétert kell megadni. #max_smoothing: # Az egyes tengelyek maximális bemeneti alakító simítása az alakító # automatikus kalibrálása során (a 'SHAPER_CALIBRATE' paranccsal). # Alapértelmezés szerint nincs megadva maximális simítás. # Lásd a Measuring_Resonances útmutatót. a funkció használatának # további részleteiért. #min_freq: 5 # Minimális frekvencia a rezonancia vizsgálatához. # Az alapértelmezett érték 5 Hz. #max_freq: 133.33 # Maximális frekvencia a rezonancia vizsgálatához. # Az alapértelmezett érték 133,33 Hz. #accel_per_hz: 75 # Ez a paraméter annak meghatározására szolgál, hogy egy adott # frekvencia teszteléséhez milyen gyorsulást használjunk: # accel = accel_per_hz * freq. Minél nagyobb az érték, annál nagyobb # a rezgések energiája. Az alapértelmezett értéknél alacsonyabbra is # beállítható, ha a rezonanciák túl erősek lesznek a nyomtatón. # Az alacsonyabb értékek azonban a nagyfrekvenciás rezonanciák # mérését pontatlanabbá teszik. # Az alapértelmezett érték 75 (mm/mp). #hz_per_sec: 1 # Meghatározza a teszt sebességét. A [min_freq, max_freq] # tartományban lévő összes frekvencia tesztelésekor a frekvencia # minden másodpercben hz_per_sec értékkel nő. A kis értékek # lassúvá teszik a tesztet, a nagy értékek pedig csökkentik a teszt # pontosságát. Az alapértelmezett érték 1.0 (Hz/sec == sec^-2).
it: [resonance_tester] #probe_points: # Un elenco di coordinate X, Y, Z di punti (un punto per linea) in cui # testare le risonanze. Almeno un punto è richiesto. Assicurati che tutti # i punti con un margine di sicurezza nel piano XY (~ pochi centimetri) # siano raggiungibili dalla testa di stampa. #accel_chip: # Un nome del chip dell'accelerometro da utilizzare per le misurazioni. # Se il chip adxl345 è stato definito senza un nome esplicito, questo # parametro può semplicemente fare riferimento ad esso come # "accel_chip: adxl345", altrimenti deve essere fornito anche un nome # esplicito, ad es. "accel_chip: adxl345 mio_chip_nome". È necessario # impostare questo o i due parametri successivi. #accel_chip_x: #accel_chip_y: # Nomi dei chip dell'accelerometro da utilizzare per le misurazioni per # ciascuno degli assi. Può essere utile, ad esempio, su una stampante con # piatto, se due accelerometri separati sono montati sul piatto (per l'asse Y) # e sulla testa di stampa (per l'asse X). Questi parametri hanno lo stesso # formato del parametro 'accel_chip'. # È necessario fornire solo 'accel_chip' o questi due parametri. #max_smoothing: # Maximum input shaper smoothing to allow for each axis during shaper # auto-calibration (with 'SHAPER_CALIBRATE' command). By default no # maximum smoothing is specified. Refer to Measuring_Resonances guide # for more details on using this feature. #min_freq: 5 # Frequenza minima per testare le risonanze. L'impostazione è 5 Hz. #max_freq: 133.33 # Frequenza massima per testare le risonanze. L'impostazione è 133,33 Hz. #accel_per_hz: 75 # Questo parametro viene utilizzato per determinare quale accelerazione # utilizzare per testare una frequenza specifica: accel = accel_per_hz * freq. # Maggiore è il valore, maggiore è l'energia delle oscillazioni. Può essere # impostato su un valore inferiore al valore predefinito se le risonanze # diventano troppo forti sulla stampante. Tuttavia, valori più bassi rendono # le misurazioni delle risonanze ad alta frequenza meno precise. # Il valore predefinito è 75 (mm/sec). #hz_per_sec: 1 # Determina la velocità del test. Quando si testano tutte le frequenze # nell'intervallo [freq_min, freq_max], ogni secondo la frequenza aumenta # di hz_per_sec. Valori piccoli rallentano il test e valori grandi diminuiscono # la precisione del test. Il valore predefinito è 1,0 (Hz/sec == sec^-2).

source: The "Smart Effector" from Duet3d implements a Z probe using a force sensor. One may define this section instead of `[probe]` to enable the Smart Effector specific features. This also enables [runtime commands](G-Codes.md#smart_effector) to adjust the parameters of the Smart Effector at run time.
hu: A "Smart Effector" a Duet3d-től egy Z-szondát valósít meg egy erőérzékelő segítségével. Ezt a részt a `[probe]` helyett definiálhatjuk a Smart Effector specifikus funkcióinak engedélyezéséhez. Ez lehetővé teszi a [futásidejű parancsok](G-Codes.md#smart_effector) használatát is a Smart Effector paramétereinek futásidejű beállításához.
it: Lo "Smart Effector" di Duet3d implementa una sonda Z utilizzando un sensore di forza. Si può definire questa sezione invece di `[probe]` per abilitare le funzioni specifiche di Smart Effector. Ciò consente anche a [comandi di runtime](G-Codes.md#smart_effector) di regolare i parametri di Smart Effector in fase di esecuzione.
