Repository: Klipper3d/klipper-translations
Catalog: locales/*/LC_MESSAGES/Config_Reference.po
Languages: hu, it

source: Enables [resonance compensation](Resonance_Compensation.md). Also see the [command reference](G-Codes.md#input_shaper).
hu: Engedélyezi a [rezonancia kompenzációt](Resonance_Compensation.md). Lásd még a [parancsreferencia](G-Codes.md#input_shaper) dokumentumot.
it: Abilita [compensazione della risonanza](Resonance_Compensation.md). Vedere anche il [command reference](G-Codes.md#input_shaper).

source: Support for ADXL345 accelerometers. This support allows one to query accelerometer measurements from the sensor. This enables an ACCELEROMETER_MEASURE command (see [G-Codes](G-Codes.md#adxl345) for more information). The default chip name is "default", but one may specify an explicit name (eg, [adxl345 my_chip_name]).
hu: ADXL345 gyorsulásmérők támogatása. Ez a támogatás lehetővé teszi a gyorsulásmérő méréseinek lekérdezését az érzékelőtől. Ez lehetővé teszi az ACCELEROMETER_MEASURE parancsot (további információkért lásd a [G-kódok](G-Codes.md#adxl345) dokumentumot). Az alapértelmezett chipnév "default", de megadhatunk egy explicit nevet (pl. [adxl345 my_chip_name]).
it: Supporto per accelerometri ADXL345. Questo supporto consente di interrogare le misurazioni dell'accelerometro dal sensore. Ciò abilita un comando ACCELEROMETER_MEASURE (consultare [G-Codes](G-Codes.md#adxl345) per ulteriori informazioni). Il nome del chip predefinito è "predefinito", ma è possibile specificare un nome esplicito (ad esempio, [adxl345 my_chip_name]).

source: Support for resonance testing and automatic input shaper calibration. In order to use most of the functionality of this module, additional software dependencies must be installed; refer to [Measuring Resonances](Measuring_Resonances.md) and the [command reference](G-Codes.md#resonance_tester) for more information. See the [Max smoothing](Measuring_Resonances.md#max-smoothing) section of the measuring resonances guide for more information on `max_smoothing` parameter and its use.
hu: A rezonancia tesztelés és az automatikus bemeneti alakító kalibráció támogatása. A modul legtöbb funkciójának használatához további szoftverfüggőségeket kell telepíteni; további információkért olvassa el a [Rezonanciák mérése](Measuring_Resonances.md) és a [parancs hivatkozás](G-Codes.md#resonance_tester) című dokumentumot. A rezonanciák mérése című útmutató [Max simítás](Measuring_Resonances.md#max-smoothing) szakaszában további információkat talál a `max_smoothing` paraméterről és annak használatáról.
it: Supporto per test di risonanza e calibrazione automatica del input shaper. Per utilizzare la maggior parte delle funzionalità di questo modulo, devono essere installate dipendenze software aggiuntive; fare riferimento a [Measuring Resonances](Measuring_Resonances.md) e al [command reference](G-Codes.md#resonance_tester) per ulteriori informazioni. Per ulteriori informazioni sul parametro `max_smoothing` e sul suo utilizzo, vedere la sezione [Max smoothing](Measuring_Resonances.md#max-smoothing) della guida alla misurazione delle risonanze.

source: [extruder1] #step_pin: #dir_pin: #... # See the "extruder" section for available stepper and heater # parameters. #shared_heater: # This option is deprecated and should no longer be specified.
hu: [extruder1] #step_pin: #dir_pin: #... # Tekintse meg az "extruder" részt az elérhető léptető és # fűtőparaméterekért. #shared_heater: # Ez az opció elavult, és többé nem kell megadni.
it: [extruder1] #step_pin: #dir_pin: #... # Vedere la sezione "estrusore" per i parametri per lo stepper e il riscaldatore # disponibili. #shared_heater: # Questa opzione è obsoleta e non deve più essere specificata.

source: See the [command reference](G-Codes.md#extruder) for more information.
hu: További információkért lásd a [parancshivatkozás](G-Codes.md#extruder) dokumentumot.
it: Per ulteriori informazioni, vedere [riferimento comando](G-Codes.md#extruder).

source: Manual steppers (one may define any number of sections with a "manual_stepper" prefix). These are steppers that are controlled by the MANUAL_STEPPER g-code command. For example: "MANUAL_STEPPER STEPPER=my_stepper MOVE=10 SPEED=5". See [G-Codes](G-Codes.md#manual_stepper) file for a description of the MANUAL_STEPPER command. The steppers are not connected to the normal printer kinematics.
hu: Kézi léptetők (tetszőleges számú szakasz definiálható "manual_stepper" előtaggal). Ezeket a léptetőket a MANUAL_STEPPER G-kód parancs vezérli. Például: "MANUAL_STEPPER STEPPER=my_stepper MOVE=10 SPEED=5". A MANUAL_STEPPER parancs leírását lásd a [G-kódok](G-Codes.md#manual_stepper) fájlban. A léptetők nem kapcsolódnak a nyomtató normál kinematikájához.
it: Stepper manuali (è possibile definire un numero qualsiasi di sezioni con un prefisso "manual_stepper"). Questi sono stepper controllati dal comando g-code MANUAL_STEPPER. Ad esempio: "MANUAL_STEPPER STEPPER=my_stepper MOVE=10 SPEED=5". Vedere il file [G-Codes](G-Codes.md#manual_stepper) per una descrizione del comando MANUAL_STEPPER. Gli stepper non sono collegati alla normale cinematica della stampante.

source: Generic heaters (one may define any number of sections with a "heater_generic" prefix). These heaters behave similarly to standard heaters (extruders, heated beds). Use the SET_HEATER_TEMPERATURE command (see [G-Codes](G-Codes.md#heaters) for details) to set the target temperature.
hu: Általános fűtőtestek (tetszőleges számú szakasz definiálható a "heater_generic" előtaggal). Ezek a fűtőberendezések a standard fűtőberendezésekhez (extruderek, fűtött ágy) hasonlóan viselkednek. A SET_HEATER_TEMPERATURE paranccsal (lásd a [G-kódok](G-Codes.md#heaters) dokumentumban) állíthatjuk be a célhőmérsékletet.
it: Riscaldatori generici (si può definire un numero qualsiasi di sezioni con il prefisso "riscaldatore_generico"). Questi riscaldatori si comportano in modo simile ai riscaldatori standard (estrusori, piatti riscaldati). Utilizzare il comando SET_HEATER_TEMPERATURE (consultare [G-Codes](G-Codes.md#heaters) per i dettagli) per impostare la temperatura target.

source: LM75/LM75A two wire (I2C) connected temperature sensors. These sensors have a range of -55~125 C, so are usable for e.g. chamber temperature monitoring. They can also function as simple fan/heater controllers.
hu: LM75/LM75A kétvezetékes (I2C) csatlakozású hőmérséklet érzékelők. Ezek az érzékelők -55~125 C tartományban működnek, így pl. kamrahőmérséklet ellenőrzésre használhatók. Egyszerű ventilátor/fűtésvezérlőként is működhetnek.
it: Sensori di temperatura (I2C) LM75/LM75A. Questi sensori hanno una gamma di -55~125 C, quindi sono utilizzabili ad es. monitoraggio della temperatura della camera. Possono anche funzionare come semplici controller per ventole/riscaldatori.

source: See the [command reference](G-Codes.md#temperature_fan) for additional information.
hu: További információkért lásd a [parancs hivatkozást](G-Codes.md#temperature_fan).
it: Per ulteriori informazioni, vedere [command reference](G-Codes.md#temperature_fan).

source: Manually controlled fan (one may define any number of sections with a "fan_generic" prefix). The speed of a manually controlled fan is set with the SET_FAN_SPEED [gcode command](G-Codes.md#fan_generic).
hu: Kézi vezérlésű ventilátor (a "fan_generic" előtaggal tetszőleges számú szekciót lehet definiálni). A kézi vezérlésű ventilátor fordulatszámát a SET_FAN_SPEED [G-kód](G-Codes.md#fan_generic) paranccsal lehet beállítani.
it: Ventola a controllo manuale (si può definire un numero qualsiasi di sezioni con il prefisso "fan_generic"). La velocità di una ventola controllata manualmente viene impostata con SET_FAN_SPEED [comando gcode](G-Codes.md#fan_generic).

source: Servos (one may define any number of sections with a "servo" prefix). The servos may be controlled using the SET_SERVO [g-code command](G-Codes.md#servo). For example: SET_SERVO SERVO=my_servo ANGLE=180
hu: Szervók (a "servo" előtaggal tetszőleges számú szekciót lehet definiálni). A szervók a SET_SERVO [G-kód parancs](G-Codes.md#servo) segítségével vezérelhetők. Például: SET_SERVO SERVO=my_servo ANGLE=180
it: Servo (si può definire un numero qualsiasi di sezioni con un prefisso "servo"). I servo possono essere controllati usando SET_SERVO [comando g-code](G-Codes.md#servo). Ad esempio: SET_SERVO SERVO=my_servo ANGLE=180

source: Run-time configurable output pins (one may define any number of sections with an "output_pin" prefix). Pins configured here will be setup as output pins and one may modify them at run-time using "SET_PIN PIN=my_pin VALUE=.1" type extended [g-code commands](G-Codes.md#output_pin).
hu: Futtatási időben konfigurálható kimeneti tűk (tetszőleges számú szekciót lehet definiálni "output_pin" előtaggal). Az itt konfigurált tűk kimeneti tűkként lesznek beállítva, és futtatási időben a "SET_PIN PIN=my_pin VALUE=.1" típusú kiterjesztett [G-kód parancsok](G-Codes.md#output_pin) segítségével módosíthatjuk őket.
it: Pin di uscita configurabili in fase di run-time (è possibile definire un numero qualsiasi di sezioni con un prefisso "output_pin"). I pin configurati qui verranno impostati come pin di output e sarà possibile modificarli in fase di esecuzione utilizzando il comando esteso "SET_PIN PIN=my_pin VALUE=.1" [comandi g-code](G-Codes.md#output_pin).

source: Configuration of Trinamic stepper motor drivers in UART/SPI mode. Additional information is in the [TMC Drivers guide](TMC_Drivers.md) and in the [command reference](G-Codes.md#tmcxxxx).
hu: Trinamic léptetőmotor meghajtók konfigurálása UART/SPI üzemmódban. További információk a [TMC Drivers útmutatóban](TMC_Drivers.md) és a [parancsreferenciában](G-Codes.md#tmcxxxxxx) is találhatóak.
it: Configurazione dei driver per motori passo-passo Trinamic in modalità UART/SPI. Ulteriori informazioni si trovano nella [TMC Drivers guide](TMC_Drivers.md) e nel [command reference](G-Codes.md#tmcxxxx).

source: See the [command reference](G-Codes.md#filament_switch_sensor) for more information.
hu: További információkért lásd a [parancs hivatkozást](G-Codes.md#filament_switch_sensor).
it: Per ulteriori informazioni, vedere [command reference](G-Codes.md#filament_switch_sensor).

source: The extruder section is used to describe the heater parameters for the nozzle hotend along with the stepper controlling the extruder. See the [command reference](G-Codes.md#extruder) for additional information. See the [pressure advance guide](Pressure_Advance.md) for information on tuning pressure advance.
hu: Az extruder szakasz a fúvóka fűtőberendezés paramétereinek leírására szolgál, az extruder vezérlését végző léptetővel együtt. További információkért lásd a [parancs hivatkozás](G-Codes.md#extruder) című részt. A nyomás előtolás hangolásával kapcsolatos információkért lásd a [nyomás előtolási útmutatót](Pressure_Advance.md).
it: La sezione dell'estrusore viene utilizzata per descrivere i parametri del riscaldatore per l'hotend dell'ugello insieme allo stepper che controlla l'estrusore. Per ulteriori informazioni, vedere [riferimento comando](G-Codes.md#extruder). Consultare la [Guida all'avanzamento della pressione](Pressure_Advance.md) per informazioni sulla regolazione dell'anticipo della pressione.

source: [extruder_stepper my_extra_stepper] extruder: # The extruder this stepper is synchronized to. If this is set to an # empty string then the stepper will not be synchronized to an # extruder. This parameter must be provided. #step_pin: #dir_pin: #enable_pin: #microsteps: #rotation_distance: # See the "stepper" section for the definition of the above # parameters.
hu: [extruder_stepper my_extra_stepper] extruder: # Az extruder, amelyhez ez a léptető szinkronizálva van. Ha ez # üres karakterláncra van állítva, akkor a léptető nem lesz # szinkronizálva az extruderrel. Ezt a paramétert meg kell adni. #step_pin: #dir_pin: #enable_pin: #microsteps: #rotation_distance: # A fenti paraméterek meghatározásához lásd a "léptető" részt.
it: [extruder_stepper my_extra_stepper] extruder: # L'estrusore con cui è sincronizzato questo stepper. Se questo è impostato su # una stringa vuota, lo stepper non verrà sincronizzato con un # estrusore. Questo parametro deve essere fornito. #step_pin: #dir_pin: #enable_pin: #microsteps: #rotation_distance: # Vedere la sezione "stepper" per la definizione dei parametri sopra. # .

source: [printer] kinematics: polar max_z_velocity: # This sets the maximum velocity (in mm/s) of movement along the z # axis. This setting can be used to restrict the maximum speed of # the z stepper motor. The default is to use max_velocity for # max_z_velocity. max_z_accel: # This sets the maximum acceleration (in mm/s^2) of movement along # the z axis. It limits the acceleration of the z stepper motor. The # default is to use max_accel for max_z_accel. # The stepper_bed section is used to describe the stepper controlling # the bed. [stepper_bed] gear_ratio: # A gear_ratio must be specified and rotation_distance may not be # specified. For example, if the bed has an 80 toothed pulley driven # by a stepper with a 16 toothed pulley then one would specify a # gear ratio of "80:16". This parameter must be provided. # The stepper_arm section is used to describe the stepper controlling # the carriage on the arm. [stepper_arm] # The stepper_z section is used to describe the stepper controlling # the Z axis. [stepper_z]
hu: [printer] kinematics: polar max_z_velocity: # Ez beállítja a maximális mozgási sebességet (mm/mp-ben) a Z tengely # mentén. Ezzel a beállítással korlátozható a Z léptetőmotor maximális # sebessége. Az alapértelmezett érték a max_velocity használata a # max_z_velocity értékhez. max_z_accel: # Ez beállítja a Z tengely mentén történő mozgás maximális gyorsulását # (mm/mp^2-en). Korlátozza a Z léptetőmotor gyorsulását. # Az alapértelmezés szerint a max_accel értéke a max_z_accel. # A stepper_bed szakasz az ágyat vezérlő stepper leírására szolgál. [stepper_bed] gear_ratio: # Meg kell adni a gear_ratio értéket, és a rotation_distance nem adható # meg. Például, ha az ágy egy 80 fogas kerékkel rendelkezik, amelyet # egy léptetőmotor hajt meg egy 16 fogas kerékkel, akkor a „80:16” # áttételi arányt kell megadni. Ezt a paramétert meg kell adni. # A stepper_arm szakasz a karon lévő kocsit vezérlő léptető # leírására szolgál. [stepper_arm] # A stepper_z szakasz a Z tengelyt vezérlő léptető leírására szolgál. [stepper_z]
it: [printer] kinematics: polar max_z_velocity: # Imposta la velocità massima (in mm/s) di movimento lungo l'asse z. # Questa impostazione può essere utilizzata per limitare la velocità # massima del motore passo-passo z. L'impostazione predefinita è # utilizzare max_velocity per max_z_velocity. max_z_accel: # Questo imposta l'accelerazione massima (in mm/s^2) del # movimento lungo l'asse z. Limita l'accelerazione del motore # passo-passo z. L'impostazione predefinita è utilizzare max_accel # per max_z_accel. # La sezione stepper_bed viene utilizzata per descrivere lo stepper # che controlla il piatto [stepper_bed] gear_ratio: # È necessario specificare un gear_ratio e rotation_distance # potrebbe non essere specificato. Ad esempio, se il piatto ha una # ruota a 80 denti azionata da uno stepper con una ruota a 16 # denti, si dovrebbe specificare un rapporto di trasmissione di "80:16". # Questo parametro deve essere fornito. # La sezione stepper_arm è usata per descrivere lo stepper che # controlla il carrello sul braccio. [stepper_arm] # La sezione stepper_z viene utilizzata per descrivere lo stepper che # controlla l'asse Z. [stepper_z]

source: [bltouch] sensor_pin: # Pin connected to the BLTouch sensor pin. Most BLTouch devices # require a pullup on the sensor pin (prefix the pin name with "^"). # This parameter must be provided. control_pin: # Pin connected to the BLTouch control pin. This parameter must be # provided. #pin_move_time: 0.680 # The amount of time (in seconds) to wait for the BLTouch pin to # move up or down. The default is 0.680 seconds. #stow_on_each_sample: True # This determines if Klipper should command the pin to move up # between each probe attempt when performing a multiple probe # sequence. Read the directions in docs/BLTouch.md before setting # this to False. The default is True. #probe_with_touch_mode: False # If this is set to True then Klipper will probe with the device in # "touch_mode". The default is False (probing in "pin_down" mode). #pin_up_reports_not_triggered: True # Set if the BLTouch consistently reports the probe in a "not # triggered" state after a successful "pin_up" command. This should # be True for all genuine BLTouch devices. Read the directions in # docs/BLTouch.md before setting this to False. The default is True. #pin_up_touch_mode_reports_triggered: True # Set if the BLTouch consistently reports a "triggered" state after # the commands "pin_up" followed by "touch_mode". This should be # True for all genuine BLTouch devices. Read the directions in # docs/BLTouch.md before setting this to False. The default is True. #set_output_mode: # Request a specific sensor pin output mode on the BLTouch V3.0 (and # later). This setting should not be used on other types of probes. # Set to "5V" to request a sensor pin output of 5 Volts (only use if # the controller board needs 5V mode and is 5V tolerant on its input # signal line). Set to "OD" to request the sensor pin output use # open drain mode. The default is to not request an output mode. #x_offset: #y_offset: #z_offset: #speed: #lift_speed: #samples: #sample_retract_dist: #samples_result: #samples_tolerance: #samples_tolerance_retries: # See the "probe" section for information on these parameters.
hu: [bltouch] sensor_pin: # A BLTouch érzékelő érintkezőjéhez csatlakoztatott tű. A legtöbb # BLTouch eszköz megköveteli az érzékelő érintkezőjének felhúzását # (a tűnév elé illessze be a "^" karaktert). # Ezt a paramétert meg kell adni. control_pin: # A BLTouch vezérlőtűjéhez csatlakoztatott tű. # Ezt a paramétert meg kell adni. #pin_move_time: 0.680 # Az az idő (másodpercben), ameddig várni kell, amíg a BLTouch tű # felfelé vagy lefelé mozog. Az alapértelmezett 0,680 másodperc. #stow_on_each_sample: True # Ez határozza meg, hogy a Klippernek utasítania kell-e a tűt, hogy # mozogjon felfelé az egyes mérési kísérletek között, amikor több # mérési sorozatot hajt végre. Mielőtt False értékre állítaná, olvassa # el a docs/BLTouch.md utasításait. Az alapértelmezett érték True. #probe_with_touch_mode: False # Ha ez True értékre van állítva, akkor a Klipper "touch_mode" # módban vizsgálja az eszközt. Az alapértelmezett érték False # (tapintás "pin_down" módban). #pin_up_reports_not_triggered: True # Állítsa be, hogy a BLTouch következetesen „not triggered” # állapotban jelentse-e a mérést a sikeres „pin_up” parancs után. # Ennek True-nak kell lennie minden eredeti BLTouch eszköznél. # Mielőtt False értékre állítaná, olvassa el a docs/BLTouch.md # utasításait. Az alapértelmezett érték True. #pin_up_touch_mode_reports_triggered: True # Állítsa be, hogy a BLTouch következetesen "triggered" állapotot # jelentse-e a "pin_up" parancs kövesse a "touch_mode" parancsot. # Ennek True-nak kell lennie minden eredeti BLTouch eszköznél. # Mielőtt False értékre állítaná, olvassa el a docs/BLTouch.md # utasításait. Az alapértelmezett érték True. #set_output_mode: # Kérjen egy adott érzékelőtűs kimeneti módot a BLTouch V3.0 # (és újabb) készüléken. Ezt a beállítást nem szabad más típusú # szondákon használni. Állítsa "5V"-ra, ha 5 V-os érzékelőtűs # kimenetet kíván kérni (csak akkor használja, ha a vezérlőkártyának # 5 V-os üzemmódra van szüksége, és 5 V-ot tolerál a bemeneti # jelvezetékén). Állítsa „OD” értékre, hogy az érzékelő érintkezőjének # kimenete nyitott leeresztési módot használjon. # Az alapértelmezett az, hogy nem kér kimeneti módot. #x_offset: #y_offset: #z_offset: #speed: #lift_speed: #samples: #sample_retract_dist: #samples_result: #samples_tolerance: #samples_tolerance_retries: # A paraméterekkel kapcsolatos információkért lásd a "szonda" részt.

source: PCA9632 LED support. The PCA9632 is used on the FlashForge Dreamer.
hu: PCA9632 LED támogatás. A PCA9632-t a FlashForge Dreamer-ben használják.
it: Supporto LED PCA9632. Il PCA9632 viene utilizzato su FlashForge Dreamer.
