Repository: Klipper3d/klipper-translations
Catalog: locales/*/LC_MESSAGES/Config_Reference.po
Languages: hu, it

source: Temperature-triggered cooling fans (one may define any number of sections with a "temperature_fan" prefix). A "temperature fan" is a fan that will be enabled whenever its associated sensor is above a set temperature. By default, a temperature_fan has a shutdown_speed equal to max_power.
hu: Hőmérséklet vezérelt hűtőventilátorok (tetszőleges számú szekciót lehet definiálni a "temperature_fan" előtaggal). A "hőmérsékleti ventilátor" olyan ventilátor, amely akkor kapcsol be, amikor a hozzá tartozó érzékelő egy beállított hőmérséklet felett van. Alapértelmezés szerint a temperature_fan kikapcsolási sebessége egyenlő a max_power értékkel.
it: Ventole di raffreddamento attivate dalla temperatura (è possibile definire un numero qualsiasi di sezioni con un prefisso "temperature_fan"). Una "ventola di temperatura" è una ventola che verrà abilitata ogni volta che il sensore associato è al di sopra di una temperatura impostata. Per impostazione predefinita, una ventola_temperatura ha una velocità_di_arresto pari a potenza_massima.

source: PCA9533 LED support. The PCA9533 is used on the mightyboard.
hu: PCA9533 LED-támogatás. A PCA9533 a mightyboardon használatos.
it: PCA9533 Supporto LED. Il PCA9533 viene utilizzato sulla scheda mightyboard.

source: Execute gcode when a button is pressed or released (or when a pin changes state). You can check the state of the button by using `QUERY_BUTTON button=my_gcode_button`.
hu: A G-kód végrehajtása, amikor egy gombot megnyomnak vagy elengednek (vagy amikor egy tű állapota megváltozik). A gomb állapotát a `QUERY_BUTTON button=my_gcode_button` segítségével ellenőrizhetjük.
it: Esegui gcode quando un pulsante viene premuto o rilasciato (o quando un pin cambia stato). Puoi controllare lo stato del pulsante usando `QUERY_BUTTON button=my_gcode_button`.

source: Statically configured digital output pins (one may define any number of sections with a "static_digital_output" prefix). Pins configured here will be setup as a GPIO output during MCU configuration. They can not be changed at run-time.
hu: Statikusan konfigurált digitális kimeneti tűk (tetszőleges számú szakasz definiálható "static_digital_output" előtaggal). Az itt konfigurált tűk az MCU konfigurálása során GPIO kimenetként lesznek beállítva. Üzem közben nem módosíthatók.
it: Pin di uscita digitali configurati staticamente (è possibile definire un numero qualsiasi di sezioni con un prefisso "static_digital_output"). I pin configurati qui verranno impostati come uscita GPIO durante la configurazione dell'MCU. Non possono essere modificati in fase di esecuzione.

source: Multiple pin outputs (one may define any number of sections with a "multi_pin" prefix). A multi_pin output creates an internal pin alias that can modify multiple output pins each time the alias pin is set. For example, one could define a "[multi_pin my_fan]" object containing two pins and then set "pin=multi_pin:my_fan" in the "[fan]" section - on each fan change both output pins would be updated. These aliases may not be used with stepper motor pins.
hu: Több tűs kimenetek (a "multi_pin" előtaggal tetszőleges számú szakasz definiálható). A multi_pin kimenet egy belső tű álnevet hoz létre, amely több kimeneti tűt is módosíthat minden alkalommal, amikor az álnév tű be van állítva. Például definiálhatunk egy "[multi_pin my_fan]" objektumot, amely két tűt tartalmaz, majd beállíthatjuk a "pin=multi_pin:my_fan" értéket a "[fan]" szakaszban. Minden egyes ventilátorváltáskor mindkét kimeneti tű frissül. Ezek az álnevek nem használhatók léptetőmotoros tűkkel.
it: Uscite a pin multipli (si può definire un numero qualsiasi di sezioni con un prefisso "multi_pin"). Un output multi_pin crea un alias pin interno che può modificare più pin di output ogni volta che viene impostato il pin alias. Ad esempio, si potrebbe definire un oggetto "[multi_pin my_fan]" contenente due pin e quindi impostare "pin=multi_pin:my_fan" nella sezione "[fan]" - ad ogni cambio di ventola entrambi i pin di output verrebbero aggiornati. Questi alias non possono essere utilizzati con i pin del motore passo-passo.

source: TMC stepper driver configuration
hu: TMC motorvezérlő konfigurációja
it: Configurazione del driver TMC per stepper

source: Configure a TMC2130 stepper motor driver via SPI bus. To use this feature, define a config section with a "tmc2130" prefix followed by the name of the corresponding stepper config section (for example, "[tmc2130 stepper_x]").
hu: TMC2130 motorvezérlő konfigurálása SPI-buszon keresztül. A funkció használatához definiáljon egy konfigurációs szekciót "tmc2130" előtaggal, amelyet a megfelelő léptető konfigurációs szekció neve követ (például "[tmc2130 stepper_x]").
it: Configurare un driver per motore passo-passo TMC2130 tramite bus SPI. Per utilizzare questa funzione, definire una sezione di configurazione con un prefisso "tmc2130" seguito dal nome della sezione di configurazione dello stepper corrispondente (ad esempio, "[tmc2130 stepper_x]").

source: Configure a TMC2208 (or TMC2224) stepper motor driver via single wire UART. To use this feature, define a config section with a "tmc2208" prefix followed by the name of the corresponding stepper config section (for example, "[tmc2208 stepper_x]").
hu: TMC2208 (vagy TMC2224) motorvezérlő konfigurálása egyvezetékes UART-on keresztül. A funkció használatához definiáljon egy konfigurációs részt "tmc2208" előtaggal, amelyet a megfelelő léptető konfigurációs rész neve követ (például "[tmc2208 stepper_x]").
it: Configurare un driver per motore passo-passo TMC2208 (o TMC2224) tramite UART a filo singolo. Per utilizzare questa funzione, definire una sezione di configurazione con un prefisso "tmc2208" seguito dal nome della sezione di configurazione dello stepper corrispondente (ad esempio, "[tmc2208 stepper_x]").

source: Configure a TMC2209 stepper motor driver via single wire UART. To use this feature, define a config section with a "tmc2209" prefix followed by the name of the corresponding stepper config section (for example, "[tmc2209 stepper_x]").
hu: TMC2209 motorvezérlő konfigurálása egyvezetékes UART-on keresztül. A funkció használatához definiáljon egy konfigurációs szekciót "tmc2209" előtaggal, amelyet a megfelelő léptető konfigurációs szekció neve követ (például "[tmc2209 stepper_x]").
it: Configurare un driver per motore passo-passo TMC2209 tramite UART a filo singolo. Per utilizzare questa funzione, definire una sezione di configurazione con un prefisso "tmc2209" seguito dal nome della sezione di configurazione dello stepper corrispondente (ad esempio, "[tmc2209 stepper_x]").

source: Configure a TMC2660 stepper motor driver via SPI bus. To use this feature, define a config section with a tmc2660 prefix followed by the name of the corresponding stepper config section (for example, "[tmc2660 stepper_x]").
hu: TMC2660 motorvezérlő konfigurálása SPI-buszon keresztül. A funkció használatához definiáljon egy konfigurációs szekciót tmc2660 előtaggal, amelyet a megfelelő léptető konfigurációs szekció neve követ (például "[tmc2660 stepper_x]").
it: Configurare un driver per motore passo-passo TMC2660 tramite bus SPI. Per utilizzare questa funzione, definire una sezione di configurazione con un prefisso tmc2660 seguito dal nome della sezione di configurazione dello stepper corrispondente (ad esempio, "[tmc2660 stepper_x]").

source: Configure a TMC5160 stepper motor driver via SPI bus. To use this feature, define a config section with a "tmc5160" prefix followed by the name of the corresponding stepper config section (for example, "[tmc5160 stepper_x]").
hu: TMC5160 motorvezérlő konfigurálása SPI-buszon keresztül. A funkció használatához definiáljon egy konfigurációs szekciót "tmc5160" előtaggal, amelyet a megfelelő léptető konfigurációs szekció neve követ (például "[tmc5160 stepper_x]").
it: Configurare un driver per motore passo-passo TMC5160 tramite bus SPI. Per utilizzare questa funzione, definire una sezione di configurazione con un prefisso "tmc5160" seguito dal nome della sezione di configurazione dello stepper corrispondente (ad esempio, "[tmc5160 stepper_x]").

source: Run-time stepper motor current configuration
hu: Futás-idejű léptetőmotor áram konfiguráció
it: Configurazione della corrente del motore passo-passo a run-time

source: Statically configured AD5206 digipots connected via SPI bus (one may define any number of sections with an "ad5206" prefix).
hu: Statikusan konfigurált AD5206 digipotok, amelyek SPI-buszon keresztül csatlakoznak (tetszőleges számú szekciót lehet definiálni "ad5206" előtaggal).
it: Digipot AD5206 configurati staticamente collegati tramite bus SPI (si può definire un numero qualsiasi di sezioni con un prefisso "ad5206").

source: Statically configured MCP4451 digipot connected via I2C bus (one may define any number of sections with an "mcp4451" prefix).
hu: Statikusan konfigurált MCP4451 digipot, amely I2C buszon keresztül csatlakozik (tetszőleges számú szekciót lehet definiálni "mcp4451" előtaggal).
it: Digipot MCP4451 configurato staticamente collegato tramite bus I2C (si può definire un numero qualsiasi di sezioni con un prefisso "mcp4451").

source: Statically configured MCP4728 digital-to-analog converter connected via I2C bus (one may define any number of sections with an "mcp4728" prefix).
hu: Statikusan konfigurált MCP4728 digitális-analóg átalakító, amely I2C buszon keresztül csatlakozik (az "mcp4728" előtaggal tetszőleges számú szekciót lehet definiálni).
it: Convertitore digitale-analogico MCP4728 in configurazione statica collegato tramite bus I2C (è possibile definire un numero qualsiasi di sezioni con prefisso "mcp4728").

source: Statically configured MCP4018 digipot connected via two gpio "bit banging" pins (one may define any number of sections with an "mcp4018" prefix).
hu: Statikusan konfigurált MCP4018 digipot, amely két GPIO "bit banging" tűn keresztül csatlakozik (tetszőleges számú szekciót lehet definiálni "mcp4018" előtaggal).
it: Digipot MCP4018 configurato staticamente collegato tramite due pin gpio "bit banging" (si può definire un numero qualsiasi di sezioni con un prefisso "mcp4018").

source: Display support
hu: Kijelzőtámogatás
it: Supporto display

source: Support for a display attached to the micro-controller.
hu: A mikrokontrollerhez csatlakoztatott kijelző támogatása.
it: Supporto per un display collegato al microcontrollore.

source: hd44780 display
hu: hd44780 kijelző
it: display hd44780

source: Information on configuring hd44780 displays (which is used in "RepRapDiscount 2004 Smart Controller" type displays).
hu: Információk a HD44780 kijelzők konfigurálásáról (amelyet a "RepRapDiscount 2004 Smart Controller" típusú kijelzőkben használnak).
it: Informazioni sulla configurazione dei display hd44780 (utilizzati nei display di tipo "RepRapDiscount 2004 Smart Controller").

source: hd44780_spi display
hu: hd44780_spi kijelző
it: display hd44780_spi

source: Information on configuring an hd44780_spi display - a 20x04 display controlled via a hardware "shift register" (which is used in mightyboard based printers).
hu: Információ a HD44780_spi kijelző konfigurálásáról egy 20x04-es kijelző, egy hardveres "shift register" (amelyet a mightyboard alapú nyomtatókban használnak).
it: Informazioni sulla configurazione di un display hd44780_spi - un display 20x04 controllato tramite uno "shift register" hardware (che viene utilizzato nelle stampanti basate su mightyboard).

source: st7920 display
hu: st7920 kijelző
it: display st7920

source: Information on configuring st7920 displays (which is used in "RepRapDiscount 12864 Full Graphic Smart Controller" type displays).
hu: Információk az ST7920 kijelzők konfigurálásáról (amelyet a "RepRapDiscount 12864 Full Graphic Smart Controller" típusú kijelzőknél használnak).
it: Informazioni sulla configurazione dei display st7920 (utilizzati nei display di tipo "RepRapDiscount 12864 Full Graphic Smart Controller").

source: emulated_st7920 display
hu: emulated_st7920 kijelző
it: display emulazione emulated_st7920

source: Information on configuring an emulated st7920 display - found in some "2.4 inch touchscreen devices" and similar.
hu: Információ az emulált ST7920 kijelző konfigurálásáról. Megtalálható néhány "2,4 hüvelykes érintőképernyős eszközben" és hasonlókban.
it: Informazioni sulla configurazione di un display st7920 emulato, presenti in alcuni "dispositivi touchscreen da 2,4 pollici" e simili.

source: uc1701 display
hu: uc1701 kijelző
it: display uc1701

source: Information on configuring uc1701 displays (which is used in "MKS Mini 12864" type displays).
hu: Információk az UC1701 kijelzők konfigurálásáról (amelyet az "MKS Mini 12864" típusú kijelzőknél használnak).
it: Informazioni sulla configurazione dei display uc1701 (utilizzati nei display di tipo "MKS Mini 12864").

source: ssd1306 and sh1106 displays
hu: ssd1306 és sh1106 kijelzők
it: display ssd1306 e sh1106

source: Information on configuring ssd1306 and sh1106 displays.
hu: Az SSD1306 és SH1106 kijelzők konfigurálásával kapcsolatos információk.
it: Informazioni sulla configurazione dei display ssd1306 e sh1106.

source: Support for displaying custom data on an lcd screen. One may create any number of display groups and any number of data items under those groups. The display will show all the data items for a given group if the display_group option in the [display] section is set to the given group name.
hu: Egyéni adatok megjelenítésének támogatása LCD-kijelzőn. Tetszőleges számú megjelenítési csoportot és ezek alatt tetszőleges számú adatelemet lehet létrehozni. A kijelző egy adott csoport összes adatelemét megjeleníti, ha a [display] szakaszban a display_group opciót az adott csoport nevére állítjuk.
it: Supporto per la visualizzazione di dati personalizzati su uno schermo LCD. È possibile creare un numero qualsiasi di gruppi di visualizzazione e un numero qualsiasi di elementi di dati in quei gruppi. Il display mostrerà tutti gli elementi di dati per un determinato gruppo se l'opzione display_group nella sezione [display] è impostata sul nome del gruppo specificato.

source: A [default set of display groups](../klippy/extras/display/display.cfg) are automatically created. One can replace or extend these display_data items by overriding the defaults in the main printer.cfg config file.
hu: Az [alapértelmezett kijelzőcsoportok](../klippy/extras/display/display.cfg) automatikusan létrejönnek. Ezeket a display_data elemeket a printer.cfg konfigurációs fájlban lévő alapértelmezett értékek felülírásával lehet helyettesíteni vagy bővíteni.
it: Viene creato automaticamente un [default set of display groups](../klippy/extras/display/display.cfg) . È possibile sostituire o estendere questi elementi display_data sovrascrivendo i valori predefiniti nel file di configurazione principale printer.cfg .

source: Display a custom glyph on displays that support it. The given name will be assigned the given display data which can then be referenced in the display templates by their name surrounded by two "tilde" symbols i.e. `~my_display_glyph~`
hu: Egy egyéni írásjel megjelenítése az azt támogató kijelzőkön. A megadott névhez hozzárendeli a megadott megjelenítési adatokat, amelyekre aztán a megjelenítési sablonokban a két "tilde" szimbólummal körülvett nevükkel lehet hivatkozni, pl. `~my_display_glyph~`
it: Visualizza un glifo personalizzato sui display che lo supportano. Al nome dato verranno assegnati i dati di visualizzazione dati che possono quindi essere referenziati nei modelli di visualizzazione con il loro nome circondato da due simboli "tilde" per esempio `~my_display_glyph~`

source: See [sample-glyphs.cfg](../config/sample-glyphs.cfg) for some examples.
hu: Lásd a [sample-glyphs.cfg](../config/sample-glyphs.cfg) néhány példáját.
it: Vedere [sample-glyphs.cfg](../config/sample-glyphs.cfg) per alcuni esempi.

source: If a primary [display] section has been defined in printer.cfg as shown above it is possible to define multiple auxiliary displays. Note that auxiliary displays do not currently support menu functionality, thus they do not support the "menu" options or button configuration.
hu: Ha a printer.cfg fájlban a fentiek szerint egy elsődleges [display] szakasz került meghatározásra, akkor több kiegészítő kijelzőt is lehet definiálni. Vegye figyelembe, hogy a kiegészítő kijelzők jelenleg nem támogatják a menüfunkciókat, így nem támogatják a "menu" opciókat vagy a gombok konfigurálását.
it: Se in printer.cfg è stata definita una sezione primaria [display] come mostrato sopra, è possibile definire più display ausiliari. Si noti che i display ausiliari attualmente non supportano la funzionalità del menu, quindi non supportano le opzioni del "menu" o la configurazione dei pulsanti.

source: Customizable lcd display menus.
hu: Testreszabható LCD kijelző menük.
it: Menu display lcd personalizzabili.

source: A [default set of menus](../klippy/extras/display/menu.cfg) are automatically created. One can replace or extend the menu by overriding the defaults in the main printer.cfg config file.
hu: Egy [alapértelmezett menükészlet](../klippy/extras/display/menu.cfg) automatikusan létrejön. A menüt a fő printer.cfg konfigurációs fájlban lévő alapértelmezett értékek felülbírálásával lehet helyettesíteni vagy bővíteni.
it: Viene creato automaticamente un [default set of menus](../klippy/extras/display/menu.cfg) . È possibile sostituire o estendere il menu sovrascrivendo le impostazioni predefinite nel file di configurazione principale printer.cfg .

source: See the [command template document](Command_Templates.md#menu-templates) for information on menu attributes available during template rendering.
hu: A sablonok renderelése során elérhető menüattribútumokról a [parancssablon dokumentumban](Command_Templates.md#menu-templates) található információ.
it: Consulta il [command template document](Command_Templates.md#menu-templates) per informazioni sugli attributi di menu disponibili durante il rendering del modello.

source: Filament sensors
hu: Nyomtatószál érzékelők
it: Sensori di filamento

source: Filament Switch Sensor. Support for filament insert and runout detection using a switch sensor, such as an endstop switch.
hu: Nyomtatószál érzékelő. Támogatás a nyomtatószál behelyezésének és kifutásának érzékelésére kapcsolóérzékelő, például végálláskapcsoló segítségével.
it: Sensore del filamento a interruttore. Supporto per l'inserimento del filamento e il rilevamento dell'esaurimento tramite un sensore interruttore, come un interruttore di fine corsa.

source: Filament Motion Sensor. Support for filament insert and runout detection using an encoder that toggles the output pin during filament movement through the sensor.
hu: Nyomtatószál mozgásérzékelő. Támogatja a nyomtatószál behelyezésének és kifutásának érzékelését egy olyan kódoló segítségével, amely az érzékelőn keresztül történő mozgás közben váltogatja a kimeneti jelet.
it: Sensore di movimento del filamento. Supporto per l'inserimento del filamento e il rilevamento dell'esaurimento mediante un codificatore che commuta il pin di uscita durante il movimento del filamento attraverso il sensore.

source: TSLl401CL Based Filament Width Sensor. See the [guide](TSL1401CL_Filament_Width_Sensor.md) for more information.
hu: TSLl401CL alapú szálszélesség érzékelő. További információkért lásd az [útmutatót](TSL1401CL_Filament_Width_Sensor.md).
it: Sensore di larghezza del filamento basato su TSLl401CL. Consulta la [guida](TSL1401CL_Filament_Width_Sensor.md) per ulteriori informazioni.

source: Board specific hardware support
hu: Alaplap specifikus hardvertámogatás
it: Supporto hardware per specifica scheda

source: Configure an SX1509 I2C to GPIO expander. Due to the delay incurred by I2C communication you should NOT use SX1509 pins as stepper enable, step or dir pins or any other pin that requires fast bit-banging. They are best used as static or gcode controlled digital outputs or hardware-pwm pins for e.g. fans. One may define any number of sections with an "sx1509" prefix. Each expander provides a set of 16 pins (sx1509_my_sx1509:PIN_0 to sx1509_my_sx1509:PIN_15) which can be used in the printer configuration.
hu: Konfiguráljon egy SX1509 I2C-GPIO bővítőt. Az I2C-kommunikáció által okozott késleltetés miatt NEM szabad az SX1509 tűit motorvezérlő engedélyező, STEP vagy DIR tűként vagy bármilyen más olyan tűként használni, amely gyors bit-impulzust igényel. Legjobban statikus vagy G-kód vezérelt digitális kimenetekként vagy hardveres PWM tűként használhatók pl. ventilátorokhoz. Bármennyi szekciót definiálhatunk "sx1509" előtaggal. Minden egyes bővítő egy 16 tűből álló készletet biztosít (sx1509_my_sx1509:PIN_0-tól sx1509_my_sx1509:PIN_15-ig), amelyek a nyomtató konfigurációjában használhatók.
it: Configurare un'espansione SX1509 da I2C a GPIO. A causa del ritardo dovuto alla comunicazione I2C, NON utilizzare i pin SX1509 come abilitazione stepper, pin step o dir o qualsiasi altro pin che richieda un bit banging veloce. Sono utilizzati al meglio come uscite digitali statiche o controllate da gcode o pin hardware-pwm per es. fan. Si può definire un numero qualsiasi di sezioni con un prefisso "sx1509". Ogni espansione fornisce un set di 16 pin (da sx1509_my_sx1509:PIN_0 a sx1509_my_sx1509:PIN_15) che possono essere utilizzati nella configurazione della stampante.

source: See the [generic-duet2-duex.cfg](../config/generic-duet2-duex.cfg) file for an example.
hu: Lásd a [generic-duet2-duex.cfg](../config/generic-duet2-duex.cfg) fájlt egy példáért.
it: Per un esempio, vedere il file [generic-duet2-duex.cfg](../config/generic-duet2-duex.cfg).

source: Duet2 Maestro analog scaling by vref and vssa readings. Defining an adc_scaled section enables virtual adc pins (such as "my_name:PB0") that are automatically adjusted by the board's vref and vssa monitoring pins. Be sure to define this config section above any config sections that use one these virtual pins.
hu: Duet2 Maestro analóg skálázás vref és vssa leolvasások alapján. Az adc_scaled szakasz definiálása virtuális adc-tűként (például "my_name:PB0") tesz lehetővé, amelyeket automatikusan a kártya vref és vssa figyelőtűi állítanak be. Ügyeljen arra, hogy ezt a konfigurációs szakaszt minden olyan konfigurációs szakasz felett definiálja, amely ezeket a virtuális tűket használja.
it: Scaling analogico di Duet2 Maestro tramite letture vref e vssa. La definizione di una sezione adc_scaled abilita pin adc virtuali (come "my_name:PB0") che vengono regolati automaticamente dai pin di monitoraggio vref e vssa della scheda. Assicurati di definire questa sezione di configurazione sopra qualsiasi sezione di configurazione che utilizza uno di questi pin virtuali.

source: See the [generic-duet2-maestro.cfg](../config/generic-duet2-maestro.cfg) file for an example.
hu: Lásd a [generic-duet2-maestro.cfg](../config/generic-duet2-maestro.cfg) fájlt egy példáért.
it: Per un esempio, vedere il file [generic-duet2-maestro.cfg](../config/generic-duet2-maestro.cfg).

source: Other Custom Modules
hu: Egyéb egyedi modulok
it: Altri moduli personalizzati

source: Palette 2 multimaterial support - provides a tighter integration supporting Palette 2 devices in connected mode.
hu: Palette 2 multimaterial támogatás szorosabb integrációt biztosít, amely támogatja a Palette 2 eszközöket csatlakoztatott módban.
it: Supporto multimateriale Palette 2: fornisce un'integrazione più stretta supportando i dispositivi Palette 2 in modalità connessa.

source: This modules also requires `[virtual_sdcard]` and `[pause_resume]` for full functionality.
hu: Ez a modul a teljes funkcionalitáshoz a `[virtual_sdcard]` és `[pause_resume]` modulokat is igényli.
it: Questo modulo richiede anche `[virtual_sdcard]` e `[pause_resume]` per la piena funzionalità.
