Repository: Klipper3d/klipper-translations
Catalog: locales/*/LC_MESSAGES/Config_Reference.po
Languages: hu, it

source: [tmc2208 stepper_x] uart_pin: # The pin connected to the TMC2208 PDN_UART line. This parameter # must be provided. #tx_pin: # If using separate receive and transmit lines to communicate with # the driver then set uart_pin to the receive pin and tx_pin to the # transmit pin. The default is to use uart_pin for both reading and # writing. #select_pins: # A comma separated list of pins to set prior to accessing the # tmc2208 UART. This may be useful for configuring an analog mux for # UART communication. The default is to not configure any pins. #interpolate: True # If true, enable step interpolation (the driver will internally # step at a rate of 256 micro-steps). This interpolation does # introduce a small systemic positional deviation - see # TMC_Drivers.md for details. The default is True. run_current: # The amount of current (in amps RMS) to configure the driver to use # during stepper movement. This parameter must be provided. #hold_current: # The amount of current (in amps RMS) to configure the driver to use # when the stepper is not moving. Setting a hold_current is not # recommended (see TMC_Drivers.md for details). The default is to # not reduce the current. #sense_resistor: 0.110 # The resistance (in ohms) of the motor sense resistor. The default # is 0.110 ohms. #stealthchop_threshold: 0 # The velocity (in mm/s) to set the "stealthChop" threshold to. When # set, "stealthChop" mode will be enabled if the stepper motor # velocity is below this value. The default is 0, which disables # "stealthChop" mode. #driver_IHOLDDELAY: 8 #driver_TPOWERDOWN: 20 #driver_TBL: 2 #driver_TOFF: 3 #driver_HEND: 0 #driver_HSTRT: 5 #driver_PWM_AUTOGRAD: True #driver_PWM_AUTOSCALE: True #driver_PWM_LIM: 12 #driver_PWM_REG: 8 #driver_PWM_FREQ: 1 #driver_PWM_GRAD: 14 #driver_PWM_OFS: 36 # Set the given register during the configuration of the TMC2208 # chip. This may be used to set custom motor parameters. The # defaults for each parameter are next to the parameter name in the # above list.
hu: [tmc2208 stepper_x] uart_pin: # A TMC2208 PDN_UART vonalhoz csatlakoztatott tű. # Ezt a paramétert meg kell adni. #tx_pin: # Ha külön vételi és adási vonalat használ a meghajtóval való # kommunikációhoz, akkor állítsa be az uart_pin paramétert a vételi # lábra, és a tx_pin értéket az átviteli lábra. Az alapértelmezett az # uart_pin használata mind olvasáshoz, mind íráshoz. #select_pins: # A tmc2208 UART elérése előtt beállítandó tűk vesszővel elválasztott # listája. Ez hasznos lehet egy analóg mux konfigurálásakor az UART # kommunikációhoz. Az alapértelmezett az, hogy nem konfigurál # semmilyen érintkezőt. #interpolate: True # Ha True, engedélyezze a lépésinterpolációt (a motorvezérlő belsőleg # 256 mikrolépéses sebességgel léptet). Ez az interpoláció egy kis # szisztémás pozícióeltérést vezet be. A részletekért lásd: # TMC_Drivers.md. Az alapértelmezett érték True. run_current: # Az áramerősség (amper RMS-ben) a meghajtó konfigurálásához a # léptetőmotor mozgása során. Ezt a paramétert meg kell adni. #hold_current: # Az az áramerősség (amper RMS-ben), amelyet a motorvezérlő akkor # ad le, amikor a léptető nem mozog. A hold_current beállítása nem # ajánlott (a részletekért lásd: TMC_Drivers.md). # Az alapértelmezett az, hogy nem csökkenti az áramerősséget. #sense_resistor: 0.110 # A motor érzékelő ellenállásának ellenállása (ohmban). # Az alapértelmezett érték 0,110 ohm. #stealthchop_threshold: 0 # A „StealthChop” küszöbérték beállításához szükséges sebesség # (mm/mp-ben). Ha be van állítva, a "StealthChop" mód engedélyezve # lesz, ha a léptetőmotor sebessége ez alatt az érték alatt van. # Az alapértelmezett érték 0, ami letiltja a "StealthChop" módot. #driver_IHOLDDELAY: 8 #driver_TPOWERDOWN: 20 #driver_TBL: 2 #driver_TOFF: 3 #driver_HEND: 0 #driver_HSTRT: 5 #driver_PWM_AUTOGRAD: True #driver_PWM_AUTOSCALE: True #driver_PWM_LIM: 12 #driver_PWM_REG: 8 #driver_PWM_FREQ: 1 #driver_PWM_GRAD: 14 #driver_PWM_OFS: 36 # Állítsa be a megadott regisztert a TMC2208 chip konfigurációja során. # Ez egyéni motorparaméterek beállítására használható. Az egyes # paraméterek alapértelmezett értékei a paraméter neve mellett # találhatók a fenti listában.
it: [tmc2208 stepper_x] uart_pin: # Il pin collegato al PDN_UART del TMC2208 . # Questo parametro deve essere fornito. #tx_pin: # Se si utilizzano linee di ricezione e trasmissione separate per # comunicare con il driver, impostare uart_pin sul pin di ricezione e # tx_pin sul pin di trasmissione. L'impostazione predefinita è usare uart_pin sia per la lettura che per la scrittura. #select_pins: # Un elenco separato da virgole di pin da impostare prima di accedere # all'UART tmc2208. Questo può essere utile per configurare un mux # analogico per la comunicazione UART. L'impostazione predefinita è # di non configurare alcun pin. #interpolate: True # Se True, abilita l'interpolazione del passo (il driver eseguirà un passo # intero con 256 micropassi). Questa interpolazione # introduce una piccola deviazione posizionale sistemica - vedere # TMC_Drivers.md per i dettagli. L'impostazione predefinita è True. run_current: # La quantità di corrente (in ampere RMS) per configurare il driver da # utilizzare durante il movimento passo-passo. # Questo parametro deve essere fornito. #hold_current: # La quantità di corrente (in ampere RMS) per configurare il driver da # utilizzare quando lo stepper non è in movimento. L'impostazione di # hold_current non è consigliata (consultare TMC_Drivers.md per i # dettagli). L'impostazione predefinita è di non ridurre la corrente. #sense_resistor: 0.110 # La resistenza (in ohm) del resistore di rilevamento del motore. # Il valore predefinito è 0,110 ohm. #stealthchop_threshold: 0 # La velocità (in mm/s) su cui impostare la soglia "stealthChop". Se # impostata, la modalità "stealthChop" sarà abilitata se la velocità del # motore passo-passo è inferiore a questo valore. Il valore predefinito # è 0, che disabilita la modalità "stealthChop". #driver_IHOLDDELAY: 8 #driver_TPOWERDOWN: 20 #driver_TBL: 2 #driver_TOFF: 3 #driver_HEND: 0 #driver_HSTRT: 5 #driver_PWM_AUTOGRAD: True #driver_PWM_AUTOSCALE: True #driver_PWM_LIM: 12 #driver_PWM_REG: 8 #driver_PWM_FREQ: 1 #driver_PWM_GRAD: 14 #driver_PWM_OFS: 36 # Impostare il registro dato durante la configurazione del chip TMC2208. # Può essere utilizzato per impostare parametri motore personalizzati. # I valori predefiniti per ciascun parametro sono accanto al nome del # parametro nell'elenco precedente.

source: [tmc2660 stepper_x] cs_pin: # The pin corresponding to the TMC2660 chip select line. This pin # will be set to low at the start of SPI messages and set to high # after the message transfer completes. This parameter must be # provided. #spi_speed: 4000000 # SPI bus frequency used to communicate with the TMC2660 stepper # driver. The default is 4000000. #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # See the "common SPI settings" section for a description of the # above parameters. #interpolate: True # If true, enable step interpolation (the driver will internally # step at a rate of 256 micro-steps). This only works if microsteps # is set to 16. Interpolation does introduce a small systemic # positional deviation - see TMC_Drivers.md for details. The default # is True. run_current: # The amount of current (in amps RMS) used by the driver during # stepper movement. This parameter must be provided. #sense_resistor: # The resistance (in ohms) of the motor sense resistor. This # parameter must be provided. #idle_current_percent: 100 # The percentage of the run_current the stepper driver will be # lowered to when the idle timeout expires (you need to set up the # timeout using a [idle_timeout] config section). The current will # be raised again once the stepper has to move again. Make sure to # set this to a high enough value such that the steppers do not lose # their position. There is also small delay until the current is # raised again, so take this into account when commanding fast moves # while the stepper is idling. The default is 100 (no reduction). #driver_TBL: 2 #driver_RNDTF: 0 #driver_HDEC: 0 #driver_CHM: 0 #driver_HEND: 3 #driver_HSTRT: 3 #driver_TOFF: 4 #driver_SEIMIN: 0 #driver_SEDN: 0 #driver_SEMAX: 0 #driver_SEUP: 0 #driver_SEMIN: 0 #driver_SFILT: 0 #driver_SGT: 0 #driver_SLPH: 0 #driver_SLPL: 0 #driver_DISS2G: 0 #driver_TS2G: 3 # Set the given parameter during the configuration of the TMC2660 # chip. This may be used to set custom driver parameters. The # defaults for each parameter are next to the parameter name in the # list above. See the TMC2660 datasheet about what each parameter # does and what the restrictions on parameter combinations are. Be # especially aware of the CHOPCONF register, where setting CHM to # either zero or one will lead to layout changes (the first bit of # HDEC) is interpreted as the MSB of HSTRT in this case).
hu: [tmc2660 stepper_x] cs_pin: # A TMC2660 chip kiválasztási vonalának megfelelő tű. Ez a tű # alacsonyra lesz állítva az SPI-üzenetek elején, és magasra az # üzenetátvitel befejezése után. Ezt a paramétert meg kell adni. #spi_speed: 4000000 # A TMC2660 léptető meghajtóval való kommunikációhoz használt # SPI-busz-frekvencia. Az alapértelmezett érték 4000000. #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # A fenti paraméterek leírását a „általános SPI-beállítások” # részben találja. #interpolate: True # Ha True, engedélyezze a lépésinterpolációt (az illesztőprogram # belsőleg 256 mikrolépéses sebességgel léptet). Ez csak akkor # működik, ha a mikrolépések 16-ra vannak állítva. Az interpoláció # egy kis szisztémás pozícióeltérést vezet be. A részletekért lásd a # TMC_Drivers.md fájlt. Az alapértelmezett érték True. run_current: # A motorvezérlő által a léptető mozgása során leadott áram erőssége # (amper RMS-ben). Ezt a paramétert meg kell adni. #sense_resistor: # A motor érzékelő ellenállásának ellenállása (ohmban). # Ezt a paramétert meg kell adni. #idle_current_percent: 100 # A motorvezérlő run_current százalékos aránya lecsökken, amikor az # üresjárati időtúllépés lejár (az időtúllépést az [idle_timeout] # konfigurációs szakaszban kell beállítani). Az áramerősség ismét # megemelkedik, ha a léptetőnek ismét mozognia kell. Ügyeljen arra, # hogy ezt elég magas értékre állítsa be, hogy a léptetők ne veszítsék el # pozíciójukat. Van egy kis késleltetés is, amíg az áram ismét # megemelkedik, ezért ezt vegye figyelembe, amikor a léptető # alapjárata közben gyors mozdulatokat ad parancsba. # Az alapértelmezett érték 100 (nincs csökkentés). #driver_TBL: 2 #driver_RNDTF: 0 #driver_HDEC: 0 #driver_CHM: 0 #driver_HEND: 3 #driver_HSTRT: 3 #driver_TOFF: 4 #driver_SEIMIN: 0 #driver_SEDN: 0 #driver_SEMAX: 0 #driver_SEUP: 0 #driver_SEMIN: 0 #driver_SFILT: 0 #driver_SGT: 0 #driver_SLPH: 0 #driver_SLPL: 0 #driver_DISS2G: 0 #driver_TS2G: 3 # Állítsa be a megadott paramétert a TMC2660 chip konfigurációja során. # Ez egyéni motorvezérlő paraméterek beállítására használható. # Az egyes paraméterek alapértelmezett értékei a paraméter neve # mellett találhatók a fenti listában. Tekintse meg a TMC2660 adatlapját # az egyes paraméterek működéséről és a paraméter kombinációk # korlátozásairól. Különös figyelmet kell fordítani a CHOPCONF # regiszterre, ahol a CHM nullára vagy egyesre állítása # elrendezésmódosításokhoz vezet (a HDEC első bitje) ebben az esetben # a HSTRT MSB-jeként értelmeződik).
it: [tmc2660 stepper_x] cs_pin: # Il pin corrispondente al pin di selezione del chip TMC2660. Questo pin # verrà impostato su basso all'inizio dei messaggi SPI e impostato su # alto al termine del trasferimento del messaggio. Questo parametro # deve essere fornito. #spi_speed: 4000000 # Frequenza bus SPI utilizzata per comunicare con il driver # passo-passo TMC2660. Il valore predefinito è 4000000. #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # Vedere la sezione "impostazioni comuni SPI" per una descrizione # dei parametri di cui sopra. #interpolate: True # Se true, abilita l'interpolazione del passo (il driver eseguirà un passo # interno a una velocità di 256 micropassi). Funziona solo se microsteps # è impostato su 16. L'interpolazione introduce una piccola deviazione # posizionale sistemica - vedere TMC_Drivers.md per i dettagli. # L'impostazione predefinita è Vero. run_current: # La quantità di corrente (in ampere RMS) utilizzata dal driver durante # il movimento passo-passo. Questo parametro deve essere fornito. #sense_resistor: # La resistenza (in ohm) del resistore di rilevamento del motore. # Questo parametro deve essere fornito. #idle_current_percent: 100 # La percentuale di run_current a cui il driver stepper sarà ridotto allo # scadere del timeout di inattività (è necessario impostare il timeout # utilizzando una sezione di configurazione [idle_timeout]). La corrente # verrà nuovamente aumentata una volta che lo stepper dovrà muoversi # di nuovo. Assicurati di impostarlo su un valore sufficientemente alto in # modo che gli stepper non perdano la loro posizione. C'è anche un piccolo # ritardo fino a quando la corrente non viene nuovamente aumentata, # quindi tienine conto quando comandi mosse veloci mentre lo stepper è # al minimo. Il valore predefinito è 100 (nessuna riduzione). #driver_TBL: 2 #driver_RNDTF: 0 #driver_HDEC: 0 #driver_CHM: 0 #driver_HEND: 3 #driver_HSTRT: 3 #driver_TOFF: 4 #driver_SEIMIN: 0 #driver_SEDN: 0 #driver_SEMAX: 0 #driver_SEUP: 0 #driver_SEMIN: 0 #driver_SFILT: 0 #driver_SGT: 0 #driver_SLPH: 0 #driver_SLPL: 0 #driver_DISS2G: 0 #driver_TS2G: 3 # Imposta il parametro indicato durante la configurazione del chip TMC2660. # Questo può essere utilizzato per impostare parametri del driver personalizzati. # Le impostazioni predefinite per ogni parametro sono accanto al nome del # parametro nell'elenco sopra. Vedere la scheda tecnica del TMC2660 su cosa # fa ogni parametro e quali sono le restrizioni sulle combinazioni di parametri. # Prestare particolare attenzione al registro CHOPCONF, dove l'impostazione # di CHM su zero o uno comporterà modifiche al layout (il primo bit di HDEC) # viene interpretato come MSB di HSTRT in questo caso).

source: [tmc5160 stepper_x] cs_pin: # The pin corresponding to the TMC5160 chip select line. This pin # will be set to low at the start of SPI messages and raised to high # after the message completes. This parameter must be provided. #spi_speed: #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # See the "common SPI settings" section for a description of the # above parameters. #chain_position: #chain_length: # These parameters configure an SPI daisy chain. The two parameters # define the stepper position in the chain and the total chain length. # Position 1 corresponds to the stepper that connects to the MOSI signal. # The default is to not use an SPI daisy chain. #interpolate: True # If true, enable step interpolation (the driver will internally # step at a rate of 256 micro-steps). The default is True. run_current: # The amount of current (in amps RMS) to configure the driver to use # during stepper movement. This parameter must be provided. #hold_current: # The amount of current (in amps RMS) to configure the driver to use # when the stepper is not moving. Setting a hold_current is not # recommended (see TMC_Drivers.md for details). The default is to # not reduce the current. #sense_resistor: 0.075 # The resistance (in ohms) of the motor sense resistor. The default # is 0.075 ohms. #stealthchop_threshold: 0 # The velocity (in mm/s) to set the "stealthChop" threshold to. When # set, "stealthChop" mode will be enabled if the stepper motor # velocity is below this value. The default is 0, which disables # "stealthChop" mode. #driver_IHOLDDELAY: 6 #driver_TPOWERDOWN: 10 #driver_TBL: 2 #driver_TOFF: 3 #driver_HEND: 2 #driver_HSTRT: 5 #driver_FD3: 0 #driver_TPFD: 4 #driver_CHM: 0 #driver_VHIGHFS: 0 #driver_VHIGHCHM: 0 #driver_DISS2G: 0 #driver_DISS2VS: 0 #driver_PWM_AUTOSCALE: True #driver_PWM_AUTOGRAD: True #driver_PWM_FREQ: 0 #driver_FREEWHEEL: 0 #driver_PWM_GRAD: 0 #driver_PWM_OFS: 30 #driver_PWM_REG: 4 #driver_PWM_LIM: 12 #driver_SGT: 0 #driver_SEMIN: 0 #driver_SEUP: 0 #driver_SEMAX: 0 #driver_SEDN: 0 #driver_SEIMIN: 0 #driver_SFILT: 0 # Set the given register during the configuration of the TMC5160 # chip. This may be used to set custom motor parameters. The # defaults for each parameter are next to the parameter name in the # above list. #diag0_pin: #diag1_pin: # The micro-controller pin attached to one of the DIAG lines of the # TMC5160 chip. Only a single diag pin should be specified. The pin # is "active low" and is thus normally prefaced with "^!". Setting # this creates a "tmc5160_stepper_x:virtual_endstop" virtual pin # which may be used as the stepper's endstop_pin. Doing this enables # "sensorless homing". (Be sure to also set driver_SGT to an # appropriate sensitivity value.) The default is to not enable # sensorless homing.
hu: [tmc5160 stepper_x] cs_pin: # A TMC5160 chip kiválasztási vonalának megfelelő tű. Ez a tű alacsony # értékre lesz állítva az SPI-üzenetek elején, és az üzenet befejezése után # magasra változik. Ezt a paramétert meg kell adni. #spi_speed: #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # A fenti paraméterek leírását az „általános SPI-beállítások” # részben találja. #chain_position: #chain_length: # Ezek a paraméterek egy SPI-láncot konfigurálnak. A két paraméter # határozza meg a léptető pozícióját a láncban és a teljes lánchosszt. # Az 1. pozíció a MOSI jelhez csatlakozó léptetőnek felel meg. # Az alapértelmezés szerint nem használ SPI-láncot. #interpolate: True # Ha True, engedélyezze a lépésinterpolációt (a motorvezérlő belsőleg # 256 mikrolépéses sebességgel léptet). Az alapértelmezett érték True. run_current: # Az áramerősség (amper RMS-ben) a meghajtó konfigurálásához a # léptető mozgása során. Ezt a paramétert meg kell adni. #hold_current: # Az az áramerősség (amper RMS-ben), amelyet a motorvezérlő akkor # ad le, amikor a léptető nem mozog. A hold_current beállítása nem # ajánlott (a részletekért lásd: TMC_Drivers.md). # Az alapértelmezett az, hogy nem csökkenti az áramerősséget. #sense_resistor: 0.075 # A motor érzékelő ellenállásának ellenállása (ohmban). # Az alapértelmezett érték 0,075 ohm. #stealthchop_threshold: 0 # A „StealthChop” küszöbérték beállításához szükséges sebesség # (mm/mp-ben). Ha be van állítva, a "StealthChop" mód engedélyezve # lesz, ha a léptetőmotor sebessége ez alatt az érték alatt van. # Az alapértelmezett érték 0, ami letiltja a "StealthChop" módot. #driver_IHOLDDELAY: 6 #driver_TPOWERDOWN: 10 #driver_TBL: 2 #driver_TOFF: 3 #driver_HEND: 2 #driver_HSTRT: 5 #driver_FD3: 0 #driver_TPFD: 4 #driver_CHM: 0 #driver_VHIGHFS: 0 #driver_VHIGHCHM: 0 #driver_DISS2G: 0 #driver_DISS2VS: 0 #driver_PWM_AUTOSCALE: True #driver_PWM_AUTOGRAD: True #driver_PWM_FREQ: 0 #driver_FREEWHEEL: 0 #driver_PWM_GRAD: 0 #driver_PWM_OFS: 30 #driver_PWM_REG: 4 #driver_PWM_LIM: 12 #driver_SGT: 0 #driver_SEMIN: 0 #driver_SEUP: 0 #driver_SEMAX: 0 #driver_SEDN: 0 #driver_SEIMIN: 0 #driver_SFILT: 0 # Állítsa be a megadott regisztert a TMC5160 chip konfigurációja során. # Ez egyéni motorparaméterek beállítására használható. Az egyes # paraméterek alapértelmezett értékei a paraméter neve mellett # találhatók a fenti listában. #diag0_pin: #diag1_pin: # A mikrovezérlő tűje a TMC5160 chip egyik DIAG vonalához csatlakozik. # Csak egyetlen DIAG tűt kell megadni. A tű "active low", ezért általában # "^!" előtagja van. Ennek beállítása egy # „tmc5160_stepper_x:virtual_endstop” virtuális tűt hoz létre, amely a # léptető endstop_pin-jeként használható. Ez lehetővé teszi az „érzékelő # nélküli kezdőpont felvétel” funkciót. (Győződjön meg arról, hogy a # driver_SGT-t is megfelelő érzékenységi értékre állítja be.) # Az alapértelmezés az, hogy nem engedélyezi az érzékelő nélküli # kezdőpont felvételt.
it: [tmc5160 stepper_x] cs_pin: # Il pin corrispondente al pin di selezione del chip TMC5160. Questo pin verrà impostato su basso all'inizio dei messaggi SPI e portato su alto al termine del messaggio. Questo parametro deve essere fornito. #spi_speed: #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # Vedere la sezione "impostazioni SPI comuni" per una # descrizione dei parametri di cui sopra. #chain_position: #chain_length: # Questi parametri configurano una daisy chain SPI. I due # parametri definiscono la posizione dello stepper nella catena # e la lunghezza totale della catena. La posizione 1 corrisponde # allo stepper che si collega al segnale MOSI. L'impostazione # predefinita è di non utilizzare un collegamento a margherita SPI. #interpolate: True # Se true, abilita l'interpolazione del passo (il driver eseguirà un # passo interno con 256 micropassi). # L'impostazione predefinita è True. run_current: # La quantità di corrente (in ampere RMS) per configurare il driver # da utilizzare durante il movimento. # Questo parametro deve essere fornito. #hold_current: # La quantità di corrente (in ampere RMS) per configurare il driver # da utilizzare quando lo stepper non è in movimento. L'impostazione # di hold_current non è consigliata (consultare TMC_Drivers.md per i # dettagli). L'impostazione predefinita è di non ridurre la corrente. #sense_resistor: 0.075 # La resistenza (in ohm) del resistore di rilevamento del motore. # Il valore predefinito è 0,075 ohm. #stealthchop_threshold: 0 # La velocità (in mm/s) su cui impostare la soglia "stealthChop". Se # impostata, la modalità "stealthChop" sarà abilitata se la velocità del # motore passo-passo è inferiore a questo valore. Il valore predefinito # è 0, che disabilita la modalità "stealthChop". #driver_IHOLDDELAY: 6 #driver_TPOWERDOWN: 10 #driver_TBL: 2 #driver_TOFF: 3 #driver_HEND: 2 #driver_HSTRT: 5 #driver_FD3: 0 #driver_TPFD: 4 #driver_CHM: 0 #driver_VHIGHFS: 0 #driver_VHIGHCHM: 0 #driver_DISS2G: 0 #driver_DISS2VS: 0 #driver_PWM_AUTOSCALE: True #driver_PWM_AUTOGRAD: True #driver_PWM_FREQ: 0 #driver_FREEWHEEL: 0 #driver_PWM_GRAD: 0 #driver_PWM_OFS: 30 #driver_PWM_REG: 4 #driver_PWM_LIM: 12 #driver_SGT: 0 #driver_SEMIN: 0 #driver_SEUP: 0 #driver_SEMAX: 0 #driver_SEDN: 0 #driver_SEIMIN: 0 #driver_SFILT: 0 # Impostare il registro dato durante la configurazione del chip # TMC5160. Può essere utilizzato per impostare parametri motore # personalizzati. I valori predefiniti per ciascun parametro sono # accanto al nome del parametro nell'elenco precedente. #diag0_pin: #diag1_pin: # Il pin del microcontrollore collegato a una delle linee DIAG del chip # TMC5160. È necessario specificare un solo pin diag. Il pin è "attivo # basso" ed è quindi normalmente preceduto da "^!". L'impostazione # di questo crea un pin virtuale "tmc5160_stepper_x:virtual_endstop" # che può essere utilizzato come endstop_pin dello stepper. In questo # modo si abilita l'"homing sensorless". (Assicurarsi di impostare anche # driver_SGT su un valore di sensibilità appropriato.) L'impostazione # predefinita è di non abilitare l'homing sensorless.
