Repository: Klipper3d/klipper-translations
Catalog: locales/*/LC_MESSAGES/Config_Reference.po
Languages: hu, it

source: [mcp4451 my_digipot] i2c_address: # The i2c address that the chip is using on the i2c bus. This # parameter must be provided. #i2c_mcu: #i2c_bus: #i2c_speed: # See the "common I2C settings" section for a description of the # above parameters. #wiper_0: #wiper_1: #wiper_2: #wiper_3: # The value to statically set the given MCP4451 "wiper" to. This is # typically set to a number between 0.0 and 1.0 with 1.0 being the # highest resistance and 0.0 being the lowest resistance. However, # the range may be changed with the 'scale' parameter (see below). # If a wiper is not specified then it is left unconfigured. #scale: # This parameter can be used to alter how the 'wiper_x' parameters # are interpreted. If provided, then the 'wiper_x' parameters should # be between 0.0 and 'scale'. This may be useful when the MCP4451 is # used to set stepper voltage references. The 'scale' can be set to # the equivalent stepper amperage if the MCP4451 were at its highest # resistance, and then the 'wiper_x' parameters can be specified # using the desired amperage value for the stepper. The default is # to not scale the 'wiper_x' parameters.
hu: [mcp4451 my_digipot] i2c_address: # Az I2C cím, amelyet a chip az I2C buszon használ. # Ezt a paramétert meg kell adni. #i2c_mcu: #i2c_bus: #i2c_speed: # A fenti paraméterek leírását lásd az "általános I2C beállítások" # részben. #wiper_0: #wiper_1: #wiper_2: #wiper_3: # Az az érték, amelyre az adott MCP4451 "wiper" statikusan beállítható. # Ez általában 0,0 és 1,0 közötti számra van beállítva, ahol az 1,0 a # legnagyobb ellenállás, a 0,0 pedig a legkisebb ellenállás. # A tartomány azonban módosítható a 'scale' paraméterrel (lásd alább). # Ha nincs megadva 'wiper', akkor az konfigurálatlanul marad. #scale: # Ezzel a paraméterrel módosítható a 'wiper_x' paraméterek értelmezése. # Ha meg van adva, akkor a 'wiper_x' paraméternek 0,0 és 'scale' között # kell lennie. Ez akkor lehet hasznos, ha az MCP4451-et a léptető # feszültségreferenciák beállítására használják. A 'scale' beállítható az # egyenértékű léptető áramerősségre, ha az MCP4451 a legnagyobb # ellenálláson volt, majd a 'wiper_x' paraméterek megadhatók a # léptető kívánt áramerőssége segítségével. # Az alapértelmezés az, hogy a 'wiper_x' paramétereket nem skálázzuk.
it: [mcp4451 my_digipot] i2c_address: # L'indirizzo i2c utilizzato dal chip sul bus i2c. Questo parametro deve # essere fornito. #i2c_mcu: #i2c_bus: #i2c_speed: # Vedere la sezione "impostazioni I2C comuni" per una descrizione # dei parametri di cui sopra. #wiper_0: #wiper_1: #wiper_2: #wiper_3: # Il valore su cui impostare staticamente il "wiper" MCP4451 # specificato. Questo è in genere impostato su un numero compreso # tra 0,0 e 1,0 con 1,0 come resistenza più alta e 0,0 come resistenza # più bassa. Tuttavia, l'intervallo può essere modificato con il parametro # 'scale' (vedi sotto). Se non viene specificato un wiper, non viene # configurato. #scale: # Questo parametro può essere utilizzato per modificare il modo in # cui vengono interpretati i parametri 'wiper_x'. Se forniti, i parametri # 'wiper_x' dovrebbero essere compresi tra 0.0 e 'scale'. Questo può # essere utile quando l'MCP4451 viene utilizzato per impostare i # riferimenti di tensione stepper. La "scala" può essere impostata # sull'amperaggio stepper equivalente se l'MCP4451 fosse alla sua # massima resistenza, quindi i parametri "wiper_x" possono essere # specificati utilizzando il valore di amperaggio desiderato per lo # stepper. L'impostazione predefinita è di non ridimensionare i # parametri 'wiper_x'.

source: [mcp4728 my_dac] #i2c_address: 96 # The i2c address that the chip is using on the i2c bus. The default # is 96. #i2c_mcu: #i2c_bus: #i2c_speed: # See the "common I2C settings" section for a description of the # above parameters. #channel_a: #channel_b: #channel_c: #channel_d: # The value to statically set the given MCP4728 channel to. This is # typically set to a number between 0.0 and 1.0 with 1.0 being the # highest voltage (2.048V) and 0.0 being the lowest voltage. # However, the range may be changed with the 'scale' parameter (see # below). If a channel is not specified then it is left # unconfigured. #scale: # This parameter can be used to alter how the 'channel_x' parameters # are interpreted. If provided, then the 'channel_x' parameters # should be between 0.0 and 'scale'. This may be useful when the # MCP4728 is used to set stepper voltage references. The 'scale' can # be set to the equivalent stepper amperage if the MCP4728 were at # its highest voltage (2.048V), and then the 'channel_x' parameters # can be specified using the desired amperage value for the # stepper. The default is to not scale the 'channel_x' parameters.
hu: [mcp4728 my_dac] #i2c_address: 96 # Az I2C cím, amelyet a chip az I2C buszon használ. # Az alapértelmezett érték 96. #i2c_mcu: #i2c_bus: #i2c_speed: # A fenti paraméterek leírását lásd az "általános I2C beállítások" # részben. #channel_a: #channel_b: #channel_c: #channel_d: # Az adott MCP4728 csatorna statikus beállítására szolgáló érték. # Ez általában 0,0 és 1,0 közötti számra van beállítva, ahol az 1,0 a # legmagasabb feszültség (2,048 V), a 0,0 pedig a legalacsonyabb # feszültség. A tartomány azonban módosítható a 'scale' # paraméterrel (lásd alább). # Ha egy csatorna nincs megadva, akkor az konfigurálatlanul marad. #scale: # Ez a paraméter használható a 'channel_x' paraméterek # értelmezésének megváltoztatására. Ha meg van adva, akkor a # 'channel_x' paraméternek 0,0 és 'scale' között kell lennie. Ez akkor # lehet hasznos, ha az MCP4728-at a léptető feszültségreferenciák # beállítására használják. A 'scale' beállítható az egyenértékű léptető # áramerősségére, ha az MCP4728 a legmagasabb feszültségen volt # (2,048 V), majd a 'channel_x' paraméterek megadhatók a léptető # kívánt amperértékével. Az alapértelmezett az, hogy nem # méretezi a 'channel_x' paramétereket.
it: [mcp4728 my_dac] #i2c_address: 96 # L'indirizzo i2c utilizzato dal chip sul bus i2c. Il valore predefinito # è 96. #i2c_mcu: #i2c_bus: #i2c_speed: # Vedere la sezione "impostazioni I2C comuni" per una descrizione # dei parametri di cui sopra. #channel_a: #channel_b: #channel_c: #channel_d: # Il valore su cui impostare staticamente il canale MCP4728 # specificato. Questo è in genere impostato su un numero compreso # tra 0,0 e 1,0 con 1,0 come tensione più alta (2,048 V) e 0,0 come # tensione più bassa. Tuttavia, l'intervallo può essere modificato con # il parametro 'scale' (vedi sotto). Se un canale non è specificato, # non viene configurato. #scale: # Questo parametro può essere utilizzato per modificare il modo # in cui vengono interpretati i parametri 'channel_x'. Se forniti, i # parametri 'channel_x' dovrebbero essere compresi tra 0.0 e 'scale'. # Questo può essere utile quando l'MCP4728 viene utilizzato per # impostare i riferimenti di tensione stepper. La "scala" può essere # impostata sull'amperaggio stepper equivalente se l'MCP4728 # fosse alla sua tensione più alta (2,048 V), e quindi i parametri # "channel_x" possono essere specificati utilizzando il valore di # amperaggio desiderato per lo stepper. L'impostazione # predefinita è di non ridimensionare i parametri 'channel_x'.

source: [mcp4018 my_digipot] scl_pin: # The SCL "clock" pin. This parameter must be provided. sda_pin: # The SDA "data" pin. This parameter must be provided. wiper: # The value to statically set the given MCP4018 "wiper" to. This is # typically set to a number between 0.0 and 1.0 with 1.0 being the # highest resistance and 0.0 being the lowest resistance. However, # the range may be changed with the 'scale' parameter (see below). # This parameter must be provided. #scale: # This parameter can be used to alter how the 'wiper' parameter is # interpreted. If provided, then the 'wiper' parameter should be # between 0.0 and 'scale'. This may be useful when the MCP4018 is # used to set stepper voltage references. The 'scale' can be set to # the equivalent stepper amperage if the MCP4018 is at its highest # resistance, and then the 'wiper' parameter can be specified using # the desired amperage value for the stepper. The default is to not # scale the 'wiper' parameter.
hu: [mcp4018 my_digipot] scl_pin: # Az SCL "óra" tűje. Ezt a paramétert meg kell adni. sda_pin: # Az SDA "adat" tűje. Ezt a paramétert meg kell adni. wiper: # Az az érték, amelyre az adott MCP4018 "wiper" statikusan beállítható. # Ez általában 0,0 és 1,0 közötti számra van beállítva, ahol az 1,0 a # legnagyobb ellenállás, a 0,0 pedig a legkisebb ellenállás. # A tartomány azonban módosítható a 'scale' paraméterrel (lásd alább). # Ezt a paramétert meg kell adni. #scale: # Ezzel a paraméterrel módosítható a 'wiper' paraméter értelmezése. # Ha van, akkor az 'wiper' paraméternek 0,0 és 'scale' között kell lennie. # Ez akkor lehet hasznos, ha az MCP4018-at a léptető feszültségreferenciák # beállítására használják. A 'scale' beállítható az egyenértékű léptető # áramerősségére, ha az MCP4018 a legnagyobb ellenálláson van, # majd a 'wiper' paraméter megadható a léptető kívánt amperértékével. # Az alapértelmezett beállítás az, hogy nem skálázza a 'wiper' paramétert.
it: [mcp4018 my_digipot] scl_pin: # Il pin "clock" SCL. Questo parametro deve essere fornito. sda_pin: # Il pin "dati" SDA. Questo parametro deve essere fornito. wiper: # Il valore su cui impostare staticamente il "Wiper" MCP4018 # specificato. Questo è in genere impostato su un numero compreso # tra 0,0 e 1,0 con 1,0 come resistenza più alta e 0,0 come resistenza # più bassa. Tuttavia, l'intervallo può essere modificato con il # parametro 'scale' (vedi sotto). Questo parametro deve essere fornito. #scale: # Questo parametro può essere utilizzato per modificare il modo in # cui viene interpretato il parametro 'wiper'. Se fornito, il parametro # 'wiper' dovrebbe essere compreso tra 0.0 e 'scale'. Questo può essere # utile quando l'MCP4018 viene utilizzato per impostare i riferimenti di # tensione stepper. La "scala" può essere impostata sull'amperaggio # stepper equivalente se l'MCP4018 è alla sua massima resistenza, # quindi è possibile specificare il parametro "wiper" utilizzando il # valore di amperaggio desiderato per lo stepper. L'impostazione # predefinita è di non ridimensionare il parametro 'wiper'.

source: [display] lcd_type: hd44780 # Set to "hd44780" for hd44780 displays. rs_pin: e_pin: d4_pin: d5_pin: d6_pin: d7_pin: # The pins connected to an hd44780 type lcd. These parameters must # be provided. #hd44780_protocol_init: True # Perform 8-bit/4-bit protocol initialization on an hd44780 display. # This is necessary on real hd44780 devices. However, one may need # to disable this on some "clone" devices. The default is True. #line_length: # Set the number of characters per line for an hd44780 type lcd. # Possible values are 20 (default) and 16. The number of lines is # fixed to 4. ...
hu: [display] lcd_type: hd44780 # Állítsa "hd44780" értékre a hd44780 kijelzőkhöz. rs_pin: e_pin: d4_pin: d5_pin: d6_pin: d7_pin: # A tűk egy hd44780 típusú LCD-hez csatlakoznak. # Ezeket a paramétereket meg kell adni. #hd44780_protocol_init: True # Végezzen 8 bites/4 bites protokoll inicializálást hd44780 kijelzőn. # Ez szükséges a valódi hd44780-as eszközökön. Előfordulhat # azonban, hogy ezt bizonyos "klónozó" eszközökön le kell tiltani. # Az alapértelmezett érték True. #line_length: # Állítsa be a soronkénti karakterek számát egy hd44780 típusú # LCD-n. A lehetséges értékek: 20 (alapértelmezett) és 16. # A sorok száma 4-re van rögzítve. ...

source: [display] lcd_type: hd44780_spi # Set to "hd44780_spi" for hd44780_spi displays. latch_pin: spi_software_sclk_pin: spi_software_mosi_pin: spi_software_miso_pin: # The pins connected to the shift register controlling the display. # The spi_software_miso_pin needs to be set to an unused pin of the # printer mainboard as the shift register does not have a MISO pin, # but the software spi implementation requires this pin to be # configured. #hd44780_protocol_init: True # Perform 8-bit/4-bit protocol initialization on an hd44780 display. # This is necessary on real hd44780 devices. However, one may need # to disable this on some "clone" devices. The default is True. #line_length: # Set the number of characters per line for an hd44780 type lcd. # Possible values are 20 (default) and 16. The number of lines is # fixed to 4. ...
hu: [display] lcd_type: hd44780_spi # Állítsa be a "hd44780_spi" értéket a hd44780_spi kijelzőkhöz. latch_pin: spi_software_sclk_pin: spi_software_mosi_pin: spi_software_miso_pin: # A kijelzőt vezérlő műszakregiszterhez csatlakoztatott tűk. # Az spi_software_miso_pin-t a nyomtató alaplapjának használaton # kívüli tűjére kell állítani, mivel a shift regiszternek nincs MISO tűje, # de a szoftver SPI megvalósításához ezt a tűt be kell állítani. #hd44780_protocol_init: True # Végezzen 8 bites/4 bites protokoll inicializálást hd44780 kijelzőn. # Ez szükséges a valódi hd44780-as eszközökön. Előfordulhat # azonban, hogy ezt bizonyos "klónozó" eszközökön le kell tiltani. # Az alapértelmezett érték True. #line_length: # Állítsa be a soronkénti karakterek számát egy hd44780 típusú LCD-n. # A lehetséges értékek: 20 (alapértelmezett) és 16. # A sorok száma 4-re van rögzítve. ...

source: [display] lcd_type: st7920 # Set to "st7920" for st7920 displays. cs_pin: sclk_pin: sid_pin: # The pins connected to an st7920 type lcd. These parameters must be # provided. ...
hu: [display] lcd_type: st7920 # Állítsa az "st7920"-ra az st7920-as kijelzőkhöz. cs_pin: sclk_pin: sid_pin: # A tűk egy st7920 típusú LCD-hez csatlakoznak. # Ezeket a paramétereket meg kell adni. ...

source: [display] lcd_type: emulated_st7920 # Set to "emulated_st7920" for emulated_st7920 displays. en_pin: spi_software_sclk_pin: spi_software_mosi_pin: spi_software_miso_pin: # The pins connected to an emulated_st7920 type lcd. The en_pin # corresponds to the cs_pin of the st7920 type lcd, # spi_software_sclk_pin corresponds to sclk_pin and # spi_software_mosi_pin corresponds to sid_pin. The # spi_software_miso_pin needs to be set to an unused pin of the # printer mainboard as the st7920 as no MISO pin but the software # spi implementation requires this pin to be configured. ...
hu: [display] lcd_type: emulated_st7920 # Állítsa az "emulated_st7920" értékre az emulated_st7920 kijelzőkhöz. en_pin: spi_software_sclk_pin: spi_software_mosi_pin: spi_software_miso_pin: # Az emulált_st7920 típusú LCD-hez csatlakoztatott érintkezők. # Az en_pin az st7920 típusú LCD cs_pin-jének, az spi_software_sclk_pin # az sclk_pin-nek, az spi_software_mosi_pin pedig a sid_pin-nek felel meg. # A spi_software_miso_pin-t a nyomtató alaplapjának egy használaton # kívüli tűjére kell beállítani, mint az st7920-at, mivel nincs MISO-tű, de a # szoftveres SPI-megvalósításhoz ezt a tűt kell konfigurálni. ...

source: [display] lcd_type: uc1701 # Set to "uc1701" for uc1701 displays. cs_pin: a0_pin: # The pins connected to a uc1701 type lcd. These parameters must be # provided. #rst_pin: # The pin connected to the "rst" pin on the lcd. If it is not # specified then the hardware must have a pull-up on the # corresponding lcd line. #contrast: # The contrast to set. The value may range from 0 to 63 and the # default is 40. ...
hu: [display] lcd_type: uc1701 # Állítsa "uc1701" értékre az uc1701 kijelzőkhöz. cs_pin: a0_pin: # Az uc1701 típusú LCD-hez csatlakoztatott tűk. # Ezeket a paramétereket meg kell adni. #rst_pin: # Az LCD "első" érintkezőjéhez csatlakoztatott tű. Ha nincs megadva, # akkor a hardvernek rendelkeznie kell egy felhúzással a # megfelelő LCD soron. #contrast: # A beállítandó kontraszt. Az érték 0 és 63 között változhat, az # alapértelmezett érték pedig 40. ...

source: [display] lcd_type: # Set to either "ssd1306" or "sh1106" for the given display type. #i2c_mcu: #i2c_bus: #i2c_speed: # Optional parameters available for displays connected via an i2c # bus. See the "common I2C settings" section for a description of # the above parameters. #cs_pin: #dc_pin: #spi_speed: #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # The pins connected to the lcd when in "4-wire" spi mode. See the # "common SPI settings" section for a description of the parameters # that start with "spi_". The default is to use i2c mode for the # display. #reset_pin: # A reset pin may be specified on the display. If it is not # specified then the hardware must have a pull-up on the # corresponding lcd line. #contrast: # The contrast to set. The value may range from 0 to 256 and the # default is 239. #vcomh: 0 # Set the Vcomh value on the display. This value is associated with # a "smearing" effect on some OLED displays. The value may range # from 0 to 63. Default is 0. #invert: False # TRUE inverts the pixels on certain OLED displays. The default is # False. #x_offset: 0 # Set the horizontal offset value on SH1106 displays. The default is # 0. ...
hu: [display] lcd_type: # Állítsa be az "ssd1306" vagy az "sh1106" értéket az adott # megjelenítési típushoz. #i2c_mcu: #i2c_bus: #i2c_speed: # Opcionális paraméterek állnak rendelkezésre az I2C buszon # keresztül csatlakoztatott kijelzőkhöz. A fenti paraméterek leírását # lásd az "általános I2C beállítások" részben. #cs_pin: #dc_pin: #spi_speed: #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # Az LCD-hez csatlakoztatott érintkezők „4 vezetékes” SPI módban. # Az „spi_” karakterrel kezdődő paraméterek leírását a „általános # SPI-beállítások” részben találja. Az alapértelmezett az I2C mód # használata a kijelzőhöz. #reset_pin: # A kijelzőn megadható egy reset tű. Ha nincs megadva, akkor a # hardvernek rendelkeznie kell egy felhúzással a megfelelő LCD # soron. #contrast: # A beállítandó kontraszt. Az érték 0 és 256 között változhat, és az # alapértelmezett a 239. #vcomh: 0 # Állítsa be a Vcomh értéket a kijelzőn. Ez az érték egyes # OLED-kijelzők "elkenődési" hatásával jár. Az érték 0 és 63 között # változhat. Az alapértelmezett érték 0. #invert: False # A TRUE megfordítja a képpontokat bizonyos OLED-kijelzőkön. # Az alapértelmezett érték False. #x_offset: 0 # Állítsa be a vízszintes eltolás értékét az SH1106 kijelzőkön. # Az alapértelmezett érték 0. ...

source: [display_data my_group_name my_data_name] position: # Comma separated row and column of the display position that should # be used to display the information. This parameter must be # provided. text: # The text to show at the given position. This field is evaluated # using command templates (see docs/Command_Templates.md). This # parameter must be provided.
hu: [display_data my_group_name my_data_name] position: # A megjelenítési pozíció vesszővel elválasztott sora és oszlopa, amelyet # az információ megjelenítéséhez kell használni. # Ezt a paramétert meg kell adni. text: # Az adott helyen megjelenítendő szöveg. Ennek a mezőnek a # kiértékelése parancssablonok segítségével történik # (lásd: docs/Command_Templates.md). Ezt a paramétert meg kell adni.

source: [display_glyph my_display_glyph] #data: # The display data, stored as 16 lines consisting of 16 bits (1 per # pixel) where '.' is a blank pixel and '*' is an on pixel (e.g., # "****************" to display a solid horizontal line). # Alternatively, one can use '0' for a blank pixel and '1' for an on # pixel. Put each display line into a separate config line. The # glyph must consist of exactly 16 lines with 16 bits each. This # parameter is optional. #hd44780_data: # Glyph to use on 20x4 hd44780 displays. The glyph must consist of # exactly 8 lines with 5 bits each. This parameter is optional. #hd44780_slot: # The hd44780 hardware index (0..7) to store the glyph at. If # multiple distinct images use the same slot then make sure to only # use one of those images in any given screen. This parameter is # required if hd44780_data is specified.
hu: [display_glyph my_display_glyph] #data: # A megjelenítési adatok 16 sorként tárolva, amelyek 16 bitből állnak # (pixelenként 1), ahol a '.' egy üres pixel, a '*' pedig egy bekapcsolt # képpont (pl. "****************" folyamatos vízszintes vonal # megjelenítéséhez). Alternatív megoldásként használhatunk „0”-t # üres pixelekhez és „1”-et a bekapcsolt pixelekhez. Helyezzen minden # megjelenítési sort egy külön konfigurációs sorba. A karakterjelnek # pontosan 16, egyenként 16 bites sorból kell állnia. # Ez a paraméter nem kötelező. #hd44780_data: # Glyph használható 20x4 hd44780 kijelzőkön. A karakterjelnek pontosan # 8, egyenként 5 bites sorból kell állnia. Ez a paraméter nem kötelező. #hd44780_slot: # A hd44780 hardver indexe (0..7) a karakterjel tárolására. Ha több # különálló kép használja ugyanazt a tárat, ügyeljen arra, hogy ezek # közül csak egyet használjon az adott képernyőn. Ez a paraméter akkor # szükséges, ha a hd44780_data meg van adva.

source: [display my_extra_display] # See the "display" section for available parameters.
hu: [display my_extra_display] # A rendelkezésre álló paramétereket lásd a "kijelző" szakaszban.
it: [display my_extra_display] # Vedere la sezione "display" per i parametri disponibili.
