Repository: Klipper3d/klipper-translations
Catalog: locales/*/LC_MESSAGES/Config_Reference.po
Languages: hu, it

source: [printer] kinematics: rotary_delta max_z_velocity: # For delta printers this limits the maximum velocity (in mm/s) of # moves with z axis movement. This setting can be used to reduce the # maximum speed of up/down moves (which require a higher step rate # than other moves on a delta printer). The default is to use # max_velocity for max_z_velocity. #minimum_z_position: 0 # The minimum Z position that the user may command the head to move # to. The default is 0. shoulder_radius: # Radius (in mm) of the horizontal circle formed by the three # shoulder joints, minus the radius of the circle formed by the # effector joints. This parameter may also be calculated as: # shoulder_radius = (delta_f - delta_e) / sqrt(12) # This parameter must be provided. shoulder_height: # Distance (in mm) of the shoulder joints from the bed, minus the # effector toolhead height. This parameter must be provided. # The stepper_a section describes the stepper controlling the rear # right arm (at 30 degrees). This section also controls the homing # parameters (homing_speed, homing_retract_dist) for all arms. [stepper_a] gear_ratio: # A gear_ratio must be specified and rotation_distance may not be # specified. For example, if the arm has an 80 toothed pulley driven # by a pulley with 16 teeth, which is in turn connected to a 60 # toothed pulley driven by a stepper with a 16 toothed pulley, then # one would specify a gear ratio of "80:16, 60:16". This parameter # must be provided. position_endstop: # Distance (in mm) between the nozzle and the bed when the nozzle is # in the center of the build area and the endstop triggers. This # parameter must be provided for stepper_a; for stepper_b and # stepper_c this parameter defaults to the value specified for # stepper_a. upper_arm_length: # Length (in mm) of the arm connecting the "shoulder joint" to the # "elbow joint". This parameter must be provided for stepper_a; for # stepper_b and stepper_c this parameter defaults to the value # specified for stepper_a. lower_arm_length: # Length (in mm) of the arm connecting the "elbow joint" to the # "effector joint". This parameter must be provided for stepper_a; # for stepper_b and stepper_c this parameter defaults to the value # specified for stepper_a. #angle: # This option specifies the angle (in degrees) that the arm is at. # The default is 30 for stepper_a, 150 for stepper_b, and 270 for # stepper_c. # The stepper_b section describes the stepper controlling the rear # left arm (at 150 degrees). [stepper_b] # The stepper_c section describes the stepper controlling the front # arm (at 270 degrees). [stepper_c] # The delta_calibrate section enables a DELTA_CALIBRATE extended # g-code command that can calibrate the shoulder endstop positions. [delta_calibrate] radius: # Radius (in mm) of the area that may be probed. This is the radius # of nozzle coordinates to be probed; if using an automatic probe # with an XY offset then choose a radius small enough so that the # probe always fits over the bed. This parameter must be provided. #speed: 50 # The speed (in mm/s) of non-probing moves during the calibration. # The default is 50. #horizontal_move_z: 5 # The height (in mm) that the head should be commanded to move to # just prior to starting a probe operation. The default is 5.
hu: [printer] kinematics: rotary_delta max_z_velocity: # Delta nyomtatóknál ez korlátozza a Z tengely mozgásának maximális # sebességét (mm/mp-ben). Ezzel a beállítással csökkenthető a fel/le # mozgások maximális sebessége (amely nagyobb lépésszámot igényel, # mint a deltanyomtatók egyéb mozgásai). Az alapértelmezett érték a # max_velocity használata a max_z_velocity értékhez. #minimum_z_position: 0 # A minimális Z pozíció, amelybe a felhasználó utasíthatja a fejet, hogy # mozduljon el. Az alapértelmezett érték 0. shoulder_radius: # A három gömbcsukló által alkotott vízszintes kör sugara (mm-ben), # mínusz az effektor csuklók által alkotott kör sugara. Ez a paraméter a # következőképpen is kiszámítható: # shoulder_radius = (delta_f - delta_e) / sqrt(12) # Ezt a paramétert meg kell adni. shoulder_height: # A gömbcsuklók távolsága (mm-ben) az ágytól, mínusz az effektor # nyomtatófej magassága. Ezt a paramétert meg kell adni. # A stepper_a szakasz a jobb hátsó kart vezérlő léptetőt írja le (30 fokban). # Ez a szakasz szabályozza az összes karhoz tartozó kezdőpont felvételi # paramétereket (homing_speed, homing_retract_dist). [stepper_a] gear_ratio: # Meg kell adni a gear_ratio értéket, és nem lehet megadni a rotation_distance # értéket. Például, ha a karban van egy 80 fogú kerék, amelyet egy 16 fogú # kerék hajt meg, és amely egy 60 fogú szíjtárcsával van összekötve, amelyet # egy 16 fogú fogaskerékkel ellátott léptetőmotor hajt meg, akkor a "80-as" # áttételi arányt kell megadni: 16, 60:16". Ezt a paramétert meg kell adni. position_endstop: # Távolság (mm-ben) a fúvóka és az ágy között, ha a fúvóka az építési terület # közepén van, és a végálláskapcsoló kiold. Ezt a paramétert meg kell adni a # stepper_a; a stepper_b és stepper_c esetén ez a paraméter alapértelmezett # értéke a stepper_a paraméterben megadott érték. upper_arm_length: # A „felső gömbcsuklót” az „alsó gömbcsuklóval” összekötő kar hossza (mm-ben). # Ezt a paramétert meg kell adni a stepper_a; a stepper_b és stepper_c esetén ez # a paraméter alapértelmezett értéke a stepper_a paraméterben megadott érték. lower_arm_length: # A „felső gömbcsukló” az „effektív csuklóval” összekötő kar hossza (mm-ben). # Ezt a paramétert meg kell adni a stepper_a; a stepper_b és stepper_c esetén # ez a paraméter alapértelmezett értéke a stepper_a paraméterben megadott érték. #angle: # Ez az opció azt a szöget adja meg (fokban), amelyben a kar áll. # Az alapértelmezett érték 30 a stepper_a, 150 a stepper_b és 270 a stepper_c. # A stepper_b szakasz a bal hátsó kart vezérlő léptetőt írja le (150 fokban). [stepper_b] # A stepper_c szakasz az első kart vezérlő léptetőt írja le (270 fokban). [stepper_c] # A delta_calibrate szakasz lehetővé teszi a DELTA_CALIBRATE kiterjesztett G-kód # parancsot, amely képes kalibrálni a felső gömbcsuklók végállás pozícióit. [delta_calibrate] radius: # A vizsgálható terület sugara (mm-ben). Ez a vizsgálandó fúvókakoordináták # sugara; Ha X-Y eltolású automata szondát használ, akkor válasszon elég kicsi # sugarat, hogy a szonda mindig az ágy fölé férjen. Ezt a paramétert meg kell adni. #speed: 50 # A nem tapintó mozgás sebessége (mm/mp-ben) a kalibrálás során. # Az alapértelmezett 50. #horizontal_move_z: 5 # Az a magasság (mm-ben), ameddig a fejet utasítani kell, hogy mozduljon el # közvetlenül a mérőművelet megkezdése előtt. Az alapértelmezett érték 5.

source: [printer] kinematics: none max_velocity: 1 max_accel: 1 # The max_velocity and max_accel parameters must be defined. The # values are not used for "none" kinematics.
hu: [printer] kinematics: none max_velocity: 1 max_accel: 1 # A max_velocity és max_accel paramétereket meg kell határozni. # Az értékeket nem használjuk a "none" kinematika esetén.
it: [printer] kinematics: none max_velocity: 1 max_accel: 1 # È necessario definire i parametri max_velocity e max_accel. I valori # non vengono utilizzati per la cinematica "none".

source: [heater_bed] heater_pin: sensor_type: sensor_pin: control: min_temp: max_temp: # See the "extruder" section for a description of the above parameters.
hu: [heater_bed] heater_pin: sensor_type: sensor_pin: control: min_temp: max_temp: # A fenti paraméterek leírását lásd az "extruder" szakaszban.
it: [heater_bed] heater_pin: sensor_type: sensor_pin: control: min_temp: max_temp: # Vedere la sezione "extruder" per una descrizione dei parametri sopra.

source: [homing_override] gcode: # A list of G-Code commands to execute in place of G28 commands # found in the normal g-code input. See docs/Command_Templates.md # for G-Code format. If a G28 is contained in this list of commands # then it will invoke the normal homing procedure for the printer. # The commands listed here must home all axes. This parameter must # be provided. #axes: xyz # The axes to override. For example, if this is set to "z" then the # override script will only be run when the z axis is homed (eg, via # a "G28" or "G28 Z0" command). Note, the override script should # still home all axes. The default is "xyz" which causes the # override script to be run in place of all G28 commands. #set_position_x: #set_position_y: #set_position_z: # If specified, the printer will assume the axis is at the specified # position prior to running the above g-code commands. Setting this # disables homing checks for that axis. This may be useful if the # head must move prior to invoking the normal G28 mechanism for an # axis. The default is to not force a position for an axis.
hu: [homing_override] gcode: # A normál G-kód bemenetben található G28 parancsok helyett # végrehajtandó G-kód parancsok listája. Lásd a # docs/Command_Templates.md fájlt a G-kód formátumokhoz. # Ha a parancsok listája G28-at tartalmaz, akkor az a nyomtatófej normál # elhelyezési eljárását indítja el. Az itt felsorolt parancsoknak minden # tengelyt kezdőponthoz kell irányítaniuk. Ezt a paramétert meg kell adni. #axes: xyz # A felülírandó tengelyek. Például, ha ez "Z"-re van állítva, akkor a # felülírási parancsfájl csak akkor fut le, ha a Z tengely be van állítva # (pl. "G28" vagy "G28 Z0" paranccsal). Ne feledje, hogy a felülírási # szkriptnek továbbra is minden tengelyt kell tartalmaznia. # Az alapértelmezés az "xyz", ami azt eredményezi, hogy a felülbíráló # szkript fut minden G28 parancs helyett. #set_position_x: #set_position_y: #set_position_z: # Ha meg van adva, a nyomtató feltételezi, hogy a tengely a megadott # pozícióban van a fenti G-kód parancsok futtatása előtt. Ennek a # beállításával letiltja az adott tengelyre vonatkozó kezdőpont # ellenőrzéseket. Ez akkor lehet hasznos, ha a nyomtatófejnek el kell # mozdulnia, mielőtt a normál G28 parancsot meghívná egy tengelyre. # Az alapértelmezés az, hogy nem erőltetik a tengely pozícióját.
it: [homing_override] gcode: # Un elenco di comandi G-Code da eseguire al posto dei comandi # G28 trovati nel normale input di G-Code. # Vedi docs/Command_Templates.md per il formato G-Code. # Se un G28 è contenuto in questo elenco di comandi, invocherà # la normale procedura di homing per la stampante. I comandi # qui elencati devono eseguire l'home di tutti gli assi. # Questo parametro deve essere fornito. #axes: xyz # Gli assi da sovrascrivere. Ad esempio, se questo è impostato # su "z", lo script di override verrà eseguito solo quando l'asse z # è azzerato (ad esempio, tramite un comando "G28" o "G28 Z0"). # Nota, lo script di sovrascrittura dovrebbe comunque ospitare # tutti gli assi. L'impostazione predefinita è "xyz" che fa sì che lo # script di override venga eseguito al posto di tutti i comandi G28. #set_position_x: #set_position_y: #set_position_z: # Se specificato, la stampante presumerà che l'asse si trovi # nella posizione specificata prima di eseguire i comandi g-code # precedenti. L'impostazione di questa opzione disabilita i # controlli di riferimento per quell'asse. Questo può essere utile # se la testa deve muoversi prima di invocare il normale # meccanismo G28 per un asse. L'impostazione predefinita è # di non forzare una posizione per un asse.

source: [endstop_phase stepper_z] #endstop_accuracy: # Sets the expected accuracy (in mm) of the endstop. This represents # the maximum error distance the endstop may trigger (eg, if an # endstop may occasionally trigger 100um early or up to 100um late # then set this to 0.200 for 200um). The default is # 4*rotation_distance/full_steps_per_rotation. #trigger_phase: # This specifies the phase of the stepper motor driver to expect # when hitting the endstop. It is composed of two numbers separated # by a forward slash character - the phase and the total number of # phases (eg, "7/64"). Only set this value if one is sure the # stepper motor driver is reset every time the mcu is reset. If this # is not set, then the stepper phase will be detected on the first # home and that phase will be used on all subsequent homes. #endstop_align_zero: False # If true then the position_endstop of the axis will effectively be # modified so that the zero position for the axis occurs at a full # step on the stepper motor. (If used on the Z axis and the print # layer height is a multiple of a full step distance then every # layer will occur on a full step.) The default is False.
hu: [endstop_phase stepper_z] #endstop_accuracy: # Beállítja a végálláskapcsoló várható pontosságát (mm-ben). Ez azt a # maximális hibatávolságot jelöli, amelyet a végállás kiválthat (pl. ha # egy végállás időnként 100 um korán vagy legfeljebb 100 um késéssel # válthat ki, akkor állítsa ezt 0,200-ra 200 um esetén). Az alapértelmezett # 4*rotation_distance/full_steps_per_rotation. #trigger_phase: # Ez határozza meg a léptetőmotor meghajtójának azt az áramot, # amelyre számítani kell, amikor megüti a végállást. Két számból áll, # amelyeket egy perjel választ el. Az áramból és áramok teljes számából # (pl. "7/64"). Csak akkor állítsa be ezt az értéket, ha biztos abban, hogy a # motorvezérlő minden alkalommal alaphelyzetbe áll az MCU # alaphelyzetbe állításakor. Ha ez nincs beállítva, akkor a léptető fázist a # rendszer az első kezdőpontban érzékeli, és ezt az áramot használja az # összes következő kezdőpontfelvételkor. #endstop_align_zero: False # Ha True, akkor a tengely position_endstop értéke ténylegesen módosul, # így a tengely nulla pozíciója a léptetőmotor teljes lépésénél megjelenik. # (Ha a Z tengelyen használjuk, és a nyomtatási réteg magassága a teljes # lépéstávolság többszöröse, akkor minden réteg egy teljes lépésben # jelenik meg.) Az alapértelmezett érték False.
it: [endstop_phase stepper_z] #endstop_accuracy: # Imposta la precisione prevista (in mm) del finecorsa. Questo rappresenta # la distanza massima di errore che il finecorsa può attivare (ad es. se un # finecorsa può occasionalmente attivarsi 100um in anticipo o fino a 100um in ritardo # quindi impostalo su 0,200 per 200 um). L'impostazione predefinita è # 4*distanza_rotazione/passi_completi_per_rotazione. #trigger_phase: # Questo specifica la fase del driver del motore passo-passo da aspettarsi # quando si raggiunge il finecorsa. È composto da due numeri separati # da un '/' - la fase e il numero totale di # fasi (ad es. "7/64"). Impostare questo valore solo se si è sicuri che il # driver del motore passo-passo viene ripristinato ogni volta che viene ripristinato l'mcu. Se questo # non è impostato, la prima fase verrà rilevata al primo home # e quella fase sarà utilizzata su tutte le abitazioni successive. #endstop_align_zero: False # Se true, la posizione_endstop dell'asse sarà effettivamente # modificato in modo che la posizione zero dell'asse avvenga a passo pieno # sul motore. (Se utilizzato sull'asse Z e la stampa # l'altezza del livello è un multiplo di una distanza di un passo intero, allora ogni # layer si eseguirà in un step completo.) L'impostazione predefinita è False.

source: [gcode_macro my_cmd] #gcode: # A list of G-Code commands to execute in place of "my_cmd". See # docs/Command_Templates.md for G-Code format. This parameter must # be provided. #variable_<name>: # One may specify any number of options with a "variable_" prefix. # The given variable name will be assigned the given value (parsed # as a Python literal) and will be available during macro expansion. # For example, a config with "variable_fan_speed = 75" might have # gcode commands containing "M106 S{ fan_speed * 255 }". Variables # can be changed at run-time using the SET_GCODE_VARIABLE command # (see docs/Command_Templates.md for details). Variable names may # not use upper case characters. #rename_existing: # This option will cause the macro to override an existing G-Code # command and provide the previous definition of the command via the # name provided here. This can be used to override builtin G-Code # commands. Care should be taken when overriding commands as it can # cause complex and unexpected results. The default is to not # override an existing G-Code command. #description: G-Code macro # This will add a short description used at the HELP command or while # using the auto completion feature. Default "G-Code macro"
hu: [gcode_macro my_cmd] #gcode: # A "my_cmd" helyett végrehajtandó G-kód-parancsok listája. Lásd a # docs/Command_Templates.md fájlt a G-kód formátumhoz. # Ezt a paramétert meg kell adni. #variable_<name>: # Bármilyen számú beállítás megadható a "változó_" előtaggal. # Az adott változónévhez a rendszer hozzárendeli az adott értéket # (Python literálként értelmezi), és elérhető lesz a makróbővítés # során. Például egy "variable_fan_speed = 75" konfigurációjú G-kód # parancsok tartalmazhatják az "M106 S{ fan_speed * 255 }" értéket. # A változók futás közben módosíthatók a SET_GCODE_VARIABLE # paranccsal (a részletekért lásd a docs/Command_Templates.md fájlt). # A változónevek nem tartalmazhatnak nagybetűket. #rename_existing: # Ezzel az opcióval a makró felülír egy meglévő G-kód parancsot, és # megadja a parancs korábbi definícióját az itt megadott néven. Ez # használható a beépített G-kód parancsok felülbírálására. Óvatosan # kell eljárni a parancsok felülbírálásakor, mivel az összetett és váratlan # eredményeket okozhat. Az alapértelmezés szerint nem írnak felül # meglévő G-kód parancsot. #description: G-Code macro # Ez hozzáad egy rövid leírást, amelyet a HELP parancsnál vagy az # automatikus kiegészítés funkció használatakor használnak. # Alapértelmezett a "G-Code macro"
it: [gcode_macro my_cmd] #gcode: # Un elenco di comandi G-Code da eseguire al posto di "my_cmd". # Vedi docs/Command_Templates.md per il formato G-Code. # Questo parametro deve essere fornito. #variable_<name>: # Si può specificare un numero qualsiasi di opzioni con un prefisso # "variable_". Al nome della variabile data verrà assegnato il valore dato # (analizzato come un valore letterale Python) e sarà disponibile durante # l'espansione della macro. Ad esempio, una configurazione con # "variable_fan_speed = 75" potrebbe avere comandi gcode contenenti # "M106 S{ fan_speed * 255 }". Le variabili possono essere modificate in # fase di esecuzione utilizzando il comando SET_GCODE_VARIABLE # (consultare docs/Command_Templates.md per i dettagli). # I nomi delle variabili potrebbero non utilizzare caratteri maiuscoli. #rename_existing: # Questa opzione farà sì che la macro ignori un comando G-Code # esistente e fornisca la definizione precedente del comando tramite # il nome fornito qui. Questo può essere usato per sovrascrivere i # comandi G-Code integrati. Prestare attenzione quando si ignorano # i comandi poiché possono causare risultati complessi e imprevisti. # L'impostazione predefinita è di non sovrascrivere un comando # G-Code esistente. #description: G-Code macro # Ciò aggiungerà una breve descrizione utilizzata al comando HELP # o durante l'utilizzo della funzione di completamento automatico. # Predefinito "G-Code macro"

source: [delayed_gcode my_delayed_gcode] gcode: # A list of G-Code commands to execute when the delay duration has # elapsed. G-Code templates are supported. This parameter must be # provided. #initial_duration: 0.0 # The duration of the initial delay (in seconds). If set to a # non-zero value the delayed_gcode will execute the specified number # of seconds after the printer enters the "ready" state. This can be # useful for initialization procedures or a repeating delayed_gcode. # If set to 0 the delayed_gcode will not execute on startup. # Default is 0.
hu: [delayed_gcode my_delayed_gcode] gcode: # A késleltetési idő letelte után végrehajtandó G-kód parancsok listája. # A G-Code sablonok támogatottak. Ezt a paramétert meg kell adni. #initial_duration: 0.0 # A kezdeti késleltetés időtartama (másodpercben). Ha nullától eltérő # értékre van állítva, a delayed_gcode a megadott számú másodpercet # hajtja végre, miután a nyomtató „kész” állapotba lép. Ez hasznos lehet # inicializálási eljárások vagy ismétlődő delayed_gcode esetén. Ha 0-ra # van állítva, a delayed_gcode nem fut le az indításkor. # Az alapértelmezett érték 0.

source: [save_variables] filename: # Required - provide a filename that would be used to save the # variables to disk e.g. ~/variables.cfg
hu: [save_variables] filename: # Kötelező - adjon meg egy fájlnevet, amelyet a változók # lemezre mentéséhez használna, pl. ~/variables.cfg
it: [save_variables] filename: # Richiesto: fornire un nome file che verrebbe utilizzato per salvare # le variabili su disco, ad es. ~/variables.cfg

source: [idle_timeout] #gcode: # A list of G-Code commands to execute on an idle timeout. See # docs/Command_Templates.md for G-Code format. The default is to run # "TURN_OFF_HEATERS" and "M84". #timeout: 600 # Idle time (in seconds) to wait before running the above G-Code # commands. The default is 600 seconds.
hu: [idle_timeout] #gcode: # Az üresjárati időtúllépéskor végrehajtandó G-kód parancsok listája. # Lásd a docs/Command_Templates.md fájlt a G-kód formátumhoz. # Az alapértelmezett a „TURN_OFF_HEATERS” és „M84” futtatása. #timeout: 600 # A fenti G-kód parancsok futtatása előtti várakozási idő (másodpercben). # Az alapértelmezett érték a 600 másodperc.
it: [idle_timeout] #gcode: # Un elenco di comandi G-Code da eseguire in un timeout di # inattività. Vedi docs/Command Templates.md per il formato # G-Code. L'impostazione predefinita è # eseguire "TURN_OFF HEATERS" e "M84". #timeout: 600 # Tempo di inattività (in secondi) da attendere prima di eseguire # i comandi G-Code sopra. Il valore predefinito è 600 secondi.

source: [virtual_sdcard] path: # The path of the local directory on the host machine to look for # g-code files. This is a read-only directory (sdcard file writes # are not supported). One may point this to OctoPrint's upload # directory (generally ~/.octoprint/uploads/ ). This parameter must # be provided.
hu: [virtual_sdcard] path: # A helyi könyvtár elérési útja a gazdagépen a G-kód fájlok kereséséhez. # Ez egy csak olvasható könyvtár (az sdcard fájl írása nem támogatott). # Ezzel rámutathatunk az OctoPrint feltöltési könyvtárára # (általában ~/.octoprint/uploads/ ). Ezt a paramétert meg kell adni.

source: [force_move] #enable_force_move: False # Set to true to enable FORCE_MOVE and SET_KINEMATIC_POSITION # extended G-Code commands. The default is false.
hu: [force_move] #enable_force_move: False # A FORCE_MOVE és a SET_KINEMATIC_POSITION engedélyezéséhez # állítsuk True-ra a kiterjesztett G-kód parancsot. # Az alapértelmezett érték False.
it: [force_move] #enable_force_move: False # Impostare su True per abilitare FORCE_MOVE e SET_KINEMATIC_POSITION # i comandi G-Code estesi. L'impostazione predefinita è False.

source: [pause_resume] #recover_velocity: 50. # When capture/restore is enabled, the speed at which to return to # the captured position (in mm/s). Default is 50.0 mm/s.
hu: [pause_resume] #recover_velocity: 50. # Ha a rögzítés/visszaállítás engedélyezve van, akkor a megadott # sebességgel, tér vissza a rögzített pozícióhoz (mm/mp-ben). # Az alapértelmezett érték 50,0 mm/mp.
it: [pause_resume] #recover_velocity: 50. # Quando si abilita pause_resume, la velocità con cui tornare alla # posizione catturata (in mm/s). Il valore predefinito è 50,0 mm/s.
