Repository: Klipper3d/klipper-translations
Catalog: locales/*/LC_MESSAGES/Config_Reference.po
Languages: hu, it

source: [smart_effector] pin: # Pin connected to the Smart Effector Z Probe output pin (pin 5). Note that # pullup resistor on the board is generally not required. However, if the # output pin is connected to the board pin with a pullup resistor, that # resistor must be high value (e.g. 10K Ohm or more). Some boards have a low # value pullup resistor on the Z probe input, which will likely result in an # always-triggered probe state. In this case, connect the Smart Effector to # a different pin on the board. This parameter is required. #control_pin: # Pin connected to the Smart Effector control input pin (pin 7). If provided, # Smart Effector sensitivity programming commands become available. #probe_accel: # If set, limits the acceleration of the probing moves (in mm/sec^2). # A sudden large acceleration at the beginning of the probing move may # cause spurious probe triggering, especially if the hotend is heavy. # To prevent that, it may be necessary to reduce the acceleration of # the probing moves via this parameter. #recovery_time: 0.4 # A delay between the travel moves and the probing moves in seconds. A fast # travel move prior to probing may result in a spurious probe triggering. # This may cause 'Probe triggered prior to movement' errors if no delay # is set. Value 0 disables the recovery delay. # Default value is 0.4. #x_offset: #y_offset: # Should be left unset (or set to 0). z_offset: # Trigger height of the probe. Start with -0.1 (mm), and adjust later using # `PROBE_CALIBRATE` command. This parameter must be provided. #speed: # Speed (in mm/s) of the Z axis when probing. It is recommended to start # with the probing speed of 20 mm/s and adjust it as necessary to improve # the accuracy and repeatability of the probe triggering. #samples: #sample_retract_dist: #samples_result: #samples_tolerance: #samples_tolerance_retries: #activate_gcode: #deactivate_gcode: #deactivate_on_each_sample: # See the "probe" section for more information on the parameters above.
hu: [smart_effector] pin: # A Smart Effector Z Probe kimeneti tűjéhez (5. csap) csatlakoztatott tű. Vegye # figyelembe, hogy a lapon lévő pullup ellenállás általában nem szükséges. # Ha azonban a kimeneti tűn pullup ellenállással csatlakoztatják a lapon # lévő tűhöz, akkor ennek az ellenállásnak nagy értékűnek kell lennie # (pl. 10K Ohm vagy több). Néhány lapon alacsony értékű pullup ellenállás # van a Z szonda bemenetén, ami valószínűleg egy mindig kioldott szonda # állapotot fog eredményezni. Ebben az esetben csatlakoztassa a # Smart Effector-t a következőhöz a kártya egy másik tűjéhez. # Ez a paraméter szükséges. #control_pin: # A Smart Effector vezérlő bemeneti pinjéhez (7-es pin) csatlakoztatott pin. # Ha van, a Smart Effector érzékenység programozási parancsai válnak # elérhetővé. #probe_accel: # Ha be van állítva, korlátozza a tapogató mozgások gyorsulását # (mm/mp^2-ben). A hirtelen nagy gyorsulás a tapogató mozgás kezdetén # téves tapintásindítást okozhat, különösen, ha a hotend nehéz. Ennek # megakadályozására szükség lehet a gyorsulás csökkentésére a # szondázó mozgások gyorsulásával ezzel a paraméterrel. #recovery_time: 0.4 # Az utazási mozgások és a tapogató mozgások közötti késleltetés # másodpercben. A szondázás előtti gyors mozgatás téves # szondakapcsolást eredményezhet. Ez "A szonda a mozgást megelőzően # kioldott" hibát okozhat, ha nincs késleltetés beállítva. # A 0 érték kikapcsolja a helyreállítási késleltetést. # Az alapértelmezett érték 0,4. #x_offset: #y_offset: # Nem kell beállítani (vagy 0-ra kell állítani). z_offset: # A szonda kioldási magassága. Kezdje -0,1 (mm) értékkel, és később # állítsa be a következővel `PROBE_CALIBRATE` paranccsal. # Ezt a paramétert meg kell adni. #speed: # A Z tengely sebessége (mm/mp-ben) tapogatáskor. Javasoljuk, hogy a # tapintási sebességet 20 mm/mp sebességgel kezdjük, és szükség # szerint állítsuk be, hogy javítsuk a a tapintás kioldásának pontosságát # és megismételhetőségét. #samples: #sample_retract_dist: #samples_result: #samples_tolerance: #samples_tolerance_retries: #activate_gcode: #deactivate_gcode: #deactivate_on_each_sample: # A fenti paraméterekkel kapcsolatos további információkért # lásd a "szonda" részt.
it: [smart_effector] pin: # Pin collegato al pin di uscita della sonda Z Smart Effector (pin 5). Si noti # che la resistenza di pullup sulla scheda generalmente non è richiesta. # Tuttavia, se il pin di uscita è collegato al pin della scheda con un resistore # di pullup, tale resistore deve essere di valore elevato (ad es. 10K Ohm o più). # Alcune schede hanno un resistore di pullup di basso valore sull'ingresso # della sonda Z, che probabilmente farà risultare in uno stato di sonda sempre # attivato. In questo caso, collegare lo Smart Effector a un pin diverso sulla # scheda. Questo parametro è obbligatorio. #control_pin: # Pin collegato al pin di ingresso di controllo Smart Effector (pin 7). Se fornito, # diventano disponibili i comandi di programmazione della sensibilità # di Smart Effector. #probe_accel: # Se impostato, limita l'accelerazione dei movimenti di tastatura (in mm/sec^2). # Un'improvvisa grande accelerazione all'inizio del movimento di esplorazione # può causare l'attivazione spuria della sonda, specialmente se l'hotend è pesante. # Per evitarlo, potrebbe essere necessario ridurre l'accelerazione dei movimenti # di tastatura tramite questo parametro. #recovery_time: 0.4 # Un ritardo tra i movimenti di spostamento e tastatura in secondi. Un # movimento veloce prima della tastatura può causare l'attivazione spuria della # sonda. Ciò può causare errori "Sonda attivata prima del movimento" se non # è impostato alcun ritardo. Il valore 0 disabilita il ritardo di ripristino. # Il valore predefinito è 0.4. #x_offset: #y_offset: # Dovrebbe essere lasciato non impostato (o impostato su 0). z_offset: # Altezza di attivazione della sonda. Inizia con -0.1 (mm) e regola in seguito # usando il comando `PROBE_CALIBRATE`. Questo parametro deve essere fornito. #speed: # Velocità (in mm/s) dell'asse Z durante la tastatura. Si consiglia di iniziare con la # velocità di tastatura di 20 mm/s e di regolarla secondo necessità per migliorare la # precisione e la ripetibilità dell'attivazione della sonda. #samples: #sample_retract_dist: #samples_result: #samples_tolerance: #samples_tolerance_retries: #activate_gcode: #deactivate_gcode: #deactivate_on_each_sample: # Vedere la sezione "probe" per ulteriori informazioni sui parametri di cui sopra.

source: [temperature_fan my_temp_fan] #pin: #max_power: #shutdown_speed: #cycle_time: #hardware_pwm: #kick_start_time: #off_below: #tachometer_pin: #tachometer_ppr: #tachometer_poll_interval: # See the "fan" section for a description of the above parameters. #sensor_type: #sensor_pin: #control: #max_delta: #min_temp: #max_temp: # See the "extruder" section for a description of the above parameters. #pid_Kp: #pid_Ki: #pid_Kd: # The proportional (pid_Kp), integral (pid_Ki), and derivative # (pid_Kd) settings for the PID feedback control system. Klipper # evaluates the PID settings with the following general formula: # fan_pwm = max_power - (Kp*e + Ki*integral(e) - Kd*derivative(e)) / 255 # Where "e" is "target_temperature - measured_temperature" and # "fan_pwm" is the requested fan rate with 0.0 being full off and # 1.0 being full on. The pid_Kp, pid_Ki, and pid_Kd parameters must # be provided when the PID control algorithm is enabled. #pid_deriv_time: 2.0 # A time value (in seconds) over which temperature measurements will # be smoothed when using the PID control algorithm. This may reduce # the impact of measurement noise. The default is 2 seconds. #target_temp: 40.0 # A temperature (in Celsius) that will be the target temperature. # The default is 40 degrees. #max_speed: 1.0 # The fan speed (expressed as a value from 0.0 to 1.0) that the fan # will be set to when the sensor temperature exceeds the set value. # The default is 1.0. #min_speed: 0.3 # The minimum fan speed (expressed as a value from 0.0 to 1.0) that # the fan will be set to for PID temperature fans. # The default is 0.3. #gcode_id: # If set, the temperature will be reported in M105 queries using the # given id. The default is to not report the temperature via M105.
hu: [temperature_fan my_temp_fan] #pin: #max_power: #shutdown_speed: #cycle_time: #hardware_pwm: #kick_start_time: #off_below: #tachometer_pin: #tachometer_ppr: #tachometer_poll_interval: # A fenti paraméterek leírását lásd a "ventilátor" szakaszban. #sensor_type: #sensor_pin: #control: #max_delta: #min_temp: #max_temp: # A fenti paraméterek leírását lásd az "Extruder" fejezetben. #pid_Kp: #pid_Ki: #pid_Kd: # A PID-visszacsatolásos szabályozórendszer arányos (pid_Kp), integrál # (pid_Ki) és derivált (pid_Kd) beállításai. Klipper a PID-beállításokat a # következő általános képlettel értékeli ki: # fan_pwm = max_power - (Kp*e + Ki*integral(e) - Kd*derivative(e)) / 255 # ahol "e" a "célhőmérséklet - mért hőmérséklet" és "fan_pwm" a kért # ventilátorsebesség, ahol 0,0 a teljes kikapcsolás és 1,0 a teljes # bekapcsolás. A pid_Kp, pid_Ki és pid_Kd paramétereknek a # következőknek kell lenniük kell megadni, ha a PID-szabályozási # algoritmus engedélyezve van. #pid_deriv_time: 2.0 # Az az időérték (másodpercben), amely alatt a hőmérsékletmérések # simításra kerülnek a PID-szabályozási algoritmus használatakor. # Ez csökkentheti a a mérési zaj hatását. # Az alapértelmezett érték 2 másodperc. #target_temp: 40.0 # Egy hőmérséklet (Celsiusban), amely a célhőmérséklet lesz. # Az alapértelmezett érték 40 fok. #max_speed: 1.0 # A ventilátor fordulatszáma (0,0 és 1,0 közötti értékként kifejezve), # amelyre a ventilátor akkor áll be, ha az érzékelő hőmérséklete # meghaladja a beállított értéket. Az alapértelmezett érték 1.0. #min_speed: 0.3 # A ventilátor minimális fordulatszáma (0,0 és 1,0 közötti értékként # kifejezve), amely a ventilátor a PID-hőmérsékletű ventilátorok # esetében beállítható. Az alapértelmezett érték 0,3. #gcode_id: # Ha be van állítva, akkor a hőmérsékletet az M105 lekérdezésekben # a megadott azonosító alapján. Az alapértelmezett beállítás szerint # a hőmérsékletet nem jelentik az M105-ön keresztül.

source: Note that the [linux mcu](RPi_microcontroller.md) implementation does not currently support directly connected neopixels. The current design using the Linux kernel interface does not allow this scenario because the kernel GPIO interface is not fast enough to provide the required pulse rates.
hu: Vegye figyelembe, hogy a [linux mcu](RPi_microcontroller.md) implementáció jelenleg nem támogatja a közvetlenül csatlakoztatott neopixeleket. A Linux kernel interfészt használó jelenlegi tervezet nem teszi lehetővé ezt a forgatókönyvet, mivel a kernel GPIO interfésze nem elég gyors a szükséges impulzusszámok biztosításához.
it: Si noti che l'implementazione di [linux mcu](RPi_microcontroller.md) non supporta attualmente i neopixel collegati direttamente. L'attuale design che utilizza l'interfaccia del kernel Linux non consente questo scenario perché l'interfaccia GPIO del kernel non è sufficientemente veloce da fornire le frequenze di impulso richieste.

source: [neopixel my_neopixel] pin: # The pin connected to the neopixel. This parameter must be # provided. #chain_count: # The number of Neopixel chips that are "daisy chained" to the # provided pin. The default is 1 (which indicates only a single # Neopixel is connected to the pin). #color_order: GRB # Set the pixel order required by the LED hardware (using a string # containing the letters R, G, B, W with W optional). Alternatively, # this may be a comma separated list of pixel orders - one for each # LED in the chain. The default is GRB. #initial_RED: 0.0 #initial_GREEN: 0.0 #initial_BLUE: 0.0 #initial_WHITE: 0.0 # See the "led" section for information on these parameters.
hu: [neopixel my_neopixel] pin: # A neopixelhez csatlakoztatott tű. # Ennek a paraméternek a következőnek kell lennie. #chain_count: # A megadott tűhöz "láncolt" Neopixel chipek száma. # Az alapértelmezett érték 1 (ami azt jelenti, hogy csak egy # Neopixel csatlakozik a tűhöz). #color_order: GRB # Állítsa be a LED hardver által megkövetelt pixelsorrendjét # (az R, G, B, W betűket tartalmazó karakterláncot használva, a # W opcionális). Alternatívaként ez lehet a pixelsorrendek vesszővel # elválasztott listája is - egy minden egyes pixelhez LED-hez a láncban. # Az alapértelmezett érték GRB. #initial_RED: 0.0 #initial_GREEN: 0.0 #initial_BLUE: 0.0 #initial_WHITE: 0.0 # Ezekről a paraméterekről lásd a "LED" részt.
it: [neopixel my_neopixel] pin: # Il pin collegato al neopixel. Questo parametro deve essere fornito. #chain_count: # Il numero di chip Neopixel che sono "collegati a margherita" al # pin fornito. Il valore predefinito è 1 (che indica che un solo # Neopixel è collegato al pin). #color_order: GRB # Impostare l'ordine dei pixel richiesto dall'hardware del LED # (utilizzando una stringa contenente le lettere R, G, B, W con W # opzionale). In alternativa, questo può essere un elenco separato # da virgole di pixel, uno per ogni LED nella catena. # L'impostazione predefinita è GRB. #initial_RED: 0.0 #initial_GREEN: 0.0 #initial_BLUE: 0.0 #initial_WHITE: 0.0 # Vedere la sezione "led" per informazioni su questi parametri.

source: [manual_stepper]
it: [Stepper manuali]

source: [safe_z_home] home_xy_position: # A X, Y coordinate (e.g. 100, 100) where the Z homing should be # performed. This parameter must be provided. #speed: 50.0 # Speed at which the toolhead is moved to the safe Z home # coordinate. The default is 50 mm/s #z_hop: # Distance (in mm) to lift the Z axis prior to homing. This is # applied to any homing command, even if it doesn't home the Z axis. # If the Z axis is already homed and the current Z position is less # than z_hop, then this will lift the head to a height of z_hop. If # the Z axis is not already homed the head is lifted by z_hop. # The default is to not implement Z hop. #z_hop_speed: 15.0 # Speed (in mm/s) at which the Z axis is lifted prior to homing. The # default is 15 mm/s. #move_to_previous: False # When set to True, the X and Y axes are reset to their previous # positions after Z axis homing. The default is False.
it: [safe_z_home] home_xy_position: # Una coordinata X, Y (ad es. 100, 100) dove deve essere eseguita # homing Z. Questo parametro deve essere fornito. #speed: 50.0 # Velocità alla quale la testa di stampa viene spostata sulla # coordinata Z sicura. Il valore predefinito è 50 mm/s #z_hop: # Distanza (in mm) per sollevare l'asse Z prima dell'homing. # Questo si applica a qualsiasi comando di homing, anche se non # si trova sull'asse Z. Se l'asse Z è già azzerato e la posizione Z # corrente è inferiore a z_hop, questo solleverà la testa a un'altezza # di z_hop. Se l'asse Z non è già azzerato la testina viene sollevata # di z_hop. L'impostazione predefinita è di non implementare Z hop. #z_hop_speed: 15.0 # Velocità (in mm/s) alla quale l'asse Z viene sollevato prima # del homing. Il valore predefinito è 15 mm/s. #move_to_previous: False # Quando è impostato su True, gli assi X e Y vengono ripristinati alle # posizioni precedenti dopo l'homing dell'asse Z. # L'impostazione predefinita è False.

source: [virtual_sdcard] path: # The path of the local directory on the host machine to look for # g-code files. This is a read-only directory (sdcard file writes # are not supported). One may point this to OctoPrint's upload # directory (generally ~/.octoprint/uploads/ ). This parameter must # be provided. #on_error_gcode: # A list of G-Code commands to execute when an error is reported.
it: [virtual_sdcard] path: # Il percorso della directory locale sulla macchina host per cercare # i file di Gcode. Questa è una directory di sola lettura (le scritture # di file sdcard non sono supportate). Si può indicare questo alla # directory di caricamento di OctoPrint # (generalmente ~/.octoprint/uploads/ ). # Questo parametro deve essere fornito. #on_error_gcode: # Un elenco di comandi G-Code da eseguire quando viene segnalato # un errore.

source: Enables support to exclude or cancel individual objects during the printing process.
it: Abilita il supporto per escludere o cancellare singoli oggetti durante il processo di stampa.

source: See the [exclude objects guide](Exclude_Object.md) and [command reference](G-Codes.md#excludeobject) for additional information. See the [sample-macros.cfg](../config/sample-macros.cfg) file for a Marlin/RepRapFirmware compatible M486 G-Code macro.
it: Per ulteriori informazioni, vedere la [guida escludi oggetti](Exclude_Object.md) e [riferimento ai comandi](G-Codes.md#excludeobject). Vedere il file [sample-macros.cfg](../config/sample-macros.cfg) per una macro G-Code M486 compatibile con Marlin/RepRapFirmware.

source: Support for mpu9250 and mpu6050 accelerometers (one may define any number of sections with an "mpu9250" prefix).
it: Supporto per accelerometri mpu9250 e mpu6050 (si può definire un numero qualsiasi di sezioni con un prefisso "mpu9250").

source: [mpu9250 my_accelerometer] #i2c_address: # Default is 104 (0x68). #i2c_mcu: #i2c_bus: #i2c_speed: 400000 # See the "common I2C settings" section for a description of the # above parameters. The default "i2c_speed" is 400000. #axes_map: x, y, z # See the "adxl345" section for information on this parameter.
it: [mpu9250 my_accelerometer] #i2c_address: # Il valore predefinito è 104 (0x68). #i2c_mcu: #i2c_bus: #i2c_speed: 400000 # Vedere la sezione "impostazioni I2C comuni" per una descrizione # dei parametri di cui sopra. Il valore predefinito "i2c_speed" è 400000. #axes_map: x, y, z # Vedere la sezione "adxl345" per informazioni su questo parametro.

source: Note that Klipper's current micro-controller support for i2c is generally not tolerant to line noise. Unexpected errors on the i2c wires may result in Klipper raising a run-time error. Klipper's support for error recovery varies between each micro-controller type. It is generally recommended to only use i2c devices that are on the same printed circuit board as the micro-controller.
it: Si noti che l'attuale supporto del microcontrollore di Klipper per i2c generalmente non tollera il rumore di linea. Errori imprevisti sui cavi i2c possono causare la generazione di un errore di runtime da parte di Klipper. Il supporto di Klipper per il ripristino degli errori varia a seconda del tipo di microcontrollore. In genere si consiglia di utilizzare solo dispositivi i2c che si trovano sulla stessa scheda a circuito stampato del microcontrollore.

source: Most Klipper micro-controller implementations only support an `i2c_speed` of 100000. The Klipper "linux" micro-controller supports a 400000 speed, but it must be [set in the operating system](RPi_microcontroller.md#optional-enabling-i2c) and the `i2c_speed` parameter is otherwise ignored. The Klipper "rp2040" micro-controller supports a rate of 400000 via the `i2c_speed` parameter. All other Klipper micro-controllers use a 100000 rate and ignore the `i2c_speed` parameter.
it: La maggior parte delle implementazioni del microcontrollore Klipper supporta solo un `i2c_speed` di 100000. Il microcontrollore "linux" Klipper supporta una velocità 400000, ma deve essere [impostato nel sistema operativo](RPi_microcontroller.md#optional-enbling-i2c) e il parametro `i2c_speed` viene altrimenti ignorato. Il microcontrollore Klipper "rp2040" supporta una velocità di 400000 tramite il parametro `i2c_speed`. Tutti gli altri microcontrollori Klipper utilizzano una frequenza di 100000 e ignorano il parametro `i2c_speed`.

source: #i2c_address: # The i2c address of the device. This must specified as a decimal # number (not in hex). The default depends on the type of device. #i2c_mcu: # The name of the micro-controller that the chip is connected to. # The default is "mcu". #i2c_bus: # If the micro-controller supports multiple I2C busses then one may # specify the micro-controller bus name here. The default depends on # the type of micro-controller. #i2c_speed: # The I2C speed (in Hz) to use when communicating with the device. # The Klipper implementation on most micro-controllers is hard-coded # to 100000 and changing this value has no effect. The default is # 100000.
it: #i2c_address: # L'indirizzo i2c del dispositivo. Questo deve essere specificato # come numero decimale (non in esadecimale). L'impostazione # predefinita dipende dal tipo di dispositivo. #i2c_mcu: # Il nome del microcontrollore a cui è collegato il chip. # L'impostazione predefinita è "mcu". #i2c_bus: # Se il microcontrollore supporta più bus I2C, è possibile # specificare qui il nome del bus del microcontrollore. # L'impostazione predefinita dipende dal tipo di microcontrollore. #i2c_speed: # La velocità I2C (in Hz) da utilizzare durante la comunicazione # con il dispositivo. L'implementazione di Klipper sulla maggior # parte dei microcontrollori è codificata a 100000 e la modifica # di questo valore non ha alcun effetto. # Il valore predefinito è 100000.

source: Klipper includes definitions for many types of temperature sensors. These sensors may be used in any config section that requires a temperature sensor (such as an `[extruder]` or `[heater_bed]` section).
it: Klipper include definizioni per molti tipi di sensori di temperatura. Questi sensori possono essere utilizzati in qualsiasi sezione di configurazione che richieda un sensore di temperatura (come una sezione `[extruder]` o `[heater_bed]`).
