Repository: Klipper3d/klipper-translations
Catalog: locales/*/LC_MESSAGES/Config_Reference.po
Languages: hu, it

source: [heater_generic my_generic_heater] #gcode_id: # The id to use when reporting the temperature in the M105 command. # This parameter must be provided. #heater_pin: #max_power: #sensor_type: #sensor_pin: #smooth_time: #control: #pid_Kp: #pid_Ki: #pid_Kd: #pwm_cycle_time: #min_temp: #max_temp: # See the "extruder" section for the definition of the above # parameters.
hu: [heater_generic my_generic_heater] #gcode_id: # A hőmérséklet jelentésénél az M105 parancsban # használandó azonosító. # Ezt a paramétert meg kell adni. #heater_pin: #max_power: #sensor_type: #sensor_pin: #smooth_time: #control: #pid_Kp: #pid_Ki: #pid_Kd: #pwm_cycle_time: #min_temp: #max_temp: # A fenti paraméterek meghatározásához # lásd az "extruder" részt.
it: [heater_generic my_generic_heater] #gcode_id: # L'ID da utilizzare quando si riporta la temperatura nel comando M105. # Questo parametro deve essere fornito. #max_power: #sensor_type: #sensor_pin: #smooth_time: #control: #pid_Kp: #pid_Ki: #pid_Kd: #pwm_cycle_time: #min_temp: #max_temp: # Vedere la sezione "extruder" per la definizione dei parametri sopra.

source: [temperature_sensor my_sensor] #sensor_type: #sensor_pin: #min_temp: #max_temp: # See the "extruder" section for the definition of the above # parameters. #gcode_id: # See the "heater_generic" section for the definition of this # parameter.
hu: [temperature_sensor my_sensor] #sensor_type: #sensor_pin: #min_temp: #max_temp: # A fenti paraméterek meghatározásához lásd az # "extruder" részt. #gcode_id: # Lásd a "heater_generic" részt a paraméter # meghatározásához.
it: [temperature_sensor my_sensor] #sensor_type: #sensor_pin: #min_temp: #max_temp: # Vedi la sezione "extruder" per la definizione dei parametri # sopra indicati. #gcode_id: # Vedi la sezione "heater_generic" per la definizione dei # parametri sopra indicati.

source: sensor_type: # One of "PT100 INA826", "AD595", "AD597", "AD8494", "AD8495", # "AD8496", or "AD8497". sensor_pin: # Analog input pin connected to the sensor. This parameter must be # provided. #adc_voltage: 5.0 # The ADC comparison voltage (in Volts). The default is 5 volts. #voltage_offset: 0 # The ADC voltage offset (in Volts). The default is 0.
hu: sensor_type: # A „PT100 INA826”, „AD595”, „AD597”, „AD8494”, „AD8495”, # „AD8496” vagy „AD8497” közül az egyik. sensor_pin: # Analóg bemeneti érintkező csatlakozik az érzékelőhöz. # Ezt a paramétert meg kell adni. #adc_voltage: 5.0 # Az ADC összehasonlító feszültsége (V-ban). # Az alapértelmezett érték 5. #voltage_offset: 0 # Az ADC feszültség eltolása (V-ban). Az alapértelmezett érték 0.
it: sensor_type: # Uno tra "PT100 INA826", "AD595", "AD597", "AD8494", "AD8495", # "AD8496", o "AD8497". sensor_pin: # Pin di ingresso analogico collegato al sensore. Questo parametro # deve essere fornito. #adc_voltage: 5.0 # La tensione di confronto dell'ADC (in Volt). Il valore predefinito # è 5 volt. #voltage_offset: 0 # L'offset di tensione ADC (in Volt). Il valore predefinito è 0.

source: sensor_type: PT1000 sensor_pin: # Analog input pin connected to the sensor. This parameter must be # provided. #pullup_resistor: 4700 # The resistance (in ohms) of the pullup attached to the sensor. The # default is 4700 ohms.
hu: sensor_type: PT1000 sensor_pin: # Analóg bemeneti érintkező csatlakozik az érzékelőhöz. # Ezt a paramétert meg kell adni. #pullup_resistor: 4700 # Az érzékelőhöz csatlakoztatott felhúzó ellenállás (ohmban). # Az alapértelmezett 4700 ohm.
it: sensor_type: PT1000 sensor_pin: # Pin di ingresso analogico collegato al sensore. Questo parametro # deve essere fornito. #pullup_resistor: 4700 # La resistenza (in ohm) del pullup collegato al sensore. Il valore # predefinito è 4700 ohm.

source: sensor_type: # One of "MAX6675", "MAX31855", "MAX31856", or "MAX31865". sensor_pin: # The chip select line for the sensor chip. This parameter must be # provided. #spi_speed: 4000000 # The SPI speed (in hz) to use when communicating with the chip. # The default is 4000000. #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # See the "common SPI settings" section for a description of the # above parameters. #tc_type: K #tc_use_50Hz_filter: False #tc_averaging_count: 1 # The above parameters control the sensor parameters of MAX31856 # chips. The defaults for each parameter are next to the parameter # name in the above list. #rtd_nominal_r: 100 #rtd_reference_r: 430 #rtd_num_of_wires: 2 #rtd_use_50Hz_filter: False # The above parameters control the sensor parameters of MAX31865 # chips. The defaults for each parameter are next to the parameter # name in the above list.
hu: sensor_type: # A „MAX6675”, „MAX31855”, „MAX31856” vagy „MAX31865” egyike. sensor_pin: # Az érzékelő chip kiválasztási sora. Ezt a paramétert meg kell adni. #spi_speed: 4000000 # A chippel való kommunikáció során használandó SPI-sebesség # (hz-ben). Az alapértelmezett érték 4000000. #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # A fenti paraméterek leírását az "általános SPI-beállítások" # részben találja. #tc_type: K #tc_use_50Hz_filter: False #tc_averaging_count: 1 # A fenti paraméterek a MAX31856 chipek érzékelőparamétereit # szabályozzák. Az egyes paraméterek alapértelmezett értékei a # paraméter neve mellett találhatók a fenti listában. #rtd_nominal_r: 100 #rtd_reference_r: 430 #rtd_num_of_wires: 2 #rtd_use_50Hz_filter: False # A fenti paraméterek a MAX31865 chipek érzékelőparamétereit # szabályozzák. Az egyes paraméterek alapértelmezett értékei a # paraméter neve mellett találhatók a fenti listában.
it: sensor_type: # Uno tra "MAX6675", "MAX31855", "MAX31856", o "MAX31865". sensor_pin: # Il pin mcu collegato al pin di selezione del chip del sensore. # Questo parametro deve essere fornito. #spi_speed: 4000000 # La velocità SPI (in hz) da utilizzare durante la comunicazione # con il chip. Il valore predefinito è 4000000. #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # Vedere la sezione "impostazioni comuni SPI" per una # descrizione dei parametri di cui sopra. #tc_type: K #tc_use_50Hz_filter: False #tc_averaging_count: 1 # I parametri di cui sopra controllano i parametri del sensore # dei chip MAX31856. I valori predefiniti per ciascun parametro # sono accanto al nome del parametro nell'elenco precedente. #rtd_nominal_r: 100 #rtd_reference_r: 430 #rtd_num_of_wires: 2 #rtd_use_50Hz_filter: False # I parametri di cui sopra controllano i parametri del sensore dei # chip MAX31865. I valori predefiniti per ciascun parametro sono # accanto al nome del parametro nell'elenco precedente.

source: sensor_type: BME280 #i2c_address: # Default is 118 (0x76). Some BME280 sensors have an address of 119 # (0x77). #i2c_mcu: #i2c_bus: #i2c_speed: # See the "common I2C settings" section for a description of the # above parameters.
hu: sensor_type: BME280 #i2c_address: # Az alapértelmezett 118 (0x76). Egyes BME280 érzékelők címe 119 # (0x77). #i2c_mcu: #i2c_bus: #i2c_speed: # A fenti paraméterek leírását lásd az "általános I2C beállítások" # részben.
it: sensor_type: BME280 #i2c_address: # Il valore predefinito è 118 (0x76). Alcuni sensori BME280 hanno un # indirizzo di 119 (0x77). #i2c_mcu: #i2c_bus: #i2c_speed: # Vedere la sezione "impostazioni comuni I2C" per una descrizione # dei parametri di cui sopra.

source: sensor_type: # Must be "HTU21D" , "SI7013", "SI7020", "SI7021" or "SHT21" #i2c_address: # Default is 64 (0x40). #i2c_mcu: #i2c_bus: #i2c_speed: # See the "common I2C settings" section for a description of the # above parameters. #htu21d_hold_master: # If the sensor can hold the I2C buf while reading. If True no other # bus communication can be performed while reading is in progress. # Default is False. #htu21d_resolution: # The resolution of temperature and humidity reading. # Valid values are: # 'TEMP14_HUM12' -> 14bit for Temp and 12bit for humidity # 'TEMP13_HUM10' -> 13bit for Temp and 10bit for humidity # 'TEMP12_HUM08' -> 12bit for Temp and 08bit for humidity # 'TEMP11_HUM11' -> 11bit for Temp and 11bit for humidity # Default is: "TEMP11_HUM11" #htu21d_report_time: # Interval in seconds between readings. Default is 30
hu: sensor_type: # A következőnek kell lennie: "HTU21D", "SI7013", "SI7020", # "SI7021" vagy "SHT21" #i2c_address: # Az alapértelmezett 64 (0x40). #i2c_mcu: #i2c_bus: #i2c_speed: # A fenti paraméterek leírását lásd az "általános I2C beállítások" # részben. #htu21d_hold_master: # Ha az érzékelő képes megtartani az I2C buffot olvasás közben. # Ha True, az olvasás közben más buszkommunikáció nem # hajtható végre. Az alapértelmezett érték False. #htu21d_resolution: # A hőmérséklet és a páratartalom leolvasásának felbontása. # Az érvényes értékek a következők: # 'TEMP14_HUM12' -> 14 bit a hőmérséklethez és 12 bit a páratartalomhoz # 'TEMP13_HUM10' -> 13 bit a hőmérséklethez és 10 bit a páratartalomhoz # 'TEMP12_HUM08' -> 12 bit a hőmérséklethez és 08 bit a páratartalomhoz # 'TEMP11_HUM11' -> 11 bit a hőmérséklethez és 11 bit a páratartalomhoz # Az alapértelmezett érték: "TEMP11_HUM11" #htu21d_report_time: # A leolvasások közötti intervallum másodpercben. # Az alapértelmezett a 30
it: sensor_type: # Deve essere "HTU21D", "SI7013", "SI7020", "SI7021" o "SHT21" #i2c_address: # Il valore predefinito è 64 (0x40). #i2c_mcu: #i2c_bus: #i2c_speed: # Vedere la sezione "impostazioni comuni I2C" per una # descrizione dei parametri di cui sopra. #htu21d_hold_master: # Se il sensore può trattenere il buf I2C durante la lettura. Se # True nessun'altra comunicazione bus può essere eseguita mentre # la lettura è in corso. L'impostazione predefinita è False. #htu21d_resolution: # La risoluzione della lettura di temperatura e umidità. # I valori validi sono: # 'TEMP14_HUM12' -> 14bit per Temp e 12bit per umidità # 'TEMP13_HUM10' -> 13bit per Temp e 10bit per umidità # 'TEMP12_HUM08' -> 12bit per Temp e 08bit per umidità # 'TEMP11_HUM11' -> 11bit per Temp e 11bit per umidità # L'impostazione predefinita è: "TEMP11_HUM11" #htu21d_report_time: # Intervallo in secondi tra le letture. Il valore predefinito è 30

source: sensor_type: temperature_mcu #sensor_mcu: mcu # The micro-controller to read from. The default is "mcu". #sensor_temperature1: #sensor_adc1: # Specify the above two parameters (a temperature in Celsius and an # ADC value as a float between 0.0 and 1.0) to calibrate the # micro-controller temperature. This may improve the reported # temperature accuracy on some chips. A typical way to obtain this # calibration information is to completely remove power from the # printer for a few hours (to ensure it is at the ambient # temperature), then power it up and use the QUERY_ADC command to # obtain an ADC measurement. Use some other temperature sensor on # the printer to find the corresponding ambient temperature. The # default is to use the factory calibration data on the # micro-controller (if applicable) or the nominal values from the # micro-controller specification. #sensor_temperature2: #sensor_adc2: # If sensor_temperature1/sensor_adc1 is specified then one may also # specify sensor_temperature2/sensor_adc2 calibration data. Doing so # may provide calibrated "temperature slope" information. The # default is to use the factory calibration data on the # micro-controller (if applicable) or the nominal values from the # micro-controller specification.
hu: sensor_type: temperature_mcu #sensor_mcu: mcu # A mikrokontroller, amelyből olvasni lehet. # Az alapértelmezett érték az "mcu". #sensor_temperature1: #sensor_adc1: # Adja meg a fenti két paramétert (a hőmérsékletet Celsiusban és egy # ADC-értéket úszóként 0,0 és 1,0 között) a mikrovezérlő # hőmérsékletének kalibrálásához. Ez egyes chipeknél javíthatja a # jelentett hőmérsékleti pontosságot. A kalibrációs adatok # megszerzésének tipikus módja az, hogy néhány órára teljesen # áramtalanítja a nyomtatót (hogy megbizonyosodjon arról, hogy az # környezeti hőmérsékleten van), majd bekapcsolja, és a QUERY_ADC # paranccsal megkapja az ADC mérést. Használjon más hőmérséklet # érzékelőt a nyomtatón a megfelelő környezeti hőmérséklet # meghatározásához. Alapértelmezés szerint a mikrokontroller gyári # kalibrálási adatait (ha van) vagy a mikrovezérlő specifikációjából # származó névleges értékeket kell használni. #sensor_temperature2: #sensor_adc2: # Ha a sensor_temperature1/sensor_adc1 meg van adva, akkor # megadhatók a sensor_temperature2/sensor_adc2 kalibrációs adatai # is. Ezzel kalibrált "temperature slope" információt kaphat. # Alapértelmezés szerint a mikrokontroller gyári kalibrálási adatait # (ha van) vagy a mikrovezérlő specifikációjából származó névleges # értékeket kell használni.
it: sensor_type: temperature_mcu #sensor_mcu: mcu # Il microcontrollore da cui leggere. L'impostazione predefinita è "mcu". #sensor_temperature1: #sensor_adc1: # Specificare i due parametri precedenti (una temperatura in gradi # Celsius e un valore ADC come float compreso tra 0,0 e 1,0) per # calibrare la temperatura del microcontrollore. Ciò potrebbe # migliorare la precisione della temperatura riportata su alcuni chip. # Un modo tipico per ottenere queste informazioni di calibrazione # consiste nel rimuovere completamente l'alimentazione dalla # stampante per alcune ore (per assicurarsi che sia alla temperatura # ambiente), quindi accenderla e utilizzare il comando QUERY_ADC # per ottenere una misurazione ADC. Utilizzare un altro sensore di # temperatura sulla stampante per trovare la temperatura ambiente # corrispondente. L'impostazione predefinita consiste nell'utilizzare # i dati di calibrazione di fabbrica sul microcontrollore (se applicabile) # o i valori nominali dalle specifiche del microcontrollore. #sensor_temperature2: #sensor_adc2: # Se viene specificato sensor_temperature1/sensor_adc1, è anche # possibile specificare i dati di calibrazione sensor_temperature2/sensor_adc2. # Ciò potrebbe fornire informazioni calibrate sulla "curva della # temperatura". L'impostazione predefinita consiste nell'utilizzare i dati # di calibrazione di fabbrica sul microcontrollore (se applicabile) o i # valori nominali dalle specifiche del microcontrollore.

source: sensor_type: temperature_host #sensor_path: # The path to temperature system file. The default is # "/sys/class/thermal/thermal_zone0/temp" which is the temperature # system file on a Raspberry Pi computer.
hu: sensor_type: temperature_host #sensor_path: # A hőmérsékleti rendszerfájl elérési útja. Az alapértelmezés # a "/sys/class/thermal/thermal_zone0/temp", amely a Raspberry Pi # számítógép hőmérsékleti rendszerfájlja.
it: sensor_type: temperature_host #sensor_path: # il percorso del file di sistema della temperatura. L'impostazione # predefinita è "/sys/class/thermal/thermal_zone0/temp" che è il file di # sistema della temperatura su un computer Raspberry Pi.

source: sensor_type: DS18B20 serial_no: # Each 1-wire device has a unique serial number used to identify the device, # usually in the format 28-031674b175ff. This parameter must be provided. # Attached 1-wire devices can be listed using the following Linux command: # ls /sys/bus/w1/devices/ #ds18_report_time: # Interval in seconds between readings. Default is 3.0, with a minimum of 1.0 #sensor_mcu: # The micro-controller to read from. Must be the host_mcu
hu: sensor_type: DS18B20 serial_no: # Minden 1 vezetékes eszköz egyedi sorozatszámmal rendelkezik, amely az # eszköz azonosítására szolgál, általában 28-031674b175ff formátumban. # Ezt a paramétert meg kell adni. A csatlakoztatott egyvezetékes eszközök a # következő Linux-paranccsal listázhatók: # ls /sys/bus/w1/devices/ #ds18_report_time: # A leolvasások közötti intervallum másodpercben. # Az alapértelmezett érték 3.0, a minimum 1.0 #sensor_mcu: # A mikrokontroller, amelyből olvasni lehet. A host_mcu legyen
it: sensor_type: DS18B20 serial_no: # Ogni dispositivo a 1 filo ha un numero di serie univoco utilizzato per # identificare il dispositivo, solitamente nel formato 28-031674b175ff. Questo # parametro deve essere fornito. I dispositivi collegati a 1 filo possono essere # elencati utilizzando il seguente comando Linux: ls /sys/bus/w1/devices/ #ds18_report_time: # Intervallo in secondi tra le letture. Il valore predefinito è 3.0, con un # minimo di 1.0 #sensor_mcu: # Il microcontrollore da cui leggere. Deve essere host_mcu

source: [fan] pin: # Output pin controlling the fan. This parameter must be provided. #max_power: 1.0 # The maximum power (expressed as a value from 0.0 to 1.0) that the # pin may be set to. The value 1.0 allows the pin to be set fully # enabled for extended periods, while a value of 0.5 would allow the # pin to be enabled for no more than half the time. This setting may # be used to limit the total power output (over extended periods) to # the fan. If this value is less than 1.0 then fan speed requests # will be scaled between zero and max_power (for example, if # max_power is .9 and a fan speed of 80% is requested then the fan # power will be set to 72%). The default is 1.0. #shutdown_speed: 0 # The desired fan speed (expressed as a value from 0.0 to 1.0) if # the micro-controller software enters an error state. The default # is 0. #cycle_time: 0.010 # The amount of time (in seconds) for each PWM power cycle to the # fan. It is recommended this be 10 milliseconds or greater when # using software based PWM. The default is 0.010 seconds. #hardware_pwm: False # Enable this to use hardware PWM instead of software PWM. Most fans # do not work well with hardware PWM, so it is not recommended to # enable this unless there is an electrical requirement to switch at # very high speeds. When using hardware PWM the actual cycle time is # constrained by the implementation and may be significantly # different than the requested cycle_time. The default is False. #kick_start_time: 0.100 # Time (in seconds) to run the fan at full speed when either first # enabling or increasing it by more than 50% (helps get the fan # spinning). The default is 0.100 seconds. #off_below: 0.0 # The minimum input speed which will power the fan (expressed as a # value from 0.0 to 1.0). When a speed lower than off_below is # requested the fan will instead be turned off. This setting may be # used to prevent fan stalls and to ensure kick starts are # effective. The default is 0.0. # # This setting should be recalibrated whenever max_power is adjusted. # To calibrate this setting, start with off_below set to 0.0 and the # fan spinning. Gradually lower the fan speed to determine the lowest # input speed which reliably drives the fan without stalls. Set # off_below to the duty cycle corresponding to this value (for # example, 12% -> 0.12) or slightly higher. #tachometer_pin: # Tachometer input pin for monitoring fan speed. A pullup is generally # required. This parameter is optional. #tachometer_ppr: 2 # When tachometer_pin is specified, this is the number of pulses per # revolution of the tachometer signal. For a BLDC fan this is # normally half the number of poles. The default is 2. #tachometer_poll_interval: 0.0015 # When tachometer_pin is specified, this is the polling period of the # tachometer pin, in seconds. The default is 0.0015, which is fast # enough for fans below 10000 RPM at 2 PPR. This must be smaller than # 30/(tachometer_ppr*rpm), with some margin, where rpm is the # maximum speed (in RPM) of the fan.
hu: [ventilátor] pin: # A ventilátort vezérlő kimeneti tű. Ezt a paramétert meg kell adni. #max_power: 1.0 # A maximális teljesítmény (0.0 és 1.0 közötti értékben kifejezve), amely # a tűn beállítható. Az 1.0 érték lehetővé teszi, hogy a tű teljesen # beállítható legyen. Hosszabb időre is engedélyezve legyen, míg a 0.5 # érték lehetővé teszi, hogy a tű legfeljebb az idő felére legyen # engedélyezve. Ez a beállítás használható a teljes kimeneti teljesítmény # korlátozására a ventilátornál (hosszabb időszakok alatt). Ha ez az érték # kisebb, mint 1.0, akkor a ventilátor fordulatszám kérése nulla és a # max_power között lesz skálázva (például, ha max_power .9, és a # ventilátor 80%-os sebességet kér, akkor a ventilátor teljesítménye # 72%-ra lesz beállítva). Az alapértelmezett érték 1.0. #shutdown_speed: 0 # A kívánt ventilátorsebesség (0,0 és 1,0 közötti értékként kifejezve) ha # a mikrokontroller szoftver hibaállapotba kerül. # Az alapértelmezett érték 0. #cycle_time: 0.010 # Az az idő (másodpercben), amely alatt minden PWM ciklus kikerül a # ventilátorhoz. Ajánlatos, hogy ez 10 milliszekundum vagy nagyobb # legyen, a szoftveralapú PWM használata esetén. # Az alapértelmezett érték 0,010 másodperc. #hardware_pwm: False # Engedélyezze ezt a hardveres PWM használatához a szoftveres PWM # helyett. A legtöbb ventilátor nem működik jól a hardveres PWM-mel, # ezért nem ajánlott annak engedélyezése, hacsak nincs elektromos # követelmény, hogy a kapcsolás nagyon nagy sebességgel történjen. # Hardveres PWM használatakor a tényleges ciklusidő a megvalósítást # korlátozza, és jelentősen nagyobb mértékben eltérhet a kért # ciklusidőtől. Az alapértelmezett érték False. #kick_start_time: 0.100 # Az idő (másodpercben), amíg a ventilátor teljes fordulatszámra pörög, # amikor először engedélyezi vagy 50%-nál nagyobb mértékre növeli # (segít a ventilátor működésbe hozásában). # Az alapértelmezett érték 0,100 másodperc. #off_below: 0.0 # A minimális bemeneti sebesség, amely a ventilátort működtetni fogja # (kifejezve egy 0.0 és 1.0 közötti értékben). Ha az off_below-nál # alacsonyabb sebességet kért, a ventilátor inkább kikapcsol. Ez a # beállítás lehet használható a ventilátor leállásának megakadályozására # és a kick-indítás biztosítására. Az alapértelmezett érték 0.0. # # Ezt a beállítást mindig újra kell kalibrálni, amikor a max_power-t # módosítjuk. A beállítás kalibrálásához kezdjük úgy, hogy az off_below # értéke 0.0. Fokozatosan csökkentse a ventilátor fordulatszámát a # legalacsonyabb érték meghatározásához. Válassza azt a bemeneti # sebességet, amely megbízhatóan, leállás nélkül hajtja a ventilátort. # Állítsa be az off_below-ot az ennek az értéknek megfelelő # munkaszünetre (a például 12% -> 0,12) vagy valamivel # magasabb értéket. #tachometer_pin: # Tachométer bemeneti tű a ventilátor fordulatszámának ellenőrzésére. # A pullup általában szükséges. Ez a paraméter opcionális. #tachometer_ppr: 2 # Ha a tachometer_pin meg van adva, akkor ez az impulzusok száma per # fordulatonként a tachométer jelének impulzusainak száma. # Egy BLDC ventilátor esetében ez általában a pólusok számának fele. # Az alapértelmezett érték 2. #tachometer_poll_intervall: 0.0015 # Ha a tachometer_pin meg van adva, ez a lekérdezési periódus a # tachometer pin, másodpercben. Az alapértelmezett érték 0.0015, ami # gyors. Elég gyors az 10000 RPM alatti ventilátorokhoz 2 PPR mellett. # Ennek kisebbnek kell lennie, mint 30/(tachometer_ppr*rpm), némi # mozgástérrel, ahol az RPM a fordulatszám. # A ventilátor maximális fordulatszáma (fordulatszámban).
