Repository: Klipper3d/klipper-translations
Catalog: locales/*/LC_MESSAGES/Config_Reference.po
Languages: hu, it

source: #i2c_address: # The i2c address of the device. This must specified as a decimal # number (not in hex). The default depends on the type of device. #i2c_mcu: # The name of the micro-controller that the chip is connected to. # The default is "mcu". #i2c_bus: # If the micro-controller supports multiple I2C busses then one may # specify the micro-controller bus name here. The default depends on # the type of micro-controller. #i2c_speed: # The I2C speed (in Hz) to use when communicating with the device. # On some micro-controllers changing this value has no effect. The # default is 100000.
hu: #i2c_address: # Az eszköz I2C címe. Ezt decimális számként kell megadni (nem # hexadecimális formában). # Az alapértelmezett érték az eszköz típusától függ. #i2c_mcu: # Annak a mikrovezérlőnek a neve, amelyhez a chip csatlakozik. # Az alapértelmezett az "mcu". #i2c_bus: # Ha a mikrovezérlő több I2C buszt támogat, akkor itt megadhatja # a mikrovezérlő busz nevét. Az alapértelmezett érték a mikrovezérlő # típusától függ. #i2c_speed: # Az eszközzel való kommunikáció során használandó I2C sebesség # (Hz-ben). Egyes mikrovezérlőknél ennek az értéknek a # megváltoztatása nincs hatással. Az alapértelmezett érték 100 000.

source: This tool allows a single micro-controller pin to be defined multiple times in a config file without normal error checking. This is intended for diagnostic and debugging purposes. This section is not needed where Klipper supports using the same pin multiple times, and using this override may cause confusing and unexpected results.
hu: Ez az eszköz lehetővé teszi, hogy egyetlen mikrokontroller-tűt többször definiáljon egy konfigurációs fájlban a szokásos hibajelentés nélkül. Ez diagnosztikai és hibakeresési célokra szolgál. Erre a szakaszra nincs szükség ott, ahol a Klipper támogatja ugyanazon tű többszöri használatát, és ennek a felülbírálatnak a használata zavaros és váratlan eredményeket okozhat.
it: Questo strumento consente di definire più volte un singolo pin del microcontrollore in un file di configurazione senza il normale controllo degli errori. Questo è inteso per scopi diagnostici e di debug. Questa sezione non è necessaria laddove Klipper supporta l'utilizzo dello stesso pin più volte e l'utilizzo di questa sostituzione può causare risultati confusi e imprevisti.

source: [duplicate_pin_override] pins: # A comma separated list of pins that may be used multiple times in # a config file without normal error checks. This parameter must be # provided.
hu: [duplicate_pin_override] pins: # Azok a tűk vesszővel elválasztott listája, amelyek többször # használhatók egy konfigurációs fájlban normál hibajelentés # nélkül. Ezt a paramétert meg kell adni.
it: [duplicate_pin_override] pins: # Un elenco di pin separato da virgole che possono essere utilizzati più volte in # un file di configurazione senza normali controlli degli errori. Questo parametro deve essere # fornito.

source: SAMD SERCOM configuration to specify which pins to use on a given SERCOM. One may define any number of sections with a "samd_sercom" prefix. Each SERCOM must be configured prior to using it as SPI or I2C peripheral. Place this config section above any other section that makes use of SPI or I2C buses.
hu: SAMD SERCOM konfiguráció annak megadására, hogy mely tűket kell használni egy adott SERCOM-on. A "samd_sercom" előtaggal tetszőleges számú szekciót definiálhatunk. Minden SERCOM-ot konfigurálni kell, mielőtt SPI vagy I2C perifériaként használnánk. Helyezze ezt a konfigurációs szekciót minden más, SPI vagy I2C buszokat használó szekció fölé.
it: Configurazione SAMD SERCOM per specificare quali pin utilizzare su un determinato SERCOM. Si può definire un numero qualsiasi di sezioni con un prefisso "samd_sercom". Ogni SERCOM deve essere configurato prima di utilizzarlo come periferica SPI o I2C. Posiziona questa sezione di configurazione sopra qualsiasi altra sezione che fa uso di bus SPI o I2C.

source: [samd_sercom my_sercom] sercom: # The name of the sercom bus to configure in the micro-controller. # Available names are "sercom0", "sercom1", etc.. This parameter # must be provided. tx_pin: # MOSI pin for SPI communication, or SDA (data) pin for I2C # communication. The pin must have a valid pinmux configuration # for the given SERCOM peripheral. This parameter must be provided. #rx_pin: # MISO pin for SPI communication. This pin is not used for I2C # communication (I2C uses tx_pin for both sending and receiving). # The pin must have a valid pinmux configuration for the given # SERCOM peripheral. This parameter is optional. clk_pin: # CLK pin for SPI communication, or SCL (clock) pin for I2C # communication. The pin must have a valid pinmux configuration # for the given SERCOM peripheral. This parameter must be provided.
hu: [samd_sercom my_sercom] sercom: # A mikrovezérlőben konfigurálandó sercom busz neve. # A rendelkezésre álló nevek "sercom0", "sercom1" stb. # Ezt a paramétert meg kell adni. tx_pin: # MOSI érintkező SPI kommunikációhoz, vagy SDA (adat) érintkező # I2C kommunikációhoz. A lábnak érvényes pinmux konfigurációval # kell rendelkeznie az adott SERCOM perifériához. # Ezt a paramétert meg kell adni. #rx_pin: # MISO tű az SPI kommunikációhoz. Ezt a tűt nem használják I2C # kommunikációhoz (az I2C a tx_pin kódot használja mind a # küldéshez, mind a fogadáshoz). A lábnak érvényes pinmux # konfigurációval kell rendelkeznie az adott SERCOM perifériához. # Ez a paraméter nem kötelező. clk_pin: # CLK érintkező az SPI kommunikációhoz, vagy SCL (óra) érintkező # az I2C kommunikációhoz. A lábnak érvényes pinmux # konfigurációval kell rendelkeznie az adott SERCOM perifériához. # Ezt a paramétert meg kell adni.
it: [samd_sercom my_sercom] sercom: # Il nome del bus Sercom da configurare nel microcontrollore. I nomi # disponibili sono "sercom0", "sercom1", ecc. # Questo parametro deve essere fornito. tx_pin: # Pin MOSI per la comunicazione SPI o pin SDA (dati) per la # comunicazione I2C. Il pin deve avere una configurazione pinmux # valida per la specifica periferica SERCOM. # Questo parametro deve essere fornito. #rx_pin: # Pin MISO per la comunicazione SPI. Questo pin non viene utilizzato # per la comunicazione I2C (I2C utilizza tx_pin sia per l'invio che per la # ricezione). Il pin deve avere una configurazione pinmux valida per la # specifica periferica SERCOM. Questo parametro è facoltativo. clk_pin: # Pin CLK per la comunicazione SPI o pin SCL (clock) per la # comunicazione I2C. Il pin deve avere una configurazione pinmux # valida per la specifica periferica SERCOM. Questo parametro deve # essere fornito.

source: Configuration reference
hu: Konfigurációs hivatkozás
it: Riferimenti configurazione

source: Controller cooling fan (one may define any number of sections with a "controller_fan" prefix). A "controller fan" is a fan that will be enabled whenever its associated heater or its associated stepper driver is active. The fan will stop whenever an idle_timeout is reached to ensure no overheating will occur after deactivating a watched component.
hu: Vezérlő hűtőventilátor (a "controller_fan" előtaggal tetszőleges számú szakasz definiálható). A "vezérlő hűtőventilátor" egy olyan ventilátor, amely akkor lesz engedélyezve, amikor a hozzá tartozó fűtőberendezés vagy a hozzá tartozó léptető meghajtó aktív. A ventilátor leáll, amikor elér egy idle_timeout értéket, hogy biztosítsa, hogy a felügyelt komponens kikapcsolása után ne következzen be túlmelegedés.
it: Ventola di raffreddamento del controller (è possibile definire un numero qualsiasi di sezioni con il prefisso "controller_fan"). Una "ventola del controller" è una ventola che verrà abilitata ogni volta che il riscaldatore associato o il driver stepper associato è attivo. La ventola si fermerà ogni volta che viene raggiunto un idle_timeout per garantire che non si verifichi alcun surriscaldamento dopo la disattivazione di un componente osservato.

source: [controller_fan my_controller_fan] #pin: #max_power: #shutdown_speed: #cycle_time: #hardware_pwm: #kick_start_time: #off_below: #tachometer_pin: #tachometer_ppr: #tachometer_poll_interval: # See the "fan" section for a description of the above parameters. #fan_speed: 1.0 # The fan speed (expressed as a value from 0.0 to 1.0) that the fan # will be set to when a heater or stepper driver is active. # The default is 1.0 #idle_timeout: # The amount of time (in seconds) after a stepper driver or heater # was active and the fan should be kept running. The default # is 30 seconds. #idle_speed: # The fan speed (expressed as a value from 0.0 to 1.0) that the fan # will be set to when a heater or stepper driver was active and # before the idle_timeout is reached. The default is fan_speed. #heater: #stepper: # Name of the config section defining the heater/stepper that this fan # is associated with. If a comma separated list of heater/stepper names # is provided here, then the fan will be enabled when any of the given # heaters/steppers are enabled. The default heater is "extruder", the # default stepper is all of them.
hu: [controller_fan my_controller_fan] #pin: #max_power: #shutdown_speed: #cycle_time: #hardware_pwm: #kick_start_time: #off_below: #tachometer_pin: #tachometer_ppr: #tachometer_poll_interval: # A fenti paraméterek leírását lásd a „ventilátor” részben. #fan_speed: 1.0 # Az a ventilátorsebesség (0,0 és 1,0 közötti értékként kifejezve), # amelyre a ventilátor be lesz állítva, amikor egy fűtőelem vagy # léptető meghajtó aktív. Az alapértelmezett érték 1.0 #idle_timeout: # Az az idő (másodpercben), miután a léptető meghajtó vagy a # fűtőelem aktív volt, és a ventilátort folyamatosan működtetni kell. # Az alapértelmezett érték 30 (másodperc). #idle_speed: # A ventilátor sebessége (0,0 és 1,0 közötti értékként kifejezve), amelyre # a ventilátor be lesz állítva, amikor egy fűtőelem vagy léptető meghajtó # aktív volt, és az idle_timeout-ban megadott idő alatt még működik. # Az alapértelmezett érték a fan_speed. #heater: #stepper: # A ventilátorhoz társított fűtést/lépést meghatározó konfigurációs # szakasz neve. Ha itt megadja a fűtőelemek/léptetők vesszővel tagolt # listáját, akkor a ventilátor engedélyezve lesz, ha az adott # fűtőtestek/léptetők bármelyike engedélyezett. # Az alapértelmezett fűtőelem az "extruder", az alapértelmezett # léptető pedig mindegyik.

source: See the [rotation distance document](Rotation_Distance.md) for information on calculating the `rotation_distance` parameter. See the [Multi-MCU homing](Multi_MCU_Homing.md) document for information on homing using multiple micro-controllers.
hu: A `rotation_distance` paraméter kiszámításával kapcsolatos információkért lásd a [forgatási távolság dokumentumot](Rotation_Distance.md). A több mikrovezérlővel történő kezdőpont felvétellel kapcsolatos információkért lásd a [Multi-MCU kezdőpont](Multi_MCU_Homing.md) dokumentumot.
it: Vedere il [documento distanza di rotazione](Rotation_Distance.md) per informazioni sul calcolo del parametro `rotation_distance`. Consultare il documento [Multi-MCU homing](Multi_MCU_Homing.md) per informazioni sull'homing utilizzando più microcontrollori.

source: [probe] pin: # Probe detection pin. If the pin is on a different microcontroller # than the Z steppers then it enables "multi-mcu homing". This # parameter must be provided. #deactivate_on_each_sample: True # This determines if Klipper should execute deactivation gcode # between each probe attempt when performing a multiple probe # sequence. The default is True. #x_offset: 0.0 # The distance (in mm) between the probe and the nozzle along the # x-axis. The default is 0. #y_offset: 0.0 # The distance (in mm) between the probe and the nozzle along the # y-axis. The default is 0. z_offset: # The distance (in mm) between the bed and the nozzle when the probe # triggers. This parameter must be provided. #speed: 5.0 # Speed (in mm/s) of the Z axis when probing. The default is 5mm/s. #samples: 1 # The number of times to probe each point. The probed z-values will # be averaged. The default is to probe 1 time. #sample_retract_dist: 2.0 # The distance (in mm) to lift the toolhead between each sample (if # sampling more than once). The default is 2mm. #lift_speed: # Speed (in mm/s) of the Z axis when lifting the probe between # samples. The default is to use the same value as the 'speed' # parameter. #samples_result: average # The calculation method when sampling more than once - either # "median" or "average". The default is average. #samples_tolerance: 0.100 # The maximum Z distance (in mm) that a sample may differ from other # samples. If this tolerance is exceeded then either an error is # reported or the attempt is restarted (see # samples_tolerance_retries). The default is 0.100mm. #samples_tolerance_retries: 0 # The number of times to retry if a sample is found that exceeds # samples_tolerance. On a retry, all current samples are discarded # and the probe attempt is restarted. If a valid set of samples are # not obtained in the given number of retries then an error is # reported. The default is zero which causes an error to be reported # on the first sample that exceeds samples_tolerance. #activate_gcode: # A list of G-Code commands to execute prior to each probe attempt. # See docs/Command_Templates.md for G-Code format. This may be # useful if the probe needs to be activated in some way. Do not # issue any commands here that move the toolhead (eg, G1). The # default is to not run any special G-Code commands on activation. #deactivate_gcode: # A list of G-Code commands to execute after each probe attempt # completes. See docs/Command_Templates.md for G-Code format. Do not # issue any commands here that move the toolhead. The default is to # not run any special G-Code commands on deactivation.
hu: [probe] pin: # Szonda érzékelési tű. Ha a tű más mikrokontrolleren van, mint a Z # léptetőkön, akkor engedélyezi a "multi-mcu homing"-ot. # Ezt a paramétert meg kell adni. #deactivate_on_each_sample: True # Ez határozza meg, hogy a Klippernek végre kell-e hajtania a deaktiváló # G-kódot minden egyes vizsgálati kísérlet között, amikor több vizsgálati # sorozatot hajt végre. Az alapértelmezett érték True. #x_offset: 0.0 # A távolság (mm-ben) a szonda és a fúvóka között az X tengely mentén. # Az alapértelmezett érték 0. #y_offset: 0.0 # A szonda és a fúvóka közötti távolság (mm-ben) az Y tengely mentén. # Az alapértelmezett érték 0. z_offset: # Az ágy és a fúvóka közötti távolság (mm-ben), amikor a szonda kiold. # Ezt a paramétert meg kell adni. #speed: 5.0 # A Z tengely sebessége (mm/mp-ben) tapintáskor. # Az alapértelmezett 5 mm/mp. #samples: 1 # Az egyes pontok mérésének száma. # A vizsgált Z-értékek átlagolásra kerülnek. # Az alapértelmezett az 1-szeri mérés. #sample_retract_dist: 2.0 # A nyomtatófej felemelésének távolsága (mm-ben) az egyes mérések # között (egynél többszöri mérés esetén). # Az alapértelmezett érték 2 mm. #lift_speed: # A Z tengely sebessége (mm/mp-ben) a szonda felemelésekor a mérések # között. Az alapértelmezett érték ugyanaz, mint a „speed” paraméternél. #samples_result: average # A számítási módszer többszöri mérés esetén „median” vagy „average”. # Az alapértelmezett az average. #samples_tolerance: 0.100 # Az a maximális Z távolság (mm-ben), amellyel egy minta eltérhet más # mintáktól. Ha ezt a tűréshatárt túllépik, akkor vagy hibát jelez, vagy a # kísérlet újraindul (lásd: samples_tolerance_retries). # Az alapértelmezett érték a 0,100 mm. #samples_tolerance_retries: 0 # Az újrapróbálkozások száma, ha olyan mérést csinál, amely meghaladja a # samples_tolerance értéket. Újrapróbálkozáskor az összes jelenlegi mérést # eldobja, és a mérési kísérlet újraindul. Ha a megadott számú # újrapróbálkozás során nem érkezik érvényes méréskészlet, akkor # hibaüzenet jelenik meg. Az alapértelmezett nulla, ami hibát okoz az első # mérésen, amely meghaladja a samples_tolerance értéket. #activate_gcode: # Az egyes mérési kísérletek előtt végrehajtandó G-kód parancsok listája. # Lásd a docs/Command_Templates.md fájlt a G-kód formátumhoz. Ez # akkor lehet hasznos, ha a szondát valamilyen módon aktiválni kell. Ne # adjon ki itt olyan parancsot, amely mozgatja a nyomtatófejet (pl. G1). # Az alapértelmezés szerint nem fut semmilyen speciális G-kód parancs # aktiváláskor. #deactivate_gcode: # Az egyes mérési kísérletek befejezése után végrehajtandó G-kód # parancsok listája. Lásd a docs/Command_Templates.md fájlt a G-kód # formátumhoz. Ne adjon ki itt olyan parancsot, amely mozgatja a # nyomtatófejet. Az alapértelmezés az, hogy deaktiváláskor ne futtassunk # semmilyen speciális G-kód parancsot.
it: [probe] pin: # Pin di rilevamento della sonda. Se il pin si trova su un # microcontrollore diverso rispetto agli stepper Z, abilita # "homing multi-mcu". Questo parametro deve essere fornito. #deactivate_on_each_sample: True # Questo determina se Klipper deve eseguire la disattivazione # gcode tra ogni tentativo di esplorazione durante l'esecuzione di # una sequenza di probe multiple. L'impostazione predefinita è True. #x_offset: 0.0 # La distanza (in mm) tra la sonda e l'ugello lungo l'asse x. # Il valore predefinito è 0. #y_offset: 0.0 # La distanza (in mm) tra la sonda e l'ugello lungo l'asse y. # Il valore predefinito è 0. z_offset: # La distanza (in mm) tra il piatto e l'ugello quando la sonda si attiva. # Questo parametro deve essere fornito. #speed: 5.0 # Velocità (in mm/s) dell'asse Z durante probing. # Il valore predefinito è 5 mm/s. #samples: 1 # Il numero di volte in cui sondare ciascun punto. I valori z sondati # verranno mediati. L'impostazione predefinita è sondare 1 volta. #sample_retract_dist: 2.0 # La distanza (in mm) per sollevare la testa di stampa tra ciascun # campione (se si esegue il campionamento più di una volta). # Il valore predefinito è 2 mm. #lift_speed: # Velocità (in mm/s) dell'asse Z durante il sollevamento della sonda # tra i campioni. L'impostazione predefinita prevede l'utilizzo dello # stesso valore del parametro 'speed'. #samples_result: average # Il metodo di calcolo durante il campionamento più di una volta: # "median" o "average". L'impostazione predefinita è average. #samples_tolerance: 0.100 # La distanza Z massima (in mm) che un campione può differire da # altri campioni. Se questa tolleranza viene superata, viene segnalato # un errore o il tentativo viene riavviato # (vedere samples_tolerance_retries). Il valore predefinito è 0,100 mm. #samples_tolerance_retries: 0 # Il numero di tentativi per riprovare se viene trovato un campione che # supera samples_tolerance. In un nuovo tentativo, tutti i campioni # correnti vengono eliminati e il tentativo di sonda viene riavviato. # Se non si ottiene un insieme valido di campioni nel numero di tentativi # specificato, viene segnalato un errore. Il valore predefinito è zero che # causa la segnalazione di un errore sul primo campione che supera # samples_tolerance. #activate_gcode: # Un elenco di comandi G-Code da eseguire prima di ogni tentativo di # esplorazione. Vedi docs/Command_Templates.md per il formato # G-Code. Questo può essere utile se la sonda deve essere attivata in # qualche modo. Non impartire qui alcun comando che sposti la testa # di stampa (ad es. G1). L'impostazione predefinita è di non eseguire # alcun comando G-Code speciale all'attivazione. #deactivate_gcode: # Un elenco di comandi G-Code da eseguire dopo il completamento di # ogni tentativo di esplorazione. Vedi docs/Command_Templates.md # per il formato G-Code. Non impartire qui alcun comando che sposti # la testina. L'impostazione predefinita è di non eseguire alcun # comando G-Code speciale alla disattivazione.
