Repository: Klipper3d/klipper-translations
Catalog: locales/*/LC_MESSAGES/Config_Reference.po
Languages: hu, it

source: [printer] kinematics: # The type of printer in use. This option may be one of: cartesian, # corexy, corexz, hybrid_corexy, hybrid_corexz, rotary_delta, delta, # polar, winch, or none. This # parameter must be specified. max_velocity: # Maximum velocity (in mm/s) of the toolhead (relative to the # print). This parameter must be specified. max_accel: # Maximum acceleration (in mm/s^2) of the toolhead (relative to the # print). This parameter must be specified. #max_accel_to_decel: # A pseudo acceleration (in mm/s^2) controlling how fast the # toolhead may go from acceleration to deceleration. It is used to # reduce the top speed of short zig-zag moves (and thus reduce # printer vibration from these moves). The default is half of # max_accel. #square_corner_velocity: 5.0 # The maximum velocity (in mm/s) that the toolhead may travel a 90 # degree corner at. A non-zero value can reduce changes in extruder # flow rates by enabling instantaneous velocity changes of the # toolhead during cornering. This value configures the internal # centripetal velocity cornering algorithm; corners with angles # larger than 90 degrees will have a higher cornering velocity while # corners with angles less than 90 degrees will have a lower # cornering velocity. If this is set to zero then the toolhead will # decelerate to zero at each corner. The default is 5mm/s.
hu: [printer] kinematics: # A használt nyomtató típusa. Ez a beállítás a következők egyike lehet: # cartesian, corexy, corexz, hibrid_korexy, hibrid_corexz, rotary_delta, # delta, polar, winch, vagy semmilyen. Ezt a paramétert meg kell adni. max_velocity: # A nyomtatófej maximális sebessége (mm/mp-ben) a (nyomathoz # viszonyítva). Ezt a paramétert meg kell adni. max_accel: # A nyomtatófej maximális gyorsulása (mm/mp^2-en) a (nyomathoz # viszonyítva). Ezt a paramétert meg kell adni. #max_accel_to_decel: # Álgyorsulás (mm/mp^2-en), amely azt szabályozza, hogy a # nyomtatófej milyen gyorsan haladjon a gyorsulástól a lassításig. # A rövid cikk-cakk mozgások maximális sebességének csökkentésére # szolgál (és ezáltal csökkenti a nyomtató rezgését ezekből a # lépésekből). Az alapértelmezett a max_accel értékének a fele. #square_corner_velocity: 5.0 # Az a maximális sebesség (mm/mp-ben), amellyel a nyomtatófej egy # 90 fokos sarokban haladhat. A nullától eltérő érték csökkentheti az # extruder áramlási sebességének változásait azáltal, hogy lehetővé # teszi a nyomtatófej pillanatnyi sebességváltozását kanyarodás # közben. Ez az érték konfigurálja a belső centripetális sebesség # kanyarodási algoritmust; a 90 foknál nagyobb szögű sarkok # kanyarodási sebessége nagyobb, míg a 90 foknál kisebb szögű # sarkok kanyarsebessége kisebb. Ha ez nullára van állítva, akkor a # nyomtatófej minden saroknál nullára lassul. # Az alapértelmezett érték 5 mm/mp.

source: POLAR KINEMATICS ARE A WORK IN PROGRESS. Moves around the 0, 0 position are known to not work properly.
hu: A POLÁRIS KINEMATIKA MÉG FOLYAMATBAN VAN. A 0, 0 pozíció körüli mozgásokról ismert, hogy nem működnek megfelelően.
it: LA CINEMATICA POLARE È UN LAVORO IN CORSO. È noto che i movimenti intorno alla posizione 0, 0 non funzionano correttamente.

source: CABLE WINCH SUPPORT IS EXPERIMENTAL. Homing is not implemented on cable winch kinematics. In order to home the printer, manually send movement commands until the toolhead is at 0, 0, 0 and then issue a `G28` command.
hu: A KÁBELCSÖRLŐ TÁMOGATÁSA KÍSÉRLETI JELLEGŰ. A helymeghatározás nem valósul meg a kábelcsörlő kinematikáján. A nyomtató kezdőpont felvételéhez manuálisan küldjön mozgatási parancsokat, amíg a nyomtatófej a 0, 0, 0, 0 ponton van, majd adjon ki egy `G28` parancsot.

source: [printer] kinematics: winch # The stepper_a section describes the stepper connected to the first # cable winch. A minimum of 3 and a maximum of 26 cable winches may be # defined (stepper_a to stepper_z) though it is common to define 4. [stepper_a] rotation_distance: # The rotation_distance is the nominal distance (in mm) the toolhead # moves towards the cable winch for each full rotation of the # stepper motor. This parameter must be provided. anchor_x: anchor_y: anchor_z: # The X, Y, and Z position of the cable winch in cartesian space. # These parameters must be provided.
hu: [printer] kinematics: winch (csörlős) # A stepper_a szakasz az első kábelcsörlőhöz csatlakoztatott léptetőt írja le. # Legalább 3 és legfeljebb 26 kábelcsörlő definiálható (stepper_a-tól # stepper_z-ig), bár általában 4-et definiálnak. [stepper_a] rotation_distance: # A rotation_distance az a névleges távolság (mm-ben), amellyel a # nyomtatófej elmozdul a kábelcsörlő felé a léptetőmotor minden egyes # teljes fordulatánál. Ezt a paramétert meg kell adni. anchor_x: anchor_y: anchor_z: # A kábelcsörlő X, Y és Z helyzete derékszögű térben. # Ezeket a paramétereket meg kell adni.

source: rectangular bed, probe_count = 3, 3: x---x---x (max_point) | x---x---x | (min_point) x---x---x round bed, round_probe_count = 5, bed_radius = r: x (0, r) end / x---x---x \ (-r, 0) x---x---x---x---x (r, 0) \ x---x---x / x (0, -r) start
hu: téglalap alakú ágy, probe_count = 3, 3: x---x---x (max_point) | x---x---x | (min_point) x---x---x kerek ágy, round_probe_count = 5, bed_radius = r: x (0, r) end / x---x---x \ (-r, 0) x---x---x---x---x (r, 0) \ x---x---x / x (0, -r) start

source: [bed_mesh] #speed: 50 # The speed (in mm/s) of non-probing moves during the calibration. # The default is 50. #horizontal_move_z: 5 # The height (in mm) that the head should be commanded to move to # just prior to starting a probe operation. The default is 5. #mesh_radius: # Defines the radius of the mesh to probe for round beds. Note that # the radius is relative to the coordinate specified by the # mesh_origin option. This parameter must be provided for round beds # and omitted for rectangular beds. #mesh_origin: # Defines the center X, Y coordinate of the mesh for round beds. This # coordinate is relative to the probe's location. It may be useful # to adjust the mesh_origin in an effort to maximize the size of the # mesh radius. Default is 0, 0. This parameter must be omitted for # rectangular beds. #mesh_min: # Defines the minimum X, Y coordinate of the mesh for rectangular # beds. This coordinate is relative to the probe's location. This # will be the first point probed, nearest to the origin. This # parameter must be provided for rectangular beds. #mesh_max: # Defines the maximum X, Y coordinate of the mesh for rectangular # beds. Adheres to the same principle as mesh_min, however this will # be the furthest point probed from the bed's origin. This parameter # must be provided for rectangular beds. #probe_count: 3, 3 # For rectangular beds, this is a comma separate pair of integer # values X, Y defining the number of points to probe along each # axis. A single value is also valid, in which case that value will # be applied to both axes. Default is 3, 3. #round_probe_count: 5 # For round beds, this integer value defines the maximum number of # points to probe along each axis. This value must be an odd number. # Default is 5. #fade_start: 1.0 # The gcode z position in which to start phasing out z-adjustment # when fade is enabled. Default is 1.0. #fade_end: 0.0 # The gcode z position in which phasing out completes. When set to a # value below fade_start, fade is disabled. It should be noted that # fade may add unwanted scaling along the z-axis of a print. If a # user wishes to enable fade, a value of 10.0 is recommended. # Default is 0.0, which disables fade. #fade_target: # The z position in which fade should converge. When this value is # set to a non-zero value it must be within the range of z-values in # the mesh. Users that wish to converge to the z homing position # should set this to 0. Default is the average z value of the mesh. #split_delta_z: .025 # The amount of Z difference (in mm) along a move that will trigger # a split. Default is .025. #move_check_distance: 5.0 # The distance (in mm) along a move to check for split_delta_z. # This is also the minimum length that a move can be split. Default # is 5.0. #mesh_pps: 2, 2 # A comma separated pair of integers X, Y defining the number of # points per segment to interpolate in the mesh along each axis. A # "segment" can be defined as the space between each probed point. # The user may enter a single value which will be applied to both # axes. Default is 2, 2. #algorithm: lagrange # The interpolation algorithm to use. May be either "lagrange" or # "bicubic". This option will not affect 3x3 grids, which are forced # to use lagrange sampling. Default is lagrange. #bicubic_tension: .2 # When using the bicubic algorithm the tension parameter above may # be applied to change the amount of slope interpolated. Larger # numbers will increase the amount of slope, which results in more # curvature in the mesh. Default is .2. #relative_reference_index: # A point index in the mesh to reference all z values to. Enabling # this parameter produces a mesh relative to the probed z position # at the provided index. #faulty_region_1_min: #faulty_region_1_max: # Optional points that define a faulty region. See docs/Bed_Mesh.md # for details on faulty regions. Up to 99 faulty regions may be added. # By default no faulty regions are set.
hu: [bed_mesh] #speed: 50 # A kalibrálás során a nem próbamozgások sebessége (mm/mp-ben). # Az alapértelmezett érték 50. #horizontal_move_z: 5 # Az a magasság (mm-ben), amelyre a fejnek parancsot kell adni a # mozgásra közvetlenül a szondaművelet megkezdése előtt. # Az alapértelmezett érték 5. #mesh_radius: # Meghatározza a háló sugarát a kerek ágyakhoz. Ne feledje, hogy a # sugár a mesh_origin paraméter által megadott koordinátához # viszonyított. Ezt a paramétert a kerek ágyaknál meg kell adni, # a téglalap alakú ágyaknál pedig ki kell hagyni. # mesh_origin # Az opció által meghatározott koordináta. # Ezt a paramétert kerek ágyak esetében meg kell adni. # De elhagyható a téglalap alakú ágyak esetében. #mesh_origin: # Meghatározza a háló középpontjának X, Y koordinátáját kerek ágyak # esetén. Ez a koordináta a szonda helyéhez képest relatív. Hasznos # lehet a mesh_origin beállítása, hogy maximalizáljuk a háló méretét. # Az alapértelmezett érték 0, 0. Ezt a paramétert el kell hagyni # téglalap alakú ágyak esetén. #mesh_min: # Meghatározza a háló minimális X, Y koordinátáját téglalap alakú # ágyak esetén. Ez a koordináta a szonda helyéhez képest relatív. # Ez lesz az első szondázott pont, amely a legközelebb van az origóhoz. # Ezt a paramétert téglalap alakú ágyak esetén meg kell adni. #mesh_max: # Meghatározza a háló maximális X, Y koordinátáját téglalap alakú # ágyak esetén. Ugyanazon az elven működik, mint a mesh_min, # azonban ez a paraméter a legtávolabbi pont lesz, amelyet az # ágy origójától vizsgálunk. Ezt a paramétert téglalap alakú ágyak # esetén meg kell adni. #probe_count: 3, 3 # Téglalap alakú ágyak esetén ez egy vesszővel elválasztott egész # számpár. X, Y értékek, amelyek meghatározzák a mérni kívánt # pontok számát az egyes tengelyek mentén. Egyetlen érték is # érvényes, ebben az esetben ez az érték mindkét tengelyre vonatkozik. # Az alapértelmezett érték 3, 3. #round_probe_count: 5 # A kerek ágyak esetében ez az egész érték határozza meg a # maximális számú pontok számát, amelyeket minden tengely mentén # meg kell vizsgálni. Ennek az értéknek páratlan számnak kell lennie. # Az alapértelmezett érték 5. #fade_start: 1.0 # A G-kód Z pozíciója, ahol a Z-korrekció fokozatos megszüntetése # elkezdődik amikor a fade engedélyezve van. # Az alapértelmezett érték 1.0. #fade_end: 0.0 # A G-kód Z pozíciója, amelyben a fading out befejeződik. Ha be van # állítva egy fade_start alatti értékre a fade ki van kapcsolva. # Meg kell jegyezni, hogy a fade nem kívánt skálázást adhat a # nyomtatás Z tengelye mentén. Ha egy felhasználó engedélyezni # kívánja a fade-et, a 10.0 érték ajánlott. # Az alapértelmezett érték 0.0, amely kikapcsolja a fade-et. #fade_target: # A Z pozíció, amelyben a fade-nek konvergálnia kell. Ha ez az érték # nem nulla értékre van beállítva, akkor annak a Z-értékek tartományán # belül kell lennie a hálóban. Azok a felhasználók, akik a Z kezdőponthoz # kívánnak konvergálni, 0-ra kell állítaniuk. # Az alapértelmezett érték a háló átlagos Z értéke. #split_delta_z: .025 # A Z különbség mértéke (mm-ben) a mozgás mentén, amely kivált # egy osztást. Az alapértelmezett érték .025. #move_check_distance: 5.0 # A távolság (mm-ben) a mozgás mentén, amelynél a split_delta_z-t # ellenőrizni kell. Ez egyben a minimális hossz, ameddig egy mozgást # fel lehet osztani. Alapértelmezett érték 5.0. #mesh_pps: 2, 2 # Egy vesszővel elválasztott egész számpár X, Y, amely meghatározza a # következő pontok számát szegmensenként, amelyeket interpolálni kell # a hálóban az egyes tengelyek mentén. A "szegmens" úgy definiálható, # mint az egyes mért pontok közötti tér. A felhasználó egyetlen értéket # adhat meg, amely mindkét tengelyre vonatkozik. # Az alapértelmezett érték 2, 2. #algoritmus: lagrange # Az alkalmazandó interpolációs algoritmus. Lehet akár "lagrange" vagy # "bicubic". Ez az opció nem érinti a 3x3-as rácsokat, amelyek kényszerített # lagrange mintavételt használnak. Az alapértelmezett lagrange. #bicubic_tension: .2 # A bikubik algoritmus használatakor a fenti feszültség paraméter # alkalmazható az interpolált meredekség mértékének megváltoztatására. # Nagyobb számok növelik a meredekség mértékét, ami nagyobb # görbületet eredményez a hálóban. Az alapértelmezett érték .2. #relative_reference_index: # Egy pontindex a hálóban, amelyre minden Z értéket hivatkozni kell. # Az engedélyezése ennek a paraméternek a bekapcsolása a vizsgált # Z pozícióhoz viszonyított hálót eredményez a megadott indexhez képest. #faulty_region_1_min: #faulty_region_1_max: # A hibás régiót meghatározó opcionális pontok. Lásd docs/Bed_Mesh.md # A hibás régiókkal kapcsolatos részletekért. Legfeljebb 99 hibás régió # adható hozzá. Alapértelmezés szerint nincsenek hibás régiók beállítva.

source: [bed_tilt] #x_adjust: 0 # The amount to add to each move's Z height for each mm on the X # axis. The default is 0. #y_adjust: 0 # The amount to add to each move's Z height for each mm on the Y # axis. The default is 0. #z_adjust: 0 # The amount to add to the Z height when the nozzle is nominally at # 0, 0. The default is 0. # The remaining parameters control a BED_TILT_CALIBRATE extended # g-code command that may be used to calibrate appropriate x and y # adjustment parameters. #points: # A list of X, Y coordinates (one per line; subsequent lines # indented) that should be probed during a BED_TILT_CALIBRATE # command. Specify coordinates of the nozzle and be sure the probe # is above the bed at the given nozzle coordinates. The default is # to not enable the command. #speed: 50 # The speed (in mm/s) of non-probing moves during the calibration. # The default is 50. #horizontal_move_z: 5 # The height (in mm) that the head should be commanded to move to # just prior to starting a probe operation. The default is 5.
hu: [bed_tilt] #x_adjust: 0 # Az az érték, amit hozzá kell adni az egyes mozgások Z # magasságához az X tengely minden mm-én. # Az alapértelmezett érték 0. #y_adjust: 0 # Az az érték, amit hozzá kell adni az egyes mozgások Z # magasságához az Y tengely minden mm-én. # Az alapértelmezett érték 0. #z_adjust: 0 # A Z magassághoz hozzáadandó érték, amikor a fúvóka névlegesen 0, 0. # Az alapértelmezett érték 0. # A többi paraméter egy BED_TILT_CALIBRATE kiterjesztett G-kód # parancsot vezérel, amely a megfelelő X és Y beállítási paraméterek # kalibrálására használható. #points: # Az X, Y koordináták listája (soronként egy a következő sorokat behúzva), # amelyeket a BED_TILT_CALIBRATE parancs során meg kell vizsgálni. # Adja meg a fúvóka koordinátáit, és győződjön meg arról, hogy a szonda # az ágy felett van a megadott fúvókakoordinátákon. # Az alapértelmezett az, hogy nem engedélyezi a parancsot. #speed: 50 # A nem szondázás sebessége (mm/mp-ben) mozog a kalibrálás során. # Az alapértelmezett érték 50. #horizontal_move_z: 5 # Az a magasság (mm-ben), ameddig a fejnek el kell mozdulnia # közvetlenül a szondaművelet megkezdése előtt. # Az alapértelmezett érték 5.

source: [bed_screws] #screw1: # The X, Y coordinate of the first bed leveling screw. This is a # position to command the nozzle to that is directly above the bed # screw (or as close as possible while still being above the bed). # This parameter must be provided. #screw1_name: # An arbitrary name for the given screw. This name is displayed when # the helper script runs. The default is to use a name based upon # the screw XY location. #screw1_fine_adjust: # An X, Y coordinate to command the nozzle to so that one can fine # tune the bed leveling screw. The default is to not perform fine # adjustments on the bed screw. #screw2: #screw2_name: #screw2_fine_adjust: #... # Additional bed leveling screws. At least three screws must be # defined. #horizontal_move_z: 5 # The height (in mm) that the head should be commanded to move to # when moving from one screw location to the next. The default is 5. #probe_height: 0 # The height of the probe (in mm) after adjusting for the thermal # expansion of bed and nozzle. The default is zero. #speed: 50 # The speed (in mm/s) of non-probing moves during the calibration. # The default is 50. #probe_speed: 5 # The speed (in mm/s) when moving from a horizontal_move_z position # to a probe_height position. The default is 5.
hu: [bed_screws] #screw1: # Az első ágykiegyenlítő csavar X, Y koordinátája. Ez egy # olyan pozíció, ahová a fúvókát kell irányítani, mely közvetlenül az ágy felett van # (vagy a lehető legközelebb, de még mindig az ágy felett). # Ezt a paramétert meg kell adni. #screw1_name: # Az adott csavar tetszőleges neve. Ez a név jelenik meg, amikor a segédszkript fut. # Az alapértelmezés szerint a név alapja a csavar XY helye. #screw1_fine_adjust: # Egy X, Y koordináta, amelyre a fúvókát irányítani # kell, hogy finomítani lehessen az ágy szintező csavart. # Az alapértelmezés szerint a finombeállítás nem történik meg az ágy csavarján. #screw2: #screw2_name: #screw2_fine_adjust: #... # További ágyszintállító csavarok. Legalább három csavarnak kell lennie. #horizontal_move_z: 5 # Az a magasság (mm-ben), ahová a fejnek parancsot kell adni a mozgásra amikor az egyik # csavar helyéről a másikra mozog. # Az alapértelmezett érték 5. #probe_height: 0 # A szonda magassága (mm-ben) a hőfokszabályozás után. # Az ágy és a fúvóka hőtágulása után. Az alapértelmezett érték nulla. #speed: 50 # A kalibrálás során a nem mérési mozgások sebessége (mm/mp-ben). # Az alapértelmezett érték 50. #probe_speed: 5 # A sebesség (mm/mp-ben) a horizontális_move_z pozícióból történő mozgáskor. # A probe_height pozíciója. Az alapértelmezett érték 5.

source: [z_tilt] #z_positions: # A list of X, Y coordinates (one per line; subsequent lines # indented) describing the location of each bed "pivot point". The # "pivot point" is the point where the bed attaches to the given Z # stepper. It is described using nozzle coordinates (the X, Y position # of the nozzle if it could move directly above the point). The # first entry corresponds to stepper_z, the second to stepper_z1, # the third to stepper_z2, etc. This parameter must be provided. #points: # A list of X, Y coordinates (one per line; subsequent lines # indented) that should be probed during a Z_TILT_ADJUST command. # Specify coordinates of the nozzle and be sure the probe is above # the bed at the given nozzle coordinates. This parameter must be # provided. #speed: 50 # The speed (in mm/s) of non-probing moves during the calibration. # The default is 50. #horizontal_move_z: 5 # The height (in mm) that the head should be commanded to move to # just prior to starting a probe operation. The default is 5. #retries: 0 # Number of times to retry if the probed points aren't within # tolerance. #retry_tolerance: 0 # If retries are enabled then retry if largest and smallest probed # points differ more than retry_tolerance. Note the smallest unit of # change here would be a single step. However if you are probing # more points than steppers then you will likely have a fixed # minimum value for the range of probed points which you can learn # by observing command output.
hu: [z_tilt] #z_positions: # Az X, Y koordináták listája (soronként egy a következő sorokat behúzva), # amelyek leírják az egyes ágyak "forgáspontjainak" helyét. # A "forgáspont" az a pont, ahol az ágy az adott Z léptetőhöz # kapcsolódik. Ezt a fúvóka koordinátáival írják le (a fúvóka X, Y # pozíciója, ha közvetlenül a pont felett mozoghat). Az első bejegyzés a # stepper_z, a második a stepper_z1, a harmadik a stepper_z2 stb. # értéknek felel meg. Ezt a paramétert meg kell adni. #points: # Az X, Y koordináták listája (soronként egy a következő sorokat behúzva), # amelyeket a Z_TILT_ADJUST parancs során meg kell vizsgálni. Adja meg # a fúvóka koordinátáit, és győződjön meg arról, hogy a szonda az ágy # felett van a megadott fúvókakoordinátákon. # Ezt a paramétert meg kell adni. #speed: 50 # A nem mérési mozgás sebessége (mm/mp-ben) mozog a kalibráláskor. # Az alapértelmezett érték 50. #horizontal_move_z: 5 # Az a magasság (mm-ben), ameddig a fejnek el kell mozdulnia # közvetlenül a mérések megkezdése előtt. Az alapértelmezett érték 5. #retries: 0 # Az újrapróbálkozások száma, ha a vizsgált pontok nincsenek a # tűréshatáron belül. #retry_tolerance: 0 # Ha az újrapróbálkozás engedélyezve van, próbálkozzon újra, ha a # legnagyobb és a legkisebb vizsgált pont jobban eltér, mint a # retry_tolerance. Vegye figyelembe, hogy a változás legkisebb egysége # itt egyetlen lépés lenne. Ha azonban több pontot vizsgál, mint léptetőt, # akkor valószínűleg lesz egy rögzített minimális értéke a vizsgált pontok # tartományához, amelyet a parancs kimenetének megfigyelésével # tanulhat meg.
it: [z_tilt] #z_positions: # Un elenco di coordinate X, Y (una per riga; le righe successive # identate) che descrivono la posizione di ciascun "pivot point" # del piattotto. Il "pivot point" è il punto in cui il piatto si attacca # al dato stepper Z. Viene descritto utilizzando le coordinate dell'ugello # (la posizione X, Y dell'ugello se potesse spostarsi direttamente sopra # il punto). La prima voce corrisponde a stepper_z, la seconda a # stepper_z1, la terza a stepper_z2, ecc. # Questo parametro deve essere fornito. #points: # Un elenco di coordinate X, Y (una per riga; righe successive identate) # che devono essere rilevate durante un comando Z_TILT_ADJUST. # Specificare le coordinate dell'ugello e assicurarsi che la sonda sia # sopra il piatto alle coordinate dell'ugello date. # Questo parametro deve essere fornito. #speed: 50 # La velocità (in mm/s) degli spostamenti senza probing durante # la calibrazione. Il valore predefinito è 50. #horizontal_move_z: 5 # L'altezza (in mm) a cui la testa deve essere comandata per spostarsi # appena prima di avviare un'operazione di probing. # L'impostazione predefinita è 5. #retries: 0 # Numero di volte per riprovare se i punti rilevati non sono all'interno # della tolleranza. #retry_tolerance: 0 # Se i tentativi sono abilitati, riprovare se i punti sondati più grande e # più piccolo differiscono più di retry_tolerance. Nota che l'unità di # modifica più piccola qui sarebbe un singolo passaggio. # Tuttavia, se stai sondando più punti rispetto agli stepper, # probabilmente avrai un valore minimo fisso per l'intervallo di punti # sondati che puoi apprendere osservando l'output del comando.

source: Where x is the 0, 0 point on the bed
hu: Ahol X az ágy 0, 0 pontja
it: Dove x è il punto 0, 0 sul piatto
