Repository: Klipper3d/klipper-translations
Catalog: locales/*/LC_MESSAGES/Config_Reference.po
Languages: hu, it

source: If you use this module, do not use the Palette 2 plugin for Octoprint as they will conflict, and 1 will fail to initialize properly likely aborting your print.
hu: Ha ezt a modult használja, ne használja a Palette 2 plugint az Octoprinthez, mivel ezek ütközni fognak, és az egyik nem fog megfelelően inicializálódni, ami valószínűleg megszakítja a nyomtatást.
it: Se si utilizza questo modulo, non utilizzare il plug-in Palette 2 per Octoprint poiché entreranno in conflitto e 1 non si inizializzerà correttamente, probabilmente interrompendo la stampa.

source: If you use Octoprint and stream gcode over the serial port instead of printing from virtual_sd, then remo **M1** and **M0** from *Pausing commands* in *Settings > Serial Connection > Firmware & protocol* will prevent the need to start print on the Palette 2 and unpausing in Octoprint for your print to begin.
hu: Ha az Octoprintet használja és a gcode-ot a soros porton keresztül streameli a virtual_sd-ről való nyomtatás helyett, akkor a **M1** és **M0** parancsok *Pausing parancsok* a *Settings >. alatt remo; Serial Connection > Firmware & protocol* megakadályozzák, hogy a nyomtatás megkezdéséhez a Paletta 2-n el kelljen indítani a nyomtatást, és az Octoprintben fel kelljen oldani a szünetet.
it: Se utilizzi Octoprint e esegui lo streaming di gcode sulla porta seriale invece di stampare da virtual_sd, rimuovere **M1** e **M0** da *Pausa dei comandi* in *Impostazioni > Connessione seriale > Firmware e protocollo* eviterà la necessità per avviare la stampa sulla tavolozza 2 e riattivare la pausa in Octoprint per avviare la stampa.

source: Common bus parameters
hu: Gyakori buszparaméterek
it: Parametri bus comuni

source: Common SPI settings
hu: Gyakori SPI beállítások
it: Impostazioni SPI comuni

source: The following parameters are generally available for devices using an SPI bus.
hu: Az SPI-buszt használó eszközök esetében általában a következő paraméterek állnak rendelkezésre.
it: I seguenti parametri sono generalmente disponibili per i dispositivi che utilizzano un bus SPI.

source: Common I2C settings
hu: Gyakori I2C beállítások
it: Impostazioni I2C comuni

source: The following parameters are generally available for devices using an I2C bus.
hu: A következő paraméterek általában az I2C-buszt használó eszközökhöz állnak rendelkezésre.
it: I seguenti parametri sono generalmente disponibili per i dispositivi che utilizzano un bus I2C.

source: [mcu] serial: # The serial port to connect to the MCU. If unsure (or if it # changes) see the "Where's my serial port?" section of the FAQ. # This parameter must be provided when using a serial port. #baud: 250000 # The baud rate to use. The default is 250000. #canbus_uuid: # If using a device connected to a CAN bus then this sets the unique # chip identifier to connect to. This value must be provided when using # CAN bus for communication. #canbus_interface: # If using a device connected to a CAN bus then this sets the CAN # network interface to use. The default is 'can0'. #restart_method: # This controls the mechanism the host will use to reset the # micro-controller. The choices are 'arduino', 'cheetah', 'rpi_usb', # and 'command'. The 'arduino' method (toggle DTR) is common on # Arduino boards and clones. The 'cheetah' method is a special # method needed for some Fysetc Cheetah boards. The 'rpi_usb' method # is useful on Raspberry Pi boards with micro-controllers powered # over USB - it briefly disables power to all USB ports to # accomplish a micro-controller reset. The 'command' method involves # sending a Klipper command to the micro-controller so that it can # reset itself. The default is 'arduino' if the micro-controller # communicates over a serial port, 'command' otherwise.
hu: [mcu] serial: # Az MCU-hoz csatlakoztatandó soros port. Ha bizonytalan (vagy a # változtatásban), lásd a GYIK "Hol van a soros port?" részét. # Ezt a paramétert soros port használata esetén meg kell adni. #baud: 250000 # A használandó átviteli sebesség. # Az alapértelmezett érték 250000. #canbus_uuid: # Ha CAN-buszra csatlakoztatott eszközt használunk, akkor ez állítja # be az egyedi chip azonosítóját, amelyhez csatlakozni kell. # Ezt az értéket meg kell adni, a CAN busz használata esetén. #canbus_interface: # Ha CAN-buszra csatlakoztatott eszközt használunk, akkor ez állítja # be a CAN hálózati interfészt. Az alapértelmezett érték 'can0'. #restart_method: # Ez szabályozza azt a mechanizmust, amelyet a gazdagép használjon a # mikrokontroller újraindításához. A választható lehetőségek: 'arduino', # 'cheetah', 'rpi_usb', és 'command'. Az 'arduino' módszer # (DTR kapcsolása) a következő eszközökön gyakori. Arduino kártyák # és klónok. A 'cheetah' módszer egy speciális módszer, amely néhány # Fysetc Cheetah kártyához szükséges. Az 'rpi_usb' módszer hasznos # a Raspberry Pi lapokon, amelyek mikrovezérlőkkel vannak ellátva. # USB-n keresztül rövid időre kikapcsolja az összes USB port # áramellátását, hogy a mikrokontroller újrainduljon. A 'command' # módszer a következőket foglalja magában. Klipper parancsot küld # a mikrokontrollernek, hogy az képes legyen újraindítani magát. # Az alapértelmezett beállítás az 'arduino' ha a mikrokontroller # soros porton keresztül kommunikál, egyébként 'command'.
it: [mcu] serial: # La porta seriale per la connessione all'MCU. In caso di dubbi (o se # cambia) vedere "Dov'è la mia porta seriale?" sezione delle FAQ. # Questo parametro deve essere fornito quando si utilizza una # porta seriale. #baud: 250000 # La velocità di trasmissione da utilizzare. Il valore predefinito è 250000. #canbus_uuid: # Se si utilizza un dispositivo collegato a un bus CAN, questo imposta # l'identificatore univoco del chip a cui connettersi. Questo valore deve # essere fornito quando si utilizza il bus CAN per la comunicazione. #canbus_interface: # Se si utilizza un dispositivo collegato a un bus CAN, viene impostata # l'interfaccia di rete CAN da utilizzare. L'impostazione predefinita è 'can0'. #restart_method: # Questo controlla il meccanismo che l'host utilizzerà per reimpostare # il microcontrollore. Le scelte sono "arduino", "cheetah", "rpi_usb" e # "command". Il metodo 'arduino' (attiva/disattiva DTR) è comune su # schede Arduino e cloni. Il metodo 'cheetah' è un metodo speciale # necessario per alcune schede Fysetc Cheetah. Il metodo "rpi_usb" # è utile sulle schede Raspberry Pi con microcontrollori alimentati # tramite USB: disabilita brevemente l'alimentazione a tutte le porte # USB per eseguire un ripristino del microcontrollore. Il metodo # "comando" prevede l'invio di un comando Klipper al microcontrollore # in modo che possa reimpostarsi. L'impostazione predefinita è # 'arduino' se il microcontrollore comunica su una porta seriale, # altrimenti 'comando'.

source: [mcu my_extra_mcu] # See the "mcu" section for configuration parameters.
hu: [mcu my_extra_mcu] # A konfigurációs paramétereket lásd az "mcu" szakaszban.
it: [mcu my_extra_mcu] # Vedere la sezione "mcu" per i parametri di configurazione.

source: [printer] kinematics: cartesian max_z_velocity: # This sets the maximum velocity (in mm/s) of movement along the z # axis. This setting can be used to restrict the maximum speed of # the z stepper motor. The default is to use max_velocity for # max_z_velocity. max_z_accel: # This sets the maximum acceleration (in mm/s^2) of movement along # the z axis. It limits the acceleration of the z stepper motor. The # default is to use max_accel for max_z_accel. # The stepper_x section is used to describe the stepper controlling # the X axis in a cartesian robot. [stepper_x] # The stepper_y section is used to describe the stepper controlling # the Y axis in a cartesian robot. [stepper_y] # The stepper_z section is used to describe the stepper controlling # the Z axis in a cartesian robot. [stepper_z]
hu: [printer] kinematics: cartesian max_z_velocity: # Ez állítja be a Z irányú mozgás maximális sebességét (mm/mp-ben). # Ez a beállítás használható a maximális sebesség korlátozására a # a Z léptetőmotor esetében. Az alapértelmezés szerint a max_velocity a következő értékekre vonatkozik # max_z_velocity. max_z_accel: # Ez állítja be a mozgás maximális gyorsulását (mm/mp^2-ben) # a Z tengely mentén. Korlátozza a Z léptetőmotor gyorsulását. Az # alapértelmezett a max_accel használata a max_z_accel esetében. # A stepper_x szakasz a léptetőmotor vezérlésére szolgál. # X tengely egy cartesian gépen. [stepper_x] # A stepper_y szakasz a léptetőmotor vezérlésére szolgál. # Y tíngely egy cartesian gépen. [stepper_y] # A stepper_z szakasz a léptetőmotor vezérlésére szolgál. # Z tengely egy cartesian gépen. [stepper_z]
it: [printer] kinematics: cartesian max_z_velocity: # Imposta la velocità massima (in mm/s) di movimento lungo # l'asse z. Questa impostazione può essere utilizzata per limitare # la velocità massima del motore passo-passo z. L'impostazione # predefinita è utilizzare max_velocity per max_z_velocity. max_z_accel: # Imposta l'accelerazione massima (in mm/s^2) del movimento # lungo l'asse z. Limita l'accelerazione del motore passo-passo z. # L'impostazione predefinita è utilizzare max_accel per max_z_accel. # La sezione stepper_x viene utilizzata per descrivere lo stepper # che controlla l'asse X in un robot cartesiano. [stepper_x] # La sezione stepper_y viene utilizzata per descrivere lo stepper # che controlla l'asse Y in un robot cartesiano. [stepper_y] # La sezione stepper_z viene utilizzata per descrivere lo stepper # che controlla l'asse Z in un robot cartesiano. [stepper_z]

source: [printer] kinematics: corexy max_z_velocity: # This sets the maximum velocity (in mm/s) of movement along the z # axis. This setting can be used to restrict the maximum speed of # the z stepper motor. The default is to use max_velocity for # max_z_velocity. max_z_accel: # This sets the maximum acceleration (in mm/s^2) of movement along # the z axis. It limits the acceleration of the z stepper motor. The # default is to use max_accel for max_z_accel. # The stepper_x section is used to describe the X axis as well as the # stepper controlling the X+Y movement. [stepper_x] # The stepper_y section is used to describe the Y axis as well as the # stepper controlling the X-Y movement. [stepper_y] # The stepper_z section is used to describe the stepper controlling # the Z axis. [stepper_z]
hu: [printer] kinematics: corexy max_z_velocity: # Ez állítja be a Z irányú mozgás maximális sebességét (mm/mp-ben). # Ez a beállítás használható a Z léptetőmotor maximális sebességkorlátozására. # Az alapértelmezés szerint a max_velocity a következő értékekre vonatkozik # amely a max_z_velocity. max_z_accel: # Ez állítja be a mozgás maximális gyorsulását (mm/mp^2 -ben) # a Z tengely mentén. Korlátozza a Z léptetőmotor gyorsulását. # Az alapértelmezett max_accel használata a max_z_accel paranccsal történik. # A stepper_x szakasz az X tengely, valamint az X+Y mozgást vezérlő # léptető leírására szolgál. [stepper_x] # A stepper_y szakasz az Y tengely, valamint az X+Y mozgást vezérlő # léptető leírására szolgál. [stepper_y] # A stepper_z szakasz a Z tengely, mozgást vezérlő léptető leírására szolgál. [stepper_z]
it: [printer] kinematics: corexy max_z_velocity: # Imposta la velocità massima (in mm/s) di movimento lungo l'asse z. # Questa impostazione può essere utilizzata per limitare la velocità # massima del motore passo-passo z. L'impostazione predefinita è # utilizzare max_velocity per max_z_velocity. max_z_accel: # Imposta l'accelerazione massima (in mm/s^2) del movimento # lungo l'asse z. Limita l'accelerazione del motore passo-passo z. # L'impostazione predefinita è utilizzare max_accel per max_z_accel. # La sezione stepper_x viene utilizzata per descrivere l'asse X e lo # stepper che controlla il movimento X+Y. [stepper_x] # La sezione stepper_y viene utilizzata per descrivere l'asse Y e lo # stepper che controlla il movimento X+Y. [stepper_y] # La sezione stepper_z viene utilizzata per descrivere l'asse Z [stepper_z]

source: [printer] kinematics: corexz max_z_velocity: # This sets the maximum velocity (in mm/s) of movement along the z # axis. The default is to use max_velocity for max_z_velocity. max_z_accel: # This sets the maximum acceleration (in mm/s^2) of movement along # the z axis. The default is to use max_accel for max_z_accel. # The stepper_x section is used to describe the X axis as well as the # stepper controlling the X+Z movement. [stepper_x] # The stepper_y section is used to describe the stepper controlling # the Y axis. [stepper_y] # The stepper_z section is used to describe the Z axis as well as the # stepper controlling the X-Z movement. [stepper_z]
hu: [printer] kinematics: corexz max_z_velocity: # Ez állítja be a Z irányú mozgás maximális sebességét (mm/mp-ben). # Ez a beállítás használható a Z léptetőmotor maximális sebességkorlátozására. # Az alapértelmezés szerint a max_velocity a következő értékekre vonatkozik # amely a max_z_velocity. max_z_accel: # Ez állítja be a mozgás maximális gyorsulását (mm/mp^2 -ben) # a Z tengely mentén. Korlátozza a Z léptetőmotor gyorsulását. # Az alapértelmezett max_accel használata a max_z_accel paranccsal történik. # A stepper_x szakasz az X tengely, valamint az X+Z mozgást vezérlő # léptető leírására szolgál. [stepper_x] # A stepper_y szakasz az Y tengely léptető vezérlő leírására szolgál. [stepper_y] # A stepper_z szakasz a Z tengely leírására szolgál, valamint a # léptető, amely az X-Z mozgást vezérli. [stepper_z]
it: [printer] kinematics: corexz max_z_velocity: # Imposta la velocità massima (in mm/s) di movimento lungo l'asse z. # L'impostazione predefinita è utilizzare max_velocity per # max_z_velocity. max_z_accel: # Imposta l'accelerazione massima (in mm/s^2) del movimento lungo # l'asse z. L'impostazione predefinita è utilizzare max_accel per # max_z_accel. # La sezione stepper_x viene utilizzata per descrivere l'asse X e lo # stepper che controlla il movimento X+Z. [stepper_x] # La sezione stepper_y viene utilizzata per descrivere l'asse Y [stepper_y] # La sezione stepper_z viene utilizzata per descrivere l'asse Z e lo # stepper che controlla il movimento X+Z. [stepper_z]

source: [printer] kinematics: hybrid_corexy max_z_velocity: # This sets the maximum velocity (in mm/s) of movement along the z # axis. The default is to use max_velocity for max_z_velocity. max_z_accel: # This sets the maximum acceleration (in mm/s^2) of movement along # the z axis. The default is to use max_accel for max_z_accel. # The stepper_x section is used to describe the X axis as well as the # stepper controlling the X-Y movement. [stepper_x] # The stepper_y section is used to describe the stepper controlling # the Y axis. [stepper_y] # The stepper_z section is used to describe the stepper controlling # the Z axis. [stepper_z]
hu: [printer] kinematics: hybrid_corexy max_z_velocity: # Ez beállítja a Z tengely mentén történő mozgás maximális sebességét (mm/mp-ben). # Az alapértelmezett érték a max_velocity használata a max_z_velocity értékhez. max_z_accel: # Ez beállítja a Z tengely mentén történő mozgás maximális gyorsulását (mm/mp^2-en). # Az alapértelmezett érték a max_accel használata a max_z_accel értékhez. # A stepper_x szakasz az X tengely, valamint az X-Y mozgást vezérlő léptető leírására szolgál. [lépcső_x] # A stepper_y szakasz az Y tengelyt vezérlő léptető leírására szolgál. [lépés_y] # A stepper_z szakasz a Z tengelyt vezérlő léptető leírására szolgál. [stepper_z]
it: [printer] kinematics: hybrid_corexy max_z_velocity: # Imposta la velocità massima (in mm/s) di movimento lungo # l'asse z. L'impostazione predefinita è utilizzare max_velocity # per max_z_velocity. max_z_accel: # Imposta l'accelerazione massima (in mm/s^2) del movimento # lungo l'asse z. L'impostazione predefinita è utilizzare max_accel # per max_z_accel. # La sezione stepper_x viene utilizzata per descrivere l'asse X e lo # stepper che controlla il movimento X-Y. [stepper_x] # La sezione stepper_y viene utilizzata per descrivere lo stepper # che controlla l'asse Y. [stepper_y] # La sezione stepper_z viene utilizzata per descrivere lo stepper # che controlla l'asse Z. [stepper_z]

source: [printer] kinematics: hybrid_corexz max_z_velocity: # This sets the maximum velocity (in mm/s) of movement along the z # axis. The default is to use max_velocity for max_z_velocity. max_z_accel: # This sets the maximum acceleration (in mm/s^2) of movement along # the z axis. The default is to use max_accel for max_z_accel. # The stepper_x section is used to describe the X axis as well as the # stepper controlling the X-Z movement. [stepper_x] # The stepper_y section is used to describe the stepper controlling # the Y axis. [stepper_y] # The stepper_z section is used to describe the stepper controlling # the Z axis. [stepper_z]
hu: [printer] kinematics: hybrid_corexz max_z_velocity: # Ez beállítja a Z tengely mentén történő mozgás maximális sebességét (mm/mp-ben). # Az alapértelmezett érték a max_velocity használata a max_z_velocity értékhez. max_z_accel: # Ez beállítja a Z tengely mentén történő mozgás maximális gyorsulását (mm/mp^2-en). # Az alapértelmezett érték a max_accel használata a max_z_accel értékhez. # A stepper_x szakasz az X tengely, valamint az X-Z mozgást vezérlő léptető leírására szolgál. [lépcső_x] # A stepper_y szakasz az Y tengelyt vezérlő léptető leírására szolgál. [lépés_y] # A stepper_z szakasz a Z tengelyt vezérlő léptető leírására szolgál. [stepper_z]
it: [printer] kinematics: hybrid_corexz max_z_velocity: # Questo imposta la velocità massima (in mm/s) di movimento lungo # l'asse z. L'impostazione predefinita è utilizzare max_velocity per # max_z_velocity. max_z_accel: # Imposta l'accelerazione massima (in mm/s^2) del movimento lungo # l'asse z. L'impostazione predefinita è utilizzare max_accel per # max_z_accel. # La sezione stepper_x viene utilizzata per descrivere l'asse X e lo # stepper che controlla il movimento X-Z. [stepper_x] # La sezione stepper_y viene utilizzata per descrivere lo stepper che # controlla l'asse Y. [stepper_y] # La sezione stepper_z viene utilizzata per descrivere lo stepper che # controlla l'asse Z. [stepper_z]
