Repository: Klipper3d/klipper-translations
Catalog: locales/*/LC_MESSAGES/Config_Reference.po
Languages: hu, it

source: # Common parameters available for all menu config sections. #[menu __some_list __some_name] #type: disabled # Permanently disabled menu element, only required attribute is 'type'. # Allows you to easily disable/hide existing menu items. #[menu some_name] #type: # One of command, input, list, text: # command - basic menu element with various script triggers # input - same like 'command' but has value changing capabilities. # Press will start/stop edit mode. # list - it allows for menu items to be grouped together in a # scrollable list. Add to the list by creating menu # configurations using "some_list" as a prefix - for # example: [menu some_list some_item_in_the_list] # vsdlist - same as 'list' but will append files from virtual sdcard # (will be removed in the future) #name: # Name of menu item - evaluated as a template. #enable: # Template that evaluates to True or False. #index: # Position where an item needs to be inserted in list. By default # the item is added at the end. #[menu some_list] #type: list #name: #enable: # See above for a description of these parameters. #[menu some_list some_command] #type: command #name: #enable: # See above for a description of these parameters. #gcode: # Script to run on button click or long click. Evaluated as a # template. #[menu some_list some_input] #type: input #name: #enable: # See above for a description of these parameters. #input: # Initial value to use when editing - evaluated as a template. # Result must be float. #input_min: # Minimum value of range - evaluated as a template. Default -99999. #input_max: # Maximum value of range - evaluated as a template. Default 99999. #input_step: # Editing step - Must be a positive integer or float value. It has # internal fast rate step. When "(input_max - input_min) / # input_step > 100" then fast rate step is 10 * input_step else fast # rate step is same input_step. #realtime: # This attribute accepts static boolean value. When enabled then # gcode script is run after each value change. The default is False. #gcode: # Script to run on button click, long click or value change. # Evaluated as a template. The button click will trigger the edit # mode start or end.
hu: # Az összes menü konfigurációs szakaszhoz elérhető közös paraméterek. #[menu __some_list __some_name] #type: disabled # A menüelem végleg letiltva, csak a kötelező attribútum a 'type'. # Lehetővé teszi a meglévő menüpontok egyszerű letiltását/elrejtését. #[menu some_name] #type: # Az egyik parancs, input, list, text: # command - alapvető menüelem különféle script triggerekkel # input - ugyanaz, mint a „command”, de értékváltoztató # képességekkel rendelkezik. # Nyomja meg a szerkesztési mód # elindításához/leállításához. # list - lehetővé teszi a menüelemek egy görgethető listába # történő csoportosítását. # Adjon hozzá a listához menükonfigurációk létrehozásával # a „some_list” előtagként – # például: [menu some_list some_item_in_the_list] # vsdlist - ugyanaz, mint a "list", de hozzáfűzi a virtuális # sdcard fájlokat (a jövőben eltávolítjuk) #name: # A menüpont neve - sablonként értékelve. #enable: # Sablon, amely igazra vagy hamisra értékeli. #index: # Pozíció, ahol egy elemet be kell illeszteni a listába. Alapértelmezés # szerint az elem a végére kerül hozzáadásra. #[menu some_list] #type: list #name: #enable: # A fenti paraméterek leírását lásd fent. #[menu some_list some_command] #type: command #name: #enable: # A fenti paraméterek leírását lásd fent. #gcode: # Gombkattintással vagy hosszú kattintással futtatható szkript. # Sablonként értékelve. #[menu some_list some_input] #type: input #name: #enable: # A fenti paraméterek leírását lásd fent. #input: # Szerkesztéskor használandó kezdeti érték – sablonként értékelve. # Az eredménynek lebegőértéknek kell lennie. #input_min: # Tartomány minimális értéke – sablonként értékelve. # Alapértelmezett -99999. #input_max: # Tartomány maximális értéke – sablonként értékelve. # Alapértelmezett 99999. #input_step: # Szerkesztési lépés – pozitív egész számnak vagy lebegőértéknek # kell lennie. Belső gyorslépéssel rendelkezik. # Ha "(input_max - input_min) / input_step > 100", akkor a gyors # sebesség lépése 10 * input_step, különben a gyors ütem ugyanaz # a bemeneti_lépés. #realtime: # Ez az attribútum statikus logikai értéket fogad el. Ha engedélyezve # van, akkor a G-kód szkript minden értékváltozás után lefut. # Az alapértelmezett érték False. #gcode: # Gombkattintással, hosszú kattintással vagy értékmódosítással # futtatható szkript. Sablonként értékelve. A gomb kattintása elindítja # a szerkesztési mód kezdetét vagy befejezését.

source: [filament_switch_sensor my_sensor] #pause_on_runout: True # When set to True, a PAUSE will execute immediately after a runout # is detected. Note that if pause_on_runout is False and the # runout_gcode is omitted then runout detection is disabled. Default # is True. #runout_gcode: # A list of G-Code commands to execute after a filament runout is # detected. See docs/Command_Templates.md for G-Code format. If # pause_on_runout is set to True this G-Code will run after the # PAUSE is complete. The default is not to run any G-Code commands. #insert_gcode: # A list of G-Code commands to execute after a filament insert is # detected. See docs/Command_Templates.md for G-Code format. The # default is not to run any G-Code commands, which disables insert # detection. #event_delay: 3.0 # The minimum amount of time in seconds to delay between events. # Events triggered during this time period will be silently # ignored. The default is 3 seconds. #pause_delay: 0.5 # The amount of time to delay, in seconds, between the pause command # dispatch and execution of the runout_gcode. It may be useful to # increase this delay if OctoPrint exhibits strange pause behavior. # Default is 0.5 seconds. #switch_pin: # The pin on which the switch is connected. This parameter must be # provided.
hu: [filament_switch_sensor my_sensor] #pause_on_runout: True # Ha True értékre van állítva, a PAUSE azonnal végrehajtódik, miután a # rendszer szálkifutást észlel. Ne feledje, hogy ha a pause_on_runout # értéke False, és a runout_gcode kimarad, akkor a kifutás észlelése le # van tiltva. Az alapértelmezett érték True. #runout_gcode: # A nyomtatószál kifutását követően végrehajtandó G-kód parancsok listája. # Lásd a docs/Command_Templates.md fájlt a G-kód formátumhoz. Ha a # pause_on_runout értéke True, ez a G-kód a PAUSE befejezése után fog # futni. Az alapértelmezés szerint nem fut semmilyen G-kód parancs. #insert_gcode: # A nyomtatószál-beillesztés észlelése után végrehajtandó G-kód parancsok # listája. Lásd a docs/Command_Templates.md fájlt a G-kód formátumhoz. # Az alapértelmezés szerint nem fut semmilyen G-kód parancs, ami letiltja # a beszúrás észlelését. #event_delay: 3.0 # Az események közötti késleltetés minimális időtartama másodpercben. # Az ebben az időszakban elindított eseményeket a rendszer csendben # figyelmen kívül hagyja. Az alapértelmezett érték 3 másodperc. #pause_delay: 0.5 # A szüneteltetési parancs kiküldése és a runout_gcode végrehajtása # között eltelt idő másodpercben. Hasznos lehet növelni ezt a késleltetést, # ha az OctoPrint furcsa szüneteltetést mutat. # Az alapértelmezett érték 0,5 másodperc. #switch_pin: # Az a tű, amelyre a kapcsoló csatlakoztatva van. # Ezt a paramétert meg kell adni.
it: [filament_switch_sensor my_sensor] #pause_on_runout: True # Se impostato su True, verrà eseguita una PAUSA immediatamente # dopo il rilevamento di un'eccentricità. Si noti che se pause_on_runout # è False e runout_gcode viene omesso, il rilevamento dell'eccentricità # è disabilitato. L'impostazione predefinita è Vero. #runout_gcode: # Un elenco di comandi G-Code da eseguire dopo il rilevamento di # un'esaurimento del filamento. Vedi docs/Command_Templates.md # per il formato G-Code. Se pause_on_runout è impostato su True, # questo codice G verrà eseguito al termine della PAUSA. # L'impostazione predefinita è di non eseguire alcun comando G-Code. #insert_gcode: # Un elenco di comandi G-Code da eseguire dopo il rilevamento # dell'inserimento di filamento. Vedi docs/Command_Templates.md # per il formato G-Code. L'impostazione predefinita non prevede # l'esecuzione di alcun comando G-Code, che disabilita il rilevamento # dell'inserimento. #event_delay: 3.0 # Il tempo minimo in secondi per ritardare tra gli eventi. Gli eventi # attivati durante questo periodo di tempo verranno ignorati # silenziosamente. L'impostazione predefinita è 3 secondi. #pause_delay: 0.5 # Il tempo di ritardo, in secondi, tra l'invio del comando pause e # l'esecuzione di runout_gcode. Potrebbe essere utile aumentare # questo ritardo se OctoPrint mostra uno strano comportamento # di pausa. Il valore predefinito è 0,5 secondi. #switch_pin: # Il pin su cui è collegato l'interruttore. # Questo parametro deve essere fornito.

source: [filament_motion_sensor my_sensor] detection_length: 7.0 # The minimum length of filament pulled through the sensor to trigger # a state change on the switch_pin # Default is 7 mm. extruder: # The name of the extruder section this sensor is associated with. # This parameter must be provided. switch_pin: #pause_on_runout: #runout_gcode: #insert_gcode: #event_delay: #pause_delay: # See the "filament_switch_sensor" section for a description of the # above parameters.
hu: [filament_motion_sensor my_sensor] detection_length: 7.0 # Az érzékelőn áthúzott nyomtatószál minimális hossza, amely # állapotváltozást vált ki a switch_pin tűn. # Az alapértelmezett érték 7mm. extruder: # Az extruderrész neve, amelyhez ez az érzékelő kapcsolódik. # Ezt a paramétert meg kell adni. switch_pin: #pause_on_runout: #runout_gcode: #insert_gcode: #event_delay: #pause_delay: # A fenti paraméterek leírását a "filament_switch_sensor" # részben találja.
it: [filament_motion_sensor my_sensor] detection_length: 7.0 # La lunghezza minima di filamento tirato attraverso il sensore # per attivare un cambio di stato su switch_pin # Il default è 7 mm. extruder: # Nome della sezione extruder section con cui questo sensore è associato. # Questo parametro deve essere fornito. switch_pin: #pause_on_runout: #runout_gcode: #insert_gcode: #event_delay: #pause_delay: # Vedere la sezione "filament_switch_sensor" per la descrizione dei # parametri riportati sopra.

source: [tsl1401cl_filament_width_sensor] #pin: #default_nominal_filament_diameter: 1.75 # (mm) # Maximum allowed filament diameter difference as mm. #max_difference: 0.2 # The distance from sensor to the melting chamber as mm. #measurement_delay: 100
hu: [tsl1401cl_filament_width_sensor] #pin: #default_nominal_filament_diameter: 1.75 # (mm) # A nyomtatószál átmérőjének megengedett legnagyobb # eltérése mm-ben. #max_difference: 0.2 # Az érzékelő és a fúvóka közötti távolság mm-ben. #measurement_delay: 100
it: sl1401cl_filament_width_sensor] #pin: #diametro nominale del filamento predefinito: 1,75 (mm) # Differenza massima consentita del diametro del filamento in mm. #max_difference: 0.2 # La distanza dal sensore alla camera di fusione in mm. #measurement_delay: 100

source: [hall_filament_width_sensor] adc1: adc2: # Analog input pins connected to the sensor. These parameters must # be provided. #cal_dia1: 1.50 #cal_dia2: 2.00 # The calibration values (in mm) for the sensors. The default is # 1.50 for cal_dia1 and 2.00 for cal_dia2. #raw_dia1: 9500 #raw_dia2: 10500 # The raw calibration values for the sensors. The default is 9500 # for raw_dia1 and 10500 for raw_dia2. #default_nominal_filament_diameter: 1.75 # The nominal filament diameter. This parameter must be provided. #max_difference: 0.200 # Maximum allowed filament diameter difference in millimeters (mm). # If difference between nominal filament diameter and sensor output # is more than +- max_difference, extrusion multiplier is set back # to %100. The default is 0.200. #measurement_delay: 70 # The distance from sensor to the melting chamber/hot-end in # millimeters (mm). The filament between the sensor and the hot-end # will be treated as the default_nominal_filament_diameter. Host # module works with FIFO logic. It keeps each sensor value and # position in an array and POP them back in correct position. This # parameter must be provided. #enable: False # Sensor enabled or disabled after power on. The default is to # disable. #measurement_interval: 10 # The approximate distance (in mm) between sensor readings. The # default is 10mm. #logging: False # Out diameter to terminal and klipper.log can be turn on|of by # command. #min_diameter: 1.0 # Minimal diameter for trigger virtual filament_switch_sensor. #use_current_dia_while_delay: False # Use the current diameter instead of the nominal diameter while # the measurement delay has not run through. #pause_on_runout: #runout_gcode: #insert_gcode: #event_delay: #pause_delay: # See the "filament_switch_sensor" section for a description of the # above parameters.
hu: [hall_filament_width_sensor] adc1: adc2: # Az érzékelőhöz csatlakoztatott analóg bemeneti érintkezők. Ezeket a # paramétereket meg kell adni. #cal_dia1: 1.50 #cal_dia2: 2.00 # Az érzékelők kalibrációs értékei (mm-ben). Az alapértelmezett érték # 1,50 a cal_dia1 és 2,00 a cal_dia2 esetén. #raw_dia1: 9500 #raw_dia2: 10500 # Az érzékelők nyers kalibrációs értékei. Az alapértelmezett érték # 9500 a raw_dia1 és 10500 a raw_dia2 esetén. #default_nominal_filament_diameter: 1.75 # A nyomtatószál névleges átmérője. Ezt a paramétert meg kell adni. #max_difference: 0.200 # Az izzószál átmérőjének megengedett legnagyobb eltérése # milliméterben (mm). # Ha az izzószál névleges átmérője és az érzékelő kimenete közötti # különbség nagyobb, mint +- max_difference, az extrudálási szorzó # visszaáll %100-ra. Az alapértelmezett érték 0,200. #measurement_delay: 70 # Az érzékelő és a nyomtatófej/forró vége (nozzle) közötti távolság # milliméterben (mm). Az érzékelő és a nyomtatófej közötti # nyomtatószál default_nominal_filament_diameter-ként lesz kezelve. # A gazdagép modul FIFO logikával működik. Minden szenzorértéket # és pozíciót egy tömbben tart, és visszaállítja őket a megfelelő pozícióba. # Ezt a paramétert meg kell adni. #enable: False # Az érzékelő engedélyezve vagy letiltva a bekapcsolás után. # Az alapértelmezett a letiltása. #measurement_interval: 10 # Hozzávetőleges távolság (mm-ben) az érzékelő leolvasásai között. # Az alapértelmezett 10 mm. #logging: False # Kimeneti átmérő a terminálhoz és a klipper.log-hoz küld, amit ki # lehet kapcsolni. #min_diameter: 1.0 # A virtuális trigger minimális átmérője filament_switch_sensor. #use_current_dia_while_delay: False # Használja az aktuális átmérőt a névleges átmérő helyett, amíg a # mérési késleltetés nem futott át. #pause_on_runout: #runout_gcode: #insert_gcode: #event_delay: #pause_delay: # A fenti paraméterek leírását lásd a "filament_switch_sensor" részben.
it: [hall_filament_width_sensor] adc1: adc2: # Pin di ingresso analogico collegati al sensore. # Questi parametri devono essere forniti. #cal_dia1: 1.50 #cal_dia2: 2.00 # I valori di calibrazione (in mm) per i sensori. Il valore predefinito # è 1.50 per cal_dia1 e 2.00 per cal_dia2. #raw_dia1: 9500 #raw_dia2: 10500 # I valori di calibrazione grezzi per i sensori. Il valore predefinito è # 9500 per raw_dia1 e 10500 per raw_dia2. #default_nominal_filament_diameter: 1.75 # Il diametro nominale del filamento. # Questo parametro deve essere fornito. #max_difference: 0.200 # Differenza massima consentita del diametro del filamento in # millimetri (mm). Se la differenza tra il diametro nominale del # filamento e l'uscita del sensore è maggiore di +- max_difference, # il moltiplicatore di estrusione viene riportato a %100. # Il valore predefinito è 0,200. #measurement_delay: 70 # La distanza dal sensore alla camera di fusione/hot-end in # millimetri (mm). Il filamento tra il sensore e l'hot-end verrà # trattato come default_nominal_filament_diameter. Il modulo # host funziona con la logica FIFO. Mantiene ogni valore e posizione # del sensore in un array e li riporta nella posizione corretta. # Questo parametro deve essere fornito. #enable: False # Sensore abilitato o disabilitato dopo l'accensione. L'impostazione predefinita è disabilitare. #measurement_interval: 10 # La distanza approssimativa (in mm) tra le letture del sensore. # Il valore predefinito è 10 mm. #logging: False # Il log esterno al terminale e klipper.log può essere # attivato|off tramite comando. #min_diameter: 1.0 # Diametro minimo per trigger filament_switch_sensor virtuale. #use_current_dia_while_delay: False # Utilizzare il diametro attuale invece del diametro nominale # mentre il ritardo di misurazione non è trascorso. #pause_on_runout: #runout_gcode: #insert_gcode: #event_delay: #pause_delay: # Vedere la sezione "filament_switch_sensor" per una # descrizione dei parametri di cui sopra.

source: [sx1509 my_sx1509] i2c_address: # I2C address used by this expander. Depending on the hardware # jumpers this is one out of the following addresses: 62 63 112 # 113. This parameter must be provided. #i2c_mcu: #i2c_bus: #i2c_speed: # See the "common I2C settings" section for a description of the # above parameters. #i2c_bus: # If the I2C implementation of your micro-controller supports # multiple I2C busses, you may specify the bus name here. The # default is to use the default micro-controller i2c bus.
hu: [sx1509 my_sx1509] i2c_address: # A bővítő által használt I2C cím. A hardveres jumperektől # függően ez a következő címek egyike: 62 63 112 113. # Ezt a paramétert meg kell adni. #i2c_mcu: #i2c_bus: #i2c_speed: # A fenti paraméterek leírását lásd az "általános I2C beállítások" # részben. #i2c_bus: # Ha a mikrovezérlő I2C megvalósítása több I2C buszt is támogat, # itt megadhatja a busz nevét. # Az alapértelmezett a mikrovezérlő I2C busz használata.
it: [sx1509 my_sx1509] i2c_address: # Indirizzo I2C utilizzato da questa espansione. A seconda dei # ponticelli hardware è uno dei seguenti indirizzi: 62 63 112 113. # Questo parametro deve essere fornito. #i2c_mcu: #i2c_bus: #i2c_speed: # Vedere la sezione "impostazioni comuni I2C" per una # escrizione dei parametri di cui sopra. #i2c_bus: # Se l'implementazione I2C del tuo microcontrollore supporta # più bus I2C, puoi specificare qui il nome del bus. L'impostazione # predefinita prevede l'utilizzo del bus i2c del microcontrollore # predefinito.

source: [adc_scaled my_name] vref_pin: # The ADC pin to use for VREF monitoring. This parameter must be # provided. vssa_pin: # The ADC pin to use for VSSA monitoring. This parameter must be # provided. #smooth_time: 2.0 # A time value (in seconds) over which the vref and vssa # measurements will be smoothed to reduce the impact of measurement # noise. The default is 2 seconds.
hu: [adc_scaled my_name] vref_pin: # A VREF monitorozásához használt ADC tű. Ezt a paramétert meg kell adni. vssa_pin: # A VSSA monitorozásához használandó ADC tű. Ezt a paramétert meg kell adni. #smooth_time: 2.0 # Egy időérték (másodpercben), amely alatt a vref és a vssa # mérések simításra kerülnek, hogy csökkentsék a mérés hatását # zaj csökkentése érdekében. Az alapértelmezett érték 2 másodperc.

source: [palette2] serial: # The serial port to connect to the Palette 2. #baud: 115200 # The baud rate to use. The default is 115200. #feedrate_splice: 0.8 # The feedrate to use when splicing, default is 0.8 #feedrate_normal: 1.0 # The feedrate to use after splicing, default is 1.0 #auto_load_speed: 2 # Extrude feedrate when autoloading, default is 2 (mm/s) #auto_cancel_variation: 0.1 # Auto cancel print when ping varation is above this threshold
hu: [paletta2] serial: # A soros port, amelyhez a Palette 2 csatlakozik. #baud: 115200 # A használandó baud-ráta. Az alapértelmezett érték 115200. #feedrate_splice: 0.8 # A toldáskor használandó feedrate, alapértelmezett 0.8. #feedrate_normal: 1.0 # A toldás után használandó feedrate, alapértelmezett értéke 1.0. #auto_load_speed: 2 # Extrudálási előtolási sebesség automatikus betöltéskor, alapértelmezett 2 (mm/mp) #auto_cancel_variation: 0.1 # Automatikusan törli a nyomtatást, ha a ping meghaladja ezt a küszöbértéket.
it: [palette2] serial: # La porta seriale per la connessione alla Palette 2. #baud: 115200 # La velocità da utilizzare. Il valore predefinito è 115200. #feedrate_splice: 0.8 # L'avanzamento da utilizzare durante la giunzione # il valore predefinito è 0.8 #feedrate_normal: 1.0 # L'avanzamento da utilizzare dopo la giunzione # il valore predefinito è 1.0 #auto_load_speed: 2 # Avanzamento di estrusione durante il caricamento automatico # il valore predefinito è 2 (mm/s) #auto_cancel_variation: 0.1 # Annullamento automatico della stampa quando la variazione # del ping è superiore a questa soglia

source: #spi_speed: # The SPI speed (in hz) to use when communicating with the device. # The default depends on the type of device. #spi_bus: # If the micro-controller supports multiple SPI busses then one may # specify the micro-controller bus name here. The default depends on # the type of micro-controller. #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # Specify the above parameters to use "software based SPI". This # mode does not require micro-controller hardware support (typically # any general purpose pins may be used). The default is to not use # "software spi".
hu: #spi_speed: # Az eszközzel való kommunikáció során használandó # SPI-sebesség (hz-ben). # Az alapértelmezett érték az eszköz típusától függ. #spi_bus: # Ha a mikrovezérlő több SPI buszt támogat, akkor itt megadhatja a # mikrovezérlő busz nevét. Az alapértelmezett érték a mikrovezérlő # típusától függ. #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # Adja meg a fenti paramétereket a "szoftver alapú SPI" használatához. # Ez a mód nem igényel mikrovezérlő hardver támogatást (általában # bármilyen általános célú érintkező használható). Az alapértelmezés # szerint nem használja a "software SPI"-t.
it: #spi_speed: # La velocità SPI (in Hz) da utilizzare durante la comunicazione con il # dispositivo. L'impostazione predefinita dipende dal tipo di dispositivo. #spi_bus: # Se il microcontrollore supporta più bus SPI, è possibile specificare # qui il nome del bus del microcontrollore. L'impostazione predefinita # dipende dal tipo di microcontrollore. #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # Specificare i parametri di cui sopra per utilizzare "SPI basato su # software". Questa modalità non richiede il supporto hardware del # microcontrollore (in genere è possibile utilizzare qualsiasi pin generico). # L'impostazione predefinita è di non utilizzare "spi software".
