Repository: Klipper3d/klipper-translations
Catalog: locales/*/LC_MESSAGES/Config_checks.po
Languages: hu, it, ru

source: To test the extruder motor it will be necessary to heat the extruder to a printing temperature. Navigate to the Octoprint temperature tab and select a target temperature from the temperature drop-down box (or manually enter an appropriate temperature). Wait for the printer to reach the desired temperature. Then navigate to the Octoprint control tab and click the "Extrude" button. Verify that the extruder motor turns in the correct direction. If it does not, see the troubleshooting tips in the previous section to confirm the "enable_pin", "step_pin", and "dir_pin" settings for the extruder.
hu: Az extruder motor teszteléséhez a nyomtatófejet nyomtatási hőmérsékletre kell melegíteni. Navigáljon az Octoprint hőmérséklet fülre, és válasszon ki egy célhőmérsékletet a hőmérséklet legördülő menüből (vagy adja meg manuálisan a megfelelő hőmérsékletet). Várja meg, amíg a nyomtató eléri a kívánt hőmérsékletet. Ezután navigáljon az Octoprint vezérlő lapra, és kattintson az "Extrudálás" gombra. Ellenőrizze, hogy az extruder motorja a megfelelő irányba forog-e. Ha nem, akkor az előző szakaszban található hibaelhárítási tippek alapján ellenőrizze az extruder "enable_pin", "step_pin" és "dir_pin" beállításait.
it: Per testare il motore dell'estrusore sarà necessario riscaldare l'estrusore alla temperatura di stampa. Passare alla pagina della temperatura Octoprint e selezionare una temperatura di target nel menù a tendina della temperatura (o inserire manualmente una temperatura opportuna). Attendere che la stampante raggiunga la temperatura desiderata. Quindi vai alla pagina di controllo di Octoprint e fai clic sul pulsante "Estrudi". Verificare che il motore dell'estrusore giri nella direzione corretta. In caso contrario, vedere i suggerimenti per la risoluzione dei problemi nella sezione precedente per verificare le impostazioni "enable_pin", "step_pin" e "dir_pin" per l'estrusore.
ru: Для проверки двигателя экструдера необходимо нагреть экструдер до температуры печати. Перейдите на вкладку «Температура Octoprint» и выберите целевую температуру в раскрывающемся списке температур (или введите соответствующую температуру вручную). Подождите, пока принтер не достигнет нужной температуры. Затем перейдите на вкладку управления Octoprint и нажмите кнопку «Выдавливание». Убедитесь, что двигатель экструдера вращается в правильном направлении. Если это не так, см. советы по устранению неполадок в предыдущем разделе, чтобы подтвердить настройки «enable_pin», «step_pin» и «dir_pin» для экструдера.

source: Calibrate PID settings
hu: PID beállítások kalibrálása
it: Calibrare le impostazioni del PID
ru: Калибровка настроек PID

source: To calibrate the extruder, navigate to the OctoPrint terminal tab and run the PID_CALIBRATE command. For example: `PID_CALIBRATE HEATER=extruder TARGET=170`
hu: Az extruder kalibrálásához navigáljon az OctoPrint terminál fülre, és futtassa a PID_CALIBRATE parancsot. Például: `PID_CALIBRATE HEATER=extruder TARGET=170`
it: Per calibrare l'estrusore, accedere alla pagina del terminale OctoPrint ed eseguire il comando PID_CALIBRATE. Ad esempio: `PID_CALIBRATE HEATER=estrusore TARGET=170`
ru: Чтобы откалибровать экструдер, перейдите на вкладку терминала OctoPrint и выполните команду PID_CALIBRATE. Например: `PID_CALIBRATE HEATER=eextruder TARGET=170`

source: At the completion of the tuning test run `SAVE_CONFIG` to update the printer.cfg file the new PID settings.
hu: A hangolási teszt végén futtassa a `SAVE_CONFIG` parancsot a printer.cfg fájl új PID-beállításainak frissítéséhez.
it: Al termine del test di ottimizzazione, eseguire l'istruzione `SAVE_CONFIG` per aggiornare il file printer.cfg con le nuove impostazioni PID.
ru: По завершении тестовой настройки запустите `SAVE_CONFIG`, чтобы обновить файл print.cfg с новыми настройками PID.

source: If the printer has a heated bed and it supports being driven by PWM (Pulse Width Modulation) then it is recommended to use PID control for the bed. (When the bed heater is controlled using the PID algorithm it may turn on and off ten times a second, which may not be suitable for heaters using a mechanical switch.) A typical bed PID calibration command is: `PID_CALIBRATE HEATER=heater_bed TARGET=60`
hu: Ha a nyomtató fűtött ággyal rendelkezik, és az támogatja a PWM (impulzusszélesség-moduláció) vezérlést, akkor ajánlott PID vezérlést használni az ágyhoz. (Ha az ágyfűtést PID algoritmussal vezérli, akkor másodpercenként tízszer is be- és kikapcsolhat, ami nem biztos, hogy megfelelő a mechanikus kapcsolót használó fűtőberendezésekhez.) A tipikus ágy PID-kalibrálási parancs: `PID_CALIBRATE HEATER=heater_bed TARGET=60`
it: Se la stampante ha un piatto riscaldato ed è dotato di azionamento con funzione PWM (Pulse Width Modulation), si consiglia di utilizzare il controllo PID per il piatto. (Quando il riscaldatore del piatto è controllato utilizzando l'algoritmo PID, potrebbe accendersi e spegnersi dieci volte al secondo, il che potrebbe non essere adatto per i riscaldatori che utilizzano un relè elettromeccanico.) Un tipico comando per calibrazione PID del piatto è: `PID_CALIBRATE HEATER=heater_bed TARGET= 60`
ru: Если в принтере есть стол с подогревом и он поддерживает управление с помощью PWM (широтно-импульсной модуляции), то рекомендуется использовать ПИД-регулятор для стола. (Когда нагреватель стола управляется с помощью алгоритма PID, он может включаться и выключаться десять раз в секунду, что может не подходить для нагревателей с механическим переключателем.) Типичная команда калибровки PID стола: `PID_CALIBRATE HEATER=heater_bed TARGET=60`

source: Next steps
hu: Következő lépések
it: Passo sucessivo
ru: Следующие шаги

source: This guide is intended to help with basic verification of pin settings in the Klipper configuration file. Be sure to read the [bed leveling](Bed_Level.md) guide. Also see the [Slicers](Slicers.md) document for information on configuring a slicer with Klipper.
hu: Ez az útmutató a Klipper konfigurációs fájlban lévő tű-beállítások alapvető ellenőrzéséhez nyújt segítséget. Mindenképpen olvassa el az [ágy szintezése](Bed_Level.md) útmutatót. A Klipperrel történő szeletelő konfigurálásával kapcsolatos információkért olvassa el a [Szeletelők](Slicers.md) dokumentumot is.
it: Questa guida ha lo scopo di aiutare la verifica delle impostazioni di base riferite ai pin presenti nel file di configurazione di Klipper. Assicurati di leggere la guida [bed leveling](Bed_Level.md). Consulta anche il documento [Slicers](Slicers.md) per informazioni sulla configurazione di un software slicer con Klipper.
ru: Это руководство призвано помочь с базовой проверкой настроек контактов в файле конфигурации Klipper. Обязательно прочитайте руководство [bed leveling](Bed_Level.md). Также см. документ [Slicers](Slicers.md) для получения информации о настройке слайсера с помощью Klipper.

source: After one has verified that basic printing works, it is a good idea to consider calibrating [pressure advance](Pressure_Advance.md).
hu: Miután meggyőződtünk arról, hogy az alapnyomtatás működik, érdemes megfontolni a [nyomás szabályozás](Pressure_Advance.md) kalibrálását.
it: Dopo aver verificato che la stampa di base funziona, è una buona prassi procedere con la calibrazione [avanzamento pressione](Pressure_Advance.md).

source: It may be necessary to perform other types of detailed printer calibration - a number of guides are available online to help with this (for example, do a web search for "3d printer calibration"). As an example, if you experience the effect called ringing, you may try following [resonance compensation](Resonance_Compensation.md) tuning guide.
hu: Előfordulhat, hogy más típusú részletes nyomtató-kalibrálásra is szükség lehet. Ehhez számos útmutató áll rendelkezésre az interneten (keressen rá például a "3d nyomtató kalibrálás" szövegre). Ha például a gyűrődésnek nevezett hatást tapasztalja, megpróbálhatja követni a [rezonancia kompenzáció](Resonance_Compensation.md) hangolási útmutatót.
it: Potrebbe essere necessario eseguire altri tipi di calibrazione di dettaglio in riferimento alla stampante: sono disponibili numerose guide online per questo scopo (ad esempio, eseguire una ricerca sul Web per "calibrazione della stampante 3d"). Ad esempio, se si verifica l'effetto chiamato risonanza, è possibile provare a seguire la calibrazione tramite l'istruzione [compensazione della risonanza](Resonance_Compensation.md).

source: Configuration checks
hu: Konfigurációs ellenőrzések
it: Controlli della configurazione

source: Klipper supports [PID control](https://en.wikipedia.org/wiki/PID_controller) for the extruder and bed heaters. In order to use this control mechanism, it is necessary to calibrate the PID settings on each printer (PID settings found in other firmwares or in the example configuration files often work poorly).
hu: A Klipper támogatja a [PID-szabályozást](https://en.wikipedia.org/wiki/PID_controller) az extruder és az ágyfűtés számára. Ahhoz, hogy ezt a vezérlési mechanizmust használni lehessen, a PID-beállításokat minden nyomtatónál kalibrálni kell (a más firmware-ekben vagy a példakonfigurációs fájlokban található PID-beállítások gyakran rosszul működnek).
it: Klipper supporta il sistema [controllo PID](https://en.wikipedia.org/wiki/PID_controller) per l'estrusore e i riscaldatori del piatto. Per utilizzare questo sistema di controllo, è necessario calibrare le impostazioni PID su ciascuna stampante (le impostazioni PID presenti in altri firmware o nei file di configurazione di esempio spesso funzionano male).
