Repository: Klipper3d/klipper-translations
Catalog: locales/*/LC_MESSAGES/CONTRIBUTING.po
Languages: fr

source: Contributing to Klipper
fr: Contribuer à Klipper

source: It is important to have a "Signed-off-by" line on each commit - it certifies that you agree to the [developer certificate of origin](developer-certificate-of-origin). It must contain your real name (sorry, no pseudonyms or anonymous contributions) and contain a current email address.
fr: Il est important d'avoir une ligne "Signed-off-by" sur chaque commit - elle certifie que vous acceptez le [certificat d'origine du développeur](developer-certificate-of-origin). Cette ligne doit contenir votre vrai nom (désolé, pas de pseudonymes ou de contributions anonymes) et une adresse électronique valide.

source: module: Capitalized, short (50 chars or less) summary More detailed explanatory text, if necessary. Wrap it to about 75 characters or so. In some contexts, the first line is treated as the subject of an email and the rest of the text as the body. The blank line separating the summary from the body is critical (unless you omit the body entirely); tools like rebase can get confused if you run the two together. Further paragraphs come after blank lines.. Signed-off-by: My Name <myemail@example.org>
fr: module : Résumé en majuscules, court (50 caractères ou moins) Texte explicatif plus détaillé, si nécessaire. Limitez-le à environ 75 caractères ou plus. Dans certains contextes, la première ligne est considérée comme l'objet d'un courriel et le reste du texte comme le corps. sujet d'un message électronique et le reste du texte comme le corps du message. La ligne vierge séparant le résumé du corps est essentielle (à moins que vous n'omettiez entièrement le corps). le corps entièrement) ; des outils comme rebase peuvent être confondus si vous exécutez les les deux ensemble. Les autres paragraphes viennent après les lignes vides.. Signé par : Mon nom <myemail@example.org>

source: Contributing to Klipper Translations
fr: Contribuer aux traductions de Klipper

source: 75% Total coverage
fr: 75% Couverture totale

source: An updated navigation hierarchy PR in klipper-translations.
fr: Une PR (Pull Request) hiérarchisée de navigation mise à jour dans klipper-translations.

source: To reduce the frustration of translating domain-specific terms and gain awareness of the ongoing translations, you can submit a PR modifying the [Klipper-translations Project](https://github.com/Klipper3d/klipper-translations) `readme.md`. Once a translation is ready, the corresponding modification to the Klipper project can be made.
fr: Afin de réduire la frustration liée à la traduction de termes spécifiques à un domaine et de prendre connaissance des traductions en cours, vous pouvez soumettre une PR modifiant le [Projet Klipper-translations](https://github.com/Klipper3d/klipper-translations) `readme.md`. Dès qu'une traduction est prête, la modification correspondante du projet Klipper peut être effectuée.

source: If a translation already exists in the Klipper repository and no longer meets the checklist above, it will be marked out-of-date after a month without updates.
fr: Si une traduction existe déjà dans le référentiel Klipper et ne répond plus à la liste de contrôle ci-dessus, elle sera marquée comme obsolète après un mois sans mise à jour.

source: Thank you for contributing to Klipper! This document describes the process for contributing changes to Klipper.
fr: Merci de contribuer à Klipper ! Ce document décrit la procédure à suivre pour apporter des modifications à Klipper.

source: Please see the [contact page](Contact.md) for information on reporting an issue or for details on contacting the developers.
fr: Veuillez consulter la [page de contact](Contact.md) pour obtenir des informations sur le signalement d'un problème ou pour obtenir des détails sur la manière de contacter les développeurs.

source: Overview of Contribution Process
fr: Aperçu de la procédure de contribution

source: Contributions to Klipper generally follow a high-level process:
fr: Les contributions à Klipper suivent généralement un processus de haut niveau :

source: A submitter starts by creating a [GitHub Pull Request](https://github.com/Klipper3d/klipper/pulls) when a submission is ready for widespread deployment.
fr: Un soumissionnaire commence par créer une [GitHub Pull Request](https://github.com/Klipper3d/klipper/pulls) lorsqu'une soumission est prête à être déployée à grande échelle.

source: When a [reviewer](#reviewers) is available to [review](#what-to-expect-in-a-review) the submission, they will assign themselves to the Pull Request on GitHub. The goal of the review is to look for defects and to check that the submission follows documented guidelines.
fr: Lorsqu'un [relecteur](#reviewers) est disponible pour [réviser](#what-to-expect-in-a-review) la soumission, il s'attribuera la Pull Request sur GitHub. L'objectif de la révision est de rechercher les défauts et de vérifier que la soumission suit les directives documentées.

source: After a successful review, the reviewer will "approve the review" on GitHub and a [maintainer](#reviewers) will commit the change to the Klipper master branch.
fr: Après une révision réussie, le relecteur "approuve la révision" sur GitHub et un [mainteneur](#reviewers) commet la modification dans la branche principale de Klipper.

source: When working on enhancements, consider starting (or contributing to) a topic on [Klipper Discourse](Contact.md). An ongoing discussion on the forum can improve visibility of development work and may attract others interested in testing new work.
fr: Lorsque vous travaillez sur des améliorations, pensez à lancer (ou à contribuer à) un sujet sur [Klipper Discourse](Contact.md). Une discussion continue sur le forum peut améliorer la visibilité du travail de développement et peut attirer d'autres personnes intéressées à tester le nouveau travail.

source: What to expect in a review
fr: A quoi s'attendre lors d'une révision

source: Contributions to Klipper are reviewed before merging. The primary goal of the review process is to check for defects and to check that the submission follows guidelines specified in the Klipper documentation.
fr: Les contributions à Klipper sont examinées avant d'être fusionnées. L'objectif principal du processus de révision est de vérifier l'absence de défauts et de s'assurer que la soumission respecte les directives spécifiées dans la documentation de Klipper.

source: It is understood that there are many ways to accomplish a task; it is not the intent of the review to discuss the "best" implementation. Where possible, review discussions focused on facts and measurements are preferable.
fr: Il est entendu qu'il existe de nombreuses façons d'accomplir une tâche ; l'objectif de la révision n'est pas de discuter de la "meilleure" mise en œuvre. Dans la mesure du possible, il est préférable que les discussions de la révision soient axées sur les faits et les mesures.

source: The majority of submissions will result in feedback from a review. Be prepared to obtain feedback, provide further details, and to update the submission if needed.
fr: La majorité des soumissions donneront lieu à un retour d'information. Soyez prêt à obtenir un retour, à fournir des détails supplémentaires et à mettre à jour la soumission si nécessaire.

source: Common things a reviewer will look for:
fr: Ce que le relecteur recherche le plus souvent :

source: Is the submission free of defects and is it ready to be widely deployed?
fr: La soumission est-elle exempte de défauts et est-elle prête à être déployée à grande échelle ?

source: Submitters are expected to test their changes prior to submission. The reviewers look for errors, but they don't, in general, test submissions. An accepted submission is often deployed to thousands of printers within a few weeks of acceptance. Quality of submissions is therefore considered a priority.
fr: Les soumissionnaires sont censés tester leurs modifications avant de les soumettre. Les relecteurs recherchent les erreurs, mais ne testent pas, en général, les soumissions. Une soumission acceptée est souvent déployée sur des milliers d'imprimantes dans les quelques semaines qui suivent son acceptation. La qualité des soumissions est donc considérée comme une priorité.

source: The main [Klipper3d/klipper](https://github.com/Klipper3d/klipper) GitHub repository does not accept experimental work. Submitters should perform experimentation, debugging, and testing in their own repositories. The [Klipper Discourse](Contact.md) server is a good place to raise awareness of new work and to find users interested in providing real-world feedback.
fr: Le dépôt GitHub principal de [Klipper3d/klipper](https://github.com/Klipper3d/klipper) n'accepte pas les travaux expérimentaux. Les auteurs doivent effectuer les expérimentations, le débogage et les tests dans leurs propres dépôts. Le serveur [Klipper Discourse](Contact.md) est un bon endroit pour faire connaître les nouveaux travaux et trouver des utilisateurs désireux de fournir des commentaires concrets.

source: Submissions must pass all [regression test cases](Debugging.md).
fr: Les soumissions doivent réussir tous les [tests de régression](Debugging.md).

source: Code submissions should not contain excessive debugging code, debugging options, nor run-time debug logging.
fr: Les soumissions de code ne doivent pas contenir de code de débogage excessif, d'options de débogage, ni d'enregistrement de débogage à l'exécution.

source: Comments in code submissions should focus on enhancing code maintenance. Submissions should not contain "commented out code" nor excessive comments describing past implementations. There should not be excessive "todo" comments.
fr: Les commentaires dans les soumissions de code doivent se concentrer sur l'amélioration de la maintenance du code. Les soumissions ne doivent pas contenir de "code commenté" ni de commentaires excessifs décrivant des implémentations passées. Il ne doit pas y avoir de commentaires excessifs de type "todo".

source: Updates to documentation should not declare that they are a "work in progress".
fr: Les mises à jour de la documentation ne doivent pas indiquer qu'il s'agit d'un "travail en cours".

source: Is the copyright of the submission clear, non-gratuitous, and compatible?
fr: Le droit d'auteur de la soumission est-il clair, non gracieux et compatible ?

source: New C files and Python files should have an unambiguous copyright statement. See the existing files for the preferred format. Declaring a copyright on an existing file when making minor changes to that file is discouraged.
fr: Les nouveaux fichiers C et Python doivent comporter une déclaration de copyright sans ambiguïté. Voir les fichiers existants pour le format préféré. Il est déconseillé de déclarer un droit d'auteur sur un fichier existant lorsque l'on apporte des modifications mineures à ce fichier.

source: Code taken from 3rd party sources must be compatible with the Klipper license (GNU GPLv3). Large 3rd party code additions should be added to the `lib/` directory (and follow the format described in [lib/README](../lib/README)).
fr: Le code provenant de sources tierces doit être compatible avec la licence Klipper (GNU GPLv3). Les ajouts importants de code tiers doivent être ajoutés au répertoire `lib/` (et suivre le format décrit dans [lib/README](../lib/README)).

source: Submitters must provide a [Signed-off-by line](#format-of-commit-messages) using their full real name. It indicates the submitter agrees with the [developer certificate of origin](developer-certificate-of-origin).
fr: Les soumissionnaires doivent fournir une [ligne Signed-off-by](#format-of-commit-messages) en utilisant leur nom réel complet. Elle indique que le soumissionnaire est d'accord avec le [certificat d'origine du développeur](developer-certificate-of-origin).

source: Does the submission follow guidelines specified in the Klipper documentation?
fr: La soumission suit-elle les directives spécifiées dans la documentation de Klipper ?

source: In particular, code should follow the guidelines in <Code_Overview.md> and config files should follow the guidelines in <Example_Configs.md>.
fr: En particulier, le code doit suivre les directives de <Code_Overview.md> et les fichiers de configuration doivent suivre les directives de <Example_Configs.md>.

source: Is the Klipper documentation updated to reflect new changes?
fr: La documentation de Klipper est-elle mise à jour pour refléter les nouveaux changements ?

source: At a minimum, the reference documentation must be updated with corresponding changes to the code:
fr: Au minimum, la documentation de référence doit être mise à jour avec les modifications correspondantes du code :

source: All commands and command parameters must be documented in <G-Codes.md>.
fr: Toutes les commandes et tous les paramètres de commande doivent être documentés dans <G-Codes.md>.

source: All user facing modules and their config parameters must be documented in <Config_Reference.md>.
fr: Tous les modules destinés aux utilisateurs et leurs paramètres de configuration doivent être documentés dans <Config_Reference.md>.

source: All exported "status variables" must be documented in <Status_Reference.md>.
fr: Toutes les "variables d'état" exportées doivent être documentées dans <Status_Reference.md>.

source: All new "webhooks" and their parameters must be documented in <API_Server.md>.
fr: Tous les nouveaux "webhooks" et leurs paramètres doivent être documentés dans <API_Server.md>.

source: Any change that makes a non-backwards compatible change to a command or config file setting must be documented in <Config_Changes.md>.
fr: Toute modification qui apporte un changement non rétrocompatible à une commande ou à un paramètre du fichier de configuration doit être documentée dans <Config_Changes.md>.

source: New documents should be added to <Overview.md> and be added to the website index [docs/_klipper3d/mkdocs.yml](../docs/_klipper3d/mkdocs.yml).
fr: Les nouveaux documents doivent être ajoutés à <Overview.md> et être ajoutés à l'index du site web [docs/_klipper3d/mkdocs.yml](../docs/_klipper3d/mkdocs.yml).

source: Are commits well formed, address a single topic per commit, and independent?
fr: Les commits sont-ils bien formés, abordent-ils un seul sujet par commit, et sont-ils indépendants ?

source: Commit messages should follow the [preferred format](#format-of-commit-messages).
fr: Les messages de validation doivent suivre le [format préféré](#format-of-commit-messages).

source: Commits must not have a merge conflict. New additions to the Klipper master branch are always done via a "rebase" or "squash and rebase". It is generally not necessary for submitters to re-merge their submission on every update to the Klipper master repository. However, if there is a merge conflict, then submitters are recommended to use `git rebase` to address the conflict.
fr: Les commits ne doivent pas avoir de conflit de fusion. Les nouveaux ajouts à la branche maîtresse de Klipper sont toujours effectués via un "rebase" ou un "squash and rebase". Il n'est généralement pas nécessaire pour les soumissionnaires de fusionner à nouveau leur soumission à chaque mise à jour du dépôt maître de Klipper. Cependant, s'il y a un conflit de fusion, il est recommandé aux soumissionnaires d'utiliser `git rebase` pour résoudre le conflit.

source: Each commit should address a single high-level change. Large changes should be broken up into multiple independent commits. Each commit should "stand on its own" so that tools like `git bisect` and `git revert` work reliably.
fr: Chaque validation doit porter sur un seul changement de haut niveau. Les changements importants doivent être décomposés en plusieurs commits indépendants. Chaque livraison doit se suffire à elle-même pour que des outils comme `git bisect` et `git revert` fonctionnent de manière fiable.

source: Whitespace changes should not be mixed with functional changes. In general, gratuitous whitespace changes are not accepted unless they are from the established "owner" of the code being modified.
fr: Les modifications des espaces blancs ne doivent pas être mélangées avec les modifications fonctionnelles. En général, les changements gratuits d'espace blanc ne sont pas acceptés, sauf s'ils proviennent du "propriétaire" établi du code en cours de modification.

source: Does the submission provide a "high impact" benefit to real-world users performing real-world tasks?
fr: La demande apporte-t-elle un avantage "à fort impact" à des utilisateurs du monde réel effectuant des tâches du monde réel ?

source: Reviewers need to identify, at least in their own minds, roughly "who the target audience is", a rough scale of "the size of that audience", the "benefit" they will obtain, how the "benefit is measured", and the "results of those measurement tests". In most cases this will be obvious to both the submitter and the reviewer, and it is not explicitly stated during a review.
fr: Les relecteurs doivent identifier, au moins dans leur propre esprit, à peu près "qui est le public cible", une échelle approximative de "la taille de ce public", le "bénéfice" qu'ils obtiendront, comment le "bénéfice est mesuré", et les "résultats de ces tests de mesure". Dans la plupart des cas, ces éléments sont évidents pour l'auteur et l'examinateur, et ne sont pas explicitement mentionnés lors d'un examen.

source: Submissions to the master Klipper branch are expected to have a noteworthy target audience. As a general "rule of thumb", submissions should target a user base of at least a 100 real-world users.
fr: Les soumissions à la branche principale de Klipper doivent avoir un public cible important. En règle générale, les soumissions doivent cibler une base d'au moins 100 utilisateurs du monde réel.

source: If a reviewer asks for details on the "benefit" of a submission, please don't consider it criticism. Being able to understand the real-world benefits of a change is a natural part of a review.
fr: Si un relecteur demande des détails sur les "avantages" d'une proposition, ne considérez pas cela comme une critique. Être capable de comprendre les avantages concrets d'un changement est une partie naturelle d'un examen.

source: All new modules, config options, commands, command parameters, and documents should have "high impact". We do not want to burden users with options that they can not reasonably configure nor do we want to burden them with options that don't provide a notable benefit.
fr: Tous les nouveaux modules, options de configuration, commandes, paramètres de commande et documents doivent avoir un "impact élevé". Nous ne voulons pas imposer aux utilisateurs des options qu'ils ne peuvent raisonnablement pas configurer, ni des options qui n'apportent aucun avantage notable.

source: A reviewer may ask for clarification on how a user is to configure an option - an ideal response will contain details on the process - for example, "users of the MegaX500 are expected to set option X to 99.3 while users of the Elite100Y are expected to calibrate option X using procedure ...".
fr: Un relecteur peut demander des éclaircissements sur la manière dont un utilisateur doit configurer une option - une réponse idéale contiendra des détails sur le processus - par exemple, "les utilisateurs du MegaX500 doivent régler l'option X sur 99,3 tandis que les utilisateurs du Elite100Y doivent calibrer l'option X en utilisant la procédure ...".

source: If the goal of an option is to make the code more modular then prefer using code constants instead of user facing config options.
fr: Si le but d'une option est de rendre le code plus modulaire, il est préférable d'utiliser des constantes de code plutôt que des options de configuration pour l'utilisateur.

source: New modules, new options, and new parameters should not provide similar functionality to existing modules - if the differences are arbitrary than it's preferable to utilize the existing system or refactor the existing code.
fr: Les nouveaux modules, les nouvelles options et les nouveaux paramètres ne doivent pas offrir des fonctionnalités similaires à celles des modules existants - si les différences sont arbitraires, il est préférable d'utiliser le système existant ou de remanier le code existant.

source: Klipper does not implement a strict "coding style guide", but modifications to existing code should follow the high-level code flow, code indentation style, and format of that existing code. Submissions of new modules and systems have more flexibility in coding style, but it is preferable for that new code to follow an internally consistent style and to generally follow industry wide coding norms.
fr: Klipper ne met pas en œuvre un "guide de style de codage" strict, mais les modifications apportées au code existant doivent respecter le flux de code de haut niveau, le style d'indentation du code et le format de ce code existant. Les soumissions de nouveaux modules et systèmes bénéficient d'une plus grande souplesse en matière de style de codage, mais il est préférable que ce nouveau code suive un style cohérent en interne et respecte généralement les normes de codage en vigueur dans le secteur.

source: It is not a goal of a review to discuss "better implementations". However, if a reviewer struggles to understand the implementation of a submission, then they may ask for changes to make the implementation more transparent. In particular, if reviewers can not convince themselves that a submission is free of defects then changes may be necessary.
fr: L'objectif d'une révision n'est pas de discuter de "meilleures mises en œuvre". Cependant, si un relecteur a du mal à comprendre l'implémentation d'une soumission, il peut demander des changements pour rendre l'implémentation plus transparente. En particulier, si les relecteurs ne peuvent pas se convaincre qu'une soumission est exempte de défauts, des changements peuvent être nécessaires.
