Repository: Klipper3d/klipper-translations
Catalog: locales/*/LC_MESSAGES/Debugging.po
Languages: hu, zh_hant

source: This document describes some of the Klipper debugging tools.
hu: Ez a dokumentum a Klipper hibakeresési eszközeinek egy részét ismerteti.
zh_hant: 本文件描述了一些 Klipper 除錯工具。

source: Translating gcode files to micro-controller commands
hu: A G-kód fájlok lefordítása mikrokontroller-parancsokra
zh_hant: 將G-Code檔案轉換為微控制器命令

source: The Klippy host code can run in a batch mode to produce the low-level micro-controller commands associated with a gcode file. Inspecting these low-level commands is useful when trying to understand the actions of the low-level hardware. It can also be useful to compare the difference in micro-controller commands after a code change.
hu: A Klippy gazdagép kódja futhat kötegelt üzemmódban, hogy előállítsa a G-kód fájlhoz tartozó alacsony szintű mikrokontroller-parancsokat. Ezeknek az alacsony szintű parancsoknak a vizsgálata hasznos, amikor megpróbálod megérteni az alacsony szintű hardver műveleteit. Az is hasznos lehet, hogy összehasonlítsuk a mikrokontroller-parancsok közötti különbséget egy kódváltás után.
zh_hant: Klippy 主機程式碼可以在批處理模式下執行並產生G程式碼檔案相應的低階微控制器命令。這些低階命令可以幫助瞭解低階硬體的操作和在修改程式碼后微控制器命令的差異。

source: To run Klippy in this batch mode, there is a one time step necessary to generate the micro-controller "data dictionary". This is done by compiling the micro-controller code to obtain the **out/klipper.dict** file:
hu: A Klippy futtatásához ebben a kötegelt üzemmódban egy egyszeri lépés szükséges a mikrokontroller "adatszótár" létrehozásához. Ez a mikrokontroller kódjának lefordításával történik, hogy megkapjuk az **out/klipper.dict** fájlt:
zh_hant: 要在批處理模式下執行 Klippy，需要首先產生微控制器的"數據字典"。通過編譯微控制器程式碼來獲得**out/klipper.dict**檔案：

source: Once the above is done it is possible to run Klipper in batch mode (see [installation](Installation.md) for the steps necessary to build the python virtual environment and a printer.cfg file):
hu: Ha a fentiek megtörténtek, a Klipper futtatása batch üzemmódban is lehetséges (a [Telepítés](Installation.md) python virtuális környezet és a printer.cfg) fájl létrehozásához szükséges lépéseket lásd:
zh_hant: 完成上述操作后，可以在批處理模式下執行 Klipper（請參閱[安裝](Installation.md)以瞭解構建 Python 虛擬環境(venv)和 printer.cfg 檔案所需的步驟）：

source: The above will produce a file **test.serial** with the binary serial output. This output can be translated to readable text with:
hu: A fenti művelet egy **test.serial** fájlt fog létrehozni a bináris soros kimenettel. Ez a kimenet lefordítható olvasható szöveggé a következővel:
zh_hant: 以上命令將產生一個包含二進制序列輸出的**test.serial**檔案。該檔案可以用以下方法翻譯成可讀文字：

source: The resulting file **test.txt** contains a human readable list of micro-controller commands.
hu: Az eredményül kapott **test.txt** fájl a mikrokontroller parancsok ember által olvasható listáját tartalmazza.
zh_hant: 產生的檔案 **test.txt** 包含可讀的微控制器命令列表。

source: The batch mode disables certain response / request commands in order to function. As a result, there will be some differences between actual commands and the above output. The generated data is useful for testing and inspection; it is not useful for sending to a real micro-controller.
hu: A kötegelt üzemmód letilt bizonyos válasz/kérés parancsokat a működés érdekében. Ennek eredményeképpen a tényleges parancsok és a fenti kimenet között némi eltérés lesz. A generált adatok teszteléshez és ellenőrzéshez hasznosak; nem használhatóak valódi mikrokontrollerhez való elküldésre.
zh_hant: 爲了使批處理模式正常執行，一些響應和請求命令被禁用了。因此，實際命令和上述輸出之間會有一些差異。產生的數據可以用於測試和檢查，但是它不能被髮送到真正的微控制器。

source: Testing with simulavr
hu: Tesztelés simulavr-rel
zh_hant: 用 simulavr 測試

source: The [simulavr](http://www.nongnu.org/simulavr/) tool enables one to simulate an Atmel ATmega micro-controller. This section describes how one can run test gcode files through simulavr. It is recommended to run this on a desktop class machine (not a Raspberry Pi) as it does require significant cpu to run efficiently.
hu: A [simulavr](http://www.nongnu.org/simulavr/) eszköz lehetővé teszi egy Atmel ATmega mikrokontroller szimulálását. Ez a szakasz leírja, hogyan lehet teszt G-kód fájlokat futtatni a simulavr segítségével. Javasoljuk, hogy ezt egy asztali gépen futtasd (nem Raspberry Pi), mivel a hatékony futtatáshoz erős CPU-ra van szükség.
zh_hant: [simulavr](http://www.nongnu.org/simulavr/)工具使人們可以模擬Atmel ATmega微控制器。本節描述瞭如何通過simulavr執行測試gcode檔案。建議在臺式機（而不是Raspberry Pi）上執行這個工具，因為它需要大量的cpu來有效執行。

source: To compile Klipper for use in simulavr, run:
hu: A Klipper lefordításához a simulavr-ben való használathoz futtasd a következőt:
zh_hant: 要編譯Klipper以便在simulavr中使用，請執行：

source: Then, with simulavr running in another window, one can run the following to read gcode from a file (eg, "test.gcode"), process it with Klippy, and send it to Klipper running in simulavr (see [installation](Installation.md) for the steps necessary to build the python virtual environment):
hu: Ezután, ha a simulavr egy másik ablakban fut, futtathatjuk a következőt, hogy G-kódot olvassunk be egy fájlból (pl. "test.gcode"), feldolgozzuk a Klippy-vel, és elküldjük a simulavr-ben futó Klipper-nek (lásd [Telepítés](Installation.md) a python virtuális környezet létrehozásához szükséges lépéseket):
zh_hant: 然後，在另一個視窗中執行simulavr，可以執行以下內容，從一個檔案（例如，"test.gcode"）中讀取gcode，用Klippy處理它，並將其發送到simulavr中執行的Klipper（關於建立python虛擬環境的必要步驟，見[安裝](Installation.md)）:

source: Using simulavr with gtkwave
hu: A simulavr használata gtkwave-vel
zh_hant: 在gtkwave中使用simulavr

source: One useful feature of simulavr is its ability to create signal wave generation files with the exact timing of events. To do this, follow the directions above, but run avrsim.py with a command-line like the following:
hu: A simulavr egyik hasznos funkciója, hogy képes jelhullámgeneráló fájlokat létrehozni az események pontos időzítésével. Ehhez kövesd a fenti utasításokat, de futtasd az avrsim.py programot a következő parancssorral:
zh_hant: simulavr的一個有用的功能是它能夠建立具有準確事件時間的訊號波產生檔案。要做到這一點，請按照上面的指示，在命令列執行avrsim.py請使用：

source: The above would create a file **avrsim.vcd** with information on each change to the GPIOs on PORTA and PORTB. This could then be viewed using gtkwave with:
hu: A fentiek létrehoznak egy **avrsim.vcd** fájlt a PORTA és PORTB GPIO-k minden egyes módosításával kapcsolatos információkkal. Ezt aztán a gtkwave segítségével meg lehetne nézni a következővel:
zh_hant: 以上將建立一個檔案**avrsim.vcd**，其中包括PORTA和PORTB上的GPIO的每個變化資訊。然後可以用gtkwave來檢視：

source: Manually sending commands to the micro-controller
hu: Parancsok kézi küldése a mikrokontrollernek
zh_hant: 手動向微控制器發送命令

source: Normally, the host klippy.py process would be used to translate gcode commands to Klipper micro-controller commands. However, it's also possible to manually send these MCU commands (functions marked with the DECL_COMMAND() macro in the Klipper source code). To do so, run:
hu: Normális esetben a G-kód parancsokat a klippy.py folyamat fordítja Klipper mikrokontroller parancsokra. Azonban az is lehetséges, hogy manuálisan küldjük el ezeket az MCU-parancsokat (a Klipper forráskódjában a DECL_COMMAND() makróval jelölt függvények). Ehhez futtassa a következőket:
zh_hant: 通常情況下，主機klippy.py程序會被用來將gcode命令翻譯成Klipper微控制器命令。然而，也可以手動發送這些MCU命令（Klipper原始碼中標有DECL_COMMAND()宏的函式）。要做到這一點，請執行：

source: See the "HELP" command within the tool for more information on its functionality.
hu: Az eszközön belül a "HELP" parancsban talál további információkat a funkcióiról.
zh_hant: 請參閱該工具中的"HELP"命令，以獲得有關其功能的更多資訊。

source: Some command-line options are available. For more information run: `~/klippy-env/bin/python ./klippy/console.py --help`
hu: Néhány parancssori opció is rendelkezésre áll. További információkért futtassa a: `~/klippy-env/bin/python ./klippy/console.py --help` parancsot
zh_hant: 一些命令列選項是可用的。更多資訊請執行：`~/klippy-env/bin/python ./klippy/console.py --help`

source: Generating load graphs
hu: Terhelési grafikonok generálása
zh_hant: 產生負載圖

source: The Klippy log file (/tmp/klippy.log) stores statistics on bandwidth, micro-controller load, and host buffer load. It can be useful to graph these statistics after a print.
hu: A Klippy naplófájl (/tmp/klippy.log) tárolja a sávszélességre, a mikrokontroller terhelésre és a gazdagép pufferterhelésre vonatkozó statisztikákat. Hasznos lehet ezeket a statisztikákat grafikusan ábrázolni a nyomtatás után.
zh_hant: Klippy日誌檔案（/tmp/klippy.log）儲存了關於頻寬、微控制器負載和主機緩衝區負載的統計數據。在列印之後，繪製這些統計數字可能會很有用。

source: To generate a graph, a one time step is necessary to install the "matplotlib" package:
hu: A grafikon generálásához egy alkalommal telepíteni kell a "matplotlib" csomagot:
zh_hant: 爲了產生圖形，有必要安裝"matplotlib"包：

source: Then graphs can be produced with:
hu: Ezután grafikonok készíthetők:
zh_hant: 然後可以使用以下方式產生圖形：

source: One can then view the resulting **loadgraph.png** file.
hu: Ezután megtekinthetjük az eredményül kapott **loadgraph.png** fájlt.
zh_hant: 然後結果可以通過**loadgraph.png**檢視。

source: Different graphs can be produced. For more information run: `~/klipper/scripts/graphstats.py --help`
hu: Különböző grafikonok készíthetők. További információért futtassa: `~/klipper/scripts/graphstats.py --help `
zh_hant: 可以產生不同的圖表。更多資訊請執行：`~/klipper/scripts/graphstats.py --help`

source: Extracting information from the klippy.log file
hu: Információk kinyerése a klippy.log fájlból
zh_hant: 從klippy.log檔案中提取資訊

source: The Klippy log file (/tmp/klippy.log) also contains debugging information. There is a logextract.py script that may be useful when analyzing a micro-controller shutdown or similar problem. It is typically run with something like:
hu: A Klippy naplófájl (/tmp/klippy.log) szintén tartalmaz hibakeresési információkat. Van egy logextract.py szkript, amely hasznos lehet egy mikrokontroller leállásának vagy hasonló problémának az elemzésekor. Általában valami ilyesmivel futtatható:
zh_hant: Klippy的日誌檔案（/tmp/klippy.log）也包含除錯資訊。有一個logextract.py指令碼，在分析微控制器停機或類似問題時可能很有用。它通常是這樣執行的：

source: The script will extract the printer config file and will extract MCU shutdown information. The information dumps from an MCU shutdown (if present) will be reordered by timestamp to assist in diagnosing cause and effect scenarios.
hu: A szkript kinyeri a nyomtató konfigurációs fájlját, és kinyeri az MCU leállítási adatait. Az MCU leállításából származó információsor (ha van ilyen) időbélyegek szerint át lesz rendezve, hogy segítse az ok-okozati forgatókönyvek diagnosztizálását.
zh_hant: 該腳本將提取打印機配置文件並將提取 MCU 關機信息。來自 MCU 關閉（如果存在）的信息轉儲將按時間戳重新排序，以幫助診斷因果場景。

source: Running the regression tests
hu: A regressziós tesztek futtatása
zh_hant: 執行 regression 測試

source: The main Klipper GitHub repository uses "github actions" to run a series of regression tests. It can be useful to run some of these tests locally.
hu: A Klipper GitHub fő tárolója a "github actions" -t használd egy sor regressziós teszt futtatásához. Hasznos lehet néhány ilyen tesztet helyben futtatni.
zh_hant: 主要的 Klipper GitHub 存儲庫使用"github actions"來運行一系列回歸測試。在本地運行其中一些測試可能很有用。

source: The source code "whitespace check" can be run with:
hu: A forráskód "whitespace check" a következővel futtatható:
zh_hant: 源代碼"whitespace check"可以運行：

source: Debugging
hu: Hibakeresés
zh_hant: 除錯

source: Motion analysis and data logging
hu: Mozgáselemzés és adatnaplózás
zh_hant: 動作分析和數據記錄

source: Klipper supports logging its internal motion history, which can be later analyzed. To use this feature, Klipper must be started with the [API Server](API_Server.md) enabled.
hu: A Klipper támogatja a belső mozgástörténet naplózását, amely később elemezhető. Ennek a funkciónak a használatához a Klippert az [API Szerver](API_Server.md) engedélyezésével kell elindítani.
zh_hant: Klipper 支持記錄其內部運動歷史，以後可以對其進行分析。要使用此功能，必須在啟用 [API 服務器](API_Server.md) 的情況下啟動 Klipper。

source: Data logging is enabled with the `data_logger.py` tool. For example:
hu: Az adatnaplózást a `data_logger.py` eszközzel lehet engedélyezni. Például:
zh_hant: 使用 `data_logger.py` 工具啟用數據記錄。例如：

source: This command will connect to the Klipper API Server, subscribe to status and motion information, and log the results. Two files are generated - a compressed data file and an index file (eg, `mylog.json.gz` and `mylog.index.gz`). After starting the logging, it is possible to complete prints and other actions - the logging will continue in the background. When done logging, hit `ctrl-c` to exit from the `data_logger.py` tool.
hu: Ez a parancs csatlakozik a Klipper API-kiszolgálóhoz, feliratkozik az állapot- és mozgásinformációkra, és naplózza az eredményeket. Két fájl jön létre. Egy tömörített adatfájl és egy indexfájl (pl. `mylog.json.gz` és `mylog.index.gz`). A naplózás elindítása után lehetőség van nyomtatások és egyéb műveletek elvégzésére. A naplózás a háttérben folytatódik. Ha befejeztük a naplózást, nyomjuk meg a `ctrl-c` billentyűkombinációt a `data_logger.py` eszközből való kilépéshez.
zh_hant: 此命令將連接到 Klipper API 服務器，訂閱狀態和運動信息，並記錄結果。生成兩個文件 - 一個壓縮數據文件和一個索引文件（例如，`mylog.json.gz` 和 `mylog.index.gz`）。開始記錄後，可以完成打印和其他操作 - 記錄將在後台繼續。完成記錄後，點擊“ctrl-c”退出“data_logger.py”工具。

source: The resulting files can be read and graphed using the `motan_graph.py` tool. To generate graphs on a Raspberry Pi, a one time step is necessary to install the "matplotlib" package:
hu: Az így kapott fájlok a `motan_graph.py` eszközzel olvashatók és grafikusan ábrázolhatók. A grafikonok Raspberry Pi-n történő generálásához egyszeri lépésben telepíteni kell a "matplotlib" csomagot:
zh_hant: 可以使用 `motan_graph.py` 工具讀取生成的文件並繪製圖形。要在 Raspberry Pi 上生成圖形，需要一步安裝“matplotlib”包：

source: However, it may be more convenient to copy the data files to a desktop class machine along with the Python code in the `scripts/motan/` directory. The motion analysis scripts should run on any machine with a recent version of [Python](https://python.org) and [Matplotlib](https://matplotlib.org/) installed.
hu: Kényelmesebb lehet azonban az adatfájlokat a `scripts/motan/` könyvtárban található Python-kóddal együtt egy asztali gépre másolni. A mozgáselemző szkripteknek minden olyan gépen futniuk kell, amelyre a [Python](https://python.org) és a [Matplotlib](https://matplotlib.org/) legújabb verziója telepítve van.
zh_hant: 但是，將數據文件與 `scripts/motan/` 目錄中的 Python 代碼一起復製到桌麵類機器可能更方便。運動分析腳本應該在任何安裝了最新版本的 [Python](https://python.org) 和 [Matplotlib](https://matplotlib.org/) 的機器上運行。

source: Graphs can be generated with a command like the following:
hu: A grafikonok a következő parancs segítségével hozhatók létre:
zh_hant: 可以使用如下命令生成圖形：

source: One can use the `-g` option to specify the datasets to graph (it takes a Python literal containing a list of lists). For example:
hu: A `-g` opciót használhatjuk a grafikusan ábrázolandó adatkészletek megadására (ez egy Python literal-t fogad el, amely listák listáját tartalmazza). Például:
zh_hant: 可以使用 `-g` 選項來指定要繪製的數據集（它需要一個包含列表列表的 Python 文字）。例如：

source: The list of available datasets can be found using the `-l` option - for example:
hu: Az elérhető adatkészletek listája a `-l` opcióval érhető el. Például:
zh_hant: 可以使用 `-l` 選項找到可用數據集的列表 - 例如：

source: It is also possible to specify matplotlib plot options for each dataset:
hu: Lehetőség van arra is, hogy minden egyes adatkészlethez matplotlib ábrázolási opciókat adj meg:
zh_hant: 也可以為每個數據集指定 matplotlib 繪圖選項：

source: Many matplotlib options are available; some examples are "color", "label", "alpha", and "linestyle".
hu: Számos matplotlib opció áll rendelkezésre; néhány példa: "color", "label", "alpha" és "linestyle".
zh_hant: 許多 matplotlib 選項可用；一些例子是"color", "label", "alpha", and "linestyle"。

source: The `motan_graph.py` tool supports several other command-line options - use the `--help` option to see a list. It may also be convenient to view/modify the [motan_graph.py](../scripts/motan/motan_graph.py) script itself.
hu: A `motan_graph.py` eszköz számos más parancssori opciót is támogat a `--help` opcióval megtekintheti a listát. Kényelmes lehet magát a [motan_graph.py](../scripts/motan/motan_graph.py) szkriptet is megtekinteni/módosítani.
zh_hant: `motan_graph.py` 工具支持其他幾個命令行選項 - 使用 `--help` 選項查看列表。查看/修改 [motan_graph.py](../scripts/motan/motan_graph.py) 腳本本身也可能很方便。

source: and compile the micro-controller software for an AVR atmega644p and select SIMULAVR software emulation support. Then one can compile Klipper (run `make`) and then start the simulation with:
hu: és fordítsd le a mikrokontroller szoftvert egy AVR atmega644p számára, és válaszd a SIMULAVR szoftver emulációs támogatást. Ezután lefordíthatjuk a Klippert (futtassuk `make`), majd indítsuk el a szimulációt a következőkkel:

source: The Klippy regression test suite requires "data dictionaries" from many platforms. The easiest way to obtain them is to [download them from github](https://github.com/Klipper3d/klipper/issues/1438). Once the data dictionaries are downloaded, use the following to run the regression suite:
hu: A Klippy regressziós tesztcsomag számos platformról igényel "adatszótárakat". A legegyszerűbben úgy szerezhetjük be őket, ha [letöltjük őket a githubról](https://github.com/Klipper3d/klipper/issues/1438). Miután letöltöttük az adatszótárakat, a regressziós csomag futtatásához használjuk a következőket:
zh_hant: Klippy regression測試套件需要來自許多平台的"data dictionaries"。獲取它們的最簡單方法是[從 github 下載它們](https://github.com/Klipper3d/klipper/issues/1438)。下載"data dictionaries"後，使用以下命令運行regression套件：

source: The raw data logs produced by the `data_logger.py` tool follow the format described in the [API Server](API_Server.md). It may be useful to inspect the data with a Unix command like the following: `gunzip < mylog.json.gz | tr '\03' '\n' | less`
hu: A `data_logger.py` eszköz által előállított nyers adatnaplók az [API Szerver](API_Server.md) című dokumentumban leírt formátumot követik. Hasznos lehet az adatokat egy Unix-paranccsal megvizsgálni, mint például a következő: `gunzip < mylog.json.gz | tr '\03' '\n' | less`
zh_hant: `data_logger.py` 工俱生成的原始數據日誌遵循 [API 服務器](API_Server.md) 中描述的格式。使用 Unix 命令檢查數據可能很有用，如下所示：`gunzip < mylog.json.gz | tr '\03' '\n' | less`

source: To use simulavr, download the simulavr package and compile with python support. Note that the build system may need to have some packages (such as swig) installed in order to build the python module.
hu: A simulavr használatához töltse le a simulavr csomagot, és fordítsd le python támogatással. Vedd figyelembe, hogy a build rendszernek telepítenie kell néhány csomagot (például a swig-et) ahhoz, hogy a python modult fel tudja építeni.
zh_hant: 要使用 simulavr，請下載 simulavr 包並使用 python 支持進行編譯。請注意，構建系統可能需要安裝一些包（例如 swig）才能構建 python 模塊。

source: Make sure a file like **./build/pysimulavr/_pysimulavr.*.so** is present after the above compilation:
hu: Győződjünk meg róla, hogy a fenti fordítás után a **./build/pysimulavr/_pysimulavr.*.so** fájl jött létre:
zh_hant: 確保在上述編譯後存在 **./build/pysimulavr/_pysimulavr.*.so** 之類的文件：

source: This commmand should report a specific file (e.g. **./build/pysimulavr/_pysimulavr.cpython-39-x86_64-linux-gnu.so**) and not an error.
hu: Ennek a parancsnak egy adott fájlt kell jelentenie (pl. **./build/pysimulavr/_pysimulavr.cpython-39-x86_64-linux-gnu.so**), nem pedig hibát.

source: If you are on a Debian-based system (Debian, Ubuntu, etc.) you can install the following packages and generate *.deb files for system-wide installation of simulavr:
hu: Ha Debian-alapú rendszert használsz (Debian, Ubuntu, stb.), akkor telepítheted a következő csomagokat, és *.deb fájlokat generálhatsz a simulavr rendszerszintű telepítéséhez:
zh_hant: 如果您在基於 Debian 的系統（Debian、Ubuntu 等）上，您可以安裝以下軟件包並生成 *.deb 文件以在系統範圍內安裝 simulavr：

source: Note that if you have installed python3-simulavr system-wide, you do not need to set `PYTHONPATH`, and can simply run the simulator as
hu: Vegyük észre, hogy ha a python3-simulavr-t az egész rendszerre telepítettük, akkor nem kell beállítanunk a `PYTHONPATH` értéket, és egyszerűen futtathatjuk a szimulátort mint
zh_hant: 注意，如果你已經安裝了python3-simulavr system-wide，你不需要設置`PYTHONPATH`，並且可以簡單地運行模擬器
