Repository: Klipper3d/klipper-translations
Catalog: locales/*/LC_MESSAGES/Example_Configs.po
Languages: fr, zh_hant

source: This document contains guidelines for contributing an example Klipper configuration to the Klipper github repository (located in the [config directory](../config/)).
fr: Ce document contient des directives pour contribuer à un exemple de configuration Klipper dans le dépôt github de Klipper (situé dans le [répertoire config](../config/)).
zh_hant: 本文件包含向 Klipper Github 倉庫（位於[config directory](../config/)）貢獻 Klipper 配置示例的指南。

source: Note that the [Klipper Community Discourse server](https://community.klipper3d.org) is also a useful resource for finding and sharing config files.
fr: Notez que le [serveur discord communautaire de Klipper](https://community.klipper3d.org) est une ressource utile pour trouver et partager des fichiers de configuration.
zh_hant: 請注意 [Klipper Community Discourse server](https://community.klipper3d.org) 也可以用來尋找和分享配置檔案。

source: Guidelines
fr: Lignes directives
zh_hant: 準則

source: The `generic` prefix is used for a 3d printer board that may be used in many different types of printers.
fr: Le préfixe `generic` est utilisé pour une carte mère d'imprimante 3d qui peut être utilisée sur de nombreux modèles d'imprimantes.
zh_hant: `generic`字首用於通用3D印表機主板。

source: The `kit` prefix is for 3d printers that are assembled according to a widely used specification. These "kit" printers are generally distinct from normal "printers" in that they are not sold by a manufacturer.
fr: Le préfixe `kit` est destiné aux imprimantes 3D assemblées selon une spécification largement utilisée. Ces imprimantes «kit» se distinguent des imprimantes "normales" par le fait qu'elles ne soient pas vendues par un constructeur.
zh_hant: `kit`的字首用於按照公開規範組裝的3D印表機（例如Voron V2.4）。這些 "套件 "印表機通常與普通的印表機不同在它們通常不被製造商銷售。

source: The `sample` prefix is used for config "snippets" that one may copy-and-paste into the main config file.
fr: Le préfixe `sample` est utilisé pour des "extraits" de configuration que l'on peut copier-coller dans le fichier de configuration principal.
zh_hant: `sample`字首用於可以被複制到主配置檔案中的配置 "片段"。

source: The `example` prefix is used to describe printer kinematics. This type of config is typically only added along with code for a new type of printer kinematics.
fr: Le préfixe `example` est utilisé pour décrire la cinématique de l’imprimante. Ce type de configuration n’est généralement ajouté qu’avec le code d’un nouveau type de cinématique d’imprimante.
zh_hant: `example`字首是用來描述印表機運動學。這種型別的配置通常只與新型別的印表機運動學的程式碼一起新增。

source: Klipper must be able to start `printer`, `generic`, and `kit` example config file without error. These config files should be added to the [test/klippy/printers.test](../test/klippy/printers.test) regression test case. Add new config files to that test case in the appropriate section and in alphabetical order within that section.
fr: Klipper doit être capable de démarrer les fichiers de configuration d'exemple `printer`, `generic`, et `kit` sans erreur. Ces fichiers de configuration doivent être ajoutés au scénario de test de non régression [test/klippy/printers.test](../test/klippy/printers.test). Ajoutez les nouveaux fichiers de configuration à ce scénario de test dans la section appropriée et par ordre alphabétique dans cette section.
zh_hant: `printer`, `generic`, 和 `kit` 示例配置檔案必須保證 Klipper 能夠正常啟動而不出錯。這些配置檔案應該被新增到 [test/klippy/printers.test](../test/klippy/printers.test) 迴歸測試用例中。將新的配置檔案新增到該測試用例的適當部分，並按該部分的字母順序排列。

source: The example configuration should be for the "stock" configuration of the printer. (There are too many "customized" configurations to track in the main Klipper repository.) Similarly, we only add example config files for printers, kits, and boards that have mainstream popularity (eg, there should be at least a 100 of them in active use). Consider using the [Klipper Community Discourse server](https://community.klipper3d.org) for other configs.
fr: L'exemple de configuration doit correspondre à la configuration "standard" de l'imprimante. (Il existe trop de configurations "personnalisées" pour être suivies dans le référentiel principal de Klipper). De même, nous n'ajoutons de fichiers de configuration d'exemple que pour les imprimantes, les kits et les cartes contrôleur qui ont une bonne popularité (par exemple, il devrait y en avoir au moins une centaine en utilisation active). Pensez à utiliser le [Serveur communautaire Discourse de Klipper](https://community.klipper3d.org) pour les autres configurations.
zh_hant: 該配置示例應該是印表機的 "stock "配置。(在klipper的倉庫中有太多定製的配置。)同樣地，我們只為具有主流流行性的印表機、套件和板子新增配置檔案的例子（至少應該有100個正在使用中）。考慮使用[Klipper Community Discourse server](https://community.klipper3d.org)進行其他配置。

source: Only specify those devices present on the given printer or board. Do not specify settings specific to your particular setup.For `generic` config files, only those devices on the mainboard should be described. For example, it would not make sense to add a display config section to a "generic" config as there is no way to know if the board will be attached to that type of display. If the board has a specific hardware port to facilitate an optional peripheral (eg, a bltouch port) then one can add a "commented out" config section for the given device.
fr: Ne spécifiez que les périphériques réellement présents sur l'imprimante ou la carte donnée. Ne spécifiez pas de paramètres propres à votre configuration particulière. Pour les fichiers de configuration `génériques`, seuls les périphériques de la carte mère doivent être décrits. Par exemple, cela n'aurait pas de sens d'ajouter une section de configuration d'écran à une configuration "générique" car il n'y a aucun moyen de savoir si la carte sera attachée à ce type d'écran. Si la carte possède un port matériel spécifique pour faciliter l'utilisation d'un périphérique optionnel (par exemple, un port bltouch), on peut ajouter une section de configuration "commentée" pour le périphérique en question.
zh_hant: 只指定給定印表機或板卡上的那些裝置。對於`generic`配置檔案，應該只描述主板上的那些裝置。例如，在一個 "generic"的配置檔案中新增一個顯示配置部分是沒有意義的，因為沒有辦法知道該板是否會連線到那種型別的顯示器。如果板子上有一個特定的硬體埠，以方便一個可選的外圍裝置（bltouch埠），那麼可以為給定的裝置新增一個 "註釋出來 "的配置部分。

source: Do not specify `pressure_advance` in an example config, as that value is specific to the filament, not the printer hardware. Similarly, do not specify `max_extrude_only_velocity` nor `max_extrude_only_accel` settings.
fr: Ne spécifiez pas `pressure_advance` dans un exemple de configuration, car cette valeur est spécifique au filament, et non au matériel de l'imprimante. De même, ne spécifiez pas les paramètres `max_extrude_only_velocity` et `max_extrude_only_accel`.
zh_hant: 不要在配置示例中指定`pressure_advance`，因為該值是針對耗材的，而不是印表機硬體。同樣，不要指定`max_extrude_only_velocity`或`max_extrude_only_accel`設定。

source: Do not specify a config section containing a host path or host hardware. For example, do not specify `[virtual_sdcard]` nor `[temperature_host]` config sections.
fr: Ne spécifiez pas une section de configuration contenant un chemin d'accès à l'hôte ou un matériel hôte. Par exemple, ne spécifiez pas les sections de configuration `[virtual_sdcard]` et `[temperature_host]`.
zh_hant: 不要指定一個包含主機路徑或主機硬體的配置部分。例如，不要指定`[virtual_sdcard]`或`[temperature_host]`配置部分。

source: Only define macros that utilize functionality specific to the given printer or to define g-codes that are commonly emitted by slicers configured for the given printer.
fr: Ne définissez que les macros qui utilisent une fonctionnalité spécifique à l'imprimante donnée ou pour définir les codes g généralement émis par les trancheurs configurés pour l'imprimante donnée.
zh_hant: 只為利用特定印表機功能，或特定印表機配置的切片軟體通常發出的G程式碼定義宏。

source: Where possible, it is best to use the same wording, phrasing, indentation, and section ordering as the existing config files.The top of each config file should list the type of micro-controller the user should select during "make menuconfig". It should also have a reference to "docs/Config_Reference.md".
fr: Dans la mesure du possible, il est préférable d'utiliser la même formulation, le même phrasé, la même indentation et le même ordre des sections que les fichiers de configuration existants. Le haut de chaque fichier de configuration doit indiquer le type de microcontrôleur que l'utilisateur doit sélectionner lors de la commande "make menuconfig". Il doit également contenir une référence à "docs/Config_Reference.md".
zh_hant: 在可能的情況下，最好使用與現有配置檔案相同的措辭、短語、縮排和章節順序。每個配置檔案的頂部應該列出使用者在 "make menuconfig "時應該選擇的微控制器的型別。它還應該有一個對 "docs/Config_Reference.md "的引用。

source: Do not copy the field documentation into the example config files. (Doing so creates a maintenance burden as an update to the documentation would then require changing it in many places.)
fr: Ne copiez pas la documentation du champ dans les fichiers de configuration d'exemple. (Faire cela crée une charge de maintenance car une mise à jour de la documentation nécessiterait alors de la modifier à de nombreux endroits.)
zh_hant: 不要將欄位文件複製到示例配置檔案中。（這樣做會造成維護方面的負擔，因為對文件的更新需要在很多地方進行修改。）

source: Example config files should not contain a "SAVE_CONFIG" section. If necessary, copy the relevant fields from the SAVE_CONFIG section to the appropriate section in the main config area.
fr: Les exemples de fichiers de configuration ne doivent pas contenir de section "SAVE_CONFIG". Si nécessaire, copiez les champs pertinents de la section SAVE_CONFIG dans la section appropriée de la zone de configuration principale.
zh_hant: 配置檔案的例子不應包含 "SAVE_CONFIG "部分。如果有必要，把SAVE_CONFIG部分的相關欄位複製到主配置區的適當部分。

source: Use `field: value` syntax instead of `field=value`.
fr: Utilisez la syntaxe `field: value` au lieu de `field=value`.
zh_hant: 使用`field: value`的語法，而不要使用`field=value`。

source: Avoid defining field values that are set to their default value. For example, one should not specify `min_extrude_temp: 170` as that is already the default value.
fr: Évitez de définir des valeurs de champ fixées à leur valeur par défaut. Par exemple, il est inutile de spécifier `min_extrude_temp : 170` car c'est déjà la valeur par défaut.
zh_hant: 避免定義那些被設定為預設值的欄位值。例如，不應該指定`min_extrude_temp: 170`，因為這已經是預設值。

source: Where possible, lines should not exceed 80 columns.
fr: Dans la mesure du possible, les lignes ne devraient pas dépasser 80 colonnes.
zh_hant: 在可能的情況下，行數不應超過80列。

source: Avoid adding attribution or revision messages to the config files. (For example, avoid adding lines like "this file was created by ...".) Place attribution and change history in the git commit message.
fr: Évitez d'ajouter des messages d'attribution ou de révision dans les fichiers de configuration. (Par exemple, évitez d'ajouter des lignes telles que "ce fichier a été créé par ...".) Placez l'attribution et l'historique des modifications dans le message git commit.
zh_hant: 避免在配置檔案中新增歸屬或修訂資訊。例如，避免新增類似 "此檔案由......建立 "的行。）將歸屬和修改歷史放在git提交資訊中。

source: Do not disable a default safety system in an example config file. For example, a config should not specify a custom `max_extrude_cross_section`. Do not enable debugging features. For example there should not be a `force_move` config section.
fr: Ne pas désactiver un système de sécurité par défaut dans un fichier de configuration d'exemple. Par exemple, une configuration ne doit pas spécifier un `max_extrude_cross_section` personnalisé. N'activez pas les fonctions de débogage. Par exemple, il ne doit pas y avoir de section de configuration `force_move`.
zh_hant: 不要在示例配置檔案中禁用預設安全系統。例如，一個配置不應該指定一個自定義的 `max_extrude_cross_section`。不要啟用除錯功能。例如，不應該有一個 `force_move` 配置部分。

source: Example config files are submitted by creating a github "pull request". Please also follow the directions in the [contributing document](CONTRIBUTING.md).
fr: Les exemples de fichiers de configuration sont soumis en créant une "pull request" sur github. Veuillez également suivre les instructions du [document de contribution](CONTRIBUTING.md).
zh_hant: 通過建立github "pull request "來提交配置檔案示例。也請遵循[contribution document](CONTRIBUTING.md)中的指示。

source: The `printer` prefix is used for stock printers sold by a mainstream manufacturer.
fr: Le préfixe `printer` est utilisé pour les imprimantes de stock vendues par un fabricant grand public.
zh_hant: `printer`字首用於主流製造商出售的印表機。

source: Example configurations
fr: Exemples de configurations
zh_hant: 配置示例

source: Select the appropriate config filename prefix:
fr: Sélectionnez le préfixe de nom de fichier de configuration approprié :

source: All configuration files must end in a `.cfg` suffix. The `printer` config files must end in a year followed by `.cfg` (eg, `-2019.cfg`). In this case, the year is an approximate year the given printer was sold.
fr: Tous les fichiers de configuration doivent se terminer par un suffixe `.cfg`. Les fichiers de configuration `printer` doivent se terminer par une année suivie de `.cfg` (par exemple, `-2019.cfg`). Dans ce cas, l'année est une année approximative où l'imprimante donnée a été vendue.

source: Do not use spaces or special characters in the config filename. The filename should contain only characters `A-Z`, `a-z`, `0-9`, `-`, and `.`.
fr: N'utilisez pas d'espaces ou de caractères spéciaux dans le nom du fichier de configuration. Le nom du fichier doit contenir uniquement les caractères `A-Z`, `a-z`, `0-9`, `-`, et `.`.

source: Do not use any deprecated features in the example config file.
fr: N'utilisez pas de fonctionnalités obsolètes dans le fichier de configuration d'exemple.

source: When adding an extruder `rotation_distance` it is preferable to specify a `gear_ratio` if the extruder has a gearing mechanism. We expect the rotation_distance in the example configs to correlate with the circumference of the hobbed gear in the extruder - it is normally in the range of 20 to 35mm. When specifying a `gear_ratio` it is preferable to specify the actual gears on the mechanism (eg, prefer `gear_ratio: 80:20` over `gear_ratio: 4:1`). See the [rotation distance document](Rotation_Distance.md#using-a-gear_ratio) for more information.
fr: Lorsque vous ajoutez une `rotation_distance` pour une extrudeuse, il est préférable de spécifier un `gear_ratio` si l'extrudeuse a un mécanisme d'engrenage. Nous nous attendons à ce que la distance de rotation dans les exemples de configuration corresponde à la circonférence de l'engrenage denté dans l'extrudeuse - elle est normalement comprise entre 20 et 35 mm. Lorsque vous spécifiez un `gear_ratio`, il est préférable de spécifier les engrenages réels du mécanisme (par exemple, préférez `gear_ratio : 80:20` à `gear_ratio : 4:1`). Voir le document sur [la distance de rotation](Rotation_Distance.md#using-a-gear_ratio) pour plus d'informations.

source: All known boards that Klipper supports can use the default serial baud rate of 250000. Do not recommend a different baud rate in an example config file.
fr: Toutes les cartes connues que Klipper prend en charge peuvent utiliser la vitesse de transmission série par défaut de 250000. Ne recommandez pas un débit en bauds différent dans un fichier de configuration d'exemple.
