Repository: Klipper3d/klipper-translations
Catalog: locales/*/LC_MESSAGES/Overview.po
Languages: bg, ca, pt_br, uk

source: Welcome to the Klipper documentation. If new to Klipper, start with the [features](Features.md) and [installation](Installation.md) documents.
bg: Добре дошли в документацията на Klipper. Ако сте нов потребител на Klipper, започнете с документите [features](Features.md) и [installation](Installation.md).
ca: Benvingut a la documentació de Klipper. Si comences amb Klipper, comença llegint els documents [funcionalitats](Features.md) and [instal·lació](Installation.md).
pt_br: Bem-vindo à documentação do Klipper. Se for novo no Klipper, comece com os documentos de [recursos](Features.md) e [Instalação](Installation.md).
uk: Ласкаво просимо до документації Klipper. Якщо ви не знайомі з Klipper, почніть з документів [Можливості](Features.md) та [Установлення](Installation.md).

source: Overview information
bg: Преглед на информацията
ca: Informació general
pt_br: Informações gerais
uk: Оглядова інформація

source: [Features](Features.md): A high-level list of features in Klipper.
bg: [Характеристики](Features.md): Списък на високо ниво на функциите в Klipper.
ca: [Funcionalitats](Features.md): Una llista detallada de les funcionalitats de Klipper.
pt_br: [Características](Features.md): Uma lista de características de alto nível no Klipper.
uk: [Функції](Features.md): Загальний список функцій у Klipper.

source: [FAQ](FAQ.md): Frequently asked questions.
bg: [ЧЗВ](FAQ.md): Често задавани въпроси.
ca: [Preguntes freqüents](FAQ.md): Preguntes freqüents.
pt_br: [FAQ](FAQ.md): Perguntas frequentes.
uk: [FAQ](FAQ.md): Питання, що часто задаються.

source: [Releases](Releases.md): The history of Klipper releases.
bg: [Releases](Releases.md): Историята на изданията на Klipper.
ca: [Versions](Releases.md): L'historial de les versions de Klipper.
pt_br: [Lançamentos](Releases.md): O histórico de lançamentos do Klipper.
uk: [Випуски](Releases.md): Історія випусків Klipper.

source: [Config changes](Config_Changes.md): Recent software changes that may require users to update their printer config file.
bg: [Промени в конфигурацията](Config_Changes.md): Скорошни промени в софтуера, които може да изискват от потребителите да актуализират конфигурационния файл на принтера.
ca: [Canvis en la configuració](Config_Changes.md): Canvis recents en el programari que poden requerir que els usuaris hagin d'actualitzar els fitxers de configuració de la impressora.
pt_br: [Alterações de configurações](Config_Changes.md): Alterações recentes de software que podem exigir que os usuários atualizem seu arquivo de configuração da impressora.
uk: [Зміни конфігурації](Config_Changes.md): Останні зміни програмного забезпечення, які можуть вимагати від користувачів оновлення файлу конфігурації принтера.

source: [Contact](Contact.md): Information on bug reporting and general communication with the Klipper developers.
bg: [Контакт](Contact.md): Информация за докладване на грешки и обща комуникация с разработчиците на Klipper.
ca: [Contacte](Contact.md): Informació sobre com s'ha de reportar els errors i comunicació general amb els desenvolupadors de Klipper.
pt_br: [Contato](Contact.md): Informação sobre como reportar erros ou comunicação em geral com os desenvolvedores do Klipper.
uk: [Зворотний зв'язок](Contact.md): Інформація про повідомлення про помилки та загальне спілкування з розробниками Klipper.

source: [Installation](Installation.md): Guide to installing Klipper.
bg: [Инсталация](Installation.md): Ръководство за инсталиране на Klipper.
ca: [Instal·lació](Installation.md): Guia per instal·lar el Klipper.
pt_br: [Instalação](Installation.md): Guia de instalação do Klipper.
uk: [Встановлення](Installation.md): Посібник зі встановлення Klipper.

source: [Config Reference](Config_Reference.md): Description of config parameters.
bg: [Config Reference](Config_Reference.md): Описание на параметрите на конфигурацията.
ca: [Referencies per a la configuració](Config_Reference.md): Descripció dels paràmetres de configuració.
pt_br: [Referências para Configuração](Config_Reference.md): Descrição dos parâmetros de configuração.
uk: [Посилання на конфігурацію](Config_Reference.md): Опис параметрів конфігурації.

source: [Rotation Distance](Rotation_Distance.md): Calculating the rotation_distance stepper parameter.
bg: [Разстояние на завъртане](Rotation_Distance.md): Изчисляване на стъпковия параметър Rotation_distance.
ca: [Distància de rotació](Rotation_Distance.md): Calculant el paràmetre rotation_distance del motor pas a pas.
pt_br: [Distância de Rotação](Rotation_Distance.md): Como calcular o parâmetro de distância de rotação passo a passo.
uk: [Відстань обертання](Rotation_Distance.md): Обчислення значення параметра відстані обертання.

source: [Config checks](Config_checks.md): Verify basic pin settings in the config file.
bg: [Проверки на конфигурацията](Config_checks.md): Проверете основните настройки на ПИН в конфигурационния файл.
ca: [Validació de la configuració](Config_checks.md): Verificar les configuracions bàsiques de pins en el fitxer de configuració.
pt_br: [Verificação de Configuração](Config_checks.md): Verificar as configurações básicas do PIN no arquivo de configuração.
uk: [Перевірка конфігурації](Config_checks.md): Перевірте основні параметри PIN у файлі конфігурації.

source: [Bed level](Bed_Level.md): Information on "bed leveling" in Klipper.
bg: [Ниво на леглото](Bed_Level.md): Информация за "нивелиране на леглото" в Klipper.
ca: [Anivellat del llitl](Bed_Level.md): Informació sobre "anivellat del llit calent" en Klipper.
pt_br: [Nível da cama](Bed_Level.md): Informação da "nivelação da cama" no Klipper.
uk: [Рівень ліжка](Bed_Level.md): Інформація про "вирівнювання ліжка" у Klipper.

source: [Delta calibrate](Delta_Calibrate.md): Calibration of delta kinematics.
bg: [Delta calibrate](Delta_Calibrate.md): Калибриране на делта кинематиката.
ca: [Calibració delta](Delta_Calibrate.md): Calibratge de cinemàtiques tipus delta.
pt_br: [Calibração delta](Delta_Calibrate.md): Calibração da cinemática delta.
uk: [Дельта-калібрування](Delta_Calibrate.md): Калібрування дельта-кінематики.

source: [Probe calibrate](Probe_Calibrate.md): Calibration of automatic Z probes.
bg: [Probe calibrate](Probe_Calibrate.md): Калибриране на автоматичните Z-сонди.
ca: [Calibratge de la sonda](Probe_Calibrate.md): Calibratge de sondes Z automàtiques.
pt_br: [Calibração da sonda](Probe_Calibrate.md): Calibração das sondas automáticas Z.
uk: [Калібрування зонда](Probe_Calibrate.md): Калібрування автоматичних Z-зондів.

source: [BL-Touch](BLTouch.md): Configure a "BL-Touch" Z probe.
bg: [BL-Touch](BLTouch.md): Конфигуриране на Z-сонда "BL-Touch".
ca: [BL-Touch](BLTouch.md): Configurar un "BL-Touch" com a Z probe.
pt_br: [BL-Touch](BLTouch.md): Configure uma sonda Z "BL-Touch".
uk: [BL-Touch](BLTouch.md): Конфігурація "BL-Touch" Z-зонду.

source: [Manual level](Manual_Level.md): Calibration of Z endstops (and similar).
bg: [Ръчно ниво](Manual_Level.md): Калибриране на крайните ограничители Z (и други подобни).
ca: [Anivellat manual](Manual_Level.md): Calibratge de finals de carrera Z (i similars).
pt_br: [Nível manual](Manual_Level.md): Calibração das paradas finais de Z (e similares).
uk: [Ручний рівень](Manual_Level.md): Калібрування кінцевих зупинок Z (і подібних).

source: [Bed Mesh](Bed_Mesh.md): Bed height correction based on XY locations.
bg: [Bed Mesh](Bed_Mesh.md): Корекция на височината на леглото въз основа на местоположението XY.
ca: [Mallat del llit](Bed_Mesh.md): Correcció de l'alçada del llit basat en localitzacions XY en forma de malla.
pt_br: [Cama de Malha](Bed_Mesh.md): Correção da altura da cama baseada em coordenadas XY.
uk: [Сітка ліжка](Bed_Mesh.md): Корекція висоти ліжка на основі розташування XY.

source: [Endstop phase](Endstop_Phase.md): Stepper assisted Z endstop positioning.
bg: [Endstop phase](Endstop_Phase.md): Позициониране на крайния ограничител Z с помощта на стъпков механизъм.
ca: [Fase de final de carrera](Endstop_Phase.md): Posicionament precís al final de carrera Z assistit per el motor pas a pas.
pt_br: [Fase de fim de curso](Endstop_Phase.md): Posicionado do fim de curso de Z assistido via motor de passo.
uk: [Фаза зупинки](Endstop_Phase.md): Позиціонування кінцевої зупинки Z за допомогою ступеня.

source: [Resonance compensation](Resonance_Compensation.md): A tool to reduce ringing in prints.
bg: [Резонансна компенсация](Resonance_Compensation.md): Инструмент за намаляване на звъненето в разпечатките.
ca: [Compensació de ressonància](Resonance_Compensation.md): Eina per a reduir els repics i ecos a les impressions.
pt_br: [Compensação de ressonância](Resonance_Compensation.md): Uma ferramenta para reduzir irregularidades nas impressões.
uk: [Компенсація резонансу](Resonance_Compensation.md): Інструмент для зменшення дзвону в друкуванні.

source: [Measuring resonances](Measuring_Resonances.md): Information on using adxl345 accelerometer hardware to measure resonance.
bg: [Измерване на резонанси](Measuring_Resonances.md): Информация за използването на хардуерния акселерометър adxl345 за измерване на резонанс.
ca: [Mesurant ressonàncies](Measuring_Resonances.md): Informació de com emprar un accelerómetre adxl345 per mesurar les ressonàncies.
pt_br: [Ressonâncias de medida](Measuring_Resonances.md): Informação sobre o uso do acelerômetro adxl345 para medir a ressonância.
uk: [Вимірювання резонансів](Measuring_Resonances.md): Інформація про використання акселерометра adxl345 для вимірювання резонансу.

source: [Pressure advance](Pressure_Advance.md): Calibrate extruder pressure.
bg: [Напредък на налягането](Pressure_Advance.md): Калибриране на налягането в екструдера.
ca: [Previsió de pressió](Pressure_Advance.md): Calibratge de la pressió del filament del fusor.
pt_br: [Avançar a pressão](Pressure_Advance.md): Calibrar a pressão da extrusor.
uk: [Підвищення тиску](Pressure_Advance.md): Калібровка тиск екструдера.

source: [Slicers](Slicers.md): Configure "slicer" software for Klipper.
bg: [Slicers](Slicers.md): Конфигуриране на софтуера "slicer" за Klipper.
ca: [Slicers](Slicers.md): Configurar el programa de llescat per a treballar amb Klipper.
pt_br: [Fatiadores](Slicers.md): Configuração do programa "fatiador" para o Klipper.
uk: [Slicers](Slicers.md): Налаштування програмного забезпечення "slicer" для Klipper.

source: [Command Templates](Command_Templates.md): G-Code macros and conditional evaluation.
bg: [Командни шаблони](Command_Templates.md): G-Code макроси и условна оценка.
ca: [Plantilla d'ordres](Command_Templates.md): Macros de G-code i evaluació condicional.
pt_br: [Modelos de comandos](Command_Templates.md): Macros em G-Code e avaliação condicional.
uk: [Шаблони команд](Command_Templates.md): Макроси G-коду та умовне оцінювання.

source: [Status Reference](Status_Reference.md): Information available to macros (and similar).
bg: [Справка за състоянието](Status_Reference.md): Налична информация за макроси (и подобни).
ca: [Referència de l'estat](Status_Reference.md):Informació disponible de macros (i similars).
pt_br: [Referência de Status](Status_Reference.md): Informações disponíveis para macros (e similares).
uk: [Довідка про стан](Status_Reference.md): Інформація доступна для макросів (та подібних).

source: [TMC Drivers](TMC_Drivers.md): Using Trinamic stepper motor drivers with Klipper.
bg: [TMC Drivers](TMC_Drivers.md): Използване на драйвери за стъпкови двигатели Trinamic с Klipper.
ca: [Controladors TMC](TMC_Drivers.md): Emprant els controladors pas a pas de Trinamic amb Klipper.
pt_br: [Drivers TMC](TMC_Drivers.md): Usando drivers Trinamic para motores de passo com o Klipper.
uk: [TMC Драйвери](TMC_Drivers.md): Використання драйверів крокових двигунів Trinamic із Klipper.

source: [PWM tools](Using_PWM_Tools.md): Guide on how to use PWM controlled tools such as lasers or spindles.
bg: [PWM tools](Using_PWM_Tools.md): Ръководство за използване на инструменти, управлявани от ШИМ, като лазери или шпиндели.
ca: [Eines PWM](Using_PWM_Tools.md): Guies per fer servir eines controlades per PWM com ara làsers i trepants.
pt_br: [Ferramentas PWM](Using_PWM_Tools.md): Guia de como usar ferramentas de controladas por PWM tais como lasers e fusos.
uk: [PWM інструменти](Using_PWM_Tools.md): Керівництво по використанню інструментів контролю PWM, таких як лазери або шпиндельки.

source: [G-Codes](G-Codes.md): Information on commands supported by Klipper.
bg: [G-Codes](G-Codes.md): Информация за командите, поддържани от Klipper.
ca: [G-Code](G-Codes.md): informació de les ordres suportades per Klipper.
pt_br: [G-Codes](G-Codes.md): Informações sobre comandos suportados pelo Klipper.
uk: [G-Codes](G-Codes.md): Інформація про команди, які підтримує Klipper.

source: Developer Documentation
bg: Документация за разработчици
ca: Documentació per a desenvolupadors
pt_br: Documentação de desenvolvedor
uk: Документація розробника

source: [Code overview](Code_Overview.md): Developers should read this first.
bg: [Преглед на кода](Code_Overview.md): Разработчиците трябва да прочетат първо това.
ca: [Perspectiva general del codi](Code_Overview.md): Els desenvolupadors han de llegir això abans que res.
pt_br: [Visão geral do código](Code_Overview.md): Desenvolvedor devem ler isto primeiro.
uk: [Огляд коду](Code_Overview.md): Розробники повинні прочитати це в першу чергу.

source: [Kinematics](Kinematics.md): Technical details on how Klipper implements motion.
bg: [Кинематика](Kinematics.md): Технически подробности за това как Klipper реализира движението.
ca: [Cinemàtiques](Kinematics.md): Detalls tècnics sobre com Klipper implementa el moviment.
pt_br: [Cinemática](Kinematics.md): Detalhes técnicos em como o Klipper implementa movimento.
uk: [Кінематика](Kinematics.md): Технічні деталі того, як Klipper реалізує рух.

source: [Protocol](Protocol.md): Information on the low-level messaging protocol between host and micro-controller.
bg: [Протокол](Protocol.md): Информация за протокола за обмен на съобщения на ниско ниво между хоста и микроконтролера.
ca: [Protocol](Protocol.md): Informació sobre el protocol de missatgeria emprat a baix nivell entre l'amfitrió i el microcontrolador.
pt_br: [Protocolo](Protocol.md): Informação sobre protocolo de troca de mensagem em baixo nível entre hospedeiro e microcontrolador.
uk: [Протокол](Protocol.md): Інформація про протокол обміну повідомленнями низького рівня між хостом та мікроконтролером.

source: [API Server](API_Server.md): Information on Klipper's command and control API.
bg: [Сървър на API](API_Server.md): Информация за API за командване и управление на Klipper.
ca: [Servidor API](API_Server.md): Informació relativa a la API de control i els comandaments de Klipper.
pt_br: [Servidor API](API_Server.md): Informações sobre comando e controle API do Klipper.
uk: [API-сервер](API_Server.md): Інформація про API команд і керування Klipper's.

source: [MCU commands](MCU_Commands.md): A description of low-level commands implemented in the micro-controller software.
bg: [MCU commands](MCU_Commands.md): Описание на командите от ниско ниво, реализирани в софтуера на микроконтролера.
ca: [Ordres MCU](MCU_Commands.md): Descripció dels comandaments de baix nivell implementats en el software del micro controlador.
pt_br: [Comandos MCU](MCU_Commands.md): Uma descrição dos comandos de baixo nível implementas no software do microcontrolador.
uk: [Команди MCU](MCU_Commands.md): Опис команд низького рівня, реалізованих у програмному забезпеченні мікроконтролера.

source: [CAN bus protocol](CANBUS_protocol.md): Klipper CAN bus message format.
bg: [Протокол на CAN шината](CANBUS_protocol.md): Формат на съобщение на CAN шината на Klipper.
ca: [Protocol de bus CAN](CANBUS_protocol.md): Format dels missages de bus CAN de Klipper.
pt_br: [Protoloco de barramento CAN](CANBUS_protocol.md): Formato de mensagens do barramento CAN.
uk: [протокол шини CAN](CANBUS_protocol.md): Формат повідомлення шини CAN Klipper.

source: [Debugging](Debugging.md): Information on how to test and debug Klipper.
bg: [Отстраняване на грешки](Debugging.md): Информация как да тествате и отстранявате грешки в Klipper.
ca: [Depuració](Debugging.md): Informació de com comprovar i depurar Klipper.
pt_br: [Depuração](Debugging.md): Informação sobre como testar e depurar o Klipper.
uk: [Налагодження](Debugging.md): Інформація про те, як перевірити та налагодити Klipper.

source: [Benchmarks](Benchmarks.md): Information on the Klipper benchmark method.
bg: [Benchmarks](Benchmarks.md): Информация за метода за сравнение Klipper.
ca: [Índexs de referencia](Benchmarks.md): Informació sobre els índexs de referència (BenchMarks) de Klipper.
pt_br: [Benchmarks](Benchmarks.md): Informação do método de medição de performance no Klipper.
uk: [Бенчмарки](Benchmarks.md): Інформація про метод бенчмарку Klipper.

source: [Contributing](CONTRIBUTING.md): Information on how to submit improvements to Klipper.
bg: [Принос](CONTRIBUTING.md): Информация за това как да изпращате подобрения в Klipper.
ca: [Contribuir](CONTRIBUTING.md): Informació de com enviar i aportar millores a Klipper.
pt_br: [Contribuindo](CONTRIBUTING.md): Informação sobre como enviar melhorias para o Klipper.
uk: [Внесок](CONTRIBUTING.md): Інформація про те, як надсилати покращення до Klipper.

source: [Packaging](Packaging.md): Information on building OS packages.
bg: [Packaging](Packaging.md): Информация за изграждането на пакети за операционни системи.
ca: [Compilació](Packaging.md): Informació sobre com compilar paquets de SO.
pt_br: [Empacotamento](Packaging.md): Informação sobre a construção de pacotes de SO.
uk: [Упаковка](Packaging.md): Інформація про збірку пакетів ОС.

source: Device Specific Documents
bg: Документи, специфични за устройството
ca: Documents específics d'un dispositiu
pt_br: Documentos de Dispositivos Específicos
uk: Документи, що стосуються пристрою

source: [Example configs](Example_Configs.md): Information on adding an example config file to Klipper.
bg: [Примерни конфигурации](Example_Configs.md): Информация за добавяне на примерен конфигурационен файл към Klipper.
ca: [Exemples de configuració](Example_Configs.md): informació de com afegir una configuració d'exemple a Klipper.
pt_br: [Configurações de exemplo](Example_Configs.md): Informação de como adicionar um arquivo de configuração de exemplo no Klipper.
uk: [Приклади конфігурацій](Example_Configs.md): Інформація щодо додавання прикладу конфігураційного файлу до Klipper.

source: [SDCard Updates](SDCard_Updates.md): Flash a micro-controller by copying a binary to an sdcard in the micro-controller.
bg: [SDCard Updates](SDCard_Updates.md): Флаш на микроконтролер чрез копиране на двоичен файл на SDcard в микроконтролера.
ca: [Actualitzacions de la targeta SD](SDCard_Updates.md): Programar un micro controlador copiant un binari a una targeta SD en el micro controlador.
pt_br: [Atualizações por cartão SD](SDCard_Updates.md): Programar um micro controlador via cópia de binário para um cartão SD no microcontrolador.
uk: [Оновлення SDCard](SDCard_Updates.md): Прошивка мікроконтролер, скопіювавши двійковий файл на sdcard у мікроконтролері.

source: [Raspberry Pi as Micro-controller](RPi_microcontroller.md): Details for controlling devices wired to the GPIO pins of a Raspberry Pi.
bg: [Raspberry Pi като микроконтролер](RPi_microcontroller.md): Подробности за управление на устройства, свързани към GPIO изводите на Raspberry Pi.
ca: [Raspberry Pi com a micro controlador](RPi_microcontroller.md): Detalls per controlar dispositius connectats als ports GPIO d'una Raspberry Pi.
pt_br: [Raspberry Pi como Micro-controlador](RPi_microcontroller.md): Detalhes para controlar dispositivos cabeados a pinos GPIO de um Raspberry Pi.
uk: [Raspberry Pi як мікроконтролер](RPi_microcontroller.md): Деталі для керування пристроями, підключеними до контактів GPIO Raspberry Pi.

source: [Bootloaders](Bootloaders.md): Developer information on micro-controller flashing.
bg: [Bootloaders](Bootloaders.md): Информация за разработчици относно флашването на микроконтролери.
ca: [Carregadors d'arrancada](Bootloaders.md): Informació per a desenvolupadors sobre programació del micro controlador.
uk: [Завантажувачі](Bootloaders.md): Інформація для розробників про перепрошивку мікроконтролерів.

source: [CAN bus](CANBUS.md): Information on using CAN bus with Klipper.
bg: [CAN bus](CANBUS.md): Информация за използването на CAN шина с Klipper.
ca: [Bus CAN](CANBUS.md): Infiormació sobre l'us del bus CAN a Klipper.
uk: [CAN шина](CANBUS.md): Інформація щодо використання шини CAN із Klipper.

source: [TSL1401CL filament width sensor](TSL1401CL_Filament_Width_Sensor.md)
bg: [TSL1401CL сензор за широчина на нишката](TSL1401CL_Filament_Width_Sensor.md)
ca: [Sensor d'amplada del filament TSL1401CL](TSL1401CL_Filament_Width_Sensor.md)
uk: [TSL1401CL датчик ширини нитки ](TSL1401CL_Filament_Width_Sensor.md)

source: Overview
bg: Общ преглед
ca: Perspectiva general
uk: Огляд

source: Installation and Configuration
bg: Инсталиране и конфигуриране
ca: Instal·lació i configuració
uk: Встановлення та налаштування

source: [Multi-MCU Homing](Multi_MCU_Homing.md): Homing and probing using multiple micro-controllers.
bg: [Multi-MCU Homing](Multi_MCU_Homing.md): Наместване и сондиране с помощта на няколко микроконтролера.
ca: [Inicialització del llit emprant varies MCU](Multi_MCU_Homing.md): Inicialització i compensació del llit emprant varies MCU.
uk: [Наведення на кілька мікроконтролерів ](Multi_MCU_Homing.md): Наведення та зондування за допомогою кількох мікроконтролерів.

source: [Skew correction](Skew_Correction.md): Adjustments for axes not perfectly square.
bg: [Корекция на наклона](Skew_Correction.md): Корекции за оси, които не са идеално квадратни.
ca: [Correcció del biaix](Skew_Correction.md): Ajustaments per a eixos que no son perfectament perpendiculars.
uk: [Корекція перекосу](Skew_Correction.md): Регулювання для осей не ідеально квадратних.

source: [Beaglebone](Beaglebone.md): Details for running Klipper on the Beaglebone PRU.
bg: [Beaglebone](Beaglebone.md): Подробности за работа с Klipper на Beaglebone PRU.
ca: [Beaglebone](Beaglebone.md): Detalls per executar Klipper en una Beaglebone.
uk: [Beaglebone](Beaglebone.md): Деталі для запуску Klipper на Beaglebone PRU.

source: [Hall filament width sensor](Hall_Filament_Width_Sensor.md)
bg: [Сензор за ширина на нишката на Хол](Hall_Filament_Width_Sensor.md)
ca: [Sensor d'efecte Hall d'amplada de filament](Hall_Filament_Width_Sensor.md)
uk: [Датчик ширини нитки Холла](Hall_Filament_Width_Sensor.md)

source: [Exclude Object](Exclude_Object.md): The guide to the Exclude Objects implementation.
ca: [Excloure objectest](Exclude_Object.md): Guia per implementar l'exclusió d'objectes.
uk: [Exclude Object](Exclude_Object.md): Посібник з реалізації виключення об'єктів.

source: [Axis Twist Compensation](Axis_Twist_Compensation.md): A tool to compensate for inaccurate probe readings due to twist in X gantry.
uk: [Компенсація скручування осі](Axis_Twist_Compensation.md): Інструмент для компенсації неточних зчитувань зонда через скручування осі X.

source: [Bootloader Entry](Bootloader_Entry.md): Requesting the bootloader.
uk: [Вхід до завантажувача](Bootloader_Entry.md): Запит завантажувача.

source: [CAN bus troubleshooting](CANBUS_Troubleshooting.md): Tips for troubleshooting CAN bus.
uk: [Усунення несправностей шини CAN](CANBUS_Troubleshooting.md): Поради щодо усунення несправностей CAN-шини.
