Repository: Klipper3d/klipper-translations
Catalog: locales/*/LC_MESSAGES/Packaging.po
Languages: bg, hu

source: Klipper is somewhat of a packaging anomaly among python programs, as it doesn't use setuptools to build and install. Some notes regarding how best to package it are as follows:
bg: Klipper е донякъде аномалия в опаковането сред програмите на Питон, тъй като не използва setuptools за изграждане и инсталиране. Някои бележки за това как е най-добре да го опаковате са следните:
hu: A Klipper egyfajta csomagolási anomália a python programok között, mivel nem használja a setuptools-t a szerkesztéshez és a telepítéshez. Néhány megjegyzés arra vonatkozóan, hogy hogyan lehet a legjobban csomagolni, a következő:

source: C modules
bg: C модули
hu: C modulok

source: Klipper uses a C module to handle some kinematics calculations more quickly. This module needs to be compiled at packaging time to avoid introducing a runtime dependency on a compiler. To compile the C module, run `python2 klippy/chelper/__init__.py`.
bg: Klipper използва модул на C за по-бързо извършване на някои кинематични изчисления. Този модул трябва да се компилира по време на пакетирането, за да се избегне въвеждането на зависимост от компилатора по време на изпълнение. За да компилирате модула C, изпълнете `python2 klippy/chelper/__init__.py`.
hu: A Klipper egy C modult használ néhány kinematikai számítás gyorsabb elvégzésére. Ezt a modult a csomagolási időben kell lefordítani, hogy elkerüljük a fordítóprogramtól való futásidejű függőséget. A C modul lefordításához futtassuk a `python2 klippy/chelper/__init__.py` fájlt.

source: Compiling python code
bg: Компилиране на Python код
hu: Python-kód összeállítása

source: Many distributions have a policy of compiling all python code before packaging to improve startup time. You can do this by running `python2 -m compileall klippy`.
bg: В много дистрибуции се прилага политика на компилиране на целия код на Python преди пакетиране, за да се подобри времето за стартиране. Можете да направите това, като стартирате `python2 -m compileall klippy`.
hu: Sok disztribúciónak van egy olyan irányelve, hogy az indítási idő javítása érdekében minden python kódot lefordít a csomagolás előtt. Ezt a `python2 -m compileall klippy` futtatásával érheted el.

source: Versioning
bg: Създаване на версии
hu: Verziókezelés

source: If you are building a package of Klipper from git, it is usual practice not to ship a .git directory, so the versioning must be handled without git. To do this, use the script shipped in `scripts/make_version.py` which should be run as follows: `python2 scripts/make_version.py YOURDISTRONAME > klippy/.version`.
bg: Ако изграждате пакет на Klipper от git, обичайната практика е да не изпращате директория .git, така че определянето на версиите трябва да се извършва без git. За да направите това, използвайте скрипта, доставен в `scripts/make_version.py`, който трябва да се изпълни по следния начин: `python2 scripts/make_version.py YOURDISTRONAME > klippy/.version`.
hu: Ha a Klipper csomagot git-ből építed, a szokásos gyakorlat szerint nem szállítasz .git könyvtárat, így a verziókezelést git nélkül kell megoldanod. Ehhez használd a `scripts/make_version.py` alatt szállított szkriptet, amelyet a következőképpen kell futtatni: `python2 scripts/make_version.py YOURDISTRONAME > klippy/.version`.

source: Sample packaging script
bg: Примерен скрипт за опаковане
hu: Minta csomagolási szkript

source: Packaging Klipper
bg: Пакетиране на Klipper
hu: Klipper csomagolás

source: klipper-git is packaged for Arch Linux, and has a PKGBUILD (package build script) available at [Arch User Repositiory](https://aur.archlinux.org/cgit/aur.git/tree/PKGBUILD?h=klipper-git).
bg: klipper-git е пакетиран за Arch Linux и има PKGBUILD (скрипт за изграждане на пакети), достъпен в [Arch User Repositiory](https://aur.archlinux.org/cgit/aur.git/tree/PKGBUILD?h=klipper-git).

source: klipper-git is packaged for Arch Linux, and has a PKGBUILD (package build script) available at [Arch User Repository](https://aur.archlinux.org/cgit/aur.git/tree/PKGBUILD?h=klipper-git).
hu: A klipper-git az Arch Linuxhoz van csomagolva, és a PKGBUILD (csomagkészítő szkript) elérhető az [Arch Felhasználói Adattár](https://aur.archlinux.org/cgit/aur.git/tree/PKGBUILD?h=klipper-git) oldalon.
