Repository: Klipper3d/klipper-translations
Catalog: locales/*/LC_MESSAGES/Pressure_Advance.po
Languages: hu, it, zh_hans

source: The pressure advance system does not change the timing or path of the toolhead. A print with pressure advance enabled will take the same amount of time as a print without pressure advance. Pressure advance also does not change the total amount of filament extruded during a print. Pressure advance results in extra extruder movement during move acceleration and deceleration. A very high pressure advance setting will result in a very large amount of extruder movement during acceleration and deceleration, and no configuration setting places a limit on the amount of that movement.
hu: A nyomás szabályozási rendszer nem változtatja meg a nymtatófej időzítését vagy útját. A nyomás szabályozással bekapcsolt állapotban ugyanannyi időt vesz igénybe, mint a nyomás szabályozás nélküli nyomtatás. A nyomás szabályozás nem változtatja meg a nyomtatás során extrudált szál teljes mennyiségét sem. A nyomás szabályozás extra extrudermozgást eredményez a mozgás gyorsítása és lassítása során. Egy nagyon magas nyomás szabályozási beállítás nagyon nagy extrudermozgást eredményez a gyorsítás és lassítás során, és semmilyen konfigurációs beállítás nem szab határt ennek a mozgásnak.
it: Il sistema di pressure advance non modifica i tempi o il percorso della testa di stampa. Una stampa con pressure advance abilitato richiederà lo stesso tempo di una stampa senza pressure advance. Inoltre, pressure advance non modifica la quantità totale di filamento estruso durante una stampa. L a pressure advance determina un movimento extra dell'estrusore durante l'accelerazione e la decelerazione del movimento. Un'impostazione di pressure advance molto elevata risulterà in una quantità molto grande di movimento dell'estrusore durante l'accelerazione e la decelerazione e nessuna impostazione di configurazione pone un limite alla quantità di tale movimento.
zh_hans: 压力提前系统将不会改变滑车运行的时间点和路径。因此使用压力提前进行打印的工件会跟不使用压力提前的工件消耗同样的打印时间。压力提前也不会增加或减少工件打印所需的耗材量。压力提前只会影响挤出机加减速时的运动行为。高压力提前设置值会使挤出机加减速时出现非常大的挤出机运动量。暂时，Klipper配置文件中没有任何设置对压力提前的额外挤出机运动进行设限。

source: Pressure advance
hu: Nyomásszabályozás
it: Anticipo di pressione
zh_hans: 压力提前
