Repository: Klipper3d/klipper-translations
Catalog: locales/*/LC_MESSAGES/Pressure_Advance.po
Languages: hu, it, zh_hans

source: This document provides information on tuning the "pressure advance" configuration variable for a particular nozzle and filament. The pressure advance feature can be helpful in reducing ooze. For more information on how pressure advance is implemented see the [kinematics](Kinematics.md) document.
hu: Ez a dokumentum a "nyomás szabályozás" konfigurációs változó adott fúvókához és nyomtatószálhoz való beállításával kapcsolatos információkat tartalmaz. A nyomás szabályozás funkció hasznos lehet a nyákosodás csökkentésében. A nyomás szabályozás megvalósításáról további információkat a [kinematika](Kinematics.md) dokumentumban talál.
it: Questo documento fornisce informazioni sulla messa a punto della variabile di regolazione del "pressure advance" per un particolare ugello e filamento. La funzione di anticipo della pressione può essere utile per ridurre le colature. Per maggiori informazioni su come viene implementato l'anticipo di pressione, vedere il documento [kinematics](Kinematics.md).
zh_hans: 本文档提供了关于调整特定喷嘴和耗材“压力提前”配置变量的方法。压力提前功能可以减少漏料。关于如何实现压力提前的更多信息，见[运动学](Kinematics.md)文件。

source: Tuning pressure advance
hu: Nyomás szabályozás hangolása
it: Regolazione della pressure advance
zh_hans: 调整压力提前

source: Pressure advance does two useful things - it reduces ooze during non-extrude moves and it reduces blobbing during cornering. This guide uses the second feature (reducing blobbing during cornering) as a mechanism for tuning.
hu: A nyomás szabályozás két hasznos dolgot tesz. Csökkenti a nem extrudált mozgások során fellépő nyákosodást, és csökkenti a kanyarodás során fellépő puffadást. Ez az útmutató a második funkciót (kanyarodás közbeni puffadás csökkentése) használja a hangolás mechanizmusaként.
it: Pressure advance fa due cose utili: riduce le colature durante i movimenti senza estrusione e riduce il blobbing durante le curve. Questa guida utilizza la seconda funzione (riduzione del blobbing durante le curve) come meccanismo per la messa a punto.
zh_hans: 压力提前有两个作用 - 它可以减少非挤出移动过程中的溢料和减少转弯时的凸起。本指南使用第二个功能（减少转弯过程中的凸起）作为优化机制。

source: In order to calibrate pressure advance the printer must be configured and operational as the tuning test involves printing and inspecting a test object. It is a good idea to read this document in full prior to running the test.
hu: A nyomás szabályozás kalibrálásához a nyomtatónak konfiguráltnak és működőképesnek kell lennie, mivel a hangolási teszt egy tesztobjektum nyomtatásával és vizsgálatával jár. A teszt lefuttatása előtt érdemes ezt a dokumentumot teljes egészében elolvasni.
it: Per calibrare la pressure advance, la stampante deve essere configurata e operativa poiché il test di ottimizzazione prevede la stampa e l'ispezione di un oggetto di prova. È una buona idea leggere questo documento per intero prima di eseguire il test.
zh_hans: 为了校准压力提前，打印机必须已经配置完成并可以正常工作。因为调优测试涉及打印和检查测试对象。在运行测试之前，最好完整阅读本文档。

source: Use a slicer to generate g-code for the large hollow square found in [docs/prints/square_tower.stl](prints/square_tower.stl). Use a high speed (eg, 100mm/s), zero infill, and a coarse layer height (the layer height should be around 75% of the nozzle diameter). Make sure any "dynamic acceleration control" is disabled in the slicer.
hu: A [docs/prints/square_tower.stl](prints/square_tower.stl) fájlban található nagy üreges négyzet G-Kódjának létrehozásához használjon egy szeletelőt. Használjon nagy sebességet (pl. 100 mm/s), nulla kitöltést és durva rétegmagasságot (a rétegmagasságnak a fúvóka átmérőjének 75%-a körül kell lennie). Győződjön meg róla, hogy a szeletelőben minden "dinamikus gyorsításvezérlés" ki van kapcsolva.
it: Usa uno slicer per generare il codice G per il grande cubo vuoto che si trova in [docs/prints/square_tower.stl](prints/square_tower.stl). Utilizzare una velocità elevata (ad es. 100 mm/s), riempimento zero e un'altezza dello strato grossolana (l'altezza dello strato dovrebbe essere circa il 75% del diametro dell'ugello). Assicurati che qualsiasi "controllo dinamico dell'accelerazione" sia disabilitato nello slicer.
zh_hans: 用切片软件将[docs/prints/square_tower.stl](prints/square_tower.stl)模型转化为G-Code。建议切片时使用高速度（如大于100mm/s），0%填充，高层厚（如75%以上的喷嘴直径）。确保“动态加速度调整”功能已关闭。

source: Prepare for the test by issuing the following G-Code command:
hu: Készüljön fel a tesztre a következő G-Kód parancs kiadásával:
it: Prepararsi per il test emettendo il seguente comando G-Code:
zh_hans: 在打印G-Code前输入下面的命令：

source: This command makes the nozzle travel slower through corners to emphasize the effects of extruder pressure. Then for printers with a direct drive extruder run the command:
hu: Ezzel a paranccsal a fúvóka lassabban halad át a kanyarokon, hogy kiemelje az extrudernyomás hatását. Ezután a direkt extruderrel rendelkező nyomtatók esetében futtassa az alábbi parancsot:
it: Questo comando fa viaggiare l'ugello più lentamente attraverso gli angoli per enfatizzare gli effetti della pressione dell'estrusore. Quindi per le stampanti con un estrusore a trasmissione diretta eseguire il comando:
zh_hans: 上述命令将使喷嘴在打印转角时减速，从而显著增加转角时挤出的压力。接着，如果您使用的是近程挤出结构，请输入下面的命令：

source: For long bowden extruders use:
hu: Hosszú bowdenes extruderekhez:
it: Per estrusori bowden lunghi utilizzare:
zh_hans: 使用远程挤出的话，则输入：

source: Then print the object. When fully printed the test print looks like:
hu: Ezután nyomtassa ki az objektumot. Teljesen kinyomtatva a tesztnyomat így néz ki:
it: Quindi stampare l'oggetto. Una volta stampata completamente, la stampa di prova avrà il seguente aspetto:
zh_hans: 接着，开始打印。打印后的测试模型将如下图：

source: ![tuning_tower](img/tuning_tower.jpg)
zh_hans: ![测试塔](img/tuning_tower.jpg)

source: The above TUNING_TOWER command instructs Klipper to alter the pressure_advance setting on each layer of the print. Higher layers in the print will have a larger pressure advance value set. Layers below the ideal pressure_advance setting will have blobbing at the corners, and layers above the ideal setting can lead to rounded corners and poor extrusion leading up to the corner.
hu: A fenti TUNING_TOWER parancs utasítja a Klippert, hogy a nyomtatás minden egyes rétegénél módosítsa a pressure_advance beállítást. A nyomtatás magasabb rétegeire nagyobb nyomáselőtolási érték lesz beállítva. Az ideális pressure_advance beállítás alatti rétegeknél a sarkoknál pattogás, az ideális beállítás feletti rétegeknél pedig lekerekített sarkok és gyenge extrudálás alakulhat ki a sarokig.
it: Il comando TUNING_TOWER sopra indica a Klipper di modificare l'impostazione pressure_advance su ogni strato della stampa. Gli strati più alti nella stampa avranno un valore di anticipo della pressione maggiore impostato. Gli strati al di sotto dell'impostazione pressione_anticipo ideale avranno macchie agli angoli e gli strati al di sopra dell'impostazione ideale possono portare a angoli arrotondati e una scarsa estrusione all'angolo.
zh_hans: 上面的调试塔（TUNING_TOWER）G-Code将会使Klipper在打印每一层时逐渐改变压力提前（pressure_advance）的设定值。打印的高度越高，压力提前的设置值越大。在理想的压力提前设定值以下的层，将会在转角出现过度挤出，出现塑料团块；而在理想值之上的层则会出现挤出不足，乃至转角缺失。

source: One can cancel the print early if one observes that the corners are no longer printing well (and thus one can avoid printing layers that are known to be above the ideal pressure_advance value).
hu: A nyomtatást idő előtt megszakíthatja, ha azt észleli, hogy a sarkok már nem nyomtatnak jól (és így elkerülheti az olyan rétegek nyomtatását, amelyekről ismert, hogy az ideális pressure_advance érték felett vannak).
it: È possibile annullare la stampa in anticipo se si osserva che gli angoli non vengono più stampati bene (e quindi si può evitare di stampare livelli noti per essere al di sopra del valore di pressione_avanzamento ideale).
zh_hans: 您可以在转角出现严重缺失的时候停止打印作业（从而避免继续测试不合理的压力提前设定值）。

source: Inspect the print and then use a digital calipers to find the height that has the best quality corners. When in doubt, prefer a lower height.
hu: Ellenőrizze az objektumot, majd digitális tolómérővel mérje meg azt a magasságot, amely a legjobb minőségű sarkokkal rendelkezik. Ha kétségei vannak, válassza az alacsonyabb magasságot.
it: Ispeziona la stampa e quindi utilizza un calibro digitale per trovare l'altezza con gli angoli della migliore qualità. In caso di dubbio, preferire un'altezza inferiore.
zh_hans: 观察打印件，然后用游标卡尺量度转角质量最佳的层对应的高度。如果不能确定哪里最佳，请优先选择较小的高度。

source: ![tune_pa](img/tune_pa.jpg)
zh_hans: ![对高度进行测量](img/tune_pa.jpg)

source: The pressure_advance value can then be calculated as `pressure_advance = <start> + <measured_height> * <factor>`. (For example, `0 + 12.90 * .020` would be `.258`.)
hu: A pressure_advance értéket ezután a következőképpen lehet kiszámítani: `pressure_advance = <start> + <measured_height> * <factor>`. (Például `0 + 12,90 * .020` lenne `.258`.)
it: Il valore pressure_advance può quindi essere calcolato come `pressure_advance = <inizio> + <altezza_misurata> * <fattore>`. (Ad esempio, `0 + 12.90 * .020` sarebbe `.258`.)
zh_hans: 压力提前的设定值可以通过`pressure_advance = <start> + <measured_height> * <factor>`进行计算，如测出的最优层高（measured_height）为12.9 mm，测试起始点（start）为0 mm，增量（factor）为0.02，则计算结果为（ `0 + 12.90 *.020=0.258`。）

source: It is possible to choose custom settings for START and FACTOR if that helps identify the best pressure advance setting. When doing this, be sure to issue the TUNING_TOWER command at the start of each test print.
hu: Lehetőség van a START és a FACTOR egyéni beállításainak kiválasztására, ha ez segít a legjobb nyomás szabályozás beállítás meghatározásában. Ennek során ügyeljen arra, hogy a TUNING_TOWER parancsot minden egyes próbanyomtatás elején ki kell adni.
it: È possibile scegliere impostazioni personalizzate per START e FACTOR se ciò aiuta a identificare la migliore impostazione di anticipo della pressione. Quando si esegue questa operazione, assicurarsi di emettere il comando TUNING_TOWER all'inizio di ogni stampa di prova.
zh_hans: 为获得最佳的压力提前设定值，您可以自定义 起始高度（START）和增量（FACTOR）。切记在开始打印前通过调试塔（TUNING_TOWER）命令设置测试值。

source: Typical pressure advance values are between 0.050 and 1.000 (the high end usually only with bowden extruders). If there is no significant improvement with a pressure advance up to 1.000, then pressure advance is unlikely to improve the quality of prints. Return to a default configuration with pressure advance disabled.
hu: A tipikus nyomás szabályozás értékek 0,050 és 1,000 között vannak (a legmagasabb értékek általában csak a bowdenes extrudereknél). Ha az 1,000-ig terjedő nyomás szabályozással nem tapasztalható jelentős javulás, akkor a nyomás szabályozás valószínűleg nem javítja a nyomatok minőségét. Térjen vissza az alapértelmezett konfigurációhoz, ahol a nyomás szabályozás ki van kapcsolva.
it: I valori tipici di pressure advance sono compresi tra 0,050 e 1,000 (la fascia alta di solito solo con estrusori bowden). Se non vi è alcun miglioramento significativo con un pressure advance fino a 1.000, è improbabile che la pressure advance migliori la qualità delle stampe. Ritorno ad una configurazione di default con pressure advance disabilitato.
zh_hans: 典型压力提前的设置值在0.050到1.000之间（较大数值的一则一般出现在远程挤出结构上）。如果压力提前设置值大于1.000而打印质量没有改善，则应考虑关闭压力提前以避免其他打印问题。

source: Although this tuning exercise directly improves the quality of corners, it's worth remembering that a good pressure advance configuration also reduces ooze throughout the print.
hu: Bár ez a hangolási gyakorlat közvetlenül javítja a sarkok minőségét, érdemes megjegyezni, hogy a jó nyomás szabályozási konfiguráció csökkenti a nyomat teljes terjedelmét.
it: Sebbene questo esercizio di messa a punto migliori direttamente la qualità degli angoli, vale la pena ricordare che una buona configurazione del pressure advance riduce anche gli ooze durante la stampa.
zh_hans: 调试压力提前值不单单直接改善转角处的打印质量，同时也有利于减少打印中的溢料/过度挤出现象。

source: At the completion of this test, set `pressure_advance = <calculated_value>` in the `[extruder]` section of the configuration file and issue a RESTART command. The RESTART command will clear the test state and return the acceleration and cornering speeds to their normal values.
hu: A teszt befejezésekor állítsa be a `pressure_advance = <calculated_value>` értéket a konfigurációs fájl `[extruder]` szakaszában, és adjon ki egy RESTART parancsot. A RESTART parancs törli a tesztállapotot, és visszaállítja a gyorsulási és kanyarodási sebességeket a normál értékekre.
it: Al termine di questo test, impostare `pressure_advance = <calculated_value>` nella sezione `[extruder]` del file di configurazione ed emettere un comando RESTART. Il comando RESTART cancellerà lo stato di test e riporterà le velocità di accelerazione e in curva ai valori normali.
zh_hans: 完成测试后，在配置中的`[extruder]`节中加入`pressure_advance = <calculated_value>`（其中`calculated_value`为前述测试计算出的数值），保存并使用 RESTART 命令重启Klipper以应用配置。同时RESTART会重置转角速度设置并取消压力提前值的逐层变化的设置。

source: Important Notes
hu: Fontos megjegyzések
it: Note importanti
zh_hans: 重要提示

source: The pressure advance value is dependent on the extruder, the nozzle, and the filament. It is common for filament from different manufactures or with different pigments to require significantly different pressure advance values. Therefore, one should calibrate pressure advance on each printer and with each spool of filament.
hu: A nyomás szabályozás értéke az extruder, a fúvóka és a szál függvénye. Gyakori, hogy a különböző gyártóktól származó vagy különböző pigmenteket tartalmazó nyomtatószálak jelentősen eltérő nyomás szabályozási értékeket igényelnek. Ezért minden nyomtatónál és minden egyes tekercs nyomtatószálnál kalibrálni kell a nyomás szabályozást.
it: Il valore di pressure advance dipende dall'estrusore, dall'ugello e dal filamento. È comune che filamenti di produttori diversi o con pigmenti diversi richiedano valori di pressure advance significativamente diversi. Pertanto, si dovrebbe calibrare pressure advance su ciascuna stampante e con ogni bobina di filamento.
zh_hans: 压力提前的设置值与挤出结构，喷嘴和耗材息息相关。对于不同厂商的耗材，或同一厂商的不同颜色/批次的耗材都会出现压力提前值显著不同的状况。因此，建议在更换耗材后重新校准压力提前值。

source: Printing temperature and extrusion rates can impact pressure advance. Be sure to tune the [extruder rotation_distance](Rotation_Distance.md#calibrating-rotation_distance-on-extruders) and [nozzle temperature](http://reprap.org/wiki/Triffid_Hunter%27s_Calibration_Guide#Nozzle_Temperature) prior to tuning pressure advance.
hu: A nyomtatási hőmérséklet és az extrudálási sebesség befolyásolhatja a nyomást. A nyomás szabályozás beállítása előtt mindenképpen hangolja be az [extruder rotation_distance](Rotation_Distance.md#calibrating-rotation_distance-on-extruders) és a [fúvóka hőmérséklet](http://reprap.org/wiki/Triffid_Hunter%27s_Calibration_Guide#Nozzle_Temperature) értékeket.
it: La temperatura di stampa e le velocità di estrusione possono influire sulla pressure advance. Assicurati di regolare [extruder rotation_distance](Rotation_Distance.md#calibrating-rotation_distance-on-extruders) e [nozzle temperature](http://reprap.org/wiki/Triffid_Hunter%27s_Calibration_Guide#Nozzle_Temperature) prima di regolare l'avanzamento della pressione.
zh_hans: 打印温度和打印速度会显著影响压力提前设置。因此请确保在完成[挤出距离校准（extruder rotation_distance）](Rotation_Distance.md#calibrating-rotation_distance-on-extruders) 和 [喷嘴温度校准（nozzle temperature）](http://reprap.org/wiki/Triffid_Hunter%27s_Calibration_Guide#Nozzle_Temperature)后进行压力提前校准。

source: The test print is designed to run with a high extruder flow rate, but otherwise "normal" slicer settings. A high flow rate is obtained by using a high printing speed (eg, 100mm/s) and a coarse layer height (typically around 75% of the nozzle diameter). Other slicer settings should be similar to their defaults (eg, perimeters of 2 or 3 lines, normal retraction amount). It can be useful to set the external perimeter speed to be the same speed as the rest of the print, but it is not a requirement.
hu: A tesztnyomtatást úgy tervezték, hogy nagy extruder-áramlási sebességgel, de egyébként "normál" szeletelő beállításokkal fusson. A nagy áramlási sebességet nagy nyomtatási sebesség (pl. 100 mm/s) és durva rétegmagasság (jellemzően a fúvóka átmérőjének kb. 75%-a) alkalmazásával érjük el. A többi szeletelőbeállításnak hasonlónak kell lennie az alapértelmezettekhez (pl. 2 vagy 3 soros kerület, normál behúzási mennyiség). Hasznos lehet a külső kerület sebességét a nyomtatás többi részével megegyező sebességre állítani, de ez nem követelmény.
it: La stampa di prova è progettata per funzionare con un'elevata portata dell'estrusore, ma per il resto con impostazioni dello slicer "normali". Un'elevata portata si ottiene utilizzando un'elevata velocità di stampa (ad es. 100 mm/s) e un'altezza dello strato grossolano (tipicamente circa il 75% del diametro dell'ugello). Altre impostazioni dello slicer dovrebbero essere simili alle loro impostazioni predefinite (ad esempio, perimetri di 2 o 3 linee, quantità di retrazione normale). Può essere utile impostare la velocità del perimetro esterno in modo che sia la stessa velocità del resto della stampa, ma non è un requisito.
zh_hans: 测试模型被设计用于高挤出量下的测试，而非使用“常规”的切片设置。大挤出量能通过使用高打印速度获得（如100 mm/s）和高层高（典型值为75%的喷嘴直径）。其他切片设置可使用常规数值（如使用2~3壁厚，常规的回抽值）。推荐将外壁打印速度设置成与中间层相同，尽管这样设置并非必要。

source: It is common for the test print to show different behavior on each corner. Often the slicer will arrange to change layers at one corner which can result in that corner being significantly different from the remaining three corners. If this occurs, then ignore that corner and tune pressure advance using the other three corners. It is also common for the remaining corners to vary slightly. (This can occur due to small differences in how the printer's frame reacts to cornering in certain directions.) Try to choose a value that works well for all the remaining corners. If in doubt, prefer a lower pressure advance value.
hu: Gyakori, hogy a tesztnyomtatás minden egyes sarkon eltérő viselkedést mutat. Gyakran előfordul, hogy a szeletelő az egyik sarkon rétegváltást hajt végre, ami azt eredményezheti, hogy az a sarok jelentősen eltér a többi három saroktól. Ha ez előfordul, akkor hagyja figyelmen kívül ezt a sarkot, és a másik három sarkot használva hangolja a nyomás szabályozást. Az is gyakori, hogy a fennmaradó sarkok kissé eltérnek. (Ez azért fordulhat elő, mert a nyomtató kerete kis eltérésekkel reagál a bizonyos irányokba történő kanyarodásra.) Próbáljon meg olyan értéket választani, amely az összes többi saroknál jól működik. Ha kétségei vannak, válasszon inkább egy alacsonyabb nyomás szabályozási értéket.
it: È comune che la stampa di prova mostri un comportamento diverso su ciascun angolo. Spesso lo slicer provvederà a cambiare i livelli in un angolo, il che può comportare che quell'angolo sia significativamente diverso dai restanti tre angoli. Se ciò si verifica, ignora quell'angolo e regola pressure advance utilizzando gli altri tre angoli. È anche comune che gli angoli rimanenti varino leggermente. (Ciò può verificarsi a causa di piccole differenze nel modo in cui il telaio della stampante reagisce alle curve in determinate direzioni.) Prova a scegliere un valore che funzioni bene per tutti gli angoli rimanenti. In caso di dubbio, preferire un valore di pressure advance inferiore.
zh_hans: 测试件的四角出现质量不一的情况非常常见。这是因为通常切片软件会将变层的动作安排在转角上，这将使变层所在的转角与其他三个显著不同。如果出现这种现象，可以忽略变层所在的转角而测量其他三个。同时其他三个转角也可能存在轻微的差异（而这种差异往往来源于打印机框架对不同转角运动出现不同的响应）。推荐尝试使用令三个转角同时获得较高质量的设定值。如果举棋不定，建议使用较低的压力提前设定值。

source: If a high pressure advance value (eg, over 0.200) is used then one may find that the extruder skips when returning to the printer's normal acceleration. The pressure advance system accounts for pressure by pushing in extra filament during acceleration and retracting that filament during deceleration. With a high acceleration and high pressure advance the extruder may not have enough torque to push the required filament. If this occurs, either use a lower acceleration value or disable pressure advance.
hu: Ha magas nyomás szabályozási értéket (pl. 0,200 fölött) használunk, akkor előfordulhat, hogy az extruder kihagy, amikor visszatér a nyomtató normál gyorsuláshoz. A nyomás szabályozási rendszer úgy veszi figyelembe a nyomást, hogy gyorsításkor extra szálat tol, és lassításkor visszahúzza ezt a szálat. Nagy gyorsítás és nagy nyomás szabályozás esetén előfordulhat, hogy az extruder nem rendelkezik elegendő nyomatékkal a szükséges szálak kinyomásához. Ha ez bekövetkezik, vagy használjon alacsonyabb gyorsítási értéket, vagy tiltsa le a nyomás szabályozási funkciót.
it: Se viene utilizzato un valore di pressure advance (ad esempio, superiore a 0.200), è possibile che l'estrusore salti quando torna alla normale accelerazione della stampante. Il sistema di pressure advance tiene conto della pressione spingendo il filamento extra durante l'accelerazione e ritraendo quel filamento durante la decelerazione. Con un'elevata accelerazione e un'elevata pressione di anticipo, l'estrusore potrebbe non avere una coppia sufficiente per spingere il filamento richiesto. In tal caso, utilizzare un valore di accelerazione inferiore o disattivare la pressure advance.
zh_hans: 若设置了一个较高的压力提前设置值，一般为大于0.200，在正常加速度下工作，挤出机可能出现丢步/跳步现象。压力提前系统是通过在加速时挤出更多的耗材，减速时通过回抽减少挤出量来控制喷嘴压力。在使用高加速度和高压力提前设置值下，挤出机或许不能提供足够的扭矩以挤出耗材。如果出现上述状况，建议降低加速度或停用压力提前。

source: Once pressure advance is tuned in Klipper, it may still be useful to configure a small retract value in the slicer (eg, 0.75mm) and to utilize the slicer's "wipe on retract option" if available. These slicer settings may help counteract ooze caused by filament cohesion (filament pulled out of the nozzle due to the stickiness of the plastic). It is recommended to disable the slicer's "z-lift on retract" option.
hu: Miután a Klipperben beállítottuk a nyomás szabályozást, hasznos lehet kisebb visszahúzási értéket beállítani a szeletelőben (pl. 0,75 mm), és használni a szeletelő "wipe on retract" opciót, ha rendelkezésre áll. Ezek a szeletelő beállítások segíthetnek a szálak kohéziója (a műanyag ragadós volta miatt a fúvókából kihúzott szálak) okozta folyása ellen. Ajánlott a szeletelő "z-lift on retract" opció kikapcsolása.
it: Una volta che pressure advance è stato regolato in Klipper, può essere comunque utile configurare un piccolo valore di retrazione nello slicer (ad es. 0,75 mm) e utilizzare l'opzione "pulizia in retrazione" dello slicer, se disponibile. Queste impostazioni dello slicer possono aiutare a contrastare la trasudazione causata dalla coesione del filamento ( estratto dall'ugello a causa della viscosità della plastica). Si consiglia di disabilitare l'opzione "Z-lift in retrazione" dello slicer.
zh_hans: 当完成了Klipper的压力提前设置后，推荐在切片时适当减少回抽距离（如0.75 mm）并开启“回抽期间进行擦嘴”的设置。该设置可以应对耗材粘连造成的溢料（喷嘴内的耗材因塑料的粘性被挤出的耗材抽出）。同时建议关闭切片软件中的“回抽时抬嘴”功能。
