Repository: Klipper3d/klipper-translations
Catalog: locales/*/LC_MESSAGES/Releases.po
Languages: fr, zh_hant

source: History of Klipper releases. Please see [installation](Installation.md) for information on installing Klipper.
fr: Historique de versions de Klipper. Merci de vous référer a la ressource [installation](Installation.md) pour plus d'information sur l'installation de Klipper.
zh_hant: Klipper版本發佈歷史。如何安裝Klipper，請檢視[installation](Installation.md)。

source: Available on 20201020. Major changes in this release:
fr: Disponible le 20/10/2020. Changements majeurs dans cette version :
zh_hant: 在20201020發佈，此版本的主要更新：

source: Support for "Input Shaping" - a mechanism to counteract printer resonance. It can reduce or eliminate "ringing" in prints.
fr: Prise en charge de "Input Shaping" - un mécanisme pour contrer la résonance de l'imprimante. Il peut réduire ou éliminer les "ondulations" dans les impressions.
zh_hant: 支援使用「Input Shaping」功能 - 此功能主要作用是抵消印表機共振。它可以減少甚至消除列印中產生的「ringing」振紋。

source: New "Smooth Pressure Advance" system. This implements "Pressure Advance" without introducing instantaneous velocity changes. It is also now possible to tune pressure advance using a "Tuning Tower" method.
fr: Nouveau système "Smooth Pressure Advance". Cela implémente "Pressure Advance" sans introduire de changements de vitesse instantanés. Il est désormais possible de régler l'avance de pression à l'aide d'une méthode "Tour de réglage".
zh_hant: 「Smooth Pressure Advance」全新的擠出演算法機制。這實現了「Pressure Advance」(列印擠出）同時不會引起擠出速度瞬間的改變，相反會變得更加平滑。現在也可以使用「Tuning Tower」方法來調整「Pressure Advance」(列印擠出）。

source: New "webhooks" API server. This provides a programmable JSON interface to Klipper.
fr: Nouveau serveur API "webhooks". Fournit une interface JSON programmable à Klipper.
zh_hant: 「webhooks」全新的API 伺服器。 這次 Klipper 新增了可程式設計的 JSON 介面。

source: The LCD display and menu are now configurable using the Jinja2 template language.
fr: L'écran LCD et le menu sont désormais configurables à l'aide du langage Jinja2.
zh_hant: 現在可以使用 Jinja2 模板語言配置 LCD 顯示和菜單。

source: The TMC2208 stepper motor drivers can now be used in "standalone" mode with Klipper.
fr: Les pilotes de moteur pas à pas TMC2208 peuvent désormais être utilisés en mode "standalone" avec Klipper.
zh_hant: 現在TMC2208 步進電機驅動器可以在 Klipper系統中 使用「standalone」模式。

source: Improved BL-Touch v3 support.
fr: Prise en charge améliorée du BL-Touch v3.
zh_hant: 支援並優化使用BL-Touch v3 。

source: Improved USB identification. Klipper now has its own USB identification code and micro-controllers can now report their unique serial numbers during USB identification.
fr: Identification USB améliorée. Klipper dispose désormais de son propre code d'identification USB et les micro-contrôleurs peuvent désormais signaler leurs numéros de série lors de l'identification USB.
zh_hant: 改進了USB識別。Klipper現在有自己的USB識別程式碼，微控制器現在可以在USB識別期間報告其唯一的序列號。

source: New kinematic support for "Rotary Delta" and "CoreXZ" printers.
fr: Nouveau support cinématique pour les imprimantes "Rotary Delta" et "CoreXZ".
zh_hant: 對 "旋轉三角洲"和 "CoreXZ "機型印表機的支援。

source: Micro-controller improvements: support for stm32f070, support for stm32f207, support for GPIO pins on "Linux MCU", stm32 "HID bootloader" support, Chitu bootloader support, MKS Robin bootloader support.
fr: Améliorations du microcontrôleur : prise en charge de stm32f070, prise en charge de stm32f207, prise en charge des broches GPIO sur "Linux MCU", prise en charge du "chargeur de démarrage HID" stm32, prise en charge du chargeur de démarrage Chitu, prise en charge du chargeur de démarrage MKS Robin.
zh_hant: 微控制器的改進：支援stm32f070，支援stm32f207，支援 "Linux MCU "的GPIO引腳，支援stm32 "HID啟動載入程式"，支援Chitu啟動載入程式，支援MKS Robin啟動載入程式。

source: Improved handling of Python "garbage collection" events.
fr: Amélioration de la gestion des événements Python pour "garbage collection".
zh_hant: 改進了對Python "垃圾收集 "事件的處理。

source: Many additional modules added: adc_scaled, adxl345, bme280, display_status, extruder_stepper, fan_generic, hall_filament_width_sensor, htu21d, homing_heaters, input_shaper, lm75, print_stats, resonance_tester, shaper_calibrate, query_adc, graph_accelerometer, graph_extruder, graph_motion, graph_shaper, graph_temp_sensor, whconsole
fr: Nombreux modules supplémentaires ajoutés : adc_scaled, adxl345, bme280, display_status, extruder_stepper, fan_generic, hall_filament_width_sensor, htu21d, homing_heaters, input_shaper, lm75, print_stats, resonance_tester, shaper_calibrate, query_adc, graph_accelerometer, graph_extruder, graph_motion, graph_shaper, graph_temp_sensor, whconsole
zh_hant: 增加了許多額外的模組：adc_scaled, adxl345, bme280, display_status, extruder_stepper, fan_generic, hall_filament_width_sensor, htu21d, homing_heaters, input_shaper, lm75, print_stats, resonance_tester, shaper_calibrate, query_adc, graph_accelerometer, graph_extruder, graph_motion, graph_shaper, graph_temp_sensor, whconsole

source: Several bug fixes and code cleanups.
fr: Plusieurs corrections de bogues et nettoyages de code.
zh_hant: 幾個錯誤的修復和程式碼的清理。

source: Available on 20201028. Release containing only bug fixes.
fr: Disponible le 28/10/2020. Version contenant uniquement des corrections de bogues.
zh_hant: 在20201028發佈。只包含錯誤修復。

source: Available on 20191021. Major changes in this release:
fr: Disponible le 21/10/2019. Changements majeurs dans cette version :
zh_hant: 在20191021發佈。此版本的主要更新：

source: New G-Code command template support. G-Code in the config file is now evaluated with the Jinja2 template language.
fr: Prise en charge du nouveau modèle de commande G-Code. Le G-Code dans le fichier de configuration est maintenant évalué avec le langage Jinja2.
zh_hant: 新的G-Code命令模板支援。配置檔案中的G-Code現在可以用Jinja2模板語言進行編寫。

source: Improvements to Trinamic stepper drivers:
fr: Améliorations de la gestion des pilotes pas à pas Trinamic :
zh_hant: 對Trinamic步進驅動器的改進：

source: New support for TMC2209 and TMC5160 drivers.
fr: Nouvelle prise en charge pour les pilotes TMC2209 et TMC5160.
zh_hant: 新增對TMC2209和TMC5160驅動器的支援。

source: Improved DUMP_TMC, SET_TMC_CURRENT, and INIT_TMC G-Code commands.
fr: Commandes G-Code DUMP_TMC, SET_TMC_CURRENT et INIT_TMC améliorées.
zh_hant: 改進了 DUMP_TMC、SET_TMC_CURRENT 和 INIT_TMC G-Code 命令。

source: Improved support for TMC UART handling with an analog mux.
fr: Prise en charge améliorée de la gestion TMC UART avec un multiplexage analogique.
zh_hant: 通過模擬多路復用器改進了對 TMC UART 處理的支援。

source: Improved homing, probing, and bed leveling support:
fr: Prise en charge améliorée de la mise à l'origine, du sondage et de la mise à niveau du lit :
zh_hant: 改進的歸位、探測和床校平支援：

source: New manual_probe, bed_screws, screws_tilt_adjust, skew_correction, safe_z_home modules added.
fr: Nouveaux modules manual_probe, bed_screws, screw_tilt_adjust, skew_correction, safe_z_home ajoutés.
zh_hant: 添加了新的 manual_probe、bed_screws、screw_tilt_adjust、skew_correction、safe_z_home 模塊。

source: Enhanced multi-sample probing with median, average, and retry logic.
fr: Sondage multi-échantillons amélioré avec une logique de médiane, de moyenne et de nouvel essai.
zh_hant: 使用中值、平均和重試邏輯增強多樣本探測。

source: Improved documentation for BL-Touch, probe calibration, endstop calibration, delta calibration, sensorless homing, and endstop phase calibration.
fr: Documentation améliorée pour le BL-Touch, l'étalonnage de la sonde, l'étalonnage de la fin de course, l'étalonnage des imprimantes delta, la mise à l'origine sans capteur et l'étalonnage de la phase de fin de course.
zh_hant: 改進了 BL-Touch、探頭校準、停止校準、增量校準、無傳感器歸位和停止相位校準的文檔。

source: Improved homing support on a large Z axis.
fr: Prise en charge améliorée de la mise à l'origine sur un axe Z de grande taille.
zh_hant: 改進了大 Z 軸上的歸位支援。

source: Many Klipper micro-controller improvements:
fr: De nombreuses améliorations du micro-contrôleur Klipper :
zh_hant: 許多 Klipper 微控制器改進：

source: Klipper ported to: SAM3X8C, SAM4S8C, SAMD51, STM32F042, STM32F4
fr: Klipper porté sur : SAM3X8C, SAM4S8C, SAMD51, STM32F042, STM32F4
zh_hant: Klipper 移植到：SAM3X8C、SAM4S8C、SAMD51、STM32F042、STM32F4

source: New USB CDC driver implementations on SAM3X, SAM4, STM32F4.
fr: Nouvelles implémentations des pilotes USB CDC sur SAM3X, SAM4, STM32F4.
zh_hant: 在 SAM3X、SAM4、STM32F4 上實現新的 USB CDC 驅動程序。

source: Enhanced support for flashing Klipper over USB.
fr: Prise en charge améliorée du flashage de Klipper via USB.
zh_hant: 增強了對通過 USB 刷新 Klipper 的支援。

source: Software SPI support.
fr: Prise en charge du SPI logiciel.
zh_hant: 軟件 SPI 支援。

source: Greatly improved temperature filtering on the LPC176x.
fr: Filtrage de température grandement amélioré sur le capteur LPC176x.
zh_hant: 大大改進了 LPC176x 上的溫度過濾。

source: Early output pin settings can be configured in the micro-controller.
fr: Les paramètres de démarrage des broches de sortie peuvent être configurés dans le micro-contrôleur.
zh_hant: 早期的輸出引腳設置可以在微控制器中進行配置。

source: New website with the Klipper documentation: http://klipper3d.org/
fr: Nouveau site web avec la documentation Klipper : http://klipper3d.org/
zh_hant: 帶有 Klipper 文檔的新網站：http://klipper3d.org/

source: Klipper now has a logo.
fr: Klipper a maintenant un logo.
zh_hant: Klipper 現在有了一個標誌。

source: Experimental support for polar and "cable winch" kinematics.
fr: Support expérimental pour la cinématique polaire et "treuil à câble".
zh_hant: 對polar和“cable winch”機型作實驗性支援。

source: The config file can now include other config files.
fr: Le fichier de configuration peut maintenant inclure d'autres fichiers de configuration.
zh_hant: 配置文件現在可以包含其他配置文件。

source: Many additional modules added: board_pins, controller_fan, delayed_gcode, dotstar, filament_switch_sensor, firmware_retraction, gcode_arcs, gcode_button, heater_generic, manual_stepper, mcp4018, mcp4728, neopixel, pause_resume, respond, temperature_sensor tsl1401cl_filament_width_sensor, tuning_tower
fr: De nombreux modules supplémentaires ajoutés : board_pins, controller_fan, delay_gcode, dotstar, filament_switch_sensor, firmware_retraction, gcode_arcs, gcode_button, heater_generic, manual_stepper, mcp4018, mcp4728, neopixel, pause_resume, respond, temperature_sensor tsl1401cl_filament_width_sensor, tuning_tower
zh_hant: 添加了許多附加模塊：board_pins、controller_fan、delayed_gcode、dotstar、filament_switch_sensor、firmware_retraction、gcode_arcs、gcode_button、heater_generic、manual_stepper、mcp4018、mcp4728、neopixel、pause_resume、response、temperature_sensor tsl1401cl_filament_width_sensor、tuning_tower

source: Many additional commands added: RESTORE_GCODE_STATE, SAVE_GCODE_STATE, SET_GCODE_VARIABLE, SET_HEATER_TEMPERATURE, SET_IDLE_TIMEOUT, SET_TEMPERATURE_FAN_TARGET
fr: De nombreuses commandes supplémentaires ajoutées : RESTORE_GCODE_STATE, SAVE_GCODE_STATE, SET_GCODE_VARIABLE, SET_HEATER_TEMPERATURE, SET_IDLE_TIMEOUT, SET_TEMPERATURE_FAN_TARGET
zh_hant: 添加了許多附加命令：RESTORE_GCODE_STATE、SAVE_GCODE_STATE、SET_GCODE_VARIABLE、SET_HEATER_TEMPERATURE、SET_IDLE_TIMEOUT、SET_TEMPERATURE_FAN_TARGET

source: Available on 20181220. Major changes in this release:
fr: Disponible le 20/12/2018. Changements majeurs dans cette version :
zh_hant: 在20181220發佈。此版本的主要更新：

source: Klipper now supports "mesh" bed leveling
fr: Klipper prend désormais en charge le nivellement du lit par maillage
zh_hant: Klipper 現在支援“網狀”床調平

source: New support for "enhanced" delta calibration (calibrates print x/y dimensions on delta printers)
fr: Nouvel étalonnage des imprimantes delta "amélioré" (étalonne les dimensions d'impression x/y sur les imprimantes delta)
zh_hant: 對三角機型的強化校準的新支援（校準三角機型打印機上的打印 x/y 尺寸）

source: Support for run-time configuration of Trinamic stepper motor drivers (tmc2130, tmc2208, tmc2660)
fr: Gestion de la configuration pendant l'exécution des pilotes de moteur pas à pas Trinamic (tmc2130, tmc2208, tmc2660)
zh_hant: 支援 Trinamic 步進電機驅動器（tmc2130、tmc2208、tmc2660）的運行時配置

source: Improved temperature sensor support: MAX6675, MAX31855, MAX31856, MAX31865, custom thermistors, common pt100 style sensors
fr: Prise en charge améliorée des capteurs de température : MAX6675, MAX31855, MAX31856, MAX31865, thermistances personnalisées, capteurs de style pt100
zh_hant: 改進的溫度傳感器支援：MAX6675、MAX31855、MAX31856、MAX31865、定制熱敏電阻、通用 pt100 型傳感器

source: Several new modules: temperature_fan, sx1509, force_move, mcp4451, z_tilt, quad_gantry_level, endstop_phase, bltouch
fr: Plusieurs nouveaux modules : temperature_fan, sx1509, force_move, mcp4451, z_tilt, quad_gantry_level, endstop_phase, bltouch
zh_hant: 幾個新模塊：temperature_fan、sx1509、force_move、mcp4451、z_tilt、quad_gantry_level、endstop_phase、bltouch

source: Several new commands added: SAVE_CONFIG, SET_PRESSURE_ADVANCE, SET_GCODE_OFFSET, SET_VELOCITY_LIMIT, STEPPER_BUZZ, TURN_OFF_HEATERS, M204, custom g-code macros
fr: Plusieurs nouvelles commandes ajoutées : SAVE_CONFIG, SET_PRESSURE_ADVANCE, SET_GCODE_OFFSET, SET_VELOCITY_LIMIT, STEPPER_BUZZ, TURN_OFF_HEATERS, M204, macros g-code personnalisées
zh_hant: 添加了幾個新命令：SAVE_CONFIG、SET_PRESSURE_ADVANCE、SET_GCODE_OFFSET、SET_VELOCITY_LIMIT、STEPPER_BUZZ、TURN_OFF_HEATERS、M204、自定義 G-Code

source: Expanded LCD display support:
fr: Prise en charge étendue de l'écran LCD :
zh_hant: 擴充的 LCD 顯示支援：

source: Support for run-time menus
fr: Prise en charge des menus d'exécution
zh_hant: 支援即時建立的菜單

source: New display icons
fr: Nouvelles icônes d'affichage
zh_hant: 新的顯示圖標

source: Support for "uc1701" and "ssd1306" displays
fr: Prise en charge des écrans "uc1701" et "ssd1306"
zh_hant: 支援“uc1701”和“ssd1306”顯示屏

source: Additional micro-controller support:
fr: Prise en charge de nouveaux micro-contrôleurs :
zh_hant: 支援更多的微控制器:

source: Klipper ported to: LPC176x (Smoothieboards), SAM4E8E (Duet2), SAMD21 (Arduino Zero), STM32F103 ("Blue pill" devices), atmega32u4
fr: Klipper porté sur : LPC176x (Smoothieboards), SAM4E8E (Duet2), SAMD21 (Arduino Zero), STM32F103 (appareils "Blue pill"), atmega32u4
zh_hant: Klipper 移植到：LPC176x (Smoothieboards), SAM4E8E (Duet2), SAMD21 (Arduino Zero), STM32F103 ("Blue pill" devices), atmega32u4

source: New Generic USB CDC driver implemented on AVR, LPC176x, SAMD21, and STM32F103
fr: Nouveau pilote CDC USB générique implémenté sur AVR, LPC176x, SAMD21 et STM32F103
zh_hant: 在 AVR、LPC176x、SAMD21 和 STM32F103 上實現的新通用 USB CDC 驅動程序

source: Performance improvements on ARM processors
fr: Améliorations des performances sur les processeurs ARM
zh_hant: 對ARM 處理器的性能改進

source: The kinematics code was rewritten to use an "iterative solver"
fr: Le code cinématique a été réécrit pour utiliser un "solveur itératif"
zh_hant: 重寫動作代碼,轉用"iterative solver"

source: New automatic test cases for the Klipper host software
fr: Nouveaux tests automatisés pour le logiciel hôte Klipper
zh_hant: Klipper 主機軟件的新自動測試用例

source: Many new example config files for common off-the-shelf printers
fr: De nombreux nouveaux exemples de fichiers de configuration pour les imprimantes les plus courantes
zh_hant: 常見的現成打印機的許多新示例配置文件

source: Documentation updates for bootloaders, benchmarking, micro-controller porting, config checks, pin mapping, slicer settings, packaging, and more
fr: Mises à jour de la documentation pour les chargeurs de démarrage, l'analyse comparative, le portage des micro-contrôleurs, les vérifications de configuration, le mappage des broches, les paramètres du trancheur, le packaging, et plus
zh_hant: 引導加載程序、基準測試、微控制器移植、配置檢查、引腳映射、切片器設置、封裝等的文檔更新

source: Several bug fixes and code cleanups
fr: Plusieurs corrections de bogues et nettoyages de code
zh_hant: 幾個錯誤修復和代碼清理

source: Available on 20180331. Major changes in this release:
fr: Disponible le 31/03/2018. Changements majeurs dans cette version :
zh_hant: 在20180331發佈。此版本的主要更新：

source: Enhanced heater and thermistor hardware failure checks
fr: Vérifications améliorées des défaillances matérielles des éléments chauffants et des thermistances
zh_hant: 增強的加熱器和熱敏電阻硬件故障檢查

source: Support for Z probes
fr: Prise en charge des sondes Z
zh_hant: 支援 Z 探頭

source: Initial support for automatic parameter calibration on deltas (via a new delta_calibrate command)
fr: Première prise en charge de l'étalonnage automatique des paramètres sur les deltas (via une nouvelle commande delta_calibrate)
zh_hant: 對三角機型的自動參數校準作初步支援（通過新的 delta_calibrate 命令）

source: Initial support for bed tilt compensation (via bed_tilt_calibrate command)
fr: Première prise en charge de la compensation d'inclinaison du lit (via la commande bed_tilt_calibrate)
zh_hant: 對床傾斜補償的初始支援（通過 bed_tilt_calibrate 命令）

source: Initial support for "safe homing" and homing overrides
fr: Première prise en charge de la « mise à l'origine 'sûre' » et des surcharges des mises à l'origine
zh_hant: 對"safe homing"和歸位覆蓋的初始支援

source: Initial support for displaying status on RepRapDiscount style 2004 and 12864 displays
fr: Prise en charge de l'affichage de l'état sur les écrans RepRapDiscount style 2004 et 12864
zh_hant: 初步支援在 RepRapDiscount 樣式 2004 和 12864 顯示屏上顯示狀態

source: New multi-extruder improvements:
fr: Nouvelles améliorations pour la multi-extrusion :
zh_hant: 新增對多擠出機支援的改善：

source: Support for shared heaters
fr: Prise en charge des chauffages partagés
zh_hant: 支援共享加熱頭

source: Initial support for dual carriages
fr: Prise en charge des chariots doubles (IDEX)
zh_hant: 對雙步進的初步支援

source: Support for configuring multiple steppers per axis (eg, dual Z)
fr: Prise en charge de la configuration de plusieurs steppers par axe (par exemple, double Z)
zh_hant: 支援為每個軸配置多個步進器（例如 : 雙 Z）

source: Support for custom digital and pwm output pins (with a new SET_PIN command)
fr: Prise en charge des broches de sortie numériques et pwm personnalisées (avec une nouvelle commande SET_PIN)
zh_hant: 支援自定義數字和 pwm 輸出引腳（使用新的 SET_PIN 命令）

source: Initial support for a "virtual sdcard" that allows printing directly from Klipper (helps on machines too slow to run OctoPrint well)
fr: Prise en charge d'une "carte SD virtuelle" qui permet d'imprimer directement depuis Klipper (aide sur les machines trop lentes pour bien exécuter OctoPrint)
zh_hant: 最初支援允許直接從 Klipper 打印的“虛擬 sdcard”（有助於機器速度太慢而無法很好地運行 OctoPrint）

source: Support for setting different arm lengths on each tower of a delta
fr: Prise en charge du réglage de différentes longueurs de bras sur chaque tour d'une delta
zh_hant: 支援在三角洲機型的每個柱上設置不同的印臂長度

source: Support for G-Code M220/M221 commands (speed factor override / extrude factor override)
fr: Prise en charge des commandes G-Code M220/M221 (remplacement du facteur de vitesse/remplacement du facteur d'extrusion)
zh_hant: 支援 G-Code M220/M221 命令 (speed factor override / extrude factor override)

source: Several documentation updates:
fr: Plusieurs mises à jour de la documentation :
zh_hant: 幾個文檔更新：

source: New multiple MCU config example
fr: Nouvel exemple de configuration multi-MCU
zh_hant: 新增多 MCU 配置示例

source: New bltouch sensor config example
fr: Nouvel exemple de configuration du capteur bltouch
zh_hant: 新的 bltouch 傳感器配置示例

source: New FAQ, config check, and G-Code documents
fr: Nouveaux documents sur la FAQ, la vérification de la configuration et le G-Code
zh_hant: 新的常見問題解答、配置檢查和 G-Code文件檔

source: Initial support for continuous integration testing on all github commits
fr: Prise en charge des tests d'intégration continue sur tous les commits github
zh_hant: 對所有 github 提交的持續集成測試的初始支援

source: Available on 20171025. Major changes in this release:
fr: Disponible le 25/10/2017. Changements majeurs dans cette version :
zh_hant: 在20171025發佈。此版本的主要更新：

source: Support for printers with multiple extruders.
fr: Prise en charge des imprimantes avec plusieurs extrudeuses.
zh_hant: 支援具有多個擠出機的打印機。

source: Initial support for running on the Beaglebone PRU. Initial support for the Replicape board.
fr: Prise en charge pour l'exécution sur le PRU Beaglebone. Prise en charge de la carte Replicape.
zh_hant: 最初支援在 Beaglebone PRU 上運行。對複制板的初始支援。

source: Initial support for running the micro-controller code in a real-time Linux process.
fr: Prise en charge de l'exécution du code du microcontrôleur dans un processus Linux en temps réel.
zh_hant: 初步支援在實時 Linux 進程中運行微控制器代碼。

source: Support for multiple micro-controllers. (For example, one could control an extruder with one micro-controller and the rest of the printer with another.) Software clock synchronization is implemented to coordinate actions between micro-controllers.
fr: Prise en charge de plusieurs microcontrôleurs. (Par exemple, on pourrait contrôler une extrudeuse avec un microcontrôleur et le reste de l'imprimante avec un autre.) Une synchronisation d'horloge logicielle est mise en œuvre pour coordonner les actions entre les microcontrôleurs.
zh_hant: 支援多個微控制器。 （例如，可以用一個微控制器控制擠出機，而用另一個微控制器控制打印機的其餘部分。）實現軟件時鐘同步以協調微控制器之間的動作。

source: Stepper performance improvements (20Mhz AVRs up to 189K steps per second).
fr: Améliorations des performances des moteurs pas à pas (AVR 20Mhz jusqu'à 189K pas par seconde).
zh_hant: 步進器性能改進（20Mhz AVR 高達每秒 189K 步）。

source: Support for controlling servos and support for defining nozzle cooling fans.
fr: Prise en charge du contrôle des servos et prise en charge de la définition des ventilateurs de refroidissement des buses.
zh_hant: 支援控制舵機，支援定義噴嘴冷卻風扇。

source: Available on 20170503. Major changes in this release:
fr: Disponible le 03/05/2017. Changements majeurs dans cette version :
zh_hant: 在20170503發佈。此版本的主要更新：

source: Improved installation on Raspberry Pi machines. Most of the install is now scripted.
fr: Installation améliorée sur les machines Raspberry Pi. La majeure partie de l'installation est maintenant scriptée.
zh_hant: 改進了 Raspberry Pi 機器上的安裝。現在大部分安裝都是腳本化的。

source: Support for corexy kinematics
fr: Prise en charge des imprimantes corexy
zh_hant: 支援 corexy 機型

source: Documentation updates: New Kinematics document, new Pressure Advance tuning guide, new example config files, and more
fr: Mises à jour de la documentation : nouveau document cinématique, nouveau guide de réglage Pressure Advance, nouveaux exemples de fichiers de configuration, et plus
zh_hant: 文檔更新：新的機型文檔、新的 Pressure Advance 調整指南、新的示例配置文件等

source: Stepper performance improvements (20Mhz AVRs over 175K steps per second, Arduino Due over 460K)
fr: Améliorations des performances des moteurs pas à pas (AVR 20Mhz sur 175K pas par seconde, Arduino Due sur 460K)
zh_hant: 步進器性能改進（20Mhz AVR 每秒超過 175K 步，Arduino Due 超過 460K）

source: Support for automatic micro-controller resets. Support for resets via toggling USB power on Raspberry Pi.
fr: Prise en charge des réinitialisations automatiques du microcontrôleur. Prise en charge des réinitialisations via basculement de l'alimentation USB sur Raspberry Pi.
zh_hant: 支援自動微控制器復位。支援通過在 Raspberry Pi 上切換 USB 電源進行重置。

source: The pressure advance algorithm now works with look-ahead to reduce pressure changes during cornering.
fr: L'algorithme d'avance de pression fonctionne désormais avec anticipation pour réduire les changements de pression dans les virages.
zh_hant: pressure advance算法現在與前瞻一起使用，以減少轉彎過程中的壓力變化。

source: Support for limiting the top speed of short zigzag moves
fr: Prise en charge de la limitation de la vitesse maximale des mouvements courts en zigzag
zh_hant: 支援限制短之字形移動的最高速度

source: Support for AD595 sensors
fr: Prise en charge des capteurs AD595
zh_hant: 支援 AD595 傳感器

source: Available on 20161223. Major changes in this release:
fr: Disponible le 23/12/2016. Changements majeurs dans cette version :
zh_hant: 在20161223發佈。此版本的主要更新：

source: Improved documentation
fr: Documentation améliorée
zh_hant: 改進的文件檔

source: Support for robots with delta kinematics
fr: Prise en charge des imprimantes avec cinématique delta
zh_hant: 支援具有 三角機型的機器

source: Support for Arduino Due micro-controller (ARM cortex-M3)
fr: Prise en charge du microcontrôleur Arduino Due (ARM cortex-M3)
zh_hant: 支援 Arduino Due 微控制器 (ARM cortex-M3)

source: Support for USB based AVR micro-controllers
fr: Prise en charge des microcontrôleurs AVR basés sur USB
zh_hant: 支援基於 USB 的 AVR 微控制器
