Repository: Klipper3d/klipper-translations
Catalog: locales/*/LC_MESSAGES/Releases.po
Languages: fr, zh_hant

source: Support for "pressure advance" algorithm - it reduces ooze during prints.
fr: Prise en charge de l'algorithme "d'avance de pression" - il réduit le suintement pendant les impressions.
zh_hant: 支援“pressure advance" 算法 - 它減少了打印過程中的滲出。

source: New "stepper phased based endstop" feature - enables higher precision on endstop homing.
fr: Nouvelle fonctionnalité "butée de fin de course basée sur la phase de moteurs pas à pas" - permet une plus grande précision sur la prise d'origine de la fin de course.
zh_hant: 新的“基於步進相控的限位器”功能 - 可實現更高精度的限位器歸位。

source: Support for "extended g-code" commands such as "help", "restart", and "status".
fr: Prise en charge des commandes "g-code étendu" telles que "help", "restart" et "status".
zh_hant: 支援“擴展 G-Code”命令，例如“help”、“restart”和“status”。

source: Support for reloading the Klipper config and restarting the host software by issuing a "restart" command from the terminal.
fr: Prise en charge du rechargement de la configuration Klipper et du redémarrage du logiciel hôte en émettant une commande "restart" depuis le terminal.
zh_hant: 支援通過從終端發出“重新啟動”命令來重新加載 Klipper 配置並重新啟動主機軟件。

source: Stepper performance improvements (20Mhz AVRs up to 158K steps per second).
fr: Améliorations des performances des moteurs pas à pas (AVR 20Mhz jusqu'à 158K pas par seconde).
zh_hant: 步進器性能改進（20Mhz AVR 高達每秒 158K 步）。

source: Improved error reporting. Most errors now shown via the terminal along with help on how to resolve.
fr: Gestion des erreurs améliorée. La plupart des erreurs sont maintenant affichées via le terminal avec une aide sur la façon de les résoudre.
zh_hant: 改進的錯誤報告。現在通過終端顯示大多數錯誤以及如何解決的幫助。

source: Initial release of Klipper. Available on 20160525. Major features available in the initial release include:
fr: Première version de Klipper. Disponible le 25/05/2016. Les principales fonctionnalités disponibles dans la version initiale incluent :
zh_hant: Klipper 的初始版本。在 20160525 上可用。初始版本中提供的主要功能包括：

source: Basic support for cartesian printers (steppers, extruder, heated bed, cooling fan).
fr: Prise en charge de base des imprimantes cartésiennes (moteurs pas à pas, extrudeur, lit chauffant, ventilateur de refroidissement).
zh_hant: 對獨立XY打印機（步進機、擠出機、加熱床、冷卻風扇）的基本支援。

source: Support for common g-code commands. Support for interfacing with OctoPrint.
fr: Prise en charge des commandes g-code de base. Prise en charge de l'interfaçage avec OctoPrint.
zh_hant: 支援常見的 G-Code命令。支援與 OctoPrint 的接口。

source: Acceleration and lookahead handling
fr: Accélération et gestion de l'anticipation
zh_hant: 加速和前瞻處理

source: Support for AVR micro-controllers via standard serial ports
fr: Prise en charge des microcontrôleurs AVR via des ports série standard
zh_hant: 通過標準串行端口支援 AVR 微控制器

source: Releases
fr: Versions
zh_hant: 版本發佈

source: Available on 20210929. Major changes in this release:
fr: Disponible le 29/09/2021. Changements majeurs dans cette version :
zh_hant: 在20210929發佈，此版本的主要更新：

source: Support for "Multi-MCU Homing". It is now possible for a stepper motor and its endstop to be wired to separate micro-controllers. This simplifies wiring of Z probes on "toolhead boards".
fr: Prise en charge de la mise à l'origine "Multi-MCU". Il est désormais possible de câbler un pilote de moteur pas à pas et sa fin de course sur des microcontrôleurs séparés. Cela simplifie le câblage des sondes Z sur les "cartes de tête d'outil".
zh_hant: 支援“多MCU歸位”。現在可以將步進電機及其限位器連接到單獨的微控制器。這簡化了"toolhead boards"上 Z 探頭的接線。

source: Klipper now has a [Community Discord Server](https://discord.klipper3d.org) and a [Community Discourse Server](https://community.klipper3d.org).
fr: Klipper a maintenant un [Serveur Discord](https://discord.klipper3d.org) et un [Serveur Discourse](https://community.klipper3d.org).
zh_hant: Klipper 現在有一個 [Community Discord Server](https://discord.klipper3d.org) 和一個 [Community Discourse Server](https://community.klipper3d.org)。

source: The [Klipper website](https://www.klipper3d.org) now uses the "mkdocs" infrastructure. There is also a [Klipper Translations](https://github.com/Klipper3d/klipper-translations) project.
fr: Le [site Web de Klipper](https://www.klipper3d.org) utilise désormais l'infrastructure "mkdocs". Il existe également un projet [Klipper Translations](https://github.com/Klipper3d/klipper-translations).
zh_hant: [Klipper 網站](https://www.klipper3d.org) 現在使用“mkdocs”基礎架構。還有一個 [Klipper Translations](https://github.com/Klipper3d/klipper-translations) 項目。

source: Automated support for flashing firmware via sdcard on many boards.
fr: Prise en charge automatisée du flash du micrologiciel via une carte SD sur de nombreuses cartes.
zh_hant: 在許多板上通過 sdcard 自動支援刷新固件。

source: New kinematic support for "Hybrid CoreXY" and "Hybrid CoreXZ" printers.
fr: Nouveau support cinématique pour les imprimantes "Hybrid CoreXY" et "Hybrid CoreXZ".
zh_hant: 對“Hybrid CoreXY”和“Hybrid CoreXZ”打印機的新機型支援。

source: Klipper now uses `rotation_distance` to configure stepper motor travel distances.
fr: Klipper utilise maintenant `rotation_distance` pour configurer les distances de déplacement du moteur pas à pas.
zh_hant: Klipper 現在使用 `rotation_distance` 來配置步進電機的行程距離。

source: The main Klipper host code can now directly communicate with micro-controllers using CAN bus.
fr: Le code hôte principal de Klipper peut désormais communiquer directement avec les microcontrôleurs via le bus CAN.
zh_hant: Klipper 主代碼現在可以使用 CANBUS直接與微控制器通信。

source: New "motion analysis" system. Klipper's internal motion updates and sensor results can be tracked and logged for analysis.
fr: Nouveau système "d'analyse de mouvement". Les mises à jour des mouvements internes de Klipper et les résultats des capteurs peuvent être suivis et enregistrés pour analyse.
zh_hant: 新的"motion analysis"系統。可以跟踪和記錄 Klipper 的內部運動更新和傳感器結果以供分析。

source: Trinamic stepper motor drivers are now continuously monitored for error conditions.
fr: Les pilotes de moteur pas à pas Trinamic sont désormais surveillés en permanence pour les conditions d'erreur.
zh_hant: Trinamic 步進電機驅動器現在可以連續監控錯誤情況。

source: Support for the rp2040 micro-controller (Raspberry Pi Pico boards).
fr: Prise en charge du microcontrôleur rp2040 (cartes Raspberry Pi Pico).
zh_hant: 支援 rp2040 微控制器（Raspberry Pi Pico 板）。

source: The "make menuconfig" system now utilizes kconfiglib.
fr: Le système "make menuconfig" utilise maintenant kconfiglib.
zh_hant: “make menuconfig”系統現在使用 kconfiglib。

source: Many additional modules added: ds18b20, duplicate_pin_override, filament_motion_sensor, palette2, motion_report, pca9533, pulse_counter, save_variables, sdcard_loop, temperature_host, temperature_mcu
fr: De nombreux modules supplémentaires ajoutés : ds18b20, duplicate_pin_override, filament_motion_sensor, palette2, motion_report, pca9533, pulse_counter, save_variables, sdcard_loop, temperature_host, temperature_mcu
zh_hant: 添加了許多附加模塊：ds18b20, duplicate_pin_override, filament_motion_sensor, palette2, motion_report, pca9533, pulse_counter, save_variables, sdcard_loop, temperature_host, temperature_mcu

source: Available on 20221128. Major changes in this release:
fr: Disponible le 28/11/2022. Changements majeurs dans cette version :

source: Trinamic stepper motor driver "step on both edges" optimization.
fr: Optimisation du pilote de moteur pas à pas trinamic "pas sur les deux côtés" ("step on both edges").

source: Support for Python3. The Klipper host code will run with either Python2 or Python3.
fr: Prise en charge de Python3. Le code hôte Klipper fonctionnera avec Python2 ou Python3.

source: Enhanced CAN bus support. Support for CAN bus on rp2040, stm32g0, stm32h7, same51, and same54 chips. Support for "USB to CAN bus bridge" mode.
fr: Prise en charge améliorée du bus CAN. Prise en charge du bus CAN sur les puces rp2040, stm32g0, stm32h7, same51 et same54. Prise en charge du mode "pont USB vers bus CAN".

source: Support for CanBoot bootloader.
fr: Prise en charge du chargeur de démarrage CanBoot.

source: Support for mpu9250 and mpu6050 accelerometers.
fr: Prise en charge des accéléromètres mpu9250 et mpu6050.

source: Improved error handling for max31856, max31855, max31865, and max6675 temperature sensors.
fr: Amélioration de la gestion des erreurs pour les capteurs de température max31856, max31855, max31865 et max6675.

source: It is now possible to configure LEDs to update during long running G-Code commands using LED "template" support.
fr: Il est désormais possible de configurer les LED pour qu'elles se mettent à jour pendant les longues commandes G-Code à l'aide de la prise en charge du "modèle" de LED.

source: Several micro-controller improvements. New support for stm32h743, stm32h750, stm32l412, stm32g0b1, same70, same51, and same54 chips. Support for i2c reads on atsamd and stm32f0. Hardware pwm support on stm32. Linux mcu signal based event dispatch. New rp2040 support for "make flash", i2c, and rp2040-e5 USB errata.
fr: Plusieurs améliorations sur le microcontrôleur. Nouvelle prise en charge des puces stm32h743, stm32h750, stm32l412, stm32g0b1, same70, same51 et same54. Prise en charge des lectures i2c sur atsamd et stm32f0. Prise en charge pwm matérielle sur stm32. Envoi d'événements basé sur le signal Linux mcu. Nouveau support rp2040 pour "make flash", i2c et rp2040-e5 USB errata.

source: New modules added: angle, dac084S085, exclude_object, led, mpu9250, pca9632, smart_effector, z_thermal_adjust. New deltesian kinematics added. New dump_mcu tool added.
fr: Nouveaux modules ajoutés : angle, dac084S085, exclude_object, led, mpu9250, pca9632, smart_effector, z_thermal_adjust. Nouvelle cinématique "deltésienne" ajoutée. Nouvel outil dump_mcu ajouté.
