Repository: Klipper3d/klipper-translations
Catalog: locales/*/LC_MESSAGES/Skew_Correction.po
Languages: hu, it

source: Skew correction
hu: Ferdeség korrekció
it: Correzione dell'inclinazione

source: Software based skew correction can help resolve dimensional inaccuracies resulting from a printer assembly that is not perfectly square. Note that if your printer is significantly skewed it is strongly recommended to first use mechanical means to get your printer as square as possible prior to applying software based correction.
hu: A szoftveralapú ferdeség korrekció segíthet a nem tökéletesen szögletes nyomtatóegységből eredő méretpontatlanságok feloldásában. Vedd figyelembe, hogy ha a nyomtatója jelentősen ferde, erősen ajánlott először mechanikai eszközökkel a nyomtatót a lehető legegyenletesebbre állítani, mielőtt a szoftveralapú korrekciót alkalmazná.
it: La correzione dell'inclinazione basata su software può aiutare a risolvere le imprecisioni dimensionali risultanti da un gruppo stampante non perfettamente in squadrato. Si noti che se la stampante è notevolmente inclinata, si consiglia vivamente di utilizzare prima mezzi meccanici per ottenere la stampante il più squadrata possibile prima di applicare la correzione basata sul software.

source: Print a Calibration Object
hu: Kalibrációs objektum nyomtatása
it: Stampa un oggetto di calibrazione

source: The first step in correcting skew is to print a [calibration object](https://www.thingiverse.com/thing:2563185/files) along the plane you want to correct. There is also a [calibration object](https://www.thingiverse.com/thing:2972743) that includes all planes in one model. You want the object oriented so that corner A is toward the origin of the plane.
hu: A ferdeség korrekciójának első lépése egy [kalibrációs objektum](https://www.thingiverse.com/thing:2563185/files) nyomtatása a korrigálni kívánt sík mentén. Létezik egy másik [kalibrációs objektum](https://www.thingiverse.com/thing:2972743) is, amely egy modell összes síkját tartalmazza. Az objektumot úgy kell tájolni, hogy az A sarok a sík origója felé legyen.
it: Il primo passaggio per correggere l'inclinazione è stampare un [calibration object](https://www.thingiverse.com/thing:2563185/files) lungo il piano che si desidera correggere. C'è anche un [calibration object](https://www.thingiverse.com/thing:2972743) che include tutti i piani in un modello. Vuoi che l'oggetto sia orientato in modo che l'angolo A sia verso l'origine del piano.

source: Make sure that no skew correction is applied during this print. You may do this by either removing the `[skew_correction]` module from printer.cfg or by issuing a `SET_SKEW CLEAR=1` gcode.
hu: Győződjön meg róla, hogy a nyomtatás során nem alkalmaz ferdeségkorrekciót. Ezt úgy teheti meg, hogy vagy eltávolítja a `[skew_correction]` modult a printer.cfg fájlból, vagy kiad egy `SET_SKEW CLEAR=1` parancsot.
it: Assicurarsi che durante questa stampa non venga applicata alcuna correzione dell'inclinazione. Puoi farlo rimuovendo il modulo `[skew_correction]` da printer.cfg o inserendo un gcode `SET_SKEW CLEAR=1`.

source: Take your measurements
hu: Mérje meg
it: Prendi le tue misure

source: The `[skew_correcton]` module requires 3 measurements for each plane you want to correct; the length from Corner A to Corner C, the length from Corner B to Corner D, and the length from Corner A to Corner D. When measuring length AD do not include the flats on the corners that some test objects provide.
hu: A `[skew_correcton]` modul minden egyes korrigálandó síkhoz 3 mérést igényel; az A saroktól a C sarokig terjedő hosszúságot, a B saroktól a D sarokig terjedő hosszúságot és az A saroktól a D sarokig terjedő hosszúságot. Az AD hosszmérésnél ne vedd figyelembe a sarkokon lévő síkokat, amelyeket néhány tesztobjektum mutat.
it: Il modulo `[skew_correcton]` richiede 3 misurazioni per ogni piano che vuoi correggere; la lunghezza dall'angolo A all'angolo C, la lunghezza dall'angolo B all'angolo D e la lunghezza dall'angolo A all'angolo D. Quando si misura la lunghezza AD non includere i piani sugli angoli forniti da alcuni oggetti di prova.

source: Configure your skew
hu: Konfigurálja a ferdeséget
it: Configura la tua inclinazione

source: Make sure `[skew_correction]` is in printer.cfg. You may now use the `SET_SKEW` gcode to configure skew_correcton. For example, if your measured lengths along XY are as follows:
hu: Győződjön meg róla, hogy a `[skew_correction]` szerepel a printer.cfg fájlban. Most már használhatod a `SET_SKEW` G-kódot a skew_correction beállításához. Például, ha az XY mentén mért hosszok a következők:
it: Assicurati che la sezione `[skew_correction]` sia in printer.cfg. Ora puoi usare il gcode `SET_SKEW` per configurare skew_correcton. Ad esempio, se le lunghezze misurate lungo XY sono le seguenti:

source: `SET_SKEW` can be used to configure skew correction for the XY plane.
hu: `SET_SKEW` az XY-sík ferdeségkorrekciójának beállítására használható.
it: `SET_SKEW` può essere utilizzato per configurare la correzione dell'inclinazione per il piano XY.

source: You may also add measurements for XZ and YZ to the gcode:
hu: Az XZ és YZ méréseket is hozzáadhatja a G-kódhoz:
it: Puoi anche aggiungere misure per XZ e YZ al gcode:

source: The `[skew_correction]` module also supports profile management in a manner similar to `[bed_mesh]`. After setting skew using the `SET_SKEW` gcode, you may use the `SKEW_PROFILE` gcode to save it:
hu: A `[skew_correction]` modul a `[bed_mesh]` modulhoz hasonló módon támogatja a profilkezelést is. Miután a `SET_SKEW` G-kóddal beállította a ferdeséget, a `SKEW_PROFILE` G-kóddal elmentheti azt:
it: Il modulo `[skew_correction]` supporta anche la gestione del profilo in un modo simile a `[bed_mesh]`. Dopo aver impostato l'inclinazione usando il gcode `SET_SKEW`, puoi usare il gcode `SKEW_PROFILE` per salvarlo:

source: After this command you will be prompted to issue a `SAVE_CONFIG` gcode to save the profile to persistent storage. If no profile is named `my_skew_profile` then a new profile will be created. If the named profile exists it will be overwritten.
hu: A parancs után a rendszer felszólítja a `SAVE_CONFIG` G-kód kiadását a profil tartós tárolóba történő mentéséhez. Ha nincs `my_skew_profile` nevű profil, akkor egy új profil jön létre. Ha a megnevezett profil létezik, akkor azt felülírja.
it: Dopo questo comando ti verrà chiesto di emettere un gcode `SAVE_CONFIG` per salvare il profilo nella memoria permanente. Se nessun profilo è denominato `my_skew_profile`, verrà creato un nuovo profilo. Se il profilo indicato esiste, verrà sovrascritto.

source: Once you have a saved profile, you may load it:
hu: Ha már van mentett profilja, betöltheti azt:
it: Una volta che hai un profilo salvato, puoi caricarlo:

source: It is also possible to remove an old or out of date profile:
hu: Lehetőség van régi vagy elavult profilok eltávolítására is:
it: È anche possibile rimuovere un profilo vecchio o superato:

source: After removing a profile you will be prompted to issue a `SAVE_CONFIG` to make this change persist.
hu: A profil eltávolítása után a rendszer felszólítja, hogy adjon ki egy `SAVE_CONFIG` parancsot, hogy a módosítás mentésre kerüljön.
it: Dopo aver rimosso un profilo, ti verrà chiesto di emettere un `SAVE_CONFIG` per far sì che questa modifica persista.

source: Verifying your correction
hu: A korrekció ellenőrzése
it: Verifica della tua correzione

source: After skew_correction has been configured you may reprint the calibration part with correction enabled. Use the following gcode to check your skew on each plane. The results should be lower than those reported via `GET_CURRENT_SKEW`.
hu: A skew_correction beállítása után újra kinyomtathatja a kalibrációs részt a korrekció engedélyezésével. A következő G-kóddal ellenőrizheti a ferdeséget minden síkban. Az eredményeknek alacsonyabbaknak kell lenniük, mint a `GET_CURRENT_SKEW` segítségével jelentett eredmények.
it: Dopo aver configurato skew_correction è possibile ristampare la parte di calibrazione con la correzione abilitata. Usa il seguente gcode per controllare la tua inclinazione su ciascun piano. I risultati dovrebbero essere inferiori a quelli riportati tramite `GET_CURRENT_SKEW`.

source: Caveats
hu: Óvintézkedések
it: Avvertenze

source: Due to the nature of skew correction it is recommended to configure skew in your start gcode, after homing and any kind of movement that travels near the edge of the print area such as a purge or nozzle wipe. You may use use the `SET_SKEW` or `SKEW_PROFILE` gcodes to accomplish this. It is also recommended to issue a `SET_SKEW CLEAR=1` in your end gcode.
hu: A ferdeségkorrekció természetéből adódóan ajánlott a ferdeséget az indító G-kódban konfigurálni, a kezdőpont felvétel és minden olyan mozgás után, amely a nyomtatási terület széléhez közelít, mint például a tisztítás vagy a fúvóka törlése. Ehhez használhatod a `SET_SKEW` vagy a `SKEW_PROFILE` G-kódokat. Ajánlott továbbá a `SET_SKEW CLEAR=1` parancs kiadása a befejező G-kódban.
it: A causa della natura della correzione dell'inclinazione, si consiglia di configurare l'inclinazione nel codice g iniziale, dopo l'homing e qualsiasi tipo di movimento che si sposta vicino al bordo dell'area di stampa, come uno spurgo o una pulizia degli ugelli. È possibile utilizzare i codici g "SET_SKEW" o "SKEW_PROFILE" per ottenere ciò. Si consiglia inoltre di emettere un `SET_SKEW CLEAR=1` alla fine del gcode.

source: Keep in mind that it is possible for `[skew_correction]` to generate a correction that moves the tool beyond the printer's boundaries on the X and/or Y axes. It is recommended to arrange parts away from the edges when using `[skew_correction]`.
hu: Ne feledje! Lehetséges, hogy a `[skew_correction]` olyan korrekciót generál, amely a fejet az X és/vagy Y tengelyen a nyomtató határain túlra helyezi. A `[skew_correction]` használatakor ajánlott a nyomtatófejet a szélektől távolabb elhelyezni.
it: Tenere presente che è possibile che `[skew_correction]` generi una correzione che sposti la testa oltre i limiti della stampante sugli assi X e/o Y. Si consiglia di disporre le parti lontano dai bordi quando si utilizza `[skew_correction]`.
