Repository: Klipper3d/klipper-translations
Catalog: locales/*/LC_MESSAGES/Slicers.po
Languages: it, zh_hans

source: This document provides some tips for configuring a "slicer" application for use with Klipper. Common slicers used with Klipper are Slic3r, Cura, Simplify3D, etc.
it: Questo documento fornisce alcuni suggerimenti per configurare un'applicazione "slicer" da usare con Klipper. Gli slicer comuni usati con Klipper sono Slic3r, Cura, Simplify3D, ecc.
zh_hans: 本文档提供了与 Klipper 一起使用的一些切片软件配置技巧。 Klipper 常用的切片软件有 Slic3r、Cura、Simplify3D 等。

source: Set the G-Code flavor to Marlin
it: Imposta il Gcode su variante Marlin
zh_hans: 将 G-Code 风格设置为 Marlin

source: Many slicers have an option to configure the "G-Code flavor". The default is frequently "Marlin" and that works well with Klipper. The "Smoothieware" setting also works well with Klipper.
it: Molti slicer hanno un'opzione per configurare il "gusto G-Code" o G-Code flavor. L'impostazione predefinita è spesso "Marlin" e funziona bene con Klipper. L'impostazione "Smoothieware" funziona bene anche con Klipper.
zh_hans: 很多切片软件可以设置“G代码风格”选项。Klipper支持通常默认的“Marlin”；Klipper 也兼容“Smoothieware”风格。

source: Slicers will often allow one to configure "Start G-Code" and "End G-Code" sequences. It is often convenient to define custom macros in the Klipper config file instead - such as: `[gcode_macro START_PRINT]` and `[gcode_macro END_PRINT]`. Then one can just run START_PRINT and END_PRINT in the slicer's configuration. Defining these actions in the Klipper configuration may make it easier to tweak the printer's start and end steps as changes do not require re-slicing.
it: Gli slicer spesso consentono di configurare le sequenze "Start G-Code" e "End G-Code". Spesso è invece conveniente definire macro personalizzate nel file di configurazione di Klipper, come ad esempio: `[gcode_macro START_PRINT]` e `[gcode_macro END_PRINT]`. Quindi puoi semplicemente eseguire START_PRINT e END_PRINT nella configurazione dello slicer. La definizione di queste azioni nella configurazione di Klipper può rendere più semplice modificare i passaggi iniziali e finali della stampante poiché le modifiche non richiedono il re-slicing.
zh_hans: 切片软件通常可以配置一个"开始G代码 "(Start G-Code)和 "结束G代码 "(End G-Code)序列。但在 Klipper 配置文件中定义自定义宏通常更简便，例如：`[gcode_macro START_PRINT]` 和 `[gcode_macro END_PRINT]` 。然后就可以在切片软件的配置中使用 START_PRINT 和 END_PRINT 。在 Klipper 的配置中定义这些动作可能会简化打印机的开始和结束步骤的配置，因为修改不需要重新切片。

source: See [sample-macros.cfg](../config/sample-macros.cfg) for example START_PRINT and END_PRINT macros.
it: Vedere [sample-macros.cfg](../config/sample-macros.cfg) ad esempio le macro START_PRINT e END_PRINT.
zh_hans: 参见[sample-macros.cfg](../config/sample-macros.cfg)中的示例 START_PRINT 和END_PRINT 宏。

source: See the [config reference](Config_Reference.md#gcode_macro) for details on defining a gcode_macro.
it: Vedere il [config reference](Config_Reference.md#gcode_macro) per i dettagli sulla definizione di una macro gcode.
zh_hans: 参见[配置参考](Config_Reference.md#gcode_macro)中关于定义 gcode_macro 的细节。

source: Large retraction settings may require tuning Klipper
it: Impostazioni di retrazione di grandi dimensioni potrebbero richiedere la messa a punto di Klipper
zh_hans: 大的回抽值可能意味着需要调优 Klipper

source: The maximum speed and acceleration of retraction moves are controlled in Klipper by the `max_extrude_only_velocity` and `max_extrude_only_accel` config settings. These settings have a default value that should work well on many printers. However, if one has configured a large retraction in the slicer (eg, 5mm or greater) then one may find they limit the desired speed of retractions.
it: La velocità massima e l'accelerazione dei movimenti di ritrazione sono controllate in Klipper dalle impostazioni di configurazione `max_extrude_only_velocity` e `max_extrude_only_accel`. Queste impostazioni hanno un valore predefinito che dovrebbe funzionare bene su molte stampanti. Tuttavia, se si è configurata una grande retrazione nello slicer (ad es. 5 mm o superiore), è possibile che limitino la velocità di retrazione desiderata.
zh_hans: 在Klipper中，回抽的最大速度和加速度由 `max_extrude_only_velocity` 和 `max_extrude_only_accel` 参数控制。在大多数打印机上这些参数的默认值应该能很好地工作。然而，如果切片软件中配置了一个大的回抽值(例如，5毫米或更大)，可能会发现期望的回抽速度受到了限制。

source: If using a large retraction, consider tuning Klipper's [pressure advance](Pressure_Advance.md) instead. Otherwise, if one finds the toolhead seems to "pause" during retraction and priming, then consider explicitly defining `max_extrude_only_velocity` and `max_extrude_only_accel` in the Klipper config file.
it: Se si utilizza una grande retrazione, prendere in considerazione l'ottimizzazione di [pressure advance](Pressure_Advance.md) di Klipper. Altrimenti, se si scopre che la testa di stampa sembra "mettersi in pausa" durante la retrazione e il priming, allora considerare di definire esplicitamente `max_extrude_only_velocity` e `max_extrude_only_accel` nel file di configurazione di Klipper.
zh_hans: 如果你正在使用一个大的回抽值，考虑调优 Klipper 的[提前压力](Pressure_Advance.md)来代替。否则你可能会发现打印头在回抽和启动时暂停，此时可以考虑在 Klipper 配置文件中设置`max_extrude_only_velocity`和`max_extrude_only_accel`参数来解决这个问题。

source: Do not enable "coasting"
it: Non abilitare "coasting" -costeggiando-
zh_hans: 不要启用“滑行(coasting)”

source: The "coasting" feature is likely to result in poor quality prints with Klipper. Consider using Klipper's [pressure advance](Pressure_Advance.md) instead.
it: È probabile che la funzione "coasting" si traduca in stampe di scarsa qualità con Klipper. Prendi in considerazione l'utilizzo di [pressure advance](Pressure_Advance.md) di Klipper.
zh_hans: 和Klipper 一起使用“滑行(coasting)”功能可能会导致打印质量不佳。考虑使用 Klipper 的[提前压力](Pressure_Advance.md)功能替代。

source: Specifically, if the slicer dramatically changes the extrusion rate between moves then Klipper will perform deceleration and acceleration between moves. This is likely to make blobbing worse, not better.
it: In particolare, se lo slicer cambia drasticamente la velocità di estrusione tra i movimenti, Klipper eseguirà la decelerazione e l'accelerazione tra i movimenti. È probabile che questo renda il blobbing peggiore, non migliore.
zh_hans: 具体来说，如果切片软件在移动之间大幅改变挤出率，那么 Klipper 将在移动之间进行减速和加速。这更可能会造成更多的挤出颗粒(blobbing)，而不是更少。

source: In contrast, it is okay (and often helpful) to use a slicer's "retract" setting, "wipe" setting, and/or "wipe on retract" setting.
it: Al contrario, va bene (e spesso utile) utilizzare l'impostazione ritiro "retract" , l'impostazione pulire "wipe" e/o l'impostazione pulire alla retrazione "wipe on retract".
zh_hans: 相反，使用切片软件的"回抽"、"擦拭 "和/或 "缩回时擦拭 "设置通常是有益的。

source: Do not use "extra restart distance" on Simplify3d
it: Non utilizzare la "distanza di riavvio extra"- "extra restart distance"su Simplify3d
zh_hans: 不要在 Simplify3d 上使用“额外重启距离(extra restart distance)”

source: This setting can cause dramatic changes to extrusion rates which can trigger Klipper's maximum extrusion cross-section check. Consider using Klipper's [pressure advance](Pressure_Advance.md) or the regular Simplify3d retract setting instead.
it: Questa impostazione può causare cambiamenti radicali alle velocità di estrusione che possono attivare il controllo della sezione trasversale di estrusione massima di Klipper. Prendi in considerazione l'utilizzo dell'[pressure advance](Pressure_Advance.md) di Klipper o della normale impostazione di retrazione Simplify3d.
zh_hans: 这个设置会导致挤出速度的剧烈变化，从而触发 Klipper 的最大挤出截面检查。考虑使用 Klipper 的[提前](Pressure_Advance.md)或 Simplify3d 的常规回抽设置来代替。

source: Disable "PreloadVE" on KISSlicer
it: Disabilita "PreloadVE" su KISSlicer
zh_hans: 在 KISSlicer 上禁用“PreloadVE”

source: If using KISSlicer slicing software then set "PreloadVE" to zero. Consider using Klipper's [pressure advance](Pressure_Advance.md) instead.
it: Se si utilizza il software di slicing KISSlicer, impostare "PreloadVE" su zero. Prendi in considerazione l'utilizzo di [pressure advance](Pressure_Advance.md) di Klipper.
zh_hans: 如果使用 KISSlicer 切片软件，那么需要把 "PreloadVE "设为0并考虑使用Klipper的[提前压力](Pressure_Advance.md)代替。

source: Disable any "advanced extruder pressure" settings
it: Disattiva le impostazioni di "pressione dell'estrusore avanzata"-"advanced extruder pressure"
zh_hans: 禁用任何"提前挤出压力"的设置

source: Some slicers advertise an "advanced extruder pressure" capability. It is recommended to keep these options disabled when using Klipper as they are likely to result in poor quality prints. Consider using Klipper's [pressure advance](Pressure_Advance.md) instead.
it: Alcune affettatrici pubblicizzano una capacità di "pressione dell'estrusore avanzata" - "advanced extruder pressure". Si consiglia di mantenere queste opzioni disabilitate quando si utilizza Klipper poiché è probabile che si traducano in stampe di scarsa qualità. Prendi in considerazione l'utilizzo di [pressure advance](Pressure_Advance.md) di Klipper.
zh_hans: 一些切片软件宣传有 "高级挤出机压力调整 "的功能。建议在使用 Klipper 时禁用这些功能，因为它们很可能会降低打印质量。考虑使用 Klipper 的[压力提前](Pressure_Advance.md)代替。

source: Specifically, these slicer settings can instruct the firmware to make wild changes to the extrusion rate in the hope that the firmware will approximate those requests and the printer will roughly obtain a desirable extruder pressure. Klipper, however, utilizes precise kinematic calculations and timing. When Klipper is commanded to make significant changes to the extrusion rate it will plan out the corresponding changes to velocity, acceleration, and extruder movement - which is not the slicer's intent. The slicer may even command excessive extrusion rates to the point that it triggers Klipper's maximum extrusion cross-section check.
it: In particolare, queste impostazioni dello slicer possono indicare al firmware di apportare modifiche alla velocità di estrusione nella speranza che il firmware si avvicini a tali richieste e che la stampante ottenga approssimativamente una pressione dell'estrusore desiderabile. Klipper, tuttavia, utilizza calcoli cinematici e tempi precisi. Quando a Klipper viene comandato di apportare modifiche significative alla velocità di estrusione, pianificherà le modifiche corrispondenti a velocità, accelerazione e movimento dell'estrusore, il che non è l'intento dello slicer. Lo slicer può anche comandare velocità di estrusione eccessive al punto da attivare il controllo della sezione trasversale di estrusione massima di Klipper.
zh_hans: 具体来说，这些切片软件的设置生成的命令会固件对挤出率进行剧烈的改变，希望固件能接近这些请求值，使打印机获得一个大致理想的挤出机压力。然而，Klipper利用精确的运动学计算和计时。当Klipper被命令对挤出率进行重大改变时，它将计划出速度、加速度和挤出机运动的相应变化--这不是切片软件的意图。切片软件甚至可能产生过大的挤出速度，以至于触发Klipper的最大挤出截面检查。

source: Slicers
it: slicer
zh_hans: 切片软件

source: START_PRINT macros
it: Macro START_PRINT
zh_hans: START_PRINT宏

source: When using a START_PRINT macro or similar, it is useful to sometimes pass through parameters from the slicer variables to the macro.
it: Quando si utilizza una macro START_PRINT o simile, a volte è utile passare i parametri dalle variabili dello slicer alla macro.
zh_hans: 当使用START_PRINT宏或类似的宏时，也可以将切片变量的参数传递给宏。

source: In Cura, to pass through temperatures, the following start gcode would be used:
it: In Cura, per passare le temperature, verrebbe utilizzato il seguente gcode iniziale:
zh_hans: 在 Cura 中，要传递温度参数，使用以下开始G代码：

source: In slic3r derivatives such as PrusaSlicer and SuperSlicer, the following would be used:
it: Nei derivati di slic3r come PrusaSlicer e SuperSlicer, verrebbe utilizzato quanto segue:
zh_hans: 在PrusaSlicer和SuperSlicer等sli3er衍生版本中，使用以下G代码：

source: Also note that these slicers will insert their own heating codes when certain conditions are not met. In Cura, the existence of the `{material_bed_temperature_layer_0}` and `{material_print_temperature_layer_0}` variables is enough to mitigate this. In slic3r derivatives, you would use:
it: Si noti inoltre che questeislicer inseriranno i propri codici di riscaldamento quando determinate condizioni non vengono soddisfatte. In Cura, l'esistenza delle variabili `{material_bed_temperature_layer_0}` e `{material_print_temperature_layer_0}` è sufficiente per mitigare questo problema. Nei derivati slic3r, dovresti usare:
zh_hans: 还要注意，当某些条件不满足时，这些切片软件会插入自己的加热代码。在Cura中，存在`{material_bed_temperature_layer_0}`和`{material_print_temperature_layer_0}`这两个变量就足够了。在slic3r衍生品中，你需要使用：

source: before the macro call. Also note that SuperSlicer has a "custom gcode only" button option, which achieves the same outcome.
it: prima della chiamata della macro. Tieni inoltre presente che SuperSlicer ha un'opzione del pulsante "solo gcode personalizzato", che ottiene lo stesso risultato.
zh_hans: 在宏调用之前。还要注意的是，SuperSlicer有一个 "仅包含定制G代码"的按钮选项，可以达到同样的效果。

source: An example of a START_PRINT macro using these paramaters can be found in config/sample-macros.cfg
it: Un esempio di una macro START_PRINT che utilizza questi parametri può essere trovato in config/sample-macros.cfg
zh_hans: 在config/sample-macros.cfg中可以找到一个使用这些参数的START_PRINT宏的例子
