Repository: Klipper3d/klipper-translations
Catalog: locales/*/LC_MESSAGES/TMC_Drivers.po
Languages: es, hu, it

source: This document provides information on using Trinamic stepper motor drivers in SPI/UART mode on Klipper.
es: Este documento provee información para utilizar el controlador de Trinamic para motor de paso a paso en modo SPI/UART en Klipper.
hu: Ez a dokumentum a Trinamic léptetőmotor-meghajtók SPI/UART üzemmódban történő Klipper-ben való használatáról nyújt információt.
it: Questo documento fornisce informazioni sull'utilizzo dei driver Trinamic per motori stepper in modalità SPI/UART su Klipper.

source: Klipper can also use Trinamic drivers in their "standalone mode". However, when the drivers are in this mode, no special Klipper configuration is needed and the advanced Klipper features discussed in this document are not available.
es: Klipper también puede usar controladores Trinamic en su "modo independiente" (“standalone-mode” en inglés). Sin embargo, cuando los controladores están en este modo, Klipper no necesita una configuración especial y las funciones avanzadas de Klipper exploradas en este documento no están disponibles.
hu: A Klipper a Trinamic motorvezérlőket is tudja használni "standalone módban". Ha azonban a motorvezérlők ebben az üzemmódban vannak, nincs szükség speciális Klipper konfigurációra, és az ebben a dokumentumban tárgyalt fejlett Klipper funkciók nem állnak rendelkezésre.
it: Klipper può anche utilizzare i driver Trinamic nella loro "modalità standalone". Tuttavia, quando i driver sono in questa modalità, non è necessaria alcuna configurazione speciale di Klipper e le funzionalità avanzate di Klipper discusse in questo documento non sono disponibili.

source: In addition to this document, be sure to review the [TMC driver config reference](Config_Reference.md#tmc-stepper-driver-configuration).
es: Además de este documento, asegúrese de revisar la [referencia de configuración del controlador TMC](Config_Reference.md#tmc-stepper-driver-configuration).
hu: Ezen a dokumentumon kívül feltétlenül tekintse át a [TMC motorvezérlő-konfigurációs hivatkozást](Config_Reference.md#tmc-stepper-driver-configuration).
it: Oltre a questo documento, assicurati di rivedere il [riferimento alla configurazione del driver TMC](Config_Reference.md#tmc-stepper-driver-configuration).

source: Sensorless Homing
es: Proceso de localización de la boquilla sin sensor
hu: Érzékelő nélküli kezdőpont
it: Homing Sensorless

source: Sensorless homing allows to home an axis without the need for a physical limit switch. Instead, the carriage on the axis is moved into the mechanical limit making the stepper motor lose steps. The stepper driver senses the lost steps and indicates this to the controlling MCU (Klipper) by toggling a pin. This information can be used by Klipper as end stop for the axis.
es: El proceso de localización de la boquilla sin sensor ("Sensorless Homing" en inglés) permite determinar el punto donde la boquilla de la impresora se encuentra en un eje sin la necesidad de un interruptor de límite físico. En su lugar, el carruaje en el eje se mueve hacia el límite mecánico haciendo que el motor paso a paso pierda pasos. El controlador del motor paso a paso detecta los pasos perdidos y alterna un pin para indicar la perdida al microcontrolador (“MCU”) dominante (Klipper). Klipper puede utilizar esta información como el punto de parada final para el eje.
hu: Az érzékelő nélküli kezdőpont felvétel lehetővé teszi a tengely kezdőpont felvételét fizikai végálláskapcsoló nélkül. Ehelyett a tengelyen lévő kocsit a mechanikus végállásba mozgatja, így a léptetőmotor lépéseket veszít. A léptető meghajtó érzékeli az elveszett lépéseket, és ezt egy tű csatlakozáson jelzi a vezérlő MCU-nak (Klipper). Ezt az információt a Klipper a tengely végállásaként használhatja.
it: L'homing senza sensori consente di posizionare un asse senza la necessità di un finecorsa fisico. Invece, il carrello sull'asse viene spostato nel finecorsa meccanico facendo perdere passi al motore passo-passo. Il driver stepper rileva i passi persi e lo indica all'MCU di controllo (Klipper) attivando un pin. Queste informazioni possono essere utilizzate da Klipper come fine corsa per l'asse.

source: This guide covers the setup of sensorless homing for the X axis of your (cartesian) printer. However, it works the same with all other axes (that require an end stop). You should configure and tune it for one axis at a time.
es: Esta guía cubre la configuración del proceso de localización de la boquilla sin sensor para el eje X de su impresora (cartesiana). Sin embargo, funciona igual con todos los demás ejes (que requieren parada final). Debe configurarlo y afinarlo para un eje a la vez.
hu: Ez az útmutató az érzékelő nélküli kezdőpont fevétel beállítását mutatja be a (cartesian) nyomtató X tengelyére. Ez azonban ugyanígy működik az összes többi tengely esetében is (amelyek végállást igényelnek). Egyszerre csak egy tengelyre kell beállítani és hangolni.
it: Questa guida illustra l'impostazione dell'homing sensorless per l'asse X della stampante (cartesiana). Tuttavia, funziona allo stesso modo con tutti gli altri assi (che richiedono un fine corsa). Dovresti configurarlo e sintonizzarlo per un asse alla volta.

source: Limitations
es: Limitaciones
hu: Korlátozások
it: Limitazioni

source: Be sure that your mechanical components are able to handle the load of the carriage bumping into the limit of the axis repeatedly. Especially leadscrews might generate a lot of force. Homing a Z axis by bumping the nozzle into the printing surface might not be a good idea. For best results, verify that the axis carriage will make a firm contact with the axis limit.
es: Asegúrese de que sus componentes mecánicos sean capaces de manejar la carga del carruaje chocando contra el límite del eje repetidamente. Especialmente los husillos pues podrían generar mucha fuerza. Posicionar un eje Z golpeando la boquilla contra la superficie de impresión puede que no sea una buena idea. Para obtener los mejores resultados, verifique que el carruaje del eje va hacer un contacto firme con el límite del eje.
hu: Győződjön meg arról, hogy a mechanikus alkatrészek képesek kezelni a tengely határértékének ismételt ütközéséből eredő terhelést. Különösen a szíjak nagy erőt fejthetnek ki. A Z tengelynek a fúvókával az ágyba való ütközéssel történő szintezése nem biztos, hogy jó ötlet. A legjobb eredmény érdekében ellenőrizze, hogy a tengelyen lévő kocsi szilárdan érintkezik-e a tengelyhatárral.
it: Assicurati che i tuoi componenti meccanici siano in grado di sopportare il carico del carrello che urta ripetutamente il limite dell'asse. Soprattutto le viti di comando potrebbero generare molta forza. L'homing di un asse Z facendo urtare l'ugello sulla superficie di stampa potrebbe non essere una buona idea. Per ottenere i migliori risultati, verificare che il carrello dell'asse stabilisca un contatto stabile con il limite dell'asse.

source: Further, sensorless homing might not be accurate enough for your printer. While homing X and Y axes on a cartesian machine can work well, homing the Z axis is generally not accurate enough and may result in an inconsistent first layer height. Homing a delta printer sensorless is not advisable due to missing accuracy.
es: Además, es posible que el proceso de localización de la boquilla sin sensor no sea lo suficientemente preciso para su impresora. Mientras el proceso de localización de la boquilla de los ejes X e Y en una máquina cartesiana puede funcionar bien, el mismo proceso en el eje Z generalmente no es lo suficientemente preciso y puede resultar en que la primera capa tenga una altura inconsistente. No es aconsejable completar el proceso de localización de la boquilla sin un sensor en una impresora delta debido a la falta de precisión.
hu: Továbbá, az érzékelő nélküli kezdőpont felvétel nem biztos, hogy elég pontos az Ön nyomtatója számára. Míg az X és Y tengelyek kezdőpont felvétele egy cartesian gépen jól működhet, a Z tengely kezdőpont felvétele általában nem elég pontos, és következetlen első rétegmagasságot eredményezhet. A delta nyomtató érzékelő nélküli kezdőpont felvétele a pontatlanság miatt nem tanácsos.
it: Inoltre, l'homing sensorless potrebbe non essere sufficientemente preciso per la tua stampante. Sebbene l'homing degli assi X e Y su una macchina cartesiana possa funzionare bene, l'homing dell'asse Z in genere non è sufficientemente preciso e può comportare un'altezza del primo strato incoerente. L'homing di una stampante delta sensorless non è consigliabile a causa della mancanza di precisione.

source: Further, the stall detection of the stepper driver is dependent on the mechanical load on the motor, the motor current and the motor temperature (coil resistance).
es: Además, la habilidad de detectar cuando el motor se detiene (“stall detection” en inglés) que se encuentra en el controlador del motor paso a paso depende de la carga mecánica en el motor, la corriente del motor y la temperatura del motor (resistencia de la bobina).
hu: Továbbá a léptető meghajtó elakadásérzékelése a motor mechanikai terhelésétől, a motoráramtól és a motor hőmérsékletétől (tekercsellenállástól) is függ.
it: Inoltre, il rilevamento dello stallo del driver passo-passo dipende dal carico meccanico sul motore, dalla corrente del motore e dalla temperatura del motore (resistenza della bobina).

source: Sensorless homing works best at medium motor speeds. For very slow speeds (less than 10 RPM) the motor does not generate significant back EMF and the TMC cannot reliably detect motor stalls. Further, at very high speeds, the back EMF of the motor approaches the supply voltage of the motor, so the TMC cannot detect stalls anymore. It is advised to have a look in the datasheet of your specific TMCs. There you can also find more details on limitations of this setup.
es: El proceso de retorno a casa sin sensor funciona mejor a velocidades de "motor medias. Para velocidades bien bajas (menos de 10 r.p.m.) el motor no genera suficiente fuerza contraelectromotriz (CEMF por sus siglas en inglés) y el controlador (“TMC” por sus siglas en inglés) no puede detectar con confiabilidad cuando el motor se detiene. Además, a velocidades muy altas, el CEMF del motor se acerca al voltaje de alimentación del motor, así es que el TMC ya no puede detectar los paros del motor. Se recomienda que revise la hoja de datos de su TMC específico. Allí también encontrará mas detalles sobre las limitaciones de esta configuración.
hu: Az érzékelő nélküli kezdőpont felvétel közepes motorsebességnél működik a legjobban. Nagyon lassú fordulatszámoknál (kevesebb mint 10 fordulat/perc) a motor nem termel jelentős ellenáramot, és a TMC nem képes megbízhatóan érzékelni a motor leállását. Továbbá, nagyon nagy fordulatszámon a motor ellen-EMF-je megközelíti a motor tápfeszültségét, így a TMC már nem képes érzékelni a leállást. Javasoljuk, hogy tekintse meg az adott TMC-k adatlapját. Ott további részleteket is találhat ennek a beállításnak a korlátairól.
it: L'homing sensorless funziona meglio a velocità medie del motore. Per velocità molto basse (inferiori a 10 giri/min) il motore non genera una significativa EMF di ritorno e il TMC non è in grado di rilevare in modo affidabile gli stalli del motore. Inoltre, a velocità molto elevate, l'EMF di ritorno del motore si avvicina alla tensione di alimentazione del motore, quindi il TMC non è più in grado di rilevare gli stalli. Si consiglia di dare un'occhiata alla scheda tecnica del proprio TMC specifico. Lì puoi anche trovare maggiori dettagli sulle limitazioni di questa configurazione.

source: Prerequisites
es: Prerequisitos
hu: Előfeltételek
it: Prerequisiti

source: A few prerequisites are needed to use sensorless homing:
es: Se necesitan algunos prerequisitos para utilizar le proceso de localización de la boquilla sin sensor:
hu: Néhány előfeltétel szükséges az érzékelő nélküli kezdőpont felvétel használatához:
it: Sono necessari alcuni prerequisiti per utilizzare l'homing sensorless:

source: SPI / UART interface of the TMC driver wired to micro-controller (stand-alone mode does not work).
es: El interfaz SPI / UART del controlador TMC conectado al microcontrolador (el modo autónomo no funciona).
hu: A TMC-motorvezérlő SPI/UART interfésze mikrokontrollerrel összekötve (a stand-alone üzemmód nem működik).
it: Interfaccia SPI/UART del driver TMC cablata al microcontrollore (la modalità stand-alone non funziona).

source: The appropriate "DIAG" or "SG_TST" pin of TMC driver connected to the micro-controller.
es: El pin “DIAG” o “SG_TST” apropiado del controlador TMC conectado al microcontrolador.
hu: A TMC motorvezérlő megfelelő "DIAG" vagy "SG_TST" tűje a mikrovezérlőhöz csatlakoztatva.
it: Il pin "DIAG" o "SG_TST" appropriato del driver TMC collegato al microcontrollore.

source: The steps in the [config checks](Config_checks.md) document must be run to confirm the stepper motors are configured and working properly.
es: Los pasos en el documento [comprobaciones de configuración](Config_checks.md) tienen que ejecutarse para confirmar que los motores paso a paso están configurados y funcionando correctamente.
hu: A [konfiguráció ellenőrzések](Config_checks.md) dokumentumban szereplő lépéseket kell lefuttatni annak megerősítésére, hogy a léptetőmotorok megfelelően vannak konfigurálva és működnek.
it: I passaggi nel documento [config checks](Config_checks.md) devono essere eseguiti per confermare che i motori passo-passo siano configurati e funzionino correttamente.

source: Tuning
es: Afinamiento
hu: Hangolás
it: Messa a punto

source: The procedure described here has six major steps:
es: El procedimiento descrito aquí tiene seis pasos principales:
hu: Az itt leírt eljárás hat fő lépésből áll:
it: La procedura qui descritta prevede sei passaggi principali:

source: Choose a homing speed.
es: Escoja una velocidad para el proceso de localización de la boquilla.
hu: Válassza ki a kezdőpont felvételi sebességet.
it: Scegli una velocità di homing.

source: Configure the `printer.cfg` file to enable sensorless homing.
es: Configure el archivo `printer.cfg` para habilitar el proceso de localización de la boquilla sin sensor.
hu: Konfigurálja a `printer.cfg` fájlt, hogy engedélyezze az érzékelő nélküli kezdőpont felvételt.
it: Configura il file `printer.cfg` per abilitare l'homing sensorless.

source: Find the stallguard setting with highest sensitivity that successfully homes.
es: Encuentre el ajuste del “stallguard” con la mayor sensibilidad que complete el proceso de localización de la boquilla con éxito.
hu: Keresse meg a legnagyobb érzékenységű StallGuard beállítást, amely sikeresen felveszi a kezdőpontot.
it: Trova l'impostazione stallguard con la massima sensibilità che funziona con successo.

source: Find the stallguard setting with lowest sensitivity that successfully homes with a single touch.
es: Encuentre el ajuste del “stallguard” con la menor sensibilidad que complete el proceso de localización de la boquilla con un solo toque.
hu: Keresse meg a legalacsonyabb érzékenységű StallGuard-beállítást, amely egyetlen érintéssel sikeres megállást jelez.
it: Trova l'impostazione stallguard con la sensibilità più bassa che effettua homing con successo con un solo tocco.

source: Update the `printer.cfg` with the desired stallguard setting.
es: Actualice `printer.cfg` con la configuración de “stallguard” deseada.
hu: Frissítse a `printer.cfg` állományt a kívánt StallGuard beállítással.
it: Aggiorna il `printer.cfg` con l'impostazione di stallguard desiderata.

source: Create or update `printer.cfg` macros to home consistently.
es: Cree o actualice los macros de `printer.cfg` para completar el proceso de localización de la boquilla de forma consistente.
hu: Hozzon létre vagy frissítse a `printer.cfg` makrókat, hogy kéznél legyenek.
it: Crea o aggiorna le macro `printer.cfg` per homing in modo coerente.

source: Choose homing speed
es: Escoja una velocidad para el proceso de localización de la boquilla
hu: Válassza ki a kezdőpont felvételi sebességet
it: Scegli la velocità di homing

source: The homing speed is an important choice when performing sensorless homing. It's desirable to use a slow homing speed so that the carriage does not exert excessive force on the frame when making contact with the end of the rail. However, the TMC drivers can't reliably detect a stall at very slow speeds.
es: La velocidad del proceso de localización de la boquilla sin sensor es una elección importante cuando se va a ejecutar el proceso. Completar el proceso a baja velocidad es preferible para evitar que el carruaje ejerza una fuerza excesiva en el armazón cuando haga contacto con el extremo del riel. Sin embargo, a bajas velocidades, los controladores TMC no pueden detectar de forma fiable cuando el motor se detiene.
hu: A kezdőpont felvételi sebesség fontos választás az érzékelő nélküli kezdőpont felvétel során. Ajánlott lassú állítási sebességet használni, hogy a kocsi ne gyakoroljon túlzott erőt a keretre, amikor a sín végével érintkezik. A TMC motorvezérlők azonban nagyon lassú sebességeknél nem képesek megbízhatóan érzékelni az elakadást.
it: La velocità di homing è una scelta importante quando si esegue l'homing senza sensori. È consigliabile utilizzare una velocità di riferimento bassa in modo che il carrello non eserciti una forza eccessiva sul telaio quando entra in contatto con l'estremità della rotaia. Tuttavia, i driver TMC non sono in grado di rilevare in modo affidabile uno stallo a velocità molto basse.

source: A good starting point for the homing speed is for the stepper motor to make a full rotation every two seconds. For many axes this will be the `rotation_distance` divided by two. For example:
es: Un buen punto de partida para la velocidad del proceso de localización de la boquilla es que el motor paso a paso complete una rotación cada dos segundos. Para muchos ejes esta será la ‘distancia de rotación’ (`rotation_distance` en inglés) dividida por dos. Por ejemplo:
hu: Az indítási sebességnek jó kiindulópontja az, hogy a léptetőmotor két másodpercenként egy teljes fordulatot végezzen. Sok tengely esetében ez a `rotation_distance` osztva kettővel. Például:
it: Un buon punto di partenza per la velocità di homing è che il motore passo-passo esegua una rotazione completa ogni due secondi. Per molti assi questa sarà la `rotation_distance` divisa per due. Per esempio:

source: Configure printer.cfg for sensorless homing
es: Configure printer.cfg para el proceso de localización de la boquilla sin sensor
hu: A printer.cfg beállítása érzékelő nélküli kezdőpont felvételhez
it: Configura printer.cfg per l'homing sensorless

source: The `homing_retract_dist` setting must be set to zero in the `stepper_x` config section to disable the second homing move. The second homing attempt does not add value when using sensorless homing, it will not work reliably, and it will confuse the tuning process.
es: El ajuste `homing_retract_dist` debe inicializarse a cero en la sección de configuración `stepper_x` para desactivar el segundo movimiento del proceso de localización de la boquilla. El segundo intento del proceso no añade valor cuando se usa el proceso de localización de la boquilla sin sensor, pues no trabajará de forma fiable y confundirá el proceso de afinamiento.
hu: A `homing_retract_dist` beállítást nullára kell állítani a `stepper_x` config szakaszban a második kezdőpont felvételi mozdulat letiltásához. A második kezdőpont felvételi kísérlet nem ad hozzáadott értéket az érzékelő nélküli kezdőpont felvételhez, nem fog megbízhatóan működni, és összezavarja a hangolási folyamatot.
it: L'impostazione `homing_retract_dist` deve essere impostata su zero nella sezione di configurazione `stepper_x` per disabilitare il secondo movimento di homing. Il secondo tentativo di homing non aggiunge valore quando si utilizza l'homing sensorless, non funzionerà in modo affidabile e confonderà il processo di ottimizzazione.

source: Be sure that a `hold_current` setting is not specified in the TMC driver section of the config. (If a hold_current is set then after contact is made, the motor stops while the carriage is pressed against the end of the rail, and reducing the current while in that position may cause the carriage to move - that results in poor performance and will confuse the tuning process.)
es: Asegúrese de que el ajuste `hold_current` no está especificado en la sección del controlador TMC de la configuración. (Si `hold_current` está inicializado, entonces después de hacer contacto, el motor se detendrá mientras el carruaje está presionado contra el extremo del riel y una reducción de corriente mientras está en esa posición puede hacer que el carruaje se mueva, lo que resultaría en un rendimiento deficiente y confundiría el proceso de afinamiento).
hu: Győződjön meg róla, hogy a konfiguráció TMC motorvezérlő részlegében nincs megadva `hold_current` beállítás. (Ha hold_current használatban van, akkor a kapcsolat létrejötte után a motor megáll, miközben a kocsi a sín végéhez van nyomva, és az áram csökkentése ebben a helyzetben a kocsi mozgását okozhatja. Ez rossz teljesítményt eredményez, és összezavarja a hangolási folyamatot.)
it: Assicurati che un'impostazione `hold_current` non sia specificata nella sezione del driver TMC del file config. (Se viene impostata una hold_current, dopo che è stato stabilito il contatto, il motore si arresta mentre il carrello viene premuto contro l'estremità del binario e la riduzione della corrente mentre si trova in quella posizione può causare il movimento del carrello, il che si traduce in prestazioni scadenti e confonde il processo di regolazione.)

source: It is necessary to configure the sensorless homing pins and to configure initial "stallguard" settings. A tmc2209 example configuration for an X axis might look like:
es: Es necesario configurar los pines del proceso de localización de la boquilla sin sensor y configurar los ajustes iniciales de "stallguard". Aquí sigue un ejemplo de como la configuración de un tmc2209 para el eje X podría ser:
hu: Szükséges a szenzor nélküli kezdőpont felvételi tűk konfigurálása és a kezdeti "StallGuard" beállítások konfigurálása. Egy TMC2209 példakonfiguráció egy X tengelyhez így nézhet ki:
it: È necessario configurare i pin di homing sensorless e configurare le impostazioni iniziali di "stallguard". Una configurazione di esempio tmc2209 per un asse X potrebbe essere simile a:

source: An example tmc2130 or tmc5160 config might look like:
es: El siguiente ejemplo demuestra una posible configuración para el tmc2130 o el tmc5160:
hu: Egy TMC2130 vagy TMC5160 konfiguráció például így nézhet ki:
it: Un esempio di configurazione tmc2130 o tmc5160 potrebbe essere simile a:

source: An example tmc2660 config might look like:
es: Aquí sigue un ejemplo de como se podría configurar el tmc2660:
hu: Egy TMC2660 konfiguráció így nézhet ki:
it: Un esempio di configurazione di tmc2660 potrebbe essere simile a:

source: The examples above only show settings specific to sensorless homing. See the [config reference](Config_Reference.md#tmc-stepper-driver-configuration) for all the available options.
es: Los ejemplos anteriores solo muestran configuraciones específicas para la localización de la boquilla sin sensor. Consulte la [referencia de configuración] (Config_Reference.md#tmc-stepper-driver-configuration) para conocer todas las opciones disponibles.
hu: A fenti példák csak az érzékelő nélküli kezdőpont felvételre jellemző beállításokat mutatják. Az összes elérhető beállításért lásd a [konfigurációs referencia](Config_Reference.md#tmc-stepper-driver-configuration) dokumentumot.
it: Gli esempi sopra mostrano solo le impostazioni specifiche per l'homing sensorless. Vedere il [riferimento alla configurazione](Config_Reference.md#tmc-stepper-driver-configuration) per tutte le opzioni disponibili.
