Repository: Klipper3d/klipper-translations
Catalog: locales/*/LC_MESSAGES/TMC_Drivers.po
Languages: es, hu, it

source: Find highest sensitivity that successfully homes
es: Encuentre la configuración de sensibilidad más alta para una localización exitosa
hu: Keresse meg a legmagasabb érzékenységet, amely sikeresen jelzi a kezdőpontot
it: Trova la massima sensibilità che porta a homing con successo

source: Place the carriage near the center of the rail. Use the SET_TMC_FIELD command to set the highest sensitivity. For tmc2209:
es: Coloque el carruaje cerca del centro del riel. Utilice el comando SET_TMC_FIELD para establecer la sensibilidad más alta. Para el tmc2209:
hu: Helyezze a kocsit a sín közepéhez közel. A SET_TMC_FIELD paranccsal állítsa be a legnagyobb érzékenységet. A TMC2209 esetében:
it: Posizionare il carrello vicino al centro del binario. Utilizzare il comando SET_TMC_FIELD per impostare la sensibilità più alta. Per tmc2209:

source: For tmc2130, tmc5160, and tmc2660:
es: Para el tmc2130, el tmc5160, y el tmc2660:
hu: A TMC2130, TMC5160 és a TMC2660 modellekhez:
it: Per tmc2130, tmc5160 e tmc2660:

source: Next, continually decrease the sensitivity of the `VALUE` setting and run the `SET_TMC_FIELD` `G28 X0` commands again to find the highest sensitivity that results in the carriage successfully moving all the way to the endstop and halting. (For tmc2209 drivers this will be decreasing SGTHRS, for other drivers it will be increasing sgt.) Be sure to start each attempt with the carriage near the center of the rail (if needed issue `M84` and then manually move the carriage to the center). It should be possible to find the highest sensitivity that homes reliably (settings with higher sensitivity result in small or no movement). Note the found value as *maximum_sensitivity*. (If the minimum possible sensitivity (SGTHRS=0 or sgt=63) is obtained without any carriage movement then something is not correct with the diag/sg_tst pin wiring or configuration and it must be corrected before continuing.)
es: A continuación, disminuya continuamente la sensibilidad del ajuste `VALUE` y ejecute los comandos `SET_TMC_FIELD` y `G28 X0` nuevamente para encontrar la más alta sensibilidad que resulte en que el carruaje se mueva exitosamente hasta su casa y se detenga. (Para los controladores tmc2209 esto será disminuir SGTHRS, para otros controladores será aumentar sgt.) Asegúrese de empezar cada intento con el carruaje cerca del centro del riel (si es necesario emita `M84` y luego mueva manualmente el carruaje al centro). Debería ser posible encontrar la sensibilidad más alta que localice la boquilla de forma fiable (los ajustes con mayor sensibilidad dan como resultado un movimiento pequeño o nulo). Apunte el valor encontrado como *maximum_sensitivity*. (Si la sensibilidad mínima posible (SGTHRS=0 o sgt =63) se obtiene sin ningún movimiento del carruaje, entonces hay algún error con el cableado o la configuración de los pines diag/sg_tst y debe corregirse antes de continuar).
hu: Ezután folyamatosan csökkentse a `VALUE` beállítás érzékenységét, és futtassa le újra a `SET_TMC_FIELD` `G28 X0` parancsokat, hogy megtalálja a legnagyobb érzékenységet, amely a kocsi sikeres mozgását eredményezi a végállásig és a megállásig. (A TMC2209 motorvezérlők esetében ez az SGTHRS csökkentése, más vezérlők esetében az sgt növelése lesz.) Ügyeljen arra, hogy minden kísérletet úgy kezdjen, hogy a kocsi a sín közepéhez közel legyen (ha szükséges, adjon ki egy `M84` parancsot, majd kézzel mozgassa a kocsit középállásba). Meg kell találni a legnagyobb érzékenységet, amely megbízhatóan jelzi a végállást (a nagyobb érzékenységű beállítások kicsi vagy semmilyen mozgást nem eredményeznek). Jegyezze fel a kapott értéket *maximum_sensitivity* néven. (Ha a lehető legkisebb érzékenységet (SGTHRS=0 vagy sgt=63) kapjuk a kocsi elmozdulása nélkül, akkor valami nincs rendben a diag/sg_tst tűk bekötésével vagy konfigurációjával, és a folytatás előtt ki kell javítani.)
it: Quindi, diminuire progressivamente la sensibilità dell'impostazione `VALUE` ed eseguire nuovamente i comandi `SET_TMC_FIELD` `G28 X0` per trovare la sensibilità più alta che fa sì che il carrello si muova con successo fino all'arresto e si arresti. (Per i driver tmc2209 questo diminuirà SGTHRS, per altri conducenti aumenterà il sgt.) Assicurati di iniziare ogni tentativo con il carrello vicino al centro del binario (se necessario, emetti `M84` e quindi sposta manualmente il carrello sul centro). Dovrebbe essere possibile trovare la sensibilità più alta che si adatta in modo affidabile (le impostazioni con una sensibilità più alta comportano movimenti piccoli o nulli). Nota il valore trovato come *sensibilità_massima*. (Se si ottiene la sensibilità minima possibile (SGTHRS=0 o sgt=63) senza alcun movimento del carrello, allora qualcosa non è corretto con il cablaggio o la configurazione dei pin diag/sg_tst e deve essere corretto prima di continuare.)

source: When searching for maximum_sensitivity, it may be convenient to jump to different VALUE settings (so as to bisect the VALUE parameter). If doing this then be prepared to issue an `M112` command to halt the printer, as a setting with a very low sensitivity may cause the axis to repeatedly "bang" into the end of the rail.
es: Al buscar la sensibilidad_máxima (“maximum_sensitivity” en inglés), puede ser conveniente saltar a un ajuste diferente de VALUE (para dividir en dos el parámetro VALUE). Si hace esto, entonces prepárese para emitir un comando `M112` para detener la impresora, ya que un ajuste con una sensibilidad muy baja puede causar que el eje "golpee" repetidamente contra el extremo del riel.
hu: A maximum_sensitivity keresésekor kényelmes lehet a különböző VALUE beállításokra ugrani (a VALUE paraméter kettéosztása érdekében). Ha ezt tesszük, akkor készüljünk fel arra, hogy a nyomtató leállításához adjunk ki egy `M112` parancsot, mivel egy nagyon alacsony érzékenységű beállítás miatt a tengely többször "beleütközhet" a sín végébe.
it: Quando si cerca la sensibilità_massima, può essere conveniente passare a diverse impostazioni VALUE (in modo da dividere in due il parametro VALUE). In tal caso, prepararsi a emettere un comando `M112` per arrestare la stampante, poiché un'impostazione con una sensibilità molto bassa potrebbe far "sbattere" ripetutamente l'asse contro l'estremità del binario.

source: Be sure to wait a couple of seconds between each homing attempt. After the TMC driver detects a stall it may take a little time for it to clear its internal indicator and be capable of detecting another stall.
es: Asegúrese de esperar un par de segundos entre cada intento del proceso de localización de la boquilla. Después de que el controlador TMC detecta una parada, puede tardar un poco en despejar su indicador interno y ser capaz de detectar otra parada.
hu: Ügyeljen arra, hogy várjon néhány másodpercet minden egyes végállási kísérlet között. Miután a TMC-motorvezérlő érzékeli az elakadást, eltarthat egy kis ideig, amíg a belső visszajelzője törlődik, és képes lesz egy újabb megállást érzékelni.
it: Assicurati di attendere un paio di secondi tra ogni tentativo di homing. Dopo che il driver TMC ha rilevato uno stallo, potrebbe volerci un po' di tempo per cancellare il suo indicatore interno ed essere in grado di rilevare un altro stallo.

source: During these tuning tests, if a `G28 X0` command does not move all the way to the axis limit, then be careful with issuing any regular movement commands (eg, `G1`). Klipper will not have a correct understanding of the carriage position and a move command may cause undesirable and confusing results.
es: Durante estas pruebas de afinamiento, si un comando `G28 X0` no causa que el carruaje se mueva hasta el límite del eje, tenga cuidado al emitir cualquier comando de movimiento regular (por ejemplo, `G1`). Klipper no tendrá una comprensión correcta de la posición del carruaje y un comando de movimiento puede causar resultados indeseables y confusos.
hu: Ha a hangolási tesztek során a `G28 X0` parancs nem mozdul el egészen a tengelyhatárig, akkor óvatosan kell eljárni a szabályos mozgatási parancsok kiadásával (pl. `G1`). A Klipper nem fogja helyesen értelmezni a kocsi helyzetét, és a mozgatási parancs nemkívánatos és zavaros eredményeket okozhat.
it: Durante questi test di ottimizzazione, se un comando `G28 X0` non si sposta fino al limite dell'asse, prestare attenzione nell'emettere qualsiasi comando di movimento regolare (ad es. `G1`). Klipper non avrà una corretta comprensione della posizione del carrello e un comando di spostamento potrebbe causare risultati indesiderati e confusi.

source: Find lowest sensitivity that homes with one touch
es: Encuentre la sensibilidad más baja que complete el proceso de localización de la boquilla con un solo toque
hu: Keresse meg a legalacsonyabb érzékenységet, amely egyetlen érintéssel kezdőponton van
it: Trova la sensibilità più bassa che porta a homing con un solo tocco

source: When homing with the found *maximum_sensitivity* value, the axis should move to the end of the rail and stop with a "single touch" - that is, there should not be a "clicking" or "banging" sound. (If there is a banging or clicking sound at maximum_sensitivity then the homing_speed may be too low, the driver current may be too low, or sensorless homing may not be a good choice for the axis.)
es: Cuando ejecutando el proceso de localización de la boquilla con el valor de *maximum_sensitivity* encontrado, el eje debe moverse hasta el extremo del riel y detenerse con un "solo toque", es decir, no debe haber un sonido de “click” o “golpeteo”. (Si hay un sonido de golpeteo o clic cuando se usa el valor de maximum_sensitivity, entonces el valor de homing_speed puede ser demasiado bajo, la corriente del controlador puede ser demasiado baja o el proceso de localización de la boquilla sin sensor puede no ser una buena opción para el eje).
hu: Ha a kapott *maximum_sensitivity* értékkel állítja be a tengelyt a sín végére, és egy "egyszeri érintéssel" áll meg, azaz nem szabad, hogy "kattogó" vagy "csattanó" hangot halljon. (Ha a maximális érzékenység mellett csattanó vagy kattogó hang hallatszik, akkor a homing_speed túl alacsony, a meghajtóáram túl alacsony, vagy az érzékelő nélküli kezdőpont felvétel nem jó választás a tengely számára.)
it: Quando si effettua l'homing con il valore *maximum_sensitivity* trovato, l'asse dovrebbe spostarsi all'estremità del binario e fermarsi con un "tocco singolo", ovvero non dovrebbe esserci un "clic" o un "sbattere". (Se c'è un suono che sbatte o scatta alla sensibilità_massima, allora la velocità di riferimento potrebbe essere troppo bassa, la corrente del driver potrebbe essere troppo bassa o la corsa di riferimento senza sensore potrebbe non essere una buona scelta per l'asse.)

source: The next step is to again continually move the carriage to a position near the center of the rail, decrease the sensitivity, and run the `SET_TMC_FIELD` `G28 X0` commands - the goal is now to find the lowest sensitivity that still results in the carriage successfully homing with a "single touch". That is, it does not "bang" or "click" when contacting the end of the rail. Note the found value as *minimum_sensitivity*.
es: El próximo paso es volver a mover continuamente el carruaje a una posición cerca del centro del riel, disminuir la sensibilidad, y ejecutar los comandos `SET_TMC_FIELD` y `G28 X0`; el objetivo ahora es encontrar la sensibilidad más baja que aún resulte en que el carruaje complete con éxito el proceso de localización de la boquilla con un “solo toque”. Es decir, no “golpea” ni hace “clic” cuando entra en contacto con el extremo del riel. Apunte el valor encontrado como *minimum_sensitivity*.
hu: A következő lépés az, hogy a kocsit ismét a sín közepére mozgatjuk, csökkentjük az érzékenységet, és futtatjuk a `SET_TMC_FIELD` `G28 X0` parancsokat. A cél most az, hogy megtaláljuk a legkisebb érzékenységet, amely még mindig azt eredményezi, hogy a kocsi egy "egyetlen érintéssel" sikeresen célba ér. Vagyis nem "bumm" vagy "csatt" a sín végének érintésekor. Jegyezze meg a talált értéket *minimum_sensitivity*.
it: Il passo successivo è spostare di nuovo continuamente il carrello in una posizione vicino al centro della rotaia, diminuire la sensibilità ed eseguire i comandi `SET_TMC_FIELD` `G28 X0` - l'obiettivo ora è trovare la sensibilità più bassa che risulti ancora nel la carrozza torna con successo al punto di riferimento con un "tocco singolo". Cioè, non "sbatte" o "clic" quando viene a contatto con l'estremità del binario. Nota il valore trovato come *sensibilità_minima*.

source: Update printer.cfg with sensitivity value
es: Actualizando printer.cfg con el valor de sensibilidad
hu: Frissítse a printer.cfg fájlt az érzékenységi értékkel
it: Aggiorna printer.cfg con il valore della sensibilità

source: After finding *maximum_sensitivity* and *minimum_sensitivity*, use a calculator to obtain the recommend sensitivity as *minimum_sensitivity + (maximum_sensitivity - minimum_sensitivity)/3*. The recommended sensitivity should be in the range between the minimum and maximum, but slightly closer to the minimum. Round the final value to the nearest integer value.
es: Después de encontrar *maximum_sensitivity* y *minimum_sensitivity*, use una calculadora para obtener la sensibilidad recomendada como *minimum_sensitivity + (maximum_sensitivity - minimum_sensitivity)/3*. La sensibilidad recomendada debe estar en el rango entre el mínimo y el máximo, pero ligeramente más cerca del mínimo. Redondee el valor final al valor entero más cercano.
hu: A *maximum_sensitivity* és *minimum_sensitivity* megállapítása után számológép segítségével kapjuk meg az ajánlott érzékenységet a *minimum_sensitivity + (maximum_sensitivity - minimum_sensitivity)/3* képlettel. Az ajánlott érzékenységnek a minimális és maximális értékek közötti tartományban kell lennie, de valamivel közelebb a minimális értékhez. A végső értéket kerekítse a legközelebbi egész értékre.
it: Dopo aver trovato *sensibilità_massima* e *sensibilità_minima*, utilizzare una calcolatrice per ottenere la sensibilità consigliata come *sensibilità_minima + (sensibilità_massima - sensibilità_minima)/3*. La sensibilità consigliata dovrebbe essere compresa tra il minimo e il massimo, ma leggermente più vicino al minimo. Arrotonda il valore finale al valore intero più vicino.

source: For tmc2209 set this in the config as `driver_SGTHRS`, for other TMC drivers set this in the config as `driver_SGT`.
es: Para el tmc2209 establezca esto en la configuración como `driver_SGTHRS` y para los otros controladores TMC establezca esto en la configuración como `driver_SGT`.
hu: A TMC2209 esetében ezt a konfigurációban a `driver_SGTHRS`, más TMC-motorvezérlők esetében a `driver_SGT` értékkel kell beállítani.
it: Per tmc2209 impostalo nella configurazione come `driver_SGTHRS`, per altri driver TMC impostalo nella configurazione come `driver_SGT`.

source: If the range between *maximum_sensitivity* and *minimum_sensitivity* is small (eg, less than 5) then it may result in unstable homing. A faster homing speed may increase the range and make the operation more stable.
es: Si el rango entre *maximum_sensitivity* y *minimum_sensitivity*. encontrado es corto (por ejemplo inferior a 5) entonces puede resultar en un proceso de localización de la boquilla inestable. Una velocidad para el proceso de localización de la boquilla más rápida puede aumentar el intervalo y hacer que la operación sea más estable.
hu: Ha a *maximum_sensitivity* és *minimum_sensitivity* közötti tartomány kicsi (pl. 5-nél kisebb), akkor ez instabil kezdőpont felvételt eredményezhet. A gyorsabb kezdőpont felvételi sebesség növelheti a hatótávolságot és stabilabbá teheti a működést.
it: Se l'intervallo tra *sensibilità_massima* e *sensibilità_minima* è piccolo (ad esempio, inferiore a 5), potrebbe risultare in un homing instabile. Una velocità di riferimento più elevata può aumentare il range e rendere l'operazione più stabile.

source: Note that if any change is made to driver current, homing speed, or a notable change is made to the printer hardware, then it will be necessary to run the tuning process again.
es: Tenga en cuenta que si se realiza algún cambio en la corriente del controlador, la velocidad del proceso de localización de la boquilla o se realiza un cambio notable en el hardware de la impresora, será necesario ejecutar el proceso de afinamiento nuevamente.
hu: Vegye figyelembe, hogy ha bármilyen változás történik a motorvezérlő áramában, az indítási sebességben vagy a nyomtató hardverén, akkor a hangolási folyamatot újra el kell végezni.
it: Si noti che se viene apportata una modifica alla corrente del driver, alla velocità di riferimento o viene apportata una modifica notevole all'hardware della stampante, sarà necessario eseguire nuovamente il processo di ottimizzazione.

source: Using Macros when Homing
es: Usando macros cuando se ejecuta el proceso de localización de la boquilla
hu: Makrók használata a kezdőpont felvétel során
it: Utilizzo delle macro durante l'homing

source: After sensorless homing completes the carriage will be pressed against the end of the rail and the stepper will exert a force on the frame until the carriage is moved away. It is a good idea to create a macro to home the axis and immediately move the carriage away from the end of the rail.
es: Después de que el proceso de localización de la boquilla sin sensor complete, el carruaje se presionará contra el extremo del riel y el motor de paso a paso ejercerá una fuerza sobre el armazón hasta que el carruaje sea alejado. Así es que, es una buena idea crear un macro para ejecutar el proceso de localización de la boquilla e inmediatamente el carruaje del extremo del riel.
hu: Az érzékelő nélküli kezdőpont felvétel befejezése után a kocsi a sín végéhez lesz nyomva, és a léptető erőt fejt ki a keretre, amíg a kocsi el nem mozdul. Jó ötlet egy makrót létrehozni a tengely kezdőpont felvételéhez, és azonnal elmozdítani a kocsit a sín végétől.
it: Dopo aver completato l'homing senza sensori, il carrello verrà premuto contro l'estremità del binario e lo stepper eserciterà una forza sul telaio fino a quando il carrello non si allontana. È una buona idea creare una macro per posizionare l'asse e allontanare immediatamente il carrello dall'estremità della rotaia.

source: It is a good idea for the macro to pause at least 2 seconds prior to starting sensorless homing (or otherwise ensure that there has been no movement on the stepper for 2 seconds). Without a delay it is possible for the driver's internal stall flag to still be set from a previous move.
es: También es una buena idea que el macro haga una pausa de por lo menos 2 segundos antes de empezar el proceso de localización de la boquilla sin sensor (o de lo contrario asegúrese de que no haya habido movimiento en el motor de paso a paso durante 2 segundos). Sin la pausa, es posible que el indicador interno de parada del controlador se mantenga inicializado basado en un movimiento anterior.
hu: Jó ötlet, ha a makró legalább 2 másodperc szünetet tart az érzékelő nélküli kezdőpont felvétel elindítása előtt (vagy más módon biztosítja, hogy a léptetőn 2 másodpercig nem volt mozgás). A késleltetés nélkül lehetséges, hogy a meghajtó belső leállási jelzője még mindig be van állítva egy korábbi mozgás miatt.
it: È una buona idea che la macro si metta in pausa di almeno 2 secondi prima di iniziare l'homing sensorless (o altrimenti assicurarsi che non ci siano stati movimenti sullo stepper per 2 secondi). Senza ritardo è possibile che il flag di stallo interno del driver sia ancora impostato da un movimento precedente.

source: An example macro might look something like:
es: Un ejemplo de un macro podría ser algo así como:
hu: Egy példamakró így nézhet ki:
it: Una macro di esempio potrebbe assomigliare a:

source: The resulting macro can be called from a [homing_override config section](Config_Reference.md#homing_override) or from a [START_PRINT macro](Slicers.md#klipper-gcode_macro).
es: El macro resultante se puede llamar desde la [sección de configuración homing_override](Config_Reference.md#homing_override) o desde un [macro START_PRINT](Slicers.md#klipper-gcode_macro).
hu: Az így kapott makró meghívható a [homing_override konfigurációs szakasz](Config_Reference.md#homing_override) vagy a [START_PRINT makró](Slicers.md#klipper-gcode_macro) segítségével.
it: La macro risultante può essere chiamata da una [sezione di configurazione homing_override](Config_Reference.md#homing_override) o da una [START_PRINT macro](Slicers.md#klipper-gcode_macro).

source: Note that if the driver current during homing is changed, then the tuning process should be run again.
es: Tenga en cuenta que si se cambia la corriente del controlador durante el proceso de localización de la boquilla, entonces el proceso de afinamiento debe ejecutarse de nuevo.
hu: Vegye figyelembe, hogy ha a motorvezérlő áramát a kezdőpont felvétel során megváltoztatják, akkor a hangolási folyamatot újra el kell végezni.
it: Si noti che se viene modificata la corrente del driver durante l'homing, il processo di ottimizzazione dovrebbe essere eseguito nuovamente.

source: Tips for sensorless homing on CoreXY
es: Consejos para el proceso de localización de la boquilla sin sensor en CoreXY
hu: Tippek CoreXY gépek szenzor nélküli kezdőpont felvételéhez
it: Suggerimenti per l'homing sensorless su CoreXY

source: It is possible to use sensorless homing on the X and Y carriages of a CoreXY printer. Klipper uses the `[stepper_x]` stepper to detect stalls when homing the X carriage and uses the `[stepper_y]` stepper to detect stalls when homing the Y carriage.
es: Es posible utilizar el proceso de localización de la boquilla sin sensor en los carruajes X e Y de una impresora CoreXY. Klipper usa la definición `[stepper_x]` para detectar los detenimientos del motor paso a paso mientras se ejecuta el proceso de localización de la boquilla en el carruaje X y usa la definición `[stepper_y]` para detectar los detenimientos del motor paso a paso mientras se ejecuta el proceso de localización de la boquilla en el carruaje Y.
hu: A CoreXY nyomtató X és Y kocsiknál érzékelő nélküli kezdőpont felvételre is van lehetőség. A Klipper a `[stepper_x]` léptetőt használja az X kocsi kezdőpont felvételekor az elakadások érzékelésére, az Y kocsi kezdőpont felvételekor pedig a `[stepper_y]` léptetőt.
it: È possibile utilizzare l'homing sensorless sui carrelli X e Y di una stampante CoreXY. Klipper usa lo stepper `[stepper_x]` per rilevare gli stalli durante l'homing del carrello X e usa lo stepper `[stepper_y]` per rilevare gli stalli durante l'homing del carrello Y.

source: Use the tuning guide described above to find the appropriate "stall sensitivity" for each carriage, but be aware of the following restrictions:
es: Utilice la guía de afinamiento descrita anteriormente para encontrar la “sensibilidad a detenimientos”, “stall sensitivity” en inglés, adecuada para cada carruaje, pero tenga en cuenta las siguientes restricciones:
hu: Használja a fent leírt hangolási útmutatót, hogy megtalálja a megfelelő "elakadás érzékenységet" az egyes kocsikhoz, de vegye figyelembe a következő korlátozásokat:
it: Utilizzare la guida alla messa a punto sopra descritta per trovare la "sensibilità allo stallo" appropriata per ciascun carrello, ma prestare attenzione alle seguenti restrizioni:
