Repository: Klipper3d/klipper-translations
Catalog: locales/*/LC_MESSAGES/TMC_Drivers.po
Languages: es, hu, it

source: [tmc2130 stepper_x] diag1_pin: ^!PA1 # Pin connected to TMC DIAG1 pin (or use diag0_pin / DIAG0 pin) driver_SGT: -64 # -64 is most sensitive value, 63 is least sensitive ... [stepper_x] endstop_pin: tmc2130_stepper_x:virtual_endstop homing_retract_dist: 0 ...
es: [tmc2130 stepper_x] diag1_pin: ^!PA1 # Pin conectado al pin TMC DIAG1 (o use diag0_pin / DIAG0 pin) driver_SGT: -64 # -64 es el valor más sensible, 63 es el menos sensible ... [stepper_x] endstop_pin: tmc2130_stepper_x:virtual_endstop homing_retract_dist: 0 ...
hu: [tmc2130 stepper_x] diag1_pin: ^!PA1 # A TMC DIAG1 tűhöz csatlakoztatott tű (vagy használja a diag0_pin / DIAG0 tűt) driver_SGT: -64 # -64 a legérzékenyebb érték, 63 a legkevésbé érzékeny. ... [stepper_x] endstop_pin: tmc2130_stepper_x:virtual_endstop homing_retract_dist: 0 ...
it: [tmc2130 stepper_x] diag1_pin: ^!PA1 # Pin collegato al pin TMC DIAG1 (o utilizzare pin diag0_pin / DIAG0) driver_SGT: -64 # -64 è il valore più sensibile, 63 è il meno sensibile ... [stepper_x] endstop_pin: tmc2130_stepper_x:virtual_endstop homing_retract_dist: 0 ...

source: [tmc2660 stepper_x] driver_SGT: -64 # -64 is most sensitive value, 63 is least sensitive ... [stepper_x] endstop_pin: ^PA1 # Pin connected to TMC SG_TST pin homing_retract_dist: 0 ...
es: [tmc2660 stepper_x] driver_SGT: -64 # -64 es el valor más sensible, 63 es el menos sensible ... [stepper_x] endstop_pin: ^PA1 # PIN conectado al PIN TMC SG_TST homing_retract_dist: 0 ...
hu: [tmc2660 stepper_x] driver_SGT: -64 # -64 a legérzékenyebb érték, 63 a legkevésbé érzékeny. ... [stepper_x] endstop_pin: ^PA1 # A TMC SG_TST tűjéhez csatlakoztatott tű. homing_retract_dist: 0 ...
it: [tmc2660 stepper_x] driver_SGT: -64 # -64 è il valore più sensibile, 63 è il meno sensibile ... [stepper_x] endstop_pin: ^PA1 # Pin collegato al pin TMC SG_TST homing_retract_dist: 0 ...

source: TMC drivers
es: Controladores TMC
hu: TMC meghajtók
it: Driver TMC

source: By default, Klipper places the TMC drivers in "spreadCycle" mode. If the driver supports "stealthChop" then it can be enabled by adding `stealthchop_threshold: 999999` to the TMC config section.
es: De forma predeterminada, Klipper coloca los controladores TMC en modo "spreadCycle". Si el controlador es compatible con “stealthChop”, se puede habilitar añadiendo `stealthchop_threshold: 999999` a la sección de configuración de TMC.
hu: Alapértelmezés szerint a Klipper a TMC motorvezérlőket "SpreadCycle" üzemmódba helyezi. Ha a motorvezérlő támogatja a "StealthChop" módot, akkor azt a `stealthchop_threshold hozzáadásával lehet engedélyezni: 999999` a TMC konfigurációs szakaszához.
it: Per impostazione predefinita, Klipper mette i driver TMC in modalità "spreadCycle". Se il driver supporta "stealthChop", può essere abilitato aggiungendo `stealthchop_threshold: 999999` alla sezione di configurazione di TMC.

source: It is recommended to always use "spreadCycle" mode (by not specifying `stealthchop_threshold`) or to always use "stealthChop" mode (by setting `stealthchop_threshold` to 999999). Unfortunately, the drivers often produce poor and confusing results if the mode changes while the motor is at a non-zero velocity.
es: Se recomienda utilizar siempre el modo "spreadCycle" (al no especificar `stealthchop_threshold`) o utilizar siempre el modo "stealthChop" (ajustando `stealthchop_threshold` a 999999). Desafortunadamente, los controladores a menudo producen resultados pobres y confusos si el modo cambia mientras el motor está a una velocidad distinta de cero.
hu: Javasoljuk, hogy mindig a "SpreadCycle" módot használja (nem megadva a `stealthchop_threshold` értéket) vagy mindig a "StealthChop" módot (a `stealthchop_threshold` 999999-re állítva). Sajnos a meghajtók gyakran rossz és zavaros eredményeket produkálnak, ha a mód változik, miközben a motor nem álló állapotban van.
it: Si consiglia di utilizzare sempre la modalità "spreadCycle" (non specificando `stealthchop_threshold`) o di utilizzare sempre la modalità "stealthChop" (impostando `stealthchop_threshold` su 999999). Sfortunatamente, i driver spesso producono risultati scadenti e confusi se la modalità cambia mentre il motore è a una velocità diversa da zero.

source: A stallGuard capable TMC stepper driver (tmc2130, tmc2209, tmc2660, or tmc5160).
es: Un controlador de motor de paso a paso TMC compatible con stallGuard (tmc2130, tmc2209, tmc2660, o tmc5160).
hu: StallGuard-képes TMC motorvezérlő (TMC2130, TMC2209, TMC2660 vagy TMC5160).
it: Driver passo-passo TMC compatibile con stallGuard (tmc2130, tmc2209, tmc2660 o tmc5160).

source: Can I use stealthChop mode on an extruder with pressure advance?
es: ¿Puedo usar el modo stealthChop en un extrusor con avance de presión (“pressure advance” en inglés)?
hu: Használhatom a StealthChop üzemmódot nyomásszabályozással rendelkező extruderen?
it: Posso usare la modalità StealthChop su un estrusore con anticipo della pressione?

source: Many people successfully use "stealthChop" mode with Klipper's pressure advance. Klipper implements [smooth pressure advance](Kinematics.md#pressure-advance) which does not introduce any instantaneous velocity changes.
es: Muchas personas utilizan con éxito el modo "stealthChop" con el avance de presión de Klipper. Klipper implementa [avance de presión fluido](Kinematics.md#pressure-advance) que no introduce ningún cambio de velocidad instantáneo.
hu: Sokan sikeresen használják a "StealthChop" üzemmódot a Klipper nyomásszabályozással. A Klipper [smooth pressure advance](Kinematics.md#pressure-advance), amely nem vezet be pillanatnyi sebesség változást.
it: Molte persone usano con successo la modalità "stealthChop" con pressure advance di Klipper. Klipper implementa [Smooth Pressure Advance](Kinematics.md#pressure-advance) che non introduce variazioni di velocità istantanee.

source: However, "stealthChop" mode may produce lower motor torque and/or produce higher motor heat. It may or may not be an adequate mode for your particular printer.
es: Sin embargo, el modo “stealthChop” puede causar que el par de torsión sea más bajo y/o causar que el motor produzca más calor. Puede o no ser un modo adecuado para su impresora en particular.
hu: A "StealthChop" üzemmód azonban alacsonyabb motornyomatékot és/vagy nagyobb motorhőt eredményezhet. Lehet, hogy ez az üzemmód megfelelő az Ön adott nyomtatója számára, de az is lehet, hogy nem.
it: Tuttavia, la modalità "stealthChop" può produrre una coppia del motore inferiore e/o produrre un maggiore calore del motore. Potrebbe essere o meno una modalità adeguata per la tua particolare stampante.

source: TMC reports error: `... ot=1(OvertempError!)`
es: TMC informa de un error: `... ot=1(OvertempError!)`
it: TMC segnala l'errore: `... ot=1(OvertempError!)`

source: This indicates the motor driver disabled itself because it became too hot. Typical solutions are to decrease the stepper motor current, increase cooling on the stepper motor driver, and/or increase cooling on the stepper motor.
es: Esto indica que el controlador del motor se desactivó de forma autónoma porque se calentó demasiado. Las soluciones típicas son disminuir la corriente del motor paso a paso, aumentar la refrigeración en el controlador del motor paso a paso y/o aumentar la refrigeración en el motor paso a paso.
hu: Ez azt jelzi, hogy a motorvezérlő kikapcsolta magát, mert túlmelegedett. A tipikus megoldások a léptetőmotor áramának csökkentése, a motorvezérlő és/vagy a léptetőmotor hűtése.
it: Ciò indica che il driver del motore si è disabilitato perché è diventato troppo caldo. Le soluzioni tipiche consistono nel ridurre la corrente del motore passo-passo, aumentare il raffreddamento sul driver del motore passo-passo e/o aumentare il raffreddamento sul motore passo-passo.

source: This indicates the driver has disabled itself because it detected very high current passing through the driver. This may indicate a loose or shorted wire to the stepper motor or within the stepper motor itself.
es: Esto indica que el controlador se ha desactivado a sí mismo porque detectó una corriente muy alta que pasaba a través de él. Esto puede indicar un cable suelto o en cortocircuito al motor paso a paso o dentro del propio motor paso a paso.
hu: Ez azt jelzi, hogy a motorvezérlő letiltotta magát, mert nagyon magas áramot érzékelt a meghajtón keresztül. Ez azt jelezheti, hogy meglazult vagy rövidre zárt vezeték van a léptetőmotorban vagy magához a léptetőmotorhoz futó vezeték hibás.
it: Ciò indica che il driver si è disabilitato perché ha rilevato una corrente molto elevata che passa attraverso il driver. Ciò potrebbe indicare un filo allentato o in cortocircuito al motore passo-passo o all'interno del motore passo-passo stesso.

source: This error may also occur if using stealthChop mode and the TMC driver is not able to accurately predict the mechanical load of the motor. (If the driver makes a poor prediction then it may send too much current through the motor and trigger its own over-current detection.) To test this, disable stealthChop mode and check if the errors continue to occur.
es: Este error también puede ocurrir si se está utilizando el modo stealthChop y el controlador TMC no puede predecir con precisión la carga mecánica del motor. (Si el controlador hace una predicción deficiente, puede enviar demasiada corriente a través del motor y desencadenar su propia detección de sobrecorriente.) Para probar esto, deshabilite el modo stealthChop y verifique si los errores continúan ocurriendo.
hu: Ez a hiba akkor is előfordulhat, ha StealthChop üzemmódot használ, és a TMC motorvezérlő nem képes pontosan megjósolni a motor mechanikai terhelését. (Ha a motorvezérlő rosszul jósol, akkor előfordulhat, hogy túl nagy áramot küld a motoron keresztül, és ezzel kiváltja saját túláram-érzékelését). Ennek teszteléséhez kapcsolja ki a StealthChop üzemmódot, és ellenőrizze, hogy a hibák továbbra is előfordulnak-e.
it: Questo errore può verificarsi anche se si utilizza la modalità StealthChop e il driver TMC non è in grado di prevedere con precisione il carico meccanico del motore. (Se il driver fa una previsione scadente, potrebbe inviare troppa corrente attraverso il motore e attivare il proprio rilevamento di sovracorrente.) Per verificarlo, disabilitare la modalità StealthChop e verificare se gli errori continuano a verificarsi.

source: TMC reports error: `... reset=1(Reset)` OR `CS_ACTUAL=0(Reset?)` OR `SE=0(Reset?)`
es: TMC informa error: `... reset=1(Reset)` OR `CS_ACTUAL=0(Reset?)` O `SE=0(Reset?)`
hu: A TMC hibát jelent: `... reset=1(Reset)` VAGY `CS_ACTUAL=0(Reset?)` VAGY `SE=0(Reset?)`
it: TMC segnala un errore: `... reset=1(Reset)` OR `CS_ACTUAL=0(Reset?)` OR `SE=0(Reset?)`

source: This indicates that the driver has reset itself mid-print. This may be due to voltage or wiring issues.
es: Esto indica que el controlador se ha reiniciado de forma autónoma a mitad de la impresión. Esto puede deberse a problemas de voltaje o de cableado.
hu: Ez azt jelzi, hogy a motorvezérlő a nyomtatás közepén visszaállította magát. Ennek oka lehet feszültség vagy vezetékezési probléma.
it: Ciò indica che il driver si è ripristinato durante la stampa. Ciò potrebbe essere dovuto a problemi di tensione o cablaggio.

source: TMC reports error: `... uv_cp=1(Undervoltage!)`
es: TMC informa de error: `... uv_cp=1(Undervoltage!)`
hu: A TMC hibát jelent: `... uv_cp=1(Undervoltage!)`...
it: TMC segnala l'errore: `... uv_cp=1(Undervoltage!)`

source: This indicates the driver has detected a low-voltage event and has disabled itself. This may be due to wiring or power supply issues.
es: Esto indica que el controlador ha detectado un evento de bajo voltaje y se ha desactivado a sí mismo. Esto puede deberse a problemas con el cableado o la fuente de alimentación.
hu: Ez azt jelzi, hogy a motorvezérlő alacsony feszültséget észlelt, és letiltotta magát. Ennek oka lehet vezetékezési vagy tápellátási probléma.
it: Ciò indica che il driver ha rilevato un evento di bassa tensione e si è disabilitato. Ciò potrebbe essere dovuto a problemi di cablaggio o alimentazione.

source: How do I tune spreadCycle/coolStep/etc. mode on my drivers?
es: ¿Cómo afino el modo spreadCycle/coolStep/etc. en mis controladores?
hu: Hogyan tudom beállítani a spreadCycle/coolStep/etc. üzemmódot a motorvezérlőimhez?
it: Come si regola la modalità spreadCycle/coolStep/etc. sui miei driver?

source: Tuning motor current
es: Afinando la corriente del motor
hu: Motoráram hangolása
it: Regolazione della corrente del motore

source: A higher driver current increases positional accuracy and torque. However, a higher current also increases the heat produced by the stepper motor and the stepper motor driver. If the stepper motor driver gets too hot it will disable itself and Klipper will report an error. If the stepper motor gets too hot, it loses torque and positional accuracy. (If it gets very hot it may also melt plastic parts attached to it or near it.)
es: Aumentar la corriente del controlador causa un aumento en la precisión posicional y en el par de torsión. Sin embargo, la corriente más alta también aumenta el calor producido por el motor de paso a paso y su controlador. Si el controlador del motor paso a paso se calienta demasiado, se desactivará de forma autónoma y Klipper informará de un error. Si el motor paso a paso se calienta demasiado, pierde par de torsión y precisión posicional. (Si se calienta mucho, también puede derretir las piezas de plástico unidas a él o cerca de él).
hu: A nagyobb meghajtóáram növeli a pozicionálási pontosságot és a nyomatékot. A nagyobb áram azonban növeli a léptetőmotor és a motorvezérlő által termelt hőt is. Ha a motorvezérlő túlságosan felmelegszik, akkor kikapcsolja magát, és a Klipper hibát jelez. Ha a léptetőmotor túlságosan felmelegszik, veszít a nyomatékból és a pozícionálási pontosságból. (Ha nagyon felforrósodik, akkor a hozzáérő vagy a közelében lévő műanyag alkatrészeket is megolvaszthatja.)
it: Una corrente più alta del driver aumenta la precisione del posizionamento e la coppia. Tuttavia, una corrente più elevata aumenta anche il calore prodotto dal motore passo-passo e dal driver del motore passo-passo. Se il driver del motore passo-passo si surriscalda, si disabiliterà e Klipper segnalerà un errore. Se il motore passo-passo si surriscalda, perde coppia e precisione di posizionamento. (Se diventa molto caldo, potrebbe anche fondere le parti di plastica attaccate o vicino ad esso.)

source: As a general tuning tip, prefer higher current values as long as the stepper motor does not get too hot and the stepper motor driver does not report warnings or errors. In general, it is okay for the stepper motor to feel warm, but it should not become so hot that it is painful to touch.
es: Como consejo de afinamiento general, prefiera valores de corriente más altos siempre que el motor paso a paso no se caliente demasiado y el controlador del motor paso a paso no comunique advertencias o errores. En general, está bien que el motor de paso a paso se sienta caliente, pero no debe calentarse tanto que sea doloroso al tocar.
hu: Általános hangolási tippként, előnyben részesítheti a magasabb áramértékeket, amíg a léptetőmotor nem melegszik túlságosan, és a motorvezérlő nem jelez figyelmeztetéseket vagy hibákat. Általánosságban elmondható, hogy a léptetőmotor nem baj, ha melegszik, de nem szabad annyira felforrósodnia, hogy érintése fájdalmas legyen.
it: Come consiglio generale per l'ottimizzazione, preferire valori di corrente più elevati purché il motore passo-passo non si surriscaldi troppo e il driver del motore passo-passo non segnali avvisi o errori. In generale, va bene che il motore passo-passo sia caldo, ma non dovrebbe diventare così caldo da risultare doloroso al tatto.

source: Prefer to not specify a hold_current
es: Es preferible no especificar “hold_current”
hu: Inkább ne adjon meg hold_current értéket
it: Preferibilmente non specificare un hold_current

source: If one configures a `hold_current` then the TMC driver can reduce current to the stepper motor when it detects that the stepper is not moving. However, changing motor current may itself introduce motor movement. This may occur due to "detent forces" within the stepper motor (the permanent magnet in the rotor pulls towards the iron teeth in the stator) or due to external forces on the axis carriage.
es: Si se configura una corriente de mantenimiento usando el ajuste `hold_current`, entonces el controlador TMC puede reducir la corriente al motor de paso a paso cuando detecta que el motor no se está moviendo. Sin embargo, un cambio a la corriente del motor por sí solo puede causar que el motor se mueva. Esto puede ocurrir debido a "fuerzas de retención" dentro del motor de paso a paso (el imán permanente en el rotor tira hacia los dientes de hierro en el estátor) o debido a fuerzas externas en el carruaje del eje.
hu: Ha beállítunk egy `hold_current` értéket, akkor a TMC motorvezérlő csökkentheti a léptetőmotor áramát, amikor azt érzékeli, hogy a léptető nem mozog. A motoráram megváltoztatása azonban önmagában is motormozgást eredményezhet. Ez bekövetkezhet a "rögzítő erők" miatt a léptetőmotoron belül (a rotorban lévő állandó mágnes az állórészben lévő vasfogak felé húz) vagy a tengelykocsira ható külső erők miatt.
it: Se si configura un `hold_current`, il driver TMC può ridurre la corrente al motore passo-passo quando rileva che il passo-passo non si sta muovendo. Tuttavia, la variazione della corrente del motore può di per sé introdurre il movimento del motore. Ciò può verificarsi a causa di "forze di arresto" all'interno del motore passo-passo (il magnete permanente nel rotore tira verso i denti di ferro nello statore) o a causa di forze esterne sul carrello dell'asse.

source: Most stepper motors will not obtain a significant benefit to reducing current during normal prints, because few printing moves will leave a stepper motor idle for sufficiently long to activate the `hold_current` feature. And, it is unlikely that one would want to introduce subtle print artifacts to the few printing moves that do leave a stepper idle sufficiently long.
es: La mayoría de los motores de paso a paso no obtendrán un beneficio significativo como resultado de reducir la corriente durante las impresiones normales, porque pocos movimientos de impresión dejarían el motor de paso a paso inactivo durante el tiempo suficiente para activar la función `hold_current`. Además, es poco probable que uno quiera introducir artefactos de impresión sutiles a los pocos movimientos de impresión que dejan al motor de paso a paso inactivo el tiempo suficiente.
hu: A legtöbb léptetőmotornak a normál nyomtatás során nem jelent jelentős előnyt az áram csökkentése, mivel kevés nyomtatási művelet hagyja a léptetőmotort elég hosszú ideig üresen ahhoz, hogy aktiválja a `hold_current` funkciót. És nem valószínű, hogy az ember finom nyomtatási műveleteket akarna bevezetni abba a néhány nyomtatási mozdulatba, amely elég hosszú ideig hagyja üresen a léptetőmotort.
it: La maggior parte dei motori passo-passo non otterrà un beneficio significativo dalla riduzione della corrente durante le normali stampe, perché pochi movimenti di stampa lasceranno un motore passo-passo inattivo per un tempo sufficientemente lungo da attivare la funzione `hold_current`. Ed è improbabile che si vogliano introdurre sottili artefatti di stampa nelle poche mosse di stampa che lasciano uno stepper inattivo sufficientemente a lungo.

source: Some printers with dedicated Z motors that are idle during normal printing moves (no bed_mesh, no bed_tilt, no Z skew_correction, no "vase mode" prints, etc.) may find that Z motors do run cooler with a `hold_current`. If implementing this then be sure to take into account this type of uncommanded Z axis movement during bed leveling, bed probing, probe calibration, and similar. The `driver_TPOWERDOWN` and `driver_IHOLDDELAY` should also be calibrated accordingly. If unsure, prefer to not specify a `hold_current`.
es: Algunas impresoras con motores Z dedicados que están inactivos durante los movimientos de impresión normales (sin bed_mesh, sin bed_tilt, sin Z skew_correction, sin impresiones en "modo jarrón" (“vase mode” en inglés), etc.) pueden encontrar que los motores Z funcionan a temperaturas más bajas cuando se usa `hold_current`. Si implementa esto, asegúrese de tener en cuenta este tipo de movimiento no ordenado del eje Z durante la nivelación de la cama, el sondeo de la cama, la calibración de la sonda y similares. El `driver_TPOWERDOWN` y el `driver_IHOLDDELAY` también deben calibrarse en consecuencia. Si no está seguro, prefiera no especificar `hold_current`.
hu: Néhány olyan, dedikált Z-motorral rendelkező nyomtató, amely a normál nyomtatási műveletek során (nincs bed_mesh, nincs bed_tilt, nincs Z skew_correction, nincs "vase mode" nyomtatás stb.) üresjáratban van, azt tapasztalhatja, hogy a Z-motorok hűvösebbek a `hold_current` beállítással. Ha ezt használja, akkor mindenképpen vegye figyelembe ezt a fajta parancs nélküli Z tengelymozgást ágykiegyenlítés, ágyszintezés, szondakalibrálás és hasonlók során. A `driver_TPOWERDOWN` és `driver_IHOLDDELAY` értékeket is ennek megfelelően kell kalibrálni. Ha bizonytalan, inkább ne adja meg a `hold_current` értéket.
it: Alcune stampanti con motori Z dedicati che sono inattivi durante i normali movimenti di stampa (nessuna bed_mesho, nessuna inclinazione_piatto, nessuna correzione_inclinazione Z, nessuna stampa in "modalità vaso", ecc.) potrebbero scoprire che i motori Z funzionano a temperature più basse con un `hold_current`. Se si implementa questo, assicurarsi di prendere in considerazione questo tipo di movimento dell'asse Z non comandato durante il livellamento del piatto, il rilevamento del piatto, la calibrazione della sonda e simili. Anche `driver_TPOWERDOWN` e `driver_IHOLDDELAY` dovrebbero essere calibrati di conseguenza. Se non sei sicuro, preferisci non specificare un `hold_current`.

source: Setting "spreadCycle" vs "stealthChop" Mode
es: Configurando el modo "spreadCycle" vs. "stealthChop"
hu: "SpreadCycle" vs "StealthChop" mód beállítása
it: Impostazione della modalità "spreadCycle" rispetto a "stealthChop"

source: In general, spreadCycle mode provides greater torque and greater positional accuracy than stealthChop mode. However, stealthChop mode may produce significantly lower audible noise on some printers.
es: En general, el modo spreadCycle proporciona un mayor par de torsión y una mayor precisión posicional que el modo stealthChop. Sin embargo, el modo stealthChop puede producir un ruido audible significativamente menor en algunas impresoras.
hu: Általában a SpreadCycle üzemmód nagyobb nyomatékot és nagyobb helymeghatározási pontosságot biztosít, mint a StealthChop üzemmód. A StealthChop üzemmód azonban néhány nyomtatónál lényegesen kisebb hallható zajjal járhat.
it: In generale, la modalità SpreadCycle fornisce una coppia maggiore e una maggiore precisione di posizionamento rispetto alla modalità StealthChop. Tuttavia, la modalità StealthChop può produrre un rumore udibile notevolmente inferiore su alcune stampanti.
