Repository: Klipper3d/klipper-translations
Catalog: locales/*/LC_MESSAGES/TMC_Drivers.po
Languages: es, hu, it

source: Tests comparing modes have shown an increased "positional lag" of around 75% of a full-step during constant velocity moves when using stealthChop mode (for example, on a printer with 40mm rotation_distance and 200 steps_per_rotation, position deviation of constant speed moves increased by ~0.150mm). However, this "delay in obtaining the requested position" may not manifest as a significant print defect and one may prefer the quieter behavior of stealthChop mode.
es: Las pruebas que comparan los modos han mostrado un aumento del "retraso posicional" (“positional lag” en inglés) de alrededor del 75 % de un paso completo durante los movimientos de velocidad constante cuando se utiliza el modo stealthChop (por ejemplo, en una impresora con 40 mm de distancia de rotación (“rotation_distance” en inglés) y 200 pasos por rotación (“steps_per_rotation” en inglés) la desviación de posición de los movimientos de velocidad constante aumentó por ~ 0,150 mm). Sin embargo, este "retraso en obtener la posición solicitada" puede no manifestarse como un defecto de impresión significativo y uno puede preferir el comportamiento más silencioso del modo stealthChop.
hu: Az üzemmódok összehasonlító tesztjei azt mutatták, hogy a StealthChop üzemmód használata esetén a "pozíciós késés" az állandó sebességű mozgások során a teljes lépés 75%-ával nőtt (például egy 40 mm-es forgási távolsággal és 200 lépés/fordulatszámmal rendelkező nyomtatónál az állandó sebességű mozgások pozícióeltérése ~0,150 mm-rel nőtt). Ez a "késedelem a kért pozíció elérésében" azonban nem biztos, hogy jelentős nyomtatási hibaként jelentkezik, és lehet, hogy jobban tetszik a StealthChop mód csendesebb működése.
it: I test di confronto delle modalità hanno mostrato un "ritardo posizionale" aumentato di circa il 75% di un passo completo durante i movimenti a velocità costante quando si utilizza la modalità StealthChop (ad esempio, su una stampante con distanza_rotazione di 40 mm e 200 passi_per_rotazione, la deviazione di posizione dei movimenti a velocità costante è aumentata di ~0,150 mm). Tuttavia, questo "ritardo nell'ottenimento della posizione richiesta" potrebbe non manifestarsi come un difetto di stampa significativo e si potrebbe preferire il comportamento più silenzioso della modalità stealthChop.

source: TMC interpolate setting introduces small position deviation
es: El ajuste interpolación del controlador TMC introduce una pequeña desviación de posición
hu: A TMC interpolációs beállítása kis pozícióeltérést eredményez
it: L'impostazione dell'interpolazione TMC introduce una piccola deviazione di posizione

source: The TMC driver `interpolate` setting may reduce the audible noise of printer movement at the cost of introducing a small systemic positional error. This systemic positional error results from the driver's delay in executing "steps" that Klipper sends it. During constant velocity moves, this delay results in a positional error of nearly half a configured microstep (more precisely, the error is half a microstep distance minus a 512th of a full step distance). For example, on an axis with a 40mm rotation_distance, 200 steps_per_rotation, and 16 microsteps, the systemic error introduced during constant velocity moves is ~0.006mm.
es: El ajuste "interpolación" (`interpolate` en inglés) del controlador TMC puede reducir el ruido audible creado por el movimiento de la impresora a costa de introducir un pequeño error de posición sistémico. Este error posicional sistémico es el resultado del retraso del controlador en ejecutar los "pasos" que Klipper le envía. Durante los movimientos de velocidad constante, este retraso da como resultado un error de posición de casi la mitad de un micropaso configurado (más precisamente, el error es la mitad de la distancia de un micropaso menos 1/512 parte de la distancia de un paso completo). Por ejemplo, en un eje con una distancia de rotación de 40 mm, 200 pasos por rotación y 16 micropasos, el error sistémico introducido durante los movimientos de velocidad constante es de ~ 0,006 mm.
hu: A TMC motorvezérlő `interpolate` beállítása csökkentheti a nyomtató mozgásának hallható zaját, de ennek ára egy kis rendszerszintű helyzeti hiba. Ez a rendszerszintű helyzeti hiba abból adódik, hogy a motorvezérlő késve hajtja végre a Klipper által küldött "lépéseket". Állandó sebességű mozgások során ez a késleltetés közel fél konfigurált mikrolépésnyi pozícióhibát eredményez (pontosabban a hiba fél mikrolépésnyi távolság mínusz a teljes lépés távolság 512-ed része). Például egy 40 mm-es rotation_distance, 200 steps_per_rotation és 16 microstep tengelyen az állandó sebességű mozgások során bevezetett rendszerszintű hiba ~0,006 mm.
it: L'impostazione `interpolate` del driver TMC può ridurre il rumore udibile del movimento della stampante a costo di introdurre un piccolo errore di posizione sistemico. Questo errore di posizione sistematico deriva dal ritardo del driver nell'esecuzione dei "passi" inviati da Klipper. Durante i movimenti a velocità costante, questo ritardo si traduce in un errore di posizione di quasi mezzo micropasso configurato (più precisamente, l'errore è di mezzo micropasso meno un 512esimo di un passo intero). Ad esempio, su un asse con una distanza_rotazione di 40 mm, 200 passi_per_rotazione e 16 micropassi, l'errore sistemico introdotto durante i movimenti a velocità costante è ~0,006 mm.

source: For best positional accuracy consider using spreadCycle mode and disable interpolation (set `interpolate: False` in the TMC driver config). When configured this way, one may increase the `microstep` setting to reduce audible noise during stepper movement. Typically, a microstep setting of `64` or `128` will have similar audible noise as interpolation, and do so without introducing a systemic positional error.
es: Para una mejor precisión posicional, considere usar el modo spreadCycle y deshabilitar la interpolación (especifique `interpolate: False` en la configuración del controlador TMC). Cuando se configura de esta manera, se puede aumentar el valor del parámetro `microstep` para reducir el ruido audible durante el movimiento del motor de paso a paso. Por lo general, especificar un valor de `64` o `128` en el parámetro "microstep" causará un ruido audible similar al de la interpolación, y lo hará sin introducir un error de posición sistémico.
hu: A legjobb helymeghatározási pontosság érdekében fontolja meg a SpreadCycle mód használatát és az interpoláció kikapcsolását (állítsa be az `interpolate: False` értéket a TMC motorvezérlő konfigurációjában). Ilyen konfiguráció esetén növelhetjük a `microstep` beállítást a léptető mozgása közbeni hallható zajok csökkentése érdekében. Általában a `64` vagy `128` mikrolépés beállítása az interpolációhoz hasonló hallható zajjal jár, és mindezt anélkül, hogy rendszerszintű helyzeti hibát vezetne be.
it: Per una migliore precisione di posizionamento, considerare l'utilizzo della modalità SpreadCycle e disabilitare l'interpolazione (impostare `interpolate: False` nella configurazione del driver TMC). Se configurato in questo modo, è possibile aumentare l'impostazione `microstep` per ridurre il rumore udibile durante il movimento del passo-passo. Tipicamente, un'impostazione microstep di `64` o `128` avrà un rumore udibile simile all'interpolazione e lo farà senza introdurre un errore posizionale sistemico.

source: If using stealthChop mode then the positional inaccuracy from interpolation is small relative to the positional inaccuracy introduced from stealthChop mode. Therefore tuning interpolation is not considered useful when in stealthChop mode, and one can leave interpolation in its default state.
es: Si utiliza el modo stealthChop entonces la inexactitud posicional debido a la interpolación es pequeña en relación con la inexactitud posicional introducida por el modo stealthChop. Por lo tanto, afinar la interpolación no se considera útil cuando se está utilizando el modo stealthChop, y se puede dejar la interpolación en su estado predeterminado.
hu: Ha a StealthChop módot használja, akkor az interpolációból eredő helyzeti pontatlanság kicsi a StealthChop módból eredő helyzeti pontatlansághoz képest. Ezért az interpoláció hangolása nem tekinthető hasznosnak StealthChop üzemmódban, és az interpoláció alapértelmezett állapotban hagyható.
it: Se si utilizza la modalità StealthChop, l'imprecisione posizionale dell'interpolazione è piccola rispetto all'imprecisione posizionale introdotta dalla modalità StealthChop. Pertanto l'interpolazione dell'ottimizzazione non è considerata utile in modalità StealthChop e si può lasciare l'interpolazione nel suo stato predefinito.

source: It can also be useful to have that macro set the driver current before homing and set a new current after the carriage has moved away.
es: También puede ser útil que ese macro establezca la corriente del controlador antes de ejecutar el proceso de localización de la boquilla y entonces establecer una nueva corriente después de que el carruaje se haya alejado.
it: Può anche essere utile fare in modo che quella macro imposti la corrente del driver prima della corsa di riferimento e imposti una nuova corrente dopo che il carrello si è allontanato.

source: [gcode_macro SENSORLESS_HOME_X] gcode: {% set HOME_CUR = 0.700 %} {% set driver_config = printer.configfile.settings['tmc2209 stepper_x'] %} {% set RUN_CUR = driver_config.run_current %} # Set current for sensorless homing SET_TMC_CURRENT STEPPER=stepper_x CURRENT={HOME_CUR} # Pause to ensure driver stall flag is clear G4 P2000 # Home G28 X0 # Move away G90 G1 X5 F1200 # Set current during print SET_TMC_CURRENT STEPPER=stepper_x CURRENT={RUN_CUR}
es: [gcode_macro SENSORLESS_HOME_X] gcode: {% set HOME_CUR = 0.700 %} {% set driver_config = printer.configfile.settings['tmc2209 stepper_x'] %} {% set RUN_CUR = driver_config.run_current %} # Establezca la corriente para el proceso de localización de la boquilla sin sensor SET_TMC_CURRENT STEPPER=stepper_x CURRENT={HOME_CUR} # Una pausa para asegurar que el indicador de parada esta despejadoEjecute el proceso de localización de la boquilla G4 P2000 # Ejecute el proceso de localización de la boquilla G28 X0 # Alejar G90 G1 X5 F1200 # Establezca la corriente usada durante la impresión SET_TMC_CURRENT STEPPER=stepper_x CURRENT={RUN_CUR}
it: [gcode_macro SENSORLESS_HOME_X] gcode: {% set HOME_CUR = 0.700 %} {% set driver_config = printer.configfile.settings['tmc2209 stepper_x'] %} {% set RUN_CUR = driver_config.run_current %} # Imposta la corrente per l'homing sensorless SET_TMC_CURRENT STEPPER=stepper_x CURRENT={HOME_CUR} # Fai una pausa per assicurarti che il flag di stallo del driver sia clear G4 P2000 # Home G28 X0 # Spostamento G90 G1 X5 F1200 # Imposta corrente durante la stampa SET_TMC_CURRENT STEPPER=stepper_x CURRENT={RUN_CUR}

source: When using sensorless homing on CoreXY, make sure there is no `hold_current` configured for either stepper.
es: Cuando utilice el proceso de localización de la boquilla sin sensor en CoreXY, asegúrese de que no haya una corriente de mantenimiento (`hold_current` en inglés) configurada para ninguno de los motores de paso a paso.
it: Quando si utilizza l'homing sensorless su CoreXY, assicurarsi che non sia configurato `hold_current` per nessuno dei due stepper.

source: If one wishes to reduce current to motors during print start routines, then consider issuing [SET_TMC_CURRENT](G-Codes.md#set_tmc_current) commands in a [START_PRINT macro](Slicers.md#klipper-gcode_macro) to adjust the current before and after normal printing moves.
es: Si desea reducir la corriente a los motores durante las rutinas de inicio de impresión, considere emitir los comandos [SET_TMC_CURRENT](G-Codes.md#set_tmc_current) en un [macro START_PRINT](Slicers.md#klipper-gcode_macro) para ajustar la corriente antes y después de los movimientos normales de impresión.
it: Se si desidera ridurre la corrente ai motori durante le routine di avvio della stampa, considerare l'emissione di comandi [SET_TMC_CURRENT](G-Codes.md#set_tmc_current) in una [START_PRINT macro](Slicers.md#klipper-gcode_macro) per regolare la corrente prima e dopo i normali spostamenti di stampa.

source: The `[DUMP_TMC command](G-Codes.md#dump_tmc) is a useful tool when configuring and diagnosing the drivers. It will report all fields configured by Klipper as well as all fields that can be queried from the driver.
es: El `[comando DUMP_TMC](G-Codes.md#dump_tmc) es una herramienta útil a la hora de configurar y diagnosticar los controladores. Informará de todos los campos configurados por Klipper así como de todos los campos que se puedan consultar desde el controlador.
it: Il [comando DUMP_TMC](G-Codes.md#dump_tmc) è uno strumento utile durante la configurazione e la diagnosi dei driver. Riporterà tutti i campi configurati da Klipper così come tutti i campi che possono essere interrogati dal driver.

source: In addition, almost all fields can be modified at run-time using the [SET_TMC_FIELD command](G-Codes.md#set_tmc_field).
es: Además, casi todos los campos se pueden modificar al tiempo de ejecución utilizando el [comando SET_TMC_FIELD](G-Codes.md#set_tmc_field).
it: Inoltre, quasi tutti i campi possono essere modificati in fase di esecuzione utilizzando il [comando SET_TMC_FIELD](G-Codes.md#set_tmc_field).

source: Then issue a `G28 X0` command and verify the axis does not move at all or quickly stops moving. If the axis does not stop, then issue an `M112` to halt the printer - something is not correct with the diag/sg_tst pin wiring or configuration and it must be corrected before continuing.
es: Entonces, ejecute un comando `G28 X0` y verifique que el eje no se mueve en absoluto o que se detiene rápidamente. Si el eje no se detiene, emita un `M112` para detener la impresora porque algo esta incorrecto en el cableado o la configuración del pin diag/sg_tst y debe corregirse antes de continuar.
it: Quindi inviare un comando `G28 X0` e verificare che l'asse non si muova affatto o smetta rapidamente di muoversi. Se l'asse non si ferma, inviare un `M112` per fermare la stampante - qualcosa non è corretto con il cablaggio o la configurazione dei pin diag/sg_tst e deve essere corretto prima di continuare.

source: An example CoreXY homing macro might look like:
es: Un ejemplo de un macro para ejecutar el proceso de localización de la boquilla en una impresora CoreXY podría ser:
it: Un esempio di macro homing CoreXY potrebbe essere simile a:

source: [gcode_macro HOME] gcode: G90 # Home Z G28 Z0 G1 Z10 F1200 # Home Y G28 Y0 G1 Y5 F1200 # Home X G4 P2000 G28 X0 G1 X5 F1200
es: [gcode_macro HOME] gcode: G90 # Ejecute el proceso de localización de la boquilla en el eje Z G28 Z0 G1 Z10 F1200 # Ejecute el proceso de localización de la boquilla en el eje Y G28 Y0 G1 Y5 F1200 # Ejecute el proceso de localización de la boquilla en el eje X G4 P2000 G28 X0 G1 X5 F1200

source: TMC reports error: `... ShortToGND` OR `ShortToSupply`
es: TMC informa de error: `... ShortToGND` O `ShortToSupply`

source: TMC reports error: `... ShortToGND` OR `LowSideShort`
hu: A TMC hibát jelent: `... ShortToGND` VAGY `LowSideShort`
it: TMC segnala un errore: `... ShortToGND` O `LowSideShort`

source: Then issue a `G28 X0` command and verify the axis does not move at all. If the axis does move, then issue an `M112` to halt the printer - something is not correct with the diag/sg_tst pin wiring or configuration and it must be corrected before continuing.
hu: Ezután adjon ki egy `G28 X0` parancsot, és ellenőrizze, hogy a tengely egyáltalán nem mozog. Ha a tengely mozog, akkor adjon ki egy `M112` parancsot a nyomtató leállításához. Valami nem stimmel a diag/sg_tst pin kábelezésével vagy konfigurációjával, ezt a folytatás előtt ki kell javítani.
