Repository: Klipper3d/klipper-translations
Catalog: locales/*/LC_MESSAGES/TMC_Drivers.po
Languages: es, hu, it

source: While tuning, make sure both the X and Y carriages are near the center of their rails before each home attempt.
es: Mientras afina, asegúrese de que los carruajes X e Y estén cerca del centro de sus rieles antes de cada intento de ejecutar el proceso de localización de la boquilla.
hu: A hangolás során győződjön meg arról, hogy az X és az Y kocsik a sínek közepénél vannak-e minden egyes kezdőpont felvételi kísérlet előtt.
it: Durante la messa a punto, assicurati che entrambi i carrelli X e Y siano vicini al centro dei loro binari prima di ogni tentativo di homing.

source: After tuning is complete, when homing both X and Y, use macros to ensure that one axis is homed first, then move that carriage away from the axis limit, pause for at least 2 seconds, and then start the homing of the other carriage. The move away from the axis avoids homing one axis while the other is pressed against the axis limit (which may skew the stall detection). The pause is necessary to ensure the driver's stall flag is cleared prior to homing again.
es: Después de completar el afinamiento, cuando se ejecute el proceso de localización de la boquilla para tanto X como Y, use macros para asegurarse de que se completen los siguientes cuatro pasos en orden: un eje complete el proceso primero; entonces se aleje ese carruaje del extremo del eje; haya una pausa de al menos 2 segundos, y entonces comience el proceso en el otro carruaje. El alejamiento del eje previene que el proceso de localización de la boquilla de un eje se ejecute mientras que el otro este presionado contra el extremo del eje (lo que podría distorsionar la detección de detenimientos). La pausa es necesaria para asegurarse que el indicador de parada del controlador este despejado antes de ejecutar el proceso de localización de la boquilla nuevamente.
hu: A hangolás befejezése után az X és Y kezdőpont felvételét makrók segítségével biztosítsa, hogy először az egyik tengely vegye fel a kezdőpontot, majd mozgassa el a kocsit a tengelyhatártól, tartson legalább 2 másodperc szünetet, majd kezdje el a másik kocsi kezdőpont felvételét. A tengelytől való eltávolodással elkerülhető, hogy az egyik tengelyt akkor indítsuk el, amikor a másik a tengelyhatárhoz van nyomva (ami eltorzíthatja az akadásérzékelést). A szünetre azért van szükség, hogy a meghajtó az újraindítás előtt törölje az elakadás érzékelő puffert.
it: Al termine dell'ottimizzazione, quando si esegue l'homing sia di X che Y, utilizzare le macro per assicurarsi che un asse sia homed per primo, quindi spostare il carrello lontano dal limite dell'asse, fare una pausa per almeno 2 secondi, quindi avviare l'orientamento dell'altro carrello. L'allontanamento dall'asse evita l'homing di un asse mentre l'altro viene premuto contro il limite dell'asse (cosa potrebbe distorcere il rilevamento dello stallo). La pausa è necessaria per garantire che il flag di stallo del driver sia cancellata prima del homing.

source: Querying and diagnosing driver settings
es: Consultando y diagnosticando los ajustes del controlador
hu: A motorvezérlő beállításainak lekérdezése és diagnosztizálása
it: Interrogazione e diagnosi delle impostazioni del driver

source: All of the reported fields are defined in the Trinamic datasheet for each driver. These datasheets can be found on the [Trinamic website](https://www.trinamic.com/). Obtain and review the Trinamic datasheet for the driver to interpret the results of DUMP_TMC.
es: Todos los campos declarados se definen en la hoja de datos de Trinamic para cada controlador. Estas hojas de datos se pueden encontrar en el [sitio web de Trinamic](https://www.trinamic.com/). Obtenga y revise la hoja de datos del conductor publicada por Trinamic para interpretar los resultados de DUMP_TMC.
hu: Az összes bejelentett mezőt az egyes motorvezérlők Trinamic adatlapja határozza meg. Ezek az adatlapok megtalálhatók a [Trinamic weboldalán](https://www.trinamic.com/). A DUMP_TMC eredményeinek értelmezéséhez szerezze be és tekintse át a meghajtó Trinamic adatlapját.
it: Tutti i campi riportati sono definiti nella scheda tecnica Trinamic per ciascun driver. Queste schede tecniche possono essere trovate sul [sito web Trinamic](https://www.trinamic.com/). Ottenere e rivedere i dati Trinamic affinché il conducente interpreti i risultati di DUMP_TMC.

source: Configuring driver_XXX settings
es: Configurado los ajustes de driver_XXX
hu: A driver_XXX beállítások konfigurálása
it: Configurazione delle impostazioni driver_XXX

source: Klipper supports configuring many low-level driver fields using `driver_XXX` settings. The [TMC driver config reference](Config_Reference.md#tmc-stepper-driver-configuration) has the full list of fields available for each type of driver.
es: Klipper admite la configuración de muchos campos de bajo nivel utilizando los ajustes disponibles en la sección `driver_XXX` del controlador. La [referencia de configuración del controlador TMC](Config_Reference.md#tmc-stepper-driver-configuration) tiene la lista completa de campos disponibles para cada tipo de controlador.
hu: A Klipper támogatja számos alacsony szintű motorvezérlő konfigurálását a `driver_XXX` beállítások használatával. A [TMC meghajtó konfigurációs hivatkozás](Config_Reference.md#tmc-stepper-driver-configuration) tartalmazza az egyes meghajtótípusokhoz elérhető mezők teljes listáját.
it: Klipper supporta la configurazione di molti campi driver di basso livello usando le impostazioni `driver_XXX`. Il [Riferimento alla configurazione del driver TMC](Config_Reference.md#tmc-stepper-driver-configuration) contiene l'elenco completo dei campi disponibili per ogni tipo di driver.

source: Each of these fields is defined in the Trinamic datasheet for each driver. These datasheets can be found on the [Trinamic website](https://www.trinamic.com/).
es: Cada uno de estos campos se define en la hoja de datos de Trinamic para cada controlador. Estas hojas de datos se pueden encontrar en el [sitio web de Trinamic](https://www.trinamic.com/).
hu: E mezők mindegyikét az egyes meghajtók Trinamic adatlapja határozza meg. Ezek az adatlapok megtalálhatók a [Trinamic weboldalán](https://www.trinamic.com/).
it: Ciascuno di questi campi è definito nella scheda tecnica Trinamic per ciascun driver. Queste schede tecniche possono essere trovate sul [sito web Trinamic](https://www.trinamic.com/).

source: Note that the Trinamic datasheets sometime use wording that can confuse a high-level setting (such as "hysteresis end") with a low-level field value (eg, "HEND"). In Klipper, `driver_XXX` and SET_TMC_FIELD always set the low-level field value that is actually written to the driver. So, for example, if the Trinamic datasheet states that a value of 3 must be written to the HEND field to obtain a "hysteresis end" of 0, then set `driver_HEND=3` to obtain the high-level value of 0.
es: Tenga en cuenta que las hojas de datos de Trinamic a veces usan una redacción que puede confundir una ajuste de alto nivel (como "hysteresis end") con un valor para un campo de bajo nivel (por ejemplo, "HEND"). En Klipper, `driver_XXX` y SET_TMC_FIELD siempre establecen el valor del campo de bajo nivel que realmente se escribe en el controlador. Entonces, por ejemplo, si la hoja de datos Trinamic establece que se debe escribir un valor de 3 en el campo HEND para obtener un "final de histéresis" (“hysteresis end” en inglés) de 0, establezca `driver_HEND=3` para obtener el valor de alto nivel de 0.
hu: Vegye figyelembe, hogy a Trinamic adatlapok néha olyan megfogalmazást használnak, amely összetéveszthet egy magas szintű beállítást (például "hiszterézis vége") egy alacsony szintű mezőértékkel (pl. "HEND"). A Klipperben a `driver_XXX` és a SET_TMC_FIELD mindig azt az alacsony szintű mezőértéket állítja be, amely ténylegesen a meghajtóba íródik. Így például, ha a Trinamic adatlapja szerint 3 értéket kell írni a HEND mezőbe, hogy a "hiszterézis vége" 0 legyen, akkor a `driver_HEND=3` beállításával a 0 magas szintű értéket kapjuk.
it: Si noti che i fogli dati Trinamic a volte utilizzano un'espressione che può confondere un'impostazione di alto livello (come "fine isteresi") con un valore di campo di basso livello (ad esempio, "HEND"). In Klipper, `driver_XXX` e SET_TMC_FIELD impostano sempre il valore del campo di basso livello che viene effettivamente scritto nel driver. Quindi, ad esempio, se il foglio dati Trinamic afferma che è necessario scrivere un valore di 3 nel campo HEND per ottenere una "fine dell'isteresi" di 0, impostare `driver_HEND=3` per ottenere il valore di alto livello di 0.

source: Common Questions
es: <strong>Preguntas más frecuentes</strong>
hu: Gyakori kérdések
it: Domande comuni

source: I keep getting "Unable to read tmc uart 'stepper_x' register IFCNT" errors?
es: ¿Sigo recibiendo errores de “No se puede leer el registro IFCNT del tmc uart ‘stepper_x’” (“Unable to read tmc uart 'stepper_x' register IFCNT” en inglés)?
hu: Folyamatosan kap "Nem tudom olvasni a tmc uart 'stepper_x' regiszter IFCNT" hibákat?
it: Continuo a ricevere gli errori "Impossibile leggere tmc uart 'stepper_x' register IFCNT"?

source: This occurs when Klipper is unable to communicate with a tmc2208 or tmc2209 driver.
es: Esto ocurre cuando Klipper no puede comunicarse con un controlador tmc2208 o tmc2209.
hu: Ez akkor fordul elő, ha a Klipper nem tud kommunikálni egy TMC2208 vagy TMC2209 meghajtóval.
it: Ciò si verifica quando Klipper non è in grado di comunicare con un driver tmc2208 o tmc2209.

source: Make sure that the motor power is enabled, as the stepper motor driver generally needs motor power before it can communicate with the micro-controller.
es: Asegúrese de que la motor esté energizado, ya que el controlador del motor paso a paso generalmente necesita tener energía antes de poder comunicarse con el microcontrolador.
hu: Győződjön meg róla, hogy a motor tápellátása engedélyezve van, mivel a léptetőmotor-meghajtónak általában motoráramra van szüksége, mielőtt kommunikálni tudna a mikrokontrollerrel.
it: Assicurarsi che l'alimentazione del motore sia abilitata, poiché il driver del motore passo-passo generalmente necessita dell'alimentazione del motore prima di poter comunicare con il microcontrollore.

source: If this error occurs after flashing Klipper for the first time, then the stepper driver may have been previously programmed in a state that is not compatible with Klipper. To reset the state, remove all power from the printer for several seconds (physically unplug both USB and power plugs).
es: Si este error ocurre después de actualizar por flash (“flashing” en inglés) a Klipper por primera vez, entonces el controlador del motor paso a paso puede haber sido programado previamente en un estado que no es compatible con Klipper. Para reinicializar el estado, desconecte toda fuente de energía de la impresora por varios segundos (desconecte físicamente tanto el USB como los enchufes).
hu: Ha ez a hiba a Klipper első égetése után jelentkezik, akkor a léptető meghajtó korábban olyan állapotba programozódott, amely nem kompatibilis a Klipperrel. Az állapot visszaállításához néhány másodpercre távolítsa el a nyomtatót az áramellátástól (fizikailag húzza ki az USB-t és a hálózati csatlakozót).
it: Se questo errore si verifica dopo aver eseguito il flashing di Klipper per la prima volta, è possibile che il driver stepper sia stato precedentemente programmato in uno stato non compatibile con Klipper. Per ripristinare lo stato, rimuovere tutta l'alimentazione dalla stampante per alcuni secondi (scollegare fisicamente sia USB che le spine di alimentazione).

source: Otherwise, this error is typically the result of incorrect UART pin wiring or an incorrect Klipper configuration of the UART pin settings.
es: De lo contrario, este error suele ser el resultado de un cableado incorrecto del pin UART o una configuración incorrecta de Klipper de los ajustes del pin UART.
hu: Ellenkező esetben ez a hiba általában az UART-tű helytelen vezetékezésének vagy az UART-tűbeállítások helytelen Klipper konfigurációjának eredménye.
it: In caso contrario, questo errore è in genere il risultato di un cablaggio errato del pin UART o di una configurazione Klipper errata delle impostazioni del pin UART.

source: I keep getting "Unable to write tmc spi 'stepper_x' register ..." errors?
es: ¿Sigo recibiendo errores de "No se puede escribir al registro 'stepper_x' del tmc spi..." (“Unable to write tmc spi 'stepper_x' register ...” en inglés)?
hu: Folyamatosan kap "Nem lehet írni tmc spi "stepper_x" register ..." hibát?
it: Continuo a ricevere errori "Unable to write tmc spi 'stepper_x' register ..."?

source: This occurs when Klipper is unable to communicate with a tmc2130 or tmc5160 driver.
es: Esto ocurre cuando Klipper no puede comunicarse con un controlador tmc2130 o tmc5160.
hu: Ez akkor fordul elő, ha a Klipper nem tud kommunikálni egy TMC2208 vagy TMC2209 motorvezérlővel.
it: Ciò si verifica quando Klipper non è in grado di comunicare con un driver tmc2130 o tmc5160.

source: Otherwise, this error is typically the result of incorrect SPI wiring, an incorrect Klipper configuration of the SPI settings, or an incomplete configuration of devices on an SPI bus.
es: De lo contrario, este error suele ser el resultado de un cableado incorrecto en el bus SPI (del inglés Serial Peripheral Inerface), de errores en la configuración de los ajustes del bus SPI en Klipper o una configuración incompleta de los dispositivos en un bus SPI.
hu: Ellenkező esetben ez a hiba általában a helytelen SPI-vezetékezés, az SPI-beállítások helytelen Klipper-konfigurációja vagy az SPI-buszon lévő eszközök hiányos konfigurációjának eredménye.
it: In caso contrario, questo errore è in genere il risultato di un cablaggio SPI errato, una configurazione Klipper errata delle impostazioni SPI o una configurazione incompleta dei dispositivi su un bus SPI.

source: Note that if the driver is on a shared SPI bus with multiple devices then be sure to fully configure every device on that shared SPI bus in Klipper. If a device on a shared SPI bus is not configured, then it may incorrectly respond to commands not intended for it and corrupt the communication to the intended device. If there is a device on a shared SPI bus that can not be configured in Klipper, then use a [static_digital_output config section](Config_Reference.md#static_digital_output) to set the CS pin of the unused device high (so that it will not attempt to use the SPI bus). The board's schematic is often a useful reference for finding which devices are on an SPI bus and their associated pins.
es: Tenga en cuenta que si el controlador está en un bus SPI compartido con varios dispositivos, debe asegurarse de configurar completamente todos los dispositivos en ese bus SPI compartido en Klipper. Si un dispositivo en un bus SPI compartido no está configurado, puede responder incorrectamente a comandos no destinados a él y corromper la comunicación con el dispositivo previsto. Si hay un dispositivo en un bus SPI compartido que no se puede configurar en Klipper, entonces use una [sección de configuración static_digital_output](Config_Reference.md#static_digital_output) para ajustar el pin CS del dispositivo no utilizado a alto (para que no intente usar el bus SPI). El esquema de la placa es a menudo una referencia útil para encontrar qué dispositivos están en un bus SPI y sus pines asociados.
hu: Ne feledje, hogy ha a motorvezérlő egy megosztott SPI-buszon van több eszközzel, akkor győződjön meg róla, hogy teljes mértékben konfigurálja a Klipperben lévő megosztott SPI-busz minden eszközét. Ha egy megosztott SPI-buszon lévő eszköz nincs konfigurálva, akkor előfordulhat, hogy helytelenül reagál a nem erre szánt parancsokra, és meghiúsul a kívánt eszközzel folytatott kommunikáció. Ha van olyan eszköz egy megosztott SPI-buszon, amelyet nem lehet konfigurálni a Klipperben, akkor a [static_digital_output konfigurációs szakasz](Config_Reference.md#static_digital_output) segítségével állítsa magasra a nem használt eszköz CS-pinjét (hogy ne kísérelje meg használni az SPI-buszt). A tábla vázlata gyakran hasznos referencia annak megállapításához, hogy mely eszközök vannak egy SPI-buszon és a hozzájuk tartozó tűkön.
it: Nota che se il driver si trova su un bus SPI condiviso con più dispositivi, assicurati di configurare completamente ogni dispositivo su quel bus SPI condiviso in Klipper. Se un dispositivo su un bus SPI condiviso non è configurato, potrebbe rispondere in modo errato a comandi non previsti e danneggiare la comunicazione con il dispositivo previsto. Se è presente un dispositivo su un bus SPI condiviso che non può essere configurato in Klipper, utilizzare una [sezione di configurazione static_digital_output](Config_Reference.md#static_digital_output) per impostare il pin CS del dispositivo inutilizzato alto (in modo che non tenti utilizzare il bus SPI). Lo schema della scheda è spesso un utile riferimento per trovare quali dispositivi si trovano su un bus SPI e i pin associati.

source: Why did I get a "TMC reports error: ..." error?
es: ¿Por qué recibí un error "TMC reports error: ..."?
hu: Miért kaptam egy "TMC jelentés hiba: ..." hibaüzenetet?
it: Perché ho ricevuto un errore "TMC reports error: ..."?

source: This type of error indicates the TMC driver detected a problem and has disabled itself. That is, the driver stopped holding its position and ignored movement commands. If Klipper detects that an active driver has disabled itself, it will transition the printer into a "shutdown" state.
es: Este tipo de error indica que el controlador TMC detectó un problema y se ha desactivado a sí mismo. Es decir, el controlador dejó de mantener su posición e ignoró los comandos de movimiento. Si Klipper detecta que un controlador activo se ha desactivado a sí mismo, hará que la impresora pase a un estado de "apagado".
hu: Az ilyen típusú hiba azt jelzi, hogy a TMC-motorvezérlő hibát észlelt, és letiltotta magát. Vagyis a meghajtó abbahagyta a pozícióját, és figyelmen kívül hagyta a mozgási parancsokat. Ha a Klipper azt észleli, hogy egy aktív motorvezérlő letiltotta magát, a nyomtatót "leállítás" állapotba állítja.
it: Questo tipo di errore indica che il driver TMC ha rilevato un problema e si è disabilitato. Cioè, il conducente ha smesso di mantenere la sua posizione e ha ignorato i comandi di movimento. Se Klipper rileva che un driver attivo si è disabilitato, la stampante passerà allo stato di "spegnimento".

source: Some common errors and tips for diagnosing them:
es: Algunos errores comunes y consejos para diagnosticarlos:
hu: Néhány gyakori hiba és tipp a diagnosztizáláshoz:
it: Alcuni errori comuni e suggerimenti per diagnosticarli:

source: It's also possible that a **TMC reports error** shutdown occurs due to SPI errors that prevent communication with the driver (on tmc2130, tmc5160, or tmc2660). If this occurs, it's common for the reported driver status to show `00000000` or `ffffffff` - for example: `TMC reports error: DRV_STATUS: ffffffff ...` OR `TMC reports error: READRSP@RDSEL2: 00000000 ...`. Such a failure may be due to an SPI wiring problem or may be due to a self-reset or failure of the TMC driver.
es: También es posible que ocurra un apagado del tipo **TMC informa de un error** (“**TMC reports error**” en inglés) debido a errores del bus SPI que impidan la comunicación con el controlador (en tmc2130, tmc5160, o tmc2660). Si esto ocurre, es común que el estado del controlador reportado muestre `00000000` o `ffffffff`, por ejemplo: `TMC informa de un error: DRV_STATUS: ffffffff ...` (`TMC reports error: DRV_STATUS: ffffffff ...` en inglés) O `TMC informa de un error: READRSP@RDSEL2: 00000000 ...` (`TMC reports error: READRSP@RDSEL2: 00000000 ...` en inglés). Tal falla puede deberse a un problema con el cableado del SPI o puede deberse a un reinicio automático o una falla del controlador TMC.
hu: Az is lehetséges, hogy a **TMC hiba** leállítása SPI hibák miatt következik be, amelyek megakadályozzák a motorvezérlőkkel való kommunikációt (TMC2130, TMC5160 vagy TMC2660). Ebben az esetben gyakori, hogy a jelentett motorvezérlő állapota `000000000` vagy `ffffffffff` - például: `TMC hibát jelent: DRV_STATUS: ffffffff ... ` VAGY `TMC jelentések hiba: READRSP@RDSEL2: 00000000 ... `. Az ilyen hiba oka lehet egy SPI vezetékezési probléma, vagy lehet a visszaállítás, vagy a TMC motorvezérlő.
it: È anche possibile che si verifichi un arresto **TMC segnala errore** a causa di errori SPI che impediscono la comunicazione con il driver (su tmc2130, tmc5160 o tmc2660). Se ciò si verifica, è normale che lo stato del driver riportato mostri `00000000` o `ffffffff`, ad esempio: `TMC reports error: DRV_STATUS: ffffffff ...` O `TMC reports error: READRSP@RDSEL2: 00000000 ... `. Tale errore può essere dovuto a un problema di cablaggio SPI o può essere dovuto a un ripristino automatico o a un guasto del driver TMC.

source: The [Trinamic website](https://www.trinamic.com/) has guides on configuring the drivers. These guides are often technical, low-level, and may require specialized hardware. Regardless, they are the best source of information.
es: El [sitio web de Trinamic](https://www.trinamic.com/) tiene guías sobre la configuración de los controladores. Estas guías suelen ser técnicas, de bajo nivel y pueden requerir hardware especializado. En cualquier caso, son la mejor fuente de información.
hu: A [Trinamic weboldal](https://www.trinamic.com/) tartalmaz útmutatókat a motorvezérlők konfigurálásához. Ezek az útmutatók gyakran technikai jellegűek, alacsony szintűek, és speciális hardvert igényelhetnek. Ettől függetlenül ez a legjobb információforrás.
it: Il [sito web Trinamic](https://www.trinamic.com/) contiene guide sulla configurazione dei driver. Queste guide sono spesso tecniche, di basso livello e potrebbero richiedere hardware specializzato. In ogni caso, sono la migliore fonte di informazioni.

source: [tmc2209 stepper_x] diag_pin: ^PA1 # Set to MCU pin connected to TMC DIAG pin driver_SGTHRS: 255 # 255 is most sensitive value, 0 is least sensitive ... [stepper_x] endstop_pin: tmc2209_stepper_x:virtual_endstop homing_retract_dist: 0 ...
es: [tmc2209 stepper_x] diag_pin: ^PA1 # Ajustar a pin de MCU conectado a pin de TMC DIAG driver_SGTHRS: 255 # 255 es el valor más sensible, 0 es el menos sensible ... [stepper_x] endstop_pin: tmc2209_stepper_x:virtual_endstop homing_retract_dist: 0 ...
hu: [tmc2209 stepper_x] diag_pin: ^PA1 # A TMC DIAG tűhöz csatlakoztatott MCU tűre állítva. driver_SGTHRS: 255 # 255 a legérzékenyebb érték, 0 a legkevésbé érzékeny. ... [stepper_x] endstop_pin: tmc2209_stepper_x:virtual_endstop homing_retract_dist: 0 ...
it: [tmc2209 stepper_x] diag_pin: ^PA1 # Impostare sul pin MCU collegato al pin TMC DIAG driver_SGTHRS: 255 #255 è il valore più sensibile, 0 è il meno sensibile ... [stepper_x] endstop_pin: tmc2209_stepper_x:virtual_endstop homing_retract_dist: 0 ...
