Repository: Klipper3d/klipper-translations
Catalog: */locales/*/LC_MESSAGES/Installation.po
Languages: it

source: These instructions assume the software will run on a Raspberry Pi computer in conjunction with OctoPrint. It is recommended that a Raspberry Pi 2, 3, or 4 computer be used as the host machine (see the [FAQ](FAQ.md#can-i-run-klipper-on-something-other-than-a-raspberry-pi-3) for other machines).
it: Queste istruzioni partono dal presupposto che Klipper girerà su un Raspberry Pi con OctoPrint. È consigliato l'utilizzo di un Raspberry Pi 2, 3 o 4 (vedi la [FAQ](FAQ.md#can-i-run-klipper-on-something-other-than-a-raspberry-pi-3) per utilizzare un hardware diverso).

source: Prepping an OS image
it: Preparazione dell'immagine del sistema operativo

source: After installing OctoPi and upgrading OctoPrint, it will be necessary to ssh into the target machine to run a handful of system commands. If using a Linux or MacOS desktop, then the "ssh" software should already be installed on the desktop. There are free ssh clients available for other desktops (eg, [PuTTY](https://www.chiark.greenend.org.uk/~sgtatham/putty/)). Use the ssh utility to connect to the Raspberry Pi (ssh pi@octopi -- password is "raspberry") and run the following commands:
it: Dopo aver installato OctoPi ed aver aggiornato OctoPrint all'ultima versione sarà necessario loggarsi via ssh sul Raspberry (o altra macchina scelta per far girare klipper) per eseguire una manciata di comandi. Se stai utilizzando un sistema Linux o MacOS desktop, il programma "ssh" potrebbe già essere installato sul tuo sistema. Esistono vari client ssh disponibili (ad esempio [PuTTY](https://www.chiark.greenend.org.uk/~sgtatham/putty/)). Usa il programma ssh per connetterti al Raspberry Pi (ssh pi@octopi -- la password è "raspberry") ed esegui questi comandi:

source: The above will download Klipper, install some system dependencies, setup Klipper to run at system startup, and start the Klipper host software. It will require an internet connection and it may take a few minutes to complete.
it: Questo scaricherà Klipper, installerà alcune dipendenze, imposterà Klipper per essere eseguito all'avvio del sistema e avvierò il programma host Klipper. Sarà necessario che il Raspberry abbia accesso ad internet e richederà alcuni minuti.

source: Building and flashing the micro-controller
it: Compilare il firmware e flashare il microcontrollore

source: To compile the micro-controller code, start by running these commands on the Raspberry Pi:
it: Per compilare il firmware per il microcontrollore, iniziamo lanciando questi comandi sul Raspberry:

source: Select the appropriate micro-controller and review any other options provided. Once configured, run:
it: Seleziona il microcontrollore dalla lista e verifica le opzioni possibili. Una volta impostato tutto, esegui:

source: It is necessary to determine the serial port connected to the micro-controller. For micro-controllers that connect via USB, run the following:
it: Ora bisogna capire quale è la porta seriale collegata al microcontrollore. Se la tua scheda è connessa via USB, esegui questo comando:

source: It should report something similar to the following:
it: Dovrebbe venire riportato qualcosa di simile a questo:

source: It's common for each printer to have its own unique serial port name. This unique name will be used when flashing the micro-controller. It's possible there may be multiple lines in the above output - if so, choose the line corresponding to the micro-controller (see the [FAQ](FAQ.md#wheres-my-serial-port) for more information).
it: È abbastanza comune che ogni stampante 3D abbia il suo nome univoco elencato come porta seriale. Questo nome sarà utilizzato quando flasheremo il microcontrollore. È possibile che ci possano essere più righe nell'elenco sopraccitato, se è così seleziona la riga cosrrispondente al microcontrollore (vedi le [FAQ](FAQ.md#wheres-my-serial-port) per maggiori informazioni).

source: For common micro-controllers, the code can be flashed with something similar to:
it: Per i microcontrollori più comuni, il firmware può essere flashato con comandi tipo:

source: Be sure to update the FLASH_DEVICE with the printer's unique serial port name.
it: Assicurati di mettere al posto di FLASH_DEVICE il nome della porta seriale associato alla stampante.

source: When flashing for the first time, make sure that OctoPrint is not connected directly to the printer (from the OctoPrint web page, under the "Connection" section, click "Disconnect").
it: Quando flashi il firmware per la prima volta verifica che OctoPrint non sia connesso alla stampante (dall'interfaccia di OctoPrint, nella sezione "Connection", clicca "Disconnect").

source: Configuring OctoPrint to use Klipper
it: Configurare OctoPrint per usare Klipper

source: The OctoPrint web server needs to be configured to communicate with the Klipper host software. Using a web browser, login to the OctoPrint web page and then configure the following items:
it: Il sistema OctoPrint deve essere configurato per comunicare con il sistema Klipper. Loggati su OctoPrint e confogura queste parti:

source: Navigate to the Settings tab (the wrench icon at the top of the page). Under "Serial Connection" in "Additional serial ports" add "/tmp/printer". Then click "Save".
it: Naviga nella scheda Impostazioni (la chiave inglese in cima alla pagina). Dentro "Serial Connection", "Additional serial ports" aggiungi "/tmp/printer". Poi fai "Save".

source: Enter the Settings tab again and under "Serial Connection" change the "Serial Port" setting to "/tmp/printer".
it: Vai nella scheda Impostazioni e sotto "Serial Connection" cambia la "Serial Port" in "/tmp/printer".

source: In the Settings tab, navigate to the "Behavior" sub-tab and select the "Cancel any ongoing prints but stay connected to the printer" option. Click "Save".
it: Nella scheda Impostazioni, vai in "Behavior" e seleziona l'opzione "Cancel any ongoing prints but stay connected to the printer", poi "Save".

source: From the main page, under the "Connection" section (at the top left of the page) make sure the "Serial Port" is set to "/tmp/printer" and click "Connect". (If "/tmp/printer" is not an available selection then try reloading the page.)
it: Dalla pagina principale, nella sezione "Connection" in alto a sinistra, verifica che il campo "Serial Port" sia "/tmp/printer" e clicca "Connect". Se l'opzione /tmp/printer non è visualizzata prova a ricaricare la pagina.

source: Once connected, navigate to the "Terminal" tab and type "status" (without the quotes) into the command entry box and click "Send". The terminal window will likely report there is an error opening the config file - that means OctoPrint is successfully communicating with Klipper. Proceed to the next section.
it: Una volta connesso, vai nella scheda "Terminal" e scrivi il comando "status" (senza virgolette) nella casella per i comandi e clicca "Send". La finestra del terminare probabilmente mostrerà un messaggio di errore sull'apertura del file config, questo significa che OctoPrint sta comunicando correttamente con Klipper. Possiamo proseguire.

source: Configuring Klipper
it: Configurare Klipper

source: Arguably the easiest way to update the Klipper configuration file is to use a desktop editor that supports editing files over the "scp" and/or "sftp" protocols. There are freely available tools that support this (eg, Notepad++, WinSCP, and Cyberduck). Use one of the example config files as a starting point and save it as a file named "printer.cfg" in the home directory of the pi user (ie, /home/pi/printer.cfg).
it: Probabilmente il modo più semplice per modificare il file di configurazione di Klipper è usare un editor di testo che supportti l'apertura di file su protocollo "SCP" e/o "SFTP". Esistono molti tool gratuiti che hanno questa caratteristica (es. Notepad++, WinSCP, Cyberduck). Usa i file config di esempio come punto di partenza e salva il file con il nome "printer.cfg" nella cartella home dell'utente pi (solitamente /home/pi/printer.cfg).

source: Alternatively, one can also copy and edit the file directly on the Raspberry Pi via ssh - for example:
it: In alternativa puoi copiare e modificare il file direttamente sul Raspberry Pi via SSH - per esempio:

source: Make sure to review and update each setting that is appropriate for the hardware.
it: Controlla bene e modifica ogni settaggio appropriato per il tuo hardware.

source: It's common for each printer to have its own unique name for the micro-controller. The name may change after flashing Klipper, so rerun the `ls /dev/serial/by-id/*` command and then update the config file with the unique name. For example, update the `[mcu]` section to look something similar to:
it: È abbastanza comune che ogni stampante 3D abbia il suo nome univoco elencato come porta seriale, tale nome potrebbe cambiare dopo aver flashato Klipper quindi riesegui il comando `ls /dev/serial/by-id/*` e modifica il file config con il nome univoco. Ad esempio aggiorna la sezione `[mcu]` in modo che assomigli a:

source: After creating and editing the file it will be necessary to issue a "restart" command in the OctoPrint web terminal to load the config. A "status" command will report the printer is ready if the Klipper config file is successfully read and the micro-controller is successfully found and configured. It is not unusual to have configuration errors during the initial setup - update the printer config file and issue "restart" until "status" reports the printer is ready.
it: Dopo aver creato e personalizzato il file config è necessario mandare il comando "restart" attraverso il terminale di OctoPrint per rendere effettiva la confogurazione. Il comando "status" mosterà che la stampante è pronta se il file config è stato letto correttamente, il mictrocontrollore è stato rilevato e configurato. Non è raro di ritrovarsi con errori di configurazione durante il setup iniziale, nel caso aggiorna il file config e invia il comando restart finché lo status non diventa ready.

source: Klipper reports error messages via the OctoPrint terminal tab. The "status" command can be used to re-report error messages. The default Klipper startup script also places a log in **/tmp/klippy.log** which provides more detailed information.
it: Klipper riferisce i messaggi di errore tramite il terminale di OctoPrint. Il comando "status" può essere usato per visualizzare nuovamente eventuali messaggi di errore. Lo script di startup di default di Klipper genererà un log sotto **/tmp/klippy.log**, questo fornirà informazioni più dettagliate.

source: In addition to common g-code commands, Klipper supports a few extended commands - "status" and "restart" are examples of these commands. Use the "help" command to get a list of other extended commands.
it: Oltre i comandi in stile g-code, Klipper supporta alcuni comandi aggiuntivi ("status" e "restart" sono alcuni esempi). Usa il comando "help" per avere una lista di altri comandi aggiuntivi.

source: Contacting the developers
it: Contattare gli svilluppatori

source: Be sure to see the [FAQ](FAQ.md) for answers to some common questions. See the [contact page](Contact.md) to report a bug or to contact the developers.
it: Assicurati di vedere le [FAQ](FAQ.md) per le risposte ad alcune domande comuni. Vedi la [contact page](Contact.md) per segnalare un bug o per contattare gli sviluppatori.

source: Installation
it: Installazione

source: Klipper currently supports a number of Atmel ATmega based micro-controllers, [ARM based micro-controllers](Features.md#step-benchmarks), and [Beaglebone PRU](Beaglebone.md) based printers.
it: Klipper attualmente supporta un certo numero di microcontrollori basati su Atmel ATmega, [ARM based micro-controllers](Features.md#step-benchmarks), e stampanti basate su [Beaglebone PRU](Beaglebone.md).

source: Start by installing [OctoPi](https://github.com/guysoft/OctoPi) on the Raspberry Pi computer. Use OctoPi v0.17.0 or later - see the [OctoPi releases](https://github.com/guysoft/OctoPi/releases) for release information. One should verify that OctoPi boots and that the OctoPrint web server works. After connecting to the OctoPrint web page, follow the prompt to upgrade OctoPrint to v1.4.2 or later.
it: Iniziate installando [OctoPi](https://github.com/guysoft/OctoPi) sul computer Raspberry Pi. Usa OctoPi v0.17.0 o successivo - vedi [OctoPi releases](https://github.com/guysoft/OctoPi/releases) per informazioni sulla versione. Si dovrebbe verificare che OctoPi si avvii e che il server web OctoPrint funzioni. Dopo essersi collegati alla pagina web OctoPrint, segui la richiesta di aggiornare OctoPrint alla v1.4.2 o successiva.
