Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/API_Server.po
Languages: it, ko

source: If the provided G-Code script raises an error, then an error response is generated. However, if the G-Code command produces terminal output, that terminal output is not provided in the response. (Use the "gcode/subscribe_output" endpoint to obtain G-Code terminal output.)
it: Se lo script G-Code fornito genera un errore, allora viene generata una risposta di errore. Tuttavia, se il comando G-Code produce un output del terminale, tale output del terminale non viene fornito nella risposta. (Utilizzare l'endpoint "gcode/subscribe_output" per ottenere l'output del terminale G-Code.)
ko: 만일 제공된 G-code 스크립트가 에러를 내면, 에러응답이 생성됩니다. 그러나 만일 G-code 명령이 터미널 결과값을 생성해내면 그 터미널 결과값은 응답값으로 제공되지 않습니다. (G-code 터미널 결과값을 얻고자 한다면 "gcode/subscribe_output" endpoint 를 사용하십시오)

source: If there is a G-Code command being processed when this request is received, then the provided script will be queued. This delay could be significant (eg, if a G-Code wait for temperature command is running). The JSON response message is sent when the processing of the script fully completes.
it: Se c'è un comando G-Code in elaborazione quando viene ricevuta questa richiesta, lo script fornito verrà messo in coda. Questo ritardo potrebbe essere significativo (ad esempio, se è in esecuzione un comando di attesa del codice G per la temperatura). Il messaggio di risposta JSON viene inviato al completamento dell'elaborazione dello script.
ko: 만일 요청이 받아들여졌을때 프로세싱되는 G-code 명령이 있다면, 제공된 스크립트는 순서를 기다리게 될 것이다. 이 지연은 매우 중요할 수 있다. (예를 들어 온도 명령을 기다리는 G-code 가 작동될 때와 같이 말이다) JSON 응답 메시지는 스크립트의 프로세싱을 완전히 끝마쳤을때 보내진다.

source: gcode/restart
ko: gcode/재시작

source: This endpoint allows one to request a restart - it is similar to running the G-Code "RESTART" command. For example: `{"id": 123, "method": "gcode/restart"}`
it: Questo endpoint consente di richiedere un riavvio: è simile all'esecuzione del comando "RESTART" del codice G. Ad esempio: `{"id": 123, "method": "gcode/restart"}`
ko: 이 endpoint 는 재시작 요청을 수행할 수 있게 해준다. 이것은 "RESTART" G-Code 명령 실행과 유사하다. 예를 들면 : `{"id": 123, "method": "gcode/restart"}`

source: As with the "gcode/script" endpoint, this endpoint only completes after any pending G-Code commands complete.
it: Come con l'endpoint "gcode/script", questo endpoint viene completato solo dopo il completamento di tutti i comandi G-Code in sospeso.
ko: "gcode/script" endpoint 와 같이 사용할 때 이 endpoint 는 지연된 G-Code 명령들이 완료된 후에만 오직 끝마칠 수 있다.

source: gcode/firmware_restart
ko: gcode/펌웨어 재실행

source: This is similar to the "gcode/restart" endpoint - it implements the G-Code "FIRMWARE_RESTART" command. For example: `{"id": 123, "method": "gcode/firmware_restart"}`
it: Questo è simile all'endpoint "gcode/restart": implementa il comando G-Code "FIRMWARE_RESTART". Ad esempio: `{"id": 123, "method": "gcode/firmware_restart"}`
ko: 이것은 "gcode/restart" endpoint 와 유사하다. - 그것도 "FIRMWARE_RESTART" G-Code 명령을 수행합니다. 예를 들면 : `{"id": 123, "method": "gcode/firmware_restart"}`

source: gcode/subscribe_output
ko: gcode/서브스크라이브_출력

source: This endpoint is used to subscribe to G-Code terminal messages that are generated by Klipper. For example: `{"id": 123, "method": "gcode/subscribe_output", "params": {"response_template":{}}}` might later produce asynchronous messages such as: `{"params": {"response": "// Klipper state: Shutdown"}}`
it: Questo endpoint viene utilizzato per iscriversi ai messaggi del terminale G-Code generati da Klipper. Ad esempio: `{"id": 123, "method": "gcode/subscribe_output", "params": {"response_template":{}}}` potrebbe in seguito produrre messaggi asincroni come: `{"params": { "response": "// Klipper state: Shutdown"}}`
ko: 이 endpoint 는 클리퍼에 의해 생성된 G-code 터미널 메시지를 표시할 때 사용됩니다. 예를 들어 : `{"id": 123, "method": "gcode/subscribe_output", "params": {"response_template":{}}}` 이것은 후에 다음과 같은 비동기형 메시지를 내보낼 수 있습니다. : `{"params": {"response": "// Klipper state: Shutdown"}}`

source: This endpoint is intended to support human interaction via a "terminal window" interface. Parsing content from the G-Code terminal output is discouraged. Use the "objects/subscribe" endpoint to obtain updates on Klipper's state.
it: Questo endpoint ha lo scopo di supportare l'interazione umana tramite un'interfaccia "finestra di terminale". L'analisi del contenuto dall'output del terminale G-Code è sconsigliata. Usa l'endpoint "objects/subscribe" per ottenere aggiornamenti sullo stato di Klipper.
ko: 이 endpoint 는 터미널창 인터페이스를 통해 인간과 상호작용을 하도록 도와줄 수 있게 합니다. G-code 터미널 출력으로 부터의 파싱 내용은 낙담케(?) 된다. 클리퍼 상태에 대한 업데이트 내용을 얻고자 할 때는 "objects/subscribe" endpoint 를 사용하라.

source: pause_resume/cancel
ko: 멈춤_재개/취소

source: This endpoint is similar to running the "PRINT_CANCEL" G-Code command. For example: `{"id": 123, "method": "pause_resume/cancel"}`
it: Questo endpoint è simile all'esecuzione del comando G-Code "PRINT_CANCEL". Ad esempio: `{"id": 123, "method": "pause_resume/cancel"}`
ko: 이 endpoint 는 "PRINT_CANCEL" G-Code 명령을 실행하는 것과 유사하다. 예를 들어 : `{"id": 123, "method": "pause_resume/cancel"}`

source: pause_resume/pause
ko: 멈춤_재개/멈춤

source: This endpoint is similar to running the "PAUSE" G-Code command. For example: `{"id": 123, "method": "pause_resume/pause"}`
it: Questo endpoint è simile all'esecuzione del comando G-Code "PAUSE". Ad esempio: `{"id": 123, "method": "pause_resume/pause"}`
ko: 이 endpoint 는 "PAUSE" G-Code 명령을 실행하는 것과 유사하다. 예를 들어 : `{"id": 123, "method": "pause_resume/pause"}`

source: pause_resume/resume
ko: 멈춤_재개/재개

source: This endpoint is similar to running the "RESUME" G-Code command. For example: `{"id": 123, "method": "pause_resume/resume"}`
it: Questo endpoint è simile all'esecuzione del comando G-Code "RESUME". Ad esempio: `{"id": 123, "method": "pause_resume/resume"}`
ko: 이 endpoint 는 "RESUME" G-Code 명령을 실행하는 것과 유사하다. 예를 들어 : `{"id": 123, "method": "pause_resume/resume"}`

source: query_endstops/status
ko: 쿼리_엔드스탑/상태

source: This endpoint will query the active endpoints and return their status. For example: `{"id": 123, "method": "query_endstops/status"}` might return: `{"id": 123, "result": {"y": "open", "x": "open", "z": "TRIGGERED"}}`
it: Questo endpoint eseguirà una query sugli endpoint attivi e restituirà il loro stato. Ad esempio: `{"id": 123, "method": "query_endstops/status"}` potrebbe restituire: `{"id": 123, "result": {"y": "open", "x": "aperto", "z": "TRIGGERED"}}`
ko: 이 endpoint 는 실행 endpoint들을 쿼리하고 그들의 상태를 반환해줄것이다. 예를 들어 : `{"id": 123, "method": "query_endstops/status"}` 이것은 다음을 반환할 것이다. : `{"id": 123, "result": {"y": "open", "x": "open", "z": "TRIGGERED"}}`

source: API server
it: Server API
ko: API 서버

source: This endpoint is used to subscribe to Klipper's internal stepper queue_step command stream for a stepper. Obtaining these low-level motion updates may be useful for diagnostic and debugging purposes. Using this endpoint may increase Klipper's system load.
it: Questo endpoint viene utilizzato per iscriversi al flusso di comandi queue_step interno di Klipper per uno stepper. L'ottenimento di questi aggiornamenti di movimento di basso livello può essere utile per scopi diagnostici e di debug. L'utilizzo di questo endpoint può aumentare il carico di sistema di Klipper.

source: A request may look like: `{"id": 123, "method":"motion_report/dump_stepper", "params": {"name": "stepper_x", "response_template": {}}}` and might return: `{"id": 123, "result": {"header": ["interval", "count", "add"]}}` and might later produce asynchronous messages such as: `{"params": {"first_clock": 179601081, "first_time": 8.98, "first_position": 0, "last_clock": 219686097, "last_time": 10.984, "data": [[179601081, 1, 0], [29573, 2, -8685], [16230, 4, -1525], [10559, 6, -160], [10000, 976, 0], [10000, 1000, 0], [10000, 1000, 0], [10000, 1000, 0], [9855, 5, 187], [11632, 4, 1534], [20756, 2, 9442]]}}`
it: Una richiesta può essere simile a: `{"id": 123, "method":"motion_report/dump_stepper", "params": {"name": "stepper_x", "response_template": {}}}` e potrebbe restituire: `{"id": 123, "result": {"header": ["interval", "count", "add"]}}` e potrebbe in seguito produrre messaggi asincroni come: `{"params": {" first_clock": 179601081, "first_time": 8.98, "first_position": 0, "last_clock": 219686097, "last_time": 10.984, "data": [[179601081, 1, 0], [29573, 2, -8685] , [16230, 4, -1525], [10559, 6, -160], [10000, 976, 0], [10000, 1000, 0], [10000, 1000, 0], [10000, 1000, 0] , [9855, 5, 187], [11632, 4, 1534], [20756, 2, 9442]]}}`

source: The "header" field in the initial query response is used to describe the fields found in later "data" responses.
it: Il campo "intestazione" nella risposta alla query iniziale viene utilizzato per descrivere i campi trovati nelle risposte "dati" successive.

source: This endpoint is used to subscribe to Klipper's internal "trapezoid motion queue". Obtaining these low-level motion updates may be useful for diagnostic and debugging purposes. Using this endpoint may increase Klipper's system load.
it: Questo endpoint viene utilizzato per iscriversi alla "coda di movimento trapezoidale" interna di Klipper. L'ottenimento di questi aggiornamenti di movimento di basso livello può essere utile per scopi diagnostici e di debug. L'utilizzo di questo endpoint può aumentare il carico di sistema di Klipper.

source: A request may look like: `{"id": 123, "method": "motion_report/dump_trapq", "params": {"name": "toolhead", "response_template":{}}}` and might return: `{"id": 1, "result": {"header": ["time", "duration", "start_velocity", "acceleration", "start_position", "direction"]}}` and might later produce asynchronous messages such as: `{"params": {"data": [[4.05, 1.0, 0.0, 0.0, [300.0, 0.0, 0.0], [0.0, 0.0, 0.0]], [5.054, 0.001, 0.0, 3000.0, [300.0, 0.0, 0.0], [-1.0, 0.0, 0.0]]]}}`
it: Una richiesta può essere simile a: `{"id": 123, "method": "motion_report/dump_trapq", "params": {"name": "toolhead", "response_template":{}}}` e potrebbe restituire: `{"id": 1, "result": {"header": ["time", "duration", "start_velocity", "acceleration", "start_position", "direction"]}}` e potrebbero in seguito produrre messaggi asincroni quali: `{"params": {"data": [[4.05, 1.0, 0.0, 0.0, [300.0, 0.0, 0.0], [0.0, 0.0, 0.0]], [5.054, 0.001, 0.0, 3000.0 , [300.0, 0.0, 0.0], [-1.0, 0.0, 0.0]]]}}`

source: This endpoint is used to subscribe to ADXL345 accelerometer data. Obtaining these low-level motion updates may be useful for diagnostic and debugging purposes. Using this endpoint may increase Klipper's system load.
it: Questo endpoint viene utilizzato per la sottoscrizione ai dati dell'accelerometro ADXL345. L'ottenimento di questi aggiornamenti di movimento di basso livello può essere utile per scopi diagnostici e di debug. L'utilizzo di questo endpoint può aumentare il carico di sistema di Klipper.

source: A request may look like: `{"id": 123, "method":"adxl345/dump_adxl345", "params": {"sensor": "adxl345", "response_template": {}}}` and might return: `{"id": 123,"result":{"header":["time","x_acceleration","y_acceleration", "z_acceleration"]}}` and might later produce asynchronous messages such as: `{"params":{"overflows":0,"data":[[3292.432935,-535.44309,-1529.8374,9561.4], [3292.433256,-382.45935,-1606.32927,9561.48375]]}}`
it: Una richiesta può essere simile a: `{"id": 123, "method":"adxl345/dump_adxl345", "params": {"sensor": "adxl345", "response_template": {}}}` e potrebbe restituire: `{"id": 123,"result":{"header":["time","x_acceleration","y_acceleration", "z_acceleration"]}}` e potrebbe in seguito produrre messaggi asincroni come: `{"params ":{"overflow":0,"data":[[3292.432935,-535.44309,-1529.8374,9561.4], [3292.433256,-382.45935,-1606.32927,9561.48375]]}}`

source: This endpoint is used to subscribe to [angle sensor data](Config_Reference.md#angle). Obtaining these low-level motion updates may be useful for diagnostic and debugging purposes. Using this endpoint may increase Klipper's system load.
it: Questo endpoint viene utilizzato per iscriversi a [dati del sensore angolare](Config_Reference.md#angle). L'ottenimento di questi aggiornamenti di movimento di basso livello può essere utile per scopi diagnostici e di debug. L'utilizzo di questo endpoint può aumentare il carico di sistema di Klipper.

source: A request may look like: `{"id": 123, "method":"angle/dump_angle", "params": {"sensor": "my_angle_sensor", "response_template": {}}}` and might return: `{"id": 123,"result":{"header":["time","angle"]}}` and might later produce asynchronous messages such as: `{"params":{"position_offset":3.151562,"errors":0, "data":[[1290.951905,-5063],[1290.952321,-5065]]}}`
it: Una richiesta può essere simile a: `{"id": 123, "method":"angle/dump_angle", "params": {"sensor": "my_angle_sensor", "response_template": {}}}` e potrebbe restituire: `{"id": 123,"result":{"header":["time","angle"]}}` e potrebbe in seguito produrre messaggi asincroni come: `{"params":{"position_offset":3.151562 ,"errori":0, "dati":[[1290.951905,-5063],[1290.952321,-5065]]}}`

source: See the [Moonraker](https://github.com/Arksine/moonraker) project for a popular tool that can forward HTTP requests to Klipper's API Server Unix Domain Socket.
it: Consulta il progetto [Moonraker](https://github.com/Arksine/moonraker) per uno strumento popolare in grado di inoltrare richieste HTTP all'API Server Unix Domain Socket di Klipper.
