Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/API_Server.po
Languages: it, ko

source: This document describes Klipper's Application Programmer Interface (API). This interface enables external applications to query and control the Klipper host software.
it: Questo documento descrive l'Application Programmer Interface (API) di Klipper. Questa interfaccia consente alle applicazioni esterne di interrogare e controllare il software host Klipper.
ko: 이 문서는 클리퍼 API 에 대해 기술하고 있습니다. 이 인터페이스는 외부 어플리케이션을 쿼리할 수 있게 해주고 클리퍼 호스트 소프트웨어를 조정할 수 있게 해줍니다.

source: Enabling the API socket
it: Abilitazione del socket API
ko: API Socket 활성화

source: In order to use the API server, the klippy.py host software must be started with the `-a` parameter. For example:
it: Per utilizzare il server API, il software host klippy.py deve essere avviato con il parametro `-a`. Per esempio:
ko: API 서버를 사용하기 위해서, klippy.py 호스트 소프트웨어가 `-a` 파라메터와 함께 시작되어야 합니다. 예를 들어:

source: This causes the host software to create a Unix Domain Socket. A client can then open a connection on that socket and send commands to Klipper.
it: Ciò fa sì che il software host crei un socket di dominio Unix. Un client può quindi aprire una connessione su quel socket e inviare comandi a Klipper.
ko: 이는 호스트 소프트웨어가 Unix Domain Socket 을 생성하도록 하며 그 이후 클라이언트가 그 Socket의 연결을 오픈하고, 클리퍼에서 명령을 보낼 수 있습니다.

source: Request format
it: Formato richiesta
ko: 요청 포맷

source: Messages sent and received on the socket are JSON encoded strings terminated by an ASCII 0x03 character:
it: I messaggi inviati e ricevuti sul socket sono stringhe codificate JSON terminate da un carattere ASCII 0x03:
ko: 소켓에 보내지고 수신된 메시지들은 JSON 인코딩된 문자열입니다. 이 문자열들은 ASCII 0x03 문자로 종료됩니다:

source: Klipper contains a `scripts/whconsole.py` tool that can perform the above message framing. For example:
it: Klipper contiene uno strumento `scripts/whconsole.py` che può eseguire il framing dei messaggi sopra. Per esempio:
ko: Klipper 는 `scripts/whconsole.py` 도구를 포함하고 있습니다.이 도구는 상위 메시지 프레이밍을 수행할 수 있습니다. 예를 들어 :

source: This tool can read a series of JSON commands from stdin, send them to Klipper, and report the results. The tool expects each JSON command to be on a single line, and it will automatically append the 0x03 terminator when transmitting a request. (The Klipper API server does not have a newline requirement.)
it: Questo strumento può leggere una serie di comandi JSON da stdin, inviarli a Klipper e riportare i risultati. Lo strumento prevede che ogni comando JSON si trovi su una singola riga e aggiungerà automaticamente il terminatore 0x03 durante la trasmissione di una richiesta. (Il server dell'API Klipper non ha un requisito di newline.)
ko: 이 도구는 stdin 으로부터 연속된 JSON 명령어들을 읽을 수 있습니다. 또한 그 읽은 명령어들을 Klipper 로 보내고 결과를 보고할 수 있습니다. 그 도구는 각 JSON 명령을 한줄로 인식하며 요청을 보낼때 자동으로 0x03 종료자를 추가할 것입니다. (Klipper API 서버는 newline 요청을 가지고 있지 않습니다.)

source: API Protocol
it: Protocollo API
ko: API 프로토콜

source: The command protocol used on the communication socket is inspired by [json-rpc](https://www.jsonrpc.org/).
it: Il protocollo dei comandi utilizzato sul socket di comunicazione è ispirato a [json-rpc](https://www.jsonrpc.org/).
ko: 통신소켓에 사용된 명령 프로토콜은 [json-rpc](https://www.jsonrpc.org/) 에 영감을 받았습니다.

source: A request might look like:
it: Una richiesta potrebbe essere simile a:
ko: 요청은 다음과 같은 형식입니다 :

source: and a response might look like:
it: e una risposta potrebbe essere simile a:
ko: 그리고 응답값은 아래와 같은 유형입니다 :

source: `{"id": 123, "result": {"state_message": "Printer is ready", "klipper_path": "/home/pi/klipper", "config_file": "/home/pi/printer.cfg", "software_version": "v0.8.0-823-g883b1cb6", "hostname": "octopi", "cpu_info": "4 core ARMv7 Processor rev 4 (v7l)", "state": "ready", "python_path": "/home/pi/klippy-env/bin/python", "log_file": "/tmp/klippy.log"}}`
ko: `{"id": 123, "result": {"state_message": "Printer is ready", "klipper_path": "/home/pi/klipper", "config_file": "/home/pi/printer.cfg", "software_version": "v0.8.0-823-g883b1cb6", "hostname": "octopi", "cpu_info": "4 core ARMv7 Processor rev 4 (v7l)", "state": "ready", "python_path": "/home/pi/klippy-env/bin/python", "log_file": "/tmp/klippy.log"}}2`

source: Each request must be a JSON dictionary. (This document uses the Python term "dictionary" to describe a "JSON object" - a mapping of key/value pairs contained within `{}`.)
it: Ogni richiesta deve essere un dizionario JSON. (Questo documento usa il termine Python "dizionario" per descrivere un "oggetto JSON" - una mappatura di coppie chiave/valore contenute in `{}`.)
ko: 각 요청은 JSON 딕셔너리여야 합니다. (이 문서는 "JSON object" - key/value 쌍은 `{}`를 포함하여 맵핑 - 를 표현하기 위해 파이썬 용어 사전을 사용합니다.)

source: The request dictionary must contain a "method" parameter that is the string name of an available Klipper "endpoint".
it: Il dizionario di richiesta deve contenere un parametro "method" che è il nome stringa di un "endpoint" di Klipper disponibile.
ko: 요청 딕셔너리는 "method" 파라메터를 반드시 포함해야 합니다. 이 파라메터는 사용가능한 Klipper "endpoint"의 문자열 이름입니다.

source: The request dictionary may contain a "params" parameter which must be of a dictionary type. The "params" provide additional parameter information to the Klipper "endpoint" handling the request. Its content is specific to the "endpoint".
it: Il dizionario della richiesta può contenere un parametro "params" che deve essere di tipo dizionario. I "parametri" forniscono ulteriori informazioni sui parametri all'"endpoint" di Klipper che gestisce la richiesta. Il suo contenuto è specifico dell'"endpoint".
ko: 요청 딕셔너리는 "params" 파라메터를 포함할 수 있습니다. 이 파라메터는 반드시 딕셔너리 타입이어야 합니다. "params" 는 클리퍼 "endpoint"가 요청을 다룰 수 있도록 추가적인 파라메터를 제공합니다. 그 내용은 "endpoint"에 특정됩니다.

source: The request dictionary may contain an "id" parameter which may be of any JSON type. If "id" is present then Klipper will respond to the request with a response message containing that "id". If "id" is omitted (or set to a JSON "null" value) then Klipper will not provide any response to the request. A response message is a JSON dictionary containing "id" and "result". The "result" is always a dictionary - its contents are specific to the "endpoint" handling the request.
it: Il dizionario delle richieste può contenere un parametro "id" che può essere di qualsiasi tipo JSON. Se è presente "id", Klipper risponderà alla richiesta con un messaggio di risposta contenente tale "id". Se "id" viene omesso (o impostato su un valore JSON "null"), Klipper non fornirà alcuna risposta alla richiesta. Un messaggio di risposta è un dizionario JSON contenente "id" e "result". Il "risultato" è sempre un dizionario: i suoi contenuti sono specifici dell'"endpoint" che gestisce la richiesta.
ko: 요청 딕셔너리는 "id" 파라메터를 포함할 수 있습니다. 이 파라메터는 JSON 타입이 될 수 있습니다. 만일 "id" 가 존재한다면 클리퍼는 "id"를 포함한 응답 메시지와 함께 요청에 응답할 것입니다. 민일 "id" 가 생략되어 있다면 (혹은 JSON "null"값이 셋팅되어 있다면) 클리퍼는 요청에 대해 어떤 응답도 제공하지 않을 것입니다. 응답 메시지는 "id" 와 "result" 를 포함한 JSON 딕셔너리입니다. "result" 는 항상 딕셔너리 입니다. 그것의 내용은 요청을 다루는 "endpoint"에 특정됩니다.

source: If the processing of a request results in an error, then the response message will contain an "error" field instead of a "result" field. For example, the request: `{"id": 123, "method": "gcode/script", "params": {"script": "G1 X200"}}` might result in an error response such as: `{"id": 123, "error": {"message": "Must home axis first: 200.000 0.000 0.000 [0.000]", "error": "WebRequestError"}}`
it: Se l'elaborazione di una richiesta genera un errore, il messaggio di risposta conterrà un campo "errore" anziché un campo "risultato". Ad esempio, la richiesta: `{"id": 123, "method": "gcode/script", "params": {"script": "G1 X200"}}` potrebbe generare una risposta di errore come: ` {"id": 123, "error": {"message": "Deve prima posizionare l'asse: 200.000 0.000 0.000 [0.000]", "error": "WebRequestError"}}`
ko: 만일 요청한 프로세싱이 오류면, 응답메시지는 "result" 필드 대신에 "error" 필드를 포함할 것입니다. 예를 들어, 다음과 같은 요청이 들어가면 : `{"id": 123, "method": "gcode/script", "params": {"script": "G1 X200"}}` 이런 에러메시지의 결과를 냅니다 : `{"id": 123, "error": {"message": "Must home axis first: 200.000 0.000 0.000 [0.000]", "error": "WebRequestError"}}`

source: Klipper will always start processing requests in the order that they are received. However, some request may not complete immediately, which could cause the associated response to be sent out of order with respect to responses from other requests. A JSON request will never pause the processing of future JSON requests.
it: Klipper inizierà sempre a elaborare le richieste nell'ordine in cui sono state ricevute. Tuttavia, alcune richieste potrebbero non essere completate immediatamente, il che potrebbe causare l'invio di una risposta associata non conforme rispetto alle risposte di altre richieste. Una richiesta JSON non sospenderà mai l'elaborazione di future richieste JSON.
ko: 클리퍼는 항상 받은 순서대로 요청 프로세싱을 시작합니다. 하지만 몇몇 요청들은 즉각 완료되지 않을 수 있습니다. 이로인해 관련응답이 다른 요청에 대한 응답순서를 벗어날 수도 있습니다. JSON 요청은 절대로 미래의 JSON 요청의 프로세싱을 중단시키지 않을 것입니다.

source: Subscriptions
it: Sottoscrizioni
ko: 구독

source: Some Klipper "endpoint" requests allow one to "subscribe" to future asynchronous update messages.
it: Alcune richieste di "endpoint" di Klipper consentono di "iscriversi" a futuri messaggi di aggiornamento asincrono.
ko: 몇몇 클리퍼의 "endpoint" 요청들은 미래의 비동기적인 업데이트 메시지를 나타내줍니다.

source: For example:
it: Per esempio:
ko: 예를 들면:

source: may initially respond with:
it: inizialmente può rispondere con:
ko: 이것은 기본적으로 다음과 같이 응답합니다:

source: and cause Klipper to send future messages similar to:
it: e fare in modo che Klipper invii messaggi futuri simili a:
ko: 그리고, 클리퍼로 하여금 다음과 같은 미래 메시지들을 보내게 합니다:

source: A subscription request accepts a "response_template" dictionary in the "params" field of the request. That "response_template" dictionary is used as a template for future asynchronous messages - it may contain arbitrary key/value pairs. When sending these future asynchronous messages, Klipper will add a "params" field containing a dictionary with "endpoint" specific contents to the response template and then send that template. If a "response_template" field is not provided then it defaults to an empty dictionary (`{}`).
it: Una richiesta di sottoscrizione accetta un dizionario "response_template" nel campo "params" della richiesta. Quel dizionario "response_template" viene utilizzato come modello per futuri messaggi asincroni: può contenere coppie chiave/valore arbitrarie. Quando invierà questi futuri messaggi asincroni, Klipper aggiungerà un campo "params" contenente un dizionario con contenuti specifici per "endpoint" al modello di risposta e quindi invierà quel modello. Se non viene fornito un campo "response_template", il valore predefinito è un dizionario vuoto (`{}`).
ko: 메시지출력 요청은 "params" 필드 요청에 "response_template" 딕셔너리를 받아들입니다. "response_template" 딕셔너리는 미래 비동기 메시지를 위한 템플릿으로 사용됩니다. 그것은 임의의 키/값 쌍을 포함할 수 있습니다. 이러한 미래 비동기 메시지들을 보내려 할 때 클리퍼는 응답 템플릿에 "endpoint" 특정 딕셔너리 내용을 포함하고 있는 "params" 필드를 더할 것입니다. 그리고, 그 템플릿을 보내게 됩니다. 만약 "response_template" 필드가 제공되지 않는다면 빈 딕셔너리 (`{}`) 를 디폴트로 보내게 됩니다.

source: Available "endpoints"
it: "endpoint" disponibili
ko: 사용가능한 "endpoints"

source: By convention, Klipper "endpoints" are of the form `<module_name>/<some_name>`. When making a request to an "endpoint", the full name must be set in the "method" parameter of the request dictionary (eg, `{"method"="gcode/restart"}`).
it: Per convenzione, gli "endpoint" di Klipper sono nella forma `<module_name>/<some_name>`. Quando si effettua una richiesta a un "endpoint", il nome completo deve essere impostato nel parametro "method" del dizionario di richiesta (ad esempio, `{"method"="gcode/restart"}`).
ko: 관행적으로 클리퍼 "endpoints"는 `<module_name>/<some_name>` 형식으로 이뤄집니다. "endpoint" 에 요청을 하고자 할 때, full name 은 요청 딕셔너리의 "method" 파라메터에 셋팅되어 있어야만 합니다. (예, `{"method"="gcode/restart"}`).

source: info
ko: 정보

source: The "info" endpoint is used to obtain system and version information from Klipper. It is also used to provide the client's version information to Klipper. For example: `{"id": 123, "method": "info", "params": { "client_info": { "version": "v1"}}}`
it: L'endpoint "info" viene utilizzato per ottenere informazioni sul sistema e sulla versione da Klipper. Viene anche utilizzato per fornire a Klipper le informazioni sulla versione del client. Ad esempio: `{"id": 123, "method": "info", "params": { "client_info": { "version": "v1"}}}`
ko: "info" endpoint 는 클리퍼로 부터 시스템과 버전 정보를 가져올 수 있습니다. 또한 클리퍼에 클라이언트 버전 정보르 제공하는데도 사용될 수 있습니다. 예시 : `{"id": 123, "method": "info", "params": { "client_info": { "version": "v1"}}}`

source: If present, the "client_info" parameter must be a dictionary, but that dictionary may have arbitrary contents. Clients are encouraged to provide the name of the client and its software version when first connecting to the Klipper API server.
it: Se presente, il parametro "client_info" deve essere un dizionario, ma quel dizionario potrebbe avere contenuti arbitrari. I clienti sono incoraggiati a fornire il nome del client e la sua versione del software quando si connettono per la prima volta al server dell'API Klipper.
ko: 만일 정보가 존재한다면, "client_info" 파라메터는 딕셔너리여야만 합니다. 그러나 그 딕셔너리는 임의의 내용들을 가질 수 있습니다. 클라이언트는 처음 클리퍼 API 서버와 연결될 때 클라이언트의 이름이나 소프트웨어 버전을 제공할 수 있습니다.

source: emergency_stop
ko: 비상정지

source: The "emergency_stop" endpoint is used to instruct Klipper to transition to a "shutdown" state. It behaves similarly to the G-Code `M112` command. For example: `{"id": 123, "method": "emergency_stop"}`
it: L'endpoint "emergency_stop" viene utilizzato per indicare a Klipper di passare allo stato di "spegnimento". Si comporta in modo simile al comando G-Code `M112`. Ad esempio: `{"id": 123, "method": "emergency_stop"}`
ko: "emergency_stop" endpoint 는 클리퍼가 "shutdown" 상태로 가도록 지시하는데 사용합니다. 그것은 `M112` gcode 와 비슷하게 행동합니다. 예시 : `{"id": 123, "method": "emergency_stop"}`

source: register_remote_method
ko: 레지스터 원격 메쏘드

source: This endpoint allows clients to register methods that can be called from klipper. It will return an empty object upon success.
it: Questo endpoint consente ai client di registrare metodi che possono essere chiamati da klipper. Restituirà un oggetto vuoto in caso di successo.
ko: 이 endpoint 는 클라이언트가 클리퍼로부터 불려지 수 있도록 메쏘드를 등록하게 해줍니다. 이는 성공시 비어있는 객체를 반환합니다.

source: For example: `{"id": 123, "method": "register_remote_method", "params": {"response_template": {"action": "run_paneldue_beep"}, "remote_method": "paneldue_beep"}}` will return: `{"id": 123, "result": {}}`
it: Per esempio: `{"id": 123, "method": "register_remote_method", "params": {"response_template": {"action": "run_paneldue_beep"}, "remote_method": "paneldue_beep"}}` will return: `{"id": 123, "result": {}}`
ko: 예시 : `{"id": 123, "method": "register_remote_method", "params": {"response_template": {"action": "run_paneldue_beep"}, "remote_method": "paneldue_beep"}}` 반환값 :`{"id": 123, "result": {}}`

source: The remote method `paneldue_beep` may now be called from Klipper. Note that if the method takes parameters they should be provided as keyword arguments. Below is an example of how it may called from a gcode_macro:
it: Il metodo remoto `paneldue_beep` ora può essere chiamato da Klipper. Nota che se il metodo accetta parametri, dovrebbero essere forniti come argomenti di parole chiave. Di seguito è riportato un esempio di come può essere chiamato da una gcode_macro:
ko: 원격 메쏘드 `paneldue_beep` 는 클리퍼로 부터 불려질 수 있습니다. 만일 메쏘드가 파라메터들을 가지게 되면 그것들은 키워드 아규먼트들로써 제공될 수 있음을 기억하십시오. 아래 어떻게 gcode 메크로에서 불러올 수 있는지에 대한 예시가 있습니다. :

source: When the PANELDUE_BEEP gcode macro is executed, Klipper would send something like the following over the socket: `{"action": "run_paneldue_beep", "params": {"frequency": 300, "duration": 1.0}}`
it: Quando viene eseguita la macro gcode PANELDUE_BEEP, Klipper invia qualcosa di simile al seguente tramite il socket: `{"action": "run_paneldue_beep", "params": {"frequency": 300, "duration": 1.0}}`
ko: PANELDUE_BEEP gcode 매크로가 실행되면 클리퍼는 소켓위에 아래와 같은 것을 내보낼 것이다.: `{"action": "run_paneldue_beep", "params": {"frequency": 300, "duration": 1.0}}`

source: objects/list
it: oggetti/elenco
ko: 객체/리스트

source: This endpoint queries the list of available printer "objects" that one may query (via the "objects/query" endpoint). For example: `{"id": 123, "method": "objects/list"}` might return: `{"id": 123, "result": {"objects": ["webhooks", "configfile", "heaters", "gcode_move", "query_endstops", "idle_timeout", "toolhead", "extruder"]}}`
it: Questo endpoint interroga l'elenco degli "oggetti" della stampante disponibili che è possibile interrogare (tramite l'endpoint "objects/query"). Ad esempio: `{"id": 123, "method": "objects/list"}` potrebbe restituire: `{"id": 123, "result": {"objects": ["webhooks", "configfile" , "heaters", "gcode_move", "query_endstops", "idle_timeout", "toolhead", "extruder"]}}`
ko: 이 endpoint는 쿼리할 수 있는 사용가능한 프린터 "objects"객체들의 리스트를 쿼리합니다. ("objects/query" endpoint 를 통하여). 예를 들면: `{"id": 123, "method": "objects/list"}` 이것은 다음과 같은 결과를 돌려줄 것입니다.: `{"id": 123, "result": {"objects": ["webhooks", "configfile", "heaters", "gcode_move", "query_endstops", "idle_timeout", "toolhead", "extruder"]}}`

source: objects/query
it: oggetti/interrogazione
ko: 객체/쿼리

source: This endpoint allows one to query information from printer objects. For example: `{"id": 123, "method": "objects/query", "params": {"objects": {"toolhead": ["position"], "webhooks": null}}}` might return: `{"id": 123, "result": {"status": {"webhooks": {"state": "ready", "state_message": "Printer is ready"}, "toolhead": {"position": [0.0, 0.0, 0.0, 0.0]}}, "eventtime": 3051555.377933684}}`
it: Questo endpoint consente di interrogare informazioni da oggetti. Ad esempio: `{"id": 123, "method": "objects/query", "params": {"objects": {"toolhead": ["position"], "webhooks": null}}}` potrebbe restituire: `{"id": 123, "result": {"status": {"webhooks": {"state": "ready", "state_message": "Printer is ready"}, "toolhead": { "position": [0.0, 0.0, 0.0, 0.0]}}, "eventtime": 3051555.377933684}}`
ko: 이 endpoint 는 프린터 객체들로 부터 정보를 쿼리할 수 있게 해줍니다. 예를 들어: `{"id": 123, "method": "objects/query", "params": {"objects": {"toolhead": ["position"], "webhooks": null}}}` 이렇게 입력하면, 다음과 같은 값을 돌려줍니다. : `{"id": 123, "result": {"status": {"webhooks": {"state": "ready", "state_message": "Printer is ready"}, "toolhead": {"position": [0.0, 0.0, 0.0, 0.0]}}, "eventtime": 3051555.377933684}}`

source: The "objects" parameter in the request must be a dictionary containing the printer objects that are to be queried - the key contains the printer object name and the value is either "null" (to query all fields) or a list of field names.
it: Il parametro "objects" nella richiesta deve essere un dizionario contenente gli oggetti stampante che devono essere interrogati - la chiave contiene il nome dell'oggetto stampante e il valore è "null" (per interrogare tutti i campi) o un elenco di nomi di campo.
ko: 요청에 들어 있는 "objects" 파라메터는 쿼리되어질 수 있는 프린터 객체를 포함하고 있는 딕셔너리여야 합니다. - 핵심 포함요소는 프린터 객체 이름과 키값이 "null" 이거나 필드 이름의 리스트여야 합니다.

source: The response message will contain a "status" field containing a dictionary with the queried information - the key contains the printer object name and the value is a dictionary containing its fields. The response message will also contain an "eventtime" field containing the timestamp from when the query was taken.
it: Il messaggio di risposta conterrà un campo "status" contenente un dizionario con le informazioni richieste: la chiave contiene il nome dell'oggetto stampante e il valore è un dizionario contenente i suoi campi. Il messaggio di risposta conterrà anche un campo "eventtime" contenente il timestamp da quando è stata eseguita la query.
ko: 응답 메시지는 쿼리된 정보를 가지고 있는 딕셔너리에 포함된 "status" 필드를 포함할 것입니다. 프린터 이름을 포함해야 하며 그 값은 그것을 포함하고 있는 딕셔너리입니다. 응답 메시지는 또한 쿼리가 가져와질때의 타임스탬프를 포함한 "eventtime"필드를 포함할 것입니다.

source: Available fields are documented in the [Status Reference](Status_Reference.md) document.
it: I campi disponibili sono documentati nel documento [Status Reference](Status_Reference.md).
ko: 가능한 필드들은 다음 문서에 있습니다. [Status Reference](Status_Reference.md) 문서.

source: objects/subscribe
it: oggetti/subscribe
ko: 객체/서브스크라이브

source: This endpoint allows one to query and then subscribe to information from printer objects. The endpoint request and response is identical to the "objects/query" endpoint. For example: `{"id": 123, "method": "objects/subscribe", "params": {"objects":{"toolhead": ["position"], "webhooks": ["state"]}, "response_template":{}}}` might return: `{"id": 123, "result": {"status": {"webhooks": {"state": "ready"}, "toolhead": {"position": [0.0, 0.0, 0.0, 0.0]}}, "eventtime": 3052153.382083195}}` and result in subsequent asynchronous messages such as: `{"params": {"status": {"webhooks": {"state": "shutdown"}}, "eventtime": 3052165.418815847}}`
it: Questo endpoint consente di eseguire query e quindi iscriversi alle informazioni dagli oggetti stampante. La richiesta e la risposta dell'endpoint sono identiche all'endpoint "objects/query". Ad esempio: `{"id": 123, "method": "objects/subscribe", "params": {"objects":{"toolhead": ["position"], "webhooks": ["state"] }, "response_template":{}}}` potrebbe restituire: `{"id": 123, "result": {"status": {"webhooks": {"state": "ready"}, "toolhead": {"position": [0.0, 0.0, 0.0, 0.0]}}, "eventtime": 3052153.382083195}}` e generare messaggi asincroni successivi come: `{"params": {"status": {"webhooks": {"state": "shutdown"}}, "eventtime": 3052165.418815847}}`
ko: 이 endpoint 는 프린터 객체로 부터 정보를 쿼리하고 서브스크라이브 할 수 있게 해줍니다. 이 endpoint 의 요청과 응답은 "objects/query" endpoint 와 동일합니다. 예를 들어 : `{"id": 123, "method": "objects/subscribe", "params": {"objects":{"toolhead": ["position"], "webhooks": ["state"]}, "response_template":{}}}` 이것은 다음을 돌려줄 것입니다. : `{"id": 123, "result": {"status": {"webhooks": {"state": "ready"}, "toolhead": {"position": [0.0, 0.0, 0.0, 0.0]}}, "eventtime": 3052153.382083195}}` 그리고 다음과 같은 연속된 비동기형 메시지를 내보내줄 것입니다. `{"params": {"status": {"webhooks": {"state": "shutdown"}}, "eventtime": 3052165.418815847}}`

source: gcode/help
ko: gcode/도움말

source: This endpoint allows one to query available G-Code commands that have a help string defined. For example: `{"id": 123, "method": "gcode/help"}` might return: `{"id": 123, "result": {"RESTORE_GCODE_STATE": "Restore a previously saved G-Code state", "PID_CALIBRATE": "Run PID calibration test", "QUERY_ADC": "Report the last value of an analog pin", ...}}`
it: Questo endpoint consente di interrogare i comandi G-Code disponibili che hanno una stringa di aiuto definita. Ad esempio: `{"id": 123, "method": "gcode/help"}` potrebbe restituire: `{"id": 123, "result": {"RESTORE_GCODE_STATE": "Restore a previously saved G-Code state", "PID_CALIBRATE": "Run PID calibration test", "QUERY_ADC": "Report the last value of an analog pin", ...}}`
ko: 이 endpoint 는 정의된 help 문자열을 가지고 있는 가능한 G-Code 명령을 쿼리할 수 있게 해줍니다. 예를 들어 : `{"id": 123, "method": "gcode/help"}` 이것은 다음을 돌려줄 것입니다.: `{"id": 123, "result": {"RESTORE_GCODE_STATE": "Restore a previously saved G-Code state", "PID_CALIBRATE": "Run PID calibration test", "QUERY_ADC": "Report the last value of an analog pin", ...}}`

source: gcode/script
ko: gcode/스크립트

source: This endpoint allows one to run a series of G-Code commands. For example: `{"id": 123, "method": "gcode/script", "params": {"script": "G90"}}`
it: Questo endpoint consente di eseguire una serie di comandi G-Code. Ad esempio: `{"id": 123, "method": "gcode/script", "params": {"script": "G90"}}`
ko: 이 endpoint 는 일련의 G-code 명령어들을 실행할 수 있게 해줍니다. 예를들어 : `{"id": 123, "method": "gcode/script", "params": {"script": "G90"}}`
