Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/beaglebone.po
Languages: fr, ko, zh_hans, zh_hant

source: This document describes the process of running Klipper on a Beaglebone PRU.
fr: Ce document décrit le processus d'exécution de Klipper sur un Beaglebone PRU.
ko: 이 문서는 비글본 PRU 에서 클리퍼를 실행시키는 과정에 대해 설명합니다.
zh_hans: 本文档描述了在 Beaglebone 可编程实时单元上运行 Klipper 的过程。
zh_hant: 本文件描述了在 Beaglebone 可程式設計實時單元上執行 Klipper 的過程。

source: Building an OS image
fr: Construire l'image de l'OS
ko: OS 이미지 빌드하기
zh_hans: 构建一个操作系统镜像
zh_hant: 構建一個操作系統映象

source: Start by installing the [Debian 9.9 2019-08-03 4GB SD IoT](https://beagleboard.org/latest-images) image. One may run the image from either a micro-SD card or from builtin eMMC. If using the eMMC, install it to eMMC now by following the instructions from the above link.
fr: Commencez par installer l'image [Debian 9.9 2019-08-03 4GB SD IoT](https://beagleboard.org/latest-images). Vous pouvez exécuter l'image à partir d'une carte micro-SD ou de la carte eMMC intégrée. Si vous utilisez l'eMMC, installez-la sur l'eMMC maintenant en suivant les instructions du lien ci-dessus.
ko: 시작은 다음 이미지를 설치하는 것부터 입니다. [Debian 9.9 2019-08-03 4GB SD IoT](https://beagleboard.org/latest-images) 이 이미지는 마이크로SD 카드나 내장된 eMMC 로 부터 실행시킬 수 있습니다. 만일 eMMC 를 사용한다면, 위 링크로 부터 다음 절차에 따라 eMMC 에 지금 설치하십시오.
zh_hans: 首先安装[Debian 9.9 2019-08-03 4GB SD IoT](https://beagleboard.org/latest-images)镜像。可以从micro-SD卡或内置的eMMC中运行该镜像。如果使用eMMC，现在需要按照上述链接的说明将其安装到eMMC。
zh_hant: 首先安裝[Debian 9.9 2019-08-03 4GB SD IoT](https://beagleboard.org/latest-images)映象。可以從micro-SD卡或內建的eMMC中執行該映象。如果使用eMMC，現在需要按照上述鏈接的說明將其安裝到eMMC。

source: Then ssh into the beaglebone machine (ssh debian@beaglebone -- password is "temppwd") and install Klipper by running the following commands:
ko: 그리고 비글본 장치로 접속하십시오. (ssh debian@beaglebone -- password is "temppwd") 그다음 아래 명령어를 실행시켜 클리퍼를 설치하시면 됩니다.:
zh_hans: 然后 ssh 进入 Beaglebone 机器（ssh debian@beaglebone -- 密码是 "temppwd"），通过运行以下命令安装 Klipper：

source: Install Octoprint
fr: Installer Octoprint
ko: 옥토프린트 설치
zh_hans: 安装 Octoprint
zh_hant: 安裝 Octoprint

source: One may then install Octoprint:
fr: On peut ensuite installer Octoprint :
ko: 이제 옥토프린터를 설치하실 수 있습니다. :
zh_hans: 然后可以安装 Octoprint：
zh_hant: 然後可以安裝 Octoprint：

source: And setup OctoPrint to start at bootup:
fr: Et configurer OctoPrint pour qu'il démarre au démarrage :
ko: 그리고 옥토프린터를 부팅시 시작하도록 셋업을 해줍니다.:
zh_hans: 和设置 Octoprint 开始启动：
zh_hant: 和設定 Octoprint 開始啟動：

source: It is necessary to modify OctoPrint's **/etc/default/octoprint** configuration file. One must change the OCTOPRINT_USER user to "debian", change NICELEVEL to 0, uncomment the BASEDIR, CONFIGFILE, and DAEMON settings and change the references from "/home/pi/" to "/home/debian/":
ko: 필수적으로 옥토프린터의 **/etc/default/octoprint** configuration 을 수정해줘야할 필요가 있습니다. OCTOPRINT_USER 사용자는 "debian" 으로 NICELEVEL 은 0 으로 BASEDIR, CONFIGFILE, DAEMON 셋팅들은 코멘트해제, 그리고 참조(references) 를 "/home/pi/" 에서 "/home/debian/" 으로 변경시킵니다:
zh_hans: 有必要修改OctoPrint的 **/etc/default/octoprint** 配置文件。我们必须把 OCTOPRINT_USER 用户改为 "debian"，把 NICELEVEL 改为 0 ，取消注释 BASEDIR、CONFIGFILE 和 DAEMON 的设置，并把引用从"/home/pi/"改为"/home/debian/"：

source: Then start the Octoprint service:
fr: Démarrez ensuite le service Octoprint :
ko: 그 다음 옥토프린터 서비스를 시작합니다:
zh_hans: 然后启动 Octoprint 服务：
zh_hant: 然後啟動 Octoprint 服務：

source: Make sure the octoprint web server is accessible - it should be at: [http://beaglebone:5000/](http://beaglebone:5000/)
ko: 옥토프린터 웹서버에 연결되었음을 확인합니다. 연결주소는 다음과 같습니다. [http://beaglebone:5000/](http://beaglebone:5000/)

source: Building the micro-controller code
fr: Construire le code du microcontrôleur
ko: 마이크로 컨트롤러 코드를 빌드하기
zh_hans: 构建微控制器代码
zh_hant: 構建微控制器程式碼

source: To compile the Klipper micro-controller code, start by configuring it for the "Beaglebone PRU":
fr: Pour compiler le code du microcontrôleur Klipper, commencez par le configurer pour le "Beaglebone PRU" :
ko: 클리퍼의 마이크로 컨트롤러 코드를 컴파일하기 위해 "Beaglebone PRU"에 대한 설정을 해줍니다.:
zh_hans: 要编译的 Klipper 微控制器代码，需要先将编译配置设为“Beaglebone PRU”：
zh_hant: 要編譯的 Klipper 微控制器程式碼，需要先將編譯配置設為「Beaglebone PRU」：

source: To build and install the new micro-controller code, run:
fr: Pour compiler et installer le nouveau code du microcontrôleur, exécutez :
ko: 새로운 마이크로 컨트롤러 코드를 빌드하고 설치하기 위해 다음을 실행시킵니다. :
zh_hans: 要构建和安装新的微控制器代码，请运行：
zh_hant: 要構建和安裝新的微控制器程式碼，請執行：

source: It is also necessary to compile and install the micro-controller code for a Linux host process. Run "make menuconfig" a second time and configure it for a "Linux process":
ko: 또한 리눅스 호스트 프로세스를 위해서 마이크로 컨트롤러 코드를 컴파일하고 설치해줄 필요가 있습니다. 두번째로 "make menuconfig" 를 실행시키고, "Linux process"를 위해 그것을 설정해줍니다.:
zh_hans: 还需要编译和安装用于 Linux 主机进程的微控制器代码。再次运行 "make menuconfig"，并将其配置为"Linux process"：

source: Then install this micro-controller code as well:
fr: Puis installez également ce code de micro-contrôleur :
ko: 그리고나서 이 마이크로 컨트롤러 코드를 설치해줍니다.:
zh_hans: 然后也安装这个微控制器代码：
zh_hant: 然後也安裝這個微控制器程式碼：

source: Remaining configuration
fr: Configuration restante
ko: 나머지 설정
zh_hans: 剩余的配置
zh_hant: 剩餘的配置

source: Complete the installation by configuring Klipper and Octoprint following the instructions in [the main installation document](Installation.md#configuring-klipper).
ko: 다음 문서 [the main installation document](Installation.md#configuring-klipper) 를 보면서 클리퍼와 옥토프린터의 설정을 완료하십시오.
zh_hans: 根据[总安装文档](Installation.md#configuring-klipper)来配置 Klipper 和 Octoprint 来完成安装。

source: Printing on the Beaglebone
fr: Imprimer avec le Beaglebone
ko: 비글본으로 출력해보기
zh_hans: 在 Beaglebone 上打印
zh_hant: 在 Beaglebone 上列印

source: Unfortunately, the Beaglebone processor can sometimes struggle to run OctoPrint well. Print stalls have been known to occur on complex prints (the printer may move faster than OctoPrint can send movement commands). If this occurs, consider using the "virtual_sdcard" feature (see [config reference](Config_Reference.md#virtual_sdcard) for details) to print directly from Klipper.
ko: 불행하게도, 비글본 프로세서는 옥토프린터를 돌리는데 간혹 버거울 수 있습니다. 프린터 실속(속도를 잃음)은 복잡한 출력을 할 때 발생하는 것으로 알려져 있습니다. (프린터는 옥토프린터가 이동명령을 보내는것보다 더 빨리 움직일 수 있다) 만일 이런 현상이 발생한다면, 클리퍼로 부터 직접적으로 출력하기 위해 "virtual_sdcard" 를 사용할것을 고려해보십시오. (자세한 내용은 다음 링크 참조. [config reference](Config_Reference.md#virtual_sdcard) ).
zh_hans: 不幸的是，Beaglebone 处理器有时难以很好地运行 OctoPrint。据了解，在复杂的打印中会出现打印停滞（打印机的移动速度可能比 OctoPrint 发送的移动命令快）。如果发生这种情况，可以考虑使用 "virtual_sdcard" 功能（详见[配置参考](Config_Reference.md#virtual_sdcard)），直接从 Klipper 打印。

source: make menuconfig
ko: 메뉴 설정하기

source: Beaglebone
ko: 비글본

source: Then ssh into the Beaglebone machine (`ssh debian@beaglebone` -- password is `temppwd`) and install Klipper by running the following commands:
fr: Ensuite, connectez-vous à la machine Beaglebone (`ssh debian@beaglebone` -- le mot de passe est `temppwd`) et installez Klipper en exécutant les commandes suivantes :
zh_hant: 然後 ssh 進入 Beaglebone 機器（`ssh debian@beaglebone` -- 密碼是 `temppwd`），通過執行以下命令安裝 Klipper：

source: It is necessary to modify OctoPrint's **/etc/default/octoprint** configuration file. One must change the `OCTOPRINT_USER` user to `debian`, change `NICELEVEL` to `0`, uncomment the `BASEDIR`, `CONFIGFILE`, and `DAEMON` settings and change the references from `/home/pi/` to `/home/debian/`:
fr: Il est nécessaire de modifier le fichier de configuration d'OctoPrint **/etc/default/octoprint**. Il faut changer l'utilisateur `OCTOPRINT_USER` en `debian`, changer `NICELEVEL` en `0`, décommenter les paramètres `BASEDIR`, `CONFIGFILE`, et `DAEMON` et changer les références de `/home/pi/` en `/home/debian/` :
zh_hant: 在配置 Klipper 之前，需要先修改OctoPrint的 **/etc/default/octoprint** 配置檔案。把 `OCTOPRINT_USER` 使用者改為 `debian`，把 `NICELEVEL` 改為 `0` ，取消註釋 `BASEDIR`、`CONFIGFILE` 和 `DAEMON` 的設定，並把引用從`/home/pi/`改為`/home/debian/`：

source: Make sure the OctoPrint web server is accessible - it should be at: <http://beaglebone:5000/>
fr: Assurez-vous que le serveur web OctoPrint est accessible - il devrait se trouver à l'adresse suivante : <http://beaglebone:5000/>
zh_hant: 需要確定可以訪問 OctoPrint 網路伺服器 - 它應該可以通過這個鏈接訪問：<http://beaglebone:5000/>

source: It is also necessary to compile and install the micro-controller code for a Linux host process. Configure it a second time for a "Linux process":
fr: Il est également nécessaire de compiler et d'installer le code du microcontrôleur pour un processus hôte Linux. Configurez-le une seconde fois pour un "processus Linux" :
zh_hant: 還需要編譯和安裝用於 Linux 主機程序的微控制器程式碼。再次修改編譯配置為"Linux process"：

source: Complete the installation by configuring Klipper and Octoprint following the instructions in the main [Installation](Installation.md#configuring-klipper) document.
fr: Terminez l'installation en configurant Klipper et Octoprint en suivant les instructions du document principal [Installation](Installation.md#configuration-klipper).
zh_hant: 根據[安裝文件](Installation.md#configuring-klipper)配置 Klipper 和 Octoprint 以完成安裝。

source: Unfortunately, the Beaglebone processor can sometimes struggle to run OctoPrint well. Print stalls have been known to occur on complex prints (the printer may move faster than OctoPrint can send movement commands). If this occurs, consider using the "virtual_sdcard" feature (see [Config Reference](Config_Reference.md#virtual_sdcard) for details) to print directly from Klipper.
fr: Malheureusement, le processeur du Beaglebone peut parfois avoir du mal à faire fonctionner OctoPrint correctement. Des blocages d'impression sont connus pour se produire sur des impressions complexes (l'imprimante peut se déplacer plus rapidement qu'OctoPrint ne peut envoyer de commandes de mouvement). Si cela se produit, envisagez d'utiliser la fonctionnalité "virtual_sdcard" (voir [Référence des configurations](Config_Reference.md#virtual_sdcard) pour plus de détails) pour imprimer directement depuis Klipper.
zh_hant: 不幸的是，Beaglebone 處理器有時不能流暢地執行 OctoPrint。在複雜的列印中會出現列印停滯（印表機的移動速度可能比 OctoPrint 發送的移動命令快）是一個已知問題。如果發生這種情況，可以嘗試使用 "virtual_sdcard" 功能（詳見[配置參考](Config_Reference.md#virtual_sdcard)），直接從 Klipper 列印。

source: Make sure the octoprint web server is accessible - it should be at: <http://beaglebone:5000/>
zh_hans: 确保可以访问 OctoPrint 网络服务器 - 它应该在以下位置：<http://beaglebone:5000/>
