Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Bed_Level.po
Languages: es, ko, ru, zh_hant

source: Then a `TESTZ Z=-` would move the nozzle to a Z position of 0.180 (half way between 0.130 and 0.230). One can use this feature to help rapidly narrow down to a consistent friction. It is also possible to use `Z=++` and `Z=--` to return directly to a past measurement - for example, after the above prompt a `TESTZ Z=--` command would move the nozzle to a Z position of 0.130.
es: Entonces un `TESTZ Z=-` movería la boquilla a una posición Z de 0,180 (a medio camino entre 0,130 y 0,230). Se puede utilizar esta función para ayudar a reducir rápidamente a una fricción consistente. También es posible utilizar `Z=++` y `Z=--` para volver directamente a una medición pasada - por ejemplo, después de la indicación anterior un comando `TESTZ Z=--` movería la boquilla a una posición Z de 0.130.
ko: 그런 다음 `TESTZ Z=-` 명령은 노즐을 0.180(0.130 과 0.230 의 중간위치)으로 이동합니다. 이 기능을 사용하여 일관된 마찰로 빠르게 좁힐 수 있습니다. `Z=++` 와 `Z=--`를 사용하여 과거 측정값으로 직접 되돌릴 수도 있습니다- 예를 들어 위의 프롬프트 후 `TESTZ Z=--` 명령은 노즐을 0.130의 Z 위치로 이동합니다.
ru: Тогда команда `TESTZ Z=-` переместит сопло в положение Z, равное 0,180 (половина пути между 0,130 и 0,230). Эту функцию можно использовать для быстрого сужения диапазона трения. Также можно использовать команды `Z=++` и `Z=--` для возврата непосредственно к прошлому измерению - например, после приведенного выше запроса команда `TESTZ Z=--` переместит сопло в положение по оси Z, равное 0,130.
zh_hant: 然後 `TESTZ Z=-` 會將噴嘴移動到 Z 座標 0.180 （0.130 和 0.230之間）。這個功能可以快速的找到一致阻力的位置。也可以用 `Z=++` 和 `Z=--` 直接回到上一次測量位置。例如，在上面反饋後執行`TESTZ Z=--`命令會將 Z 座標移動到 0.130。

source: After finding a small amount of friction run the ACCEPT command:
es: Después de encontrar una pequeña cantidad de fricción envíe el comando ACEPTAR :
ko: 약한 마찰의 정도를 찾은 후 ACCEPT 명령을 실행합니다:
ru: После обнаружения небольшого трения выполните команду ACCEPT:
zh_hant: 感受到少量的摩擦後，執行 ACCEPT 命令：

source: This will accept the given Z height and proceed with the given calibration tool.
es: Esto aceptará la altura en Z dada y continuara con la herramienta de calibración.
ko: 이렇게 하면 지정된 Z 높이를 수락하고 지정된 보정 도구로 진행합니다.
ru: При этом принимается заданная высота Z и выполняется калибровка с помощью заданного инструмента.
zh_hant: 這將接受給定的 Z 高度，並繼續使用給定的校準工具。

source: The exact amount of friction felt isn't crucial, just as the amount of thermal expansion and exact width of the paper isn't crucial. Just try to obtain the same amount of friction each time one runs the test.
es: La cantidad exacta de fricción no es crucial, al igual que la cantidad de expansión térmica y la anchura exacta del papel no son cruciales. Sólo hay que intentar obtener la misma cantidad de fricción cada vez que se realiza la prueba.
ko: 열 팽창량과 정확한 용지 폭이 중요하지 않은 것처럼 정확한 마찰 정도는 중요하지 않습니다. 테스트할 때마다 동일한 정도의 마찰이 느껴지도록 하기만 하면 됩니다.
ru: Точная величина ощущаемого трения не имеет решающего значения, так же как не имеет значения величина теплового расширения и точная ширина бумаги. Просто старайтесь добиться одинаковой величины трения при каждом испытании.
zh_hant: 確切的阻力並不重要，就像熱膨脹量和紙張的確切寬度並不重要一樣。只需要每次測試時儘量達到相同的阻力就行了。

source: If something goes wrong during the test, one can use the `ABORT` command to exit the calibration tool.
ko: 테스트 중에 문제가 발생하면 `ABORT` 명령을 사용하여 보정 도구를 종료할 수 있습니다.
ru: Если в процессе тестирования что-то пошло не так, то для выхода из программы калибровки можно воспользоваться командой `ABORT`.
zh_hant: 如果在測試過程中出了問題，可以使用 `ABORT` 命令來退出校準工具。

source: Determining Thermal Expansion
es: Determinando la Expansión Térmica
ko: 열팽창도 결정하기
ru: Определение температурного расширения
zh_hant: 確定熱膨脹

source: This type of calculation is generally not needed as most users find the simple "paper test" provides good results.
ko: 대부분의 사용자는 간단한 "종이 테스트"가 좋은 결과를 제공한다는 것을 알기 때문에 이러한 유형의 계산은 일반적으로 필요하지 않습니다.
ru: Этот тип расчетов обычно не требуется, поскольку большинство пользователей считают, что простой "бумажный тест" дает хорошие результаты.
zh_hant: 這種型別的計算通常是不需要的，因為大多數使用者發現簡單的"塞紙測試"提供了足夠好的結果。

source: The easiest way to make this calculation is to print a test object that has straight walls on all sides. The large hollow square found in [docs/prints/square.stl](prints/square.stl) can be used for this. When slicing the object, make sure the slicer uses the same layer height and extrusion widths for the first level that it does for all subsequent layers. Use a coarse layer height (the layer height should be around 75% of the nozzle diameter) and do not use a brim or raft.
ko: 이 계산을 수행하는 가장 쉬운 방법은 모든 면에 직선 벽이 있는 테스트 개체를 인쇄하는 것입니다. 큰 사이즈의 구멍난 사각형 모델링은 [docs/prints/square.stl](prints/square.stl)에 있는 큰 빈 정사각형을 여기에 사용할 수 있습니다. 객체를 슬라이스할 때 슬라이서가 이후의 모든 레이어와 동일한 레이어 높이 및 압출 너비를 첫 번째 레벨에 사용하는지 확인합니다. 두꺼운 레이어 높이(레이어 높이는 노즐 직경의 75% 정도여야 함)를 사용하고, 브림과 래프트를 사용하지 마십시오.
ru: Самый простой способ выполнить этот расчет - распечатать тестовый объект, имеющий прямые стенки со всех сторон. Для этого можно использовать большой полый квадрат, находящийся в [docs/prints/square.stl](prints/square.stl). При нарезке объекта убедитесь, что для первого уровня слайсер использует ту же высоту слоя и ширину выдавливания, что и для всех последующих слоев. Используйте грубую высоту слоя (высота слоя должна составлять около 75% диаметра сопла) и не используйте обводку или плот.
zh_hant: 最簡單的計算方法是列印一個四面都是直壁的測試物體。可以用在[docs/prints/square.stl](prints/square.stl)中找到的大型空心方形。在切片時，確保切片軟體在第一層使用與所有後續層相同的層高和擠出寬度。使用較高的層高（層高應該是噴嘴直徑的75%左右），不要使用裙邊(skirt)或筏(raft)。

source: Print the test object, wait for it to cool, and remove it from the bed. Inspect the lowest layer of the object. (It may also be useful to run a finger or nail along the bottom edge.) If one finds the bottom layer bulges out slightly along all sides of the object then it indicates the nozzle was slightly closer to the bed then it should be. One can issue a `SET_GCODE_OFFSET Z=+.010` command to increase the height. In subsequent prints one can inspect for this behavior and make further adjustment as needed. Adjustments of this type are typically in 10s of microns (.010mm).
ko: 테스트 객체를 인쇄하고 식을 때까지 기다렸다가 베드에서 꺼냅니다. 객체의 가장 낮은 레이어를 검사합니다. (손가락이나 손톱으로 아래쪽 모서리를 훑는 것도 좋은 방법입니다.) 하단 레이어가 객체의 모든 면을 따라 약간 부풀어 있다면, 노즐이 베드에 살짝 더 가까웠다는 것을 의미합니다. 높이를 올리기 위해 `SET_GCODE_OFFSET Z=+.010` 명령을 실행할 수 있습니다. 이어진 인쇄에서 같은 행동을 반복하여 최적위치를 찾습니다. 이러한 유형의 보정은 일반적으로 10미크론(0.010mm) 단위입니다.
ru: Напечатайте тестовый объект, подождите, пока он остынет, и снимите его со стола. Осмотрите самый нижний слой объекта. (Если нижний слой немного выпуклый со всех сторон, то это означает, что сопло было расположено немного ближе к слою, чем должно быть. Для увеличения высоты можно подать команду `SET_GCODE_OFFSET Z=+.010`. В последующих отпечатках можно проконтролировать такое поведение и при необходимости произвести дальнейшую настройку. Регулировки такого типа обычно выражаются в десятках микрон (.010 мм).
zh_hant: 列印測試對象，等待其自然冷卻，並將其從列印床上取下。檢查該物體的最低層。(可以用手指或指甲沿底層邊緣劃一下。)如果發現底層沿著物體的四邊略微凸起，則表明噴嘴離床面偏近。可以發出`SET_GCODE_OFFSET Z=+.010`命令來增加高度。在未來的列印中，可以用相同的方法檢查這種性狀，並根據需要作進一步調整。這種型別的調整通常是以 10 微米（0.010毫米）為單位。

source: If the bottom layer consistently appears narrower than subsequent layers then one can use the SET_GCODE_OFFSET command to make a negative Z adjustment. If one is unsure, then one can decrease the Z adjustment until the bottom layer of prints exhibit a small bulge, and then back-off until it disappears.
ko: 만일 첫레이어가 이어진 레이어들에 비해 더 얇게 보이는 경우, SET_GCODE_OFFSET 명령을 사용하여 Z 보정값을 음수로 두면 됩니다. 만약 확실치 않다고 느껴지면 첫레이어 모서리가 약간 튀어나올때까지 Z 보정값을 줄인 다음 튀어나온것이 사라질 때까지 반대로 값을 주어 최적보정값을 찾을 수 있습니다.
ru: Если нижний слой постоянно оказывается более узким, чем последующие, то можно воспользоваться командой SET_GCODE_OFFSET для отрицательной корректировки по Z. Если нет уверенности, то можно уменьшить корректировку по Z до появления небольшой выпуклости нижнего слоя отпечатков, а затем отступить до ее исчезновения.
zh_hant: 如果首層一直比後續層窄，那麼可以使用 SET_GCODE_OFFSET 命令進行負的 Z 調整。如果不確定，那麼可以減少 Z 值，直到底層的印刷品出現一個小的凸起，然後再增加 Z 值直到它消失。

source: The easiest way to apply the desired Z adjustment is to create a START_PRINT g-code macro, arrange for the slicer to call that macro during the start of each print, and add a SET_GCODE_OFFSET command to that macro. See the [slicers](Slicers.md) document for further details.
ko: 최적의 Z 보정값을 찾는 가장 쉬운 방법은 START_PRINT g-code 매크로를 만들고 각 인쇄를 시작할 때 슬라이서가 해당 매크로를 호출하도록 정렬한 다음 SET_GCODE_OFFSET 명령을 해당 매크로에 추가하는 것입니다. 자세한 내용은 [slicers](Slicers.md) 문서를 참조하십시오.
ru: Самый простой способ применить нужную корректировку по Z - создать макрос g-кода START_PRINT, организовать вызов этого макроса слайсером в начале каждой печати и добавить в этот макрос команду SET_GCODE_OFFSET. Более подробная информация приведена в документе [slicers](Slicers.md).
zh_hant: 應用期望的Z 值調整的最簡單方法是建立一個 START_PRINT G程式碼宏，配置切片軟體在列印開始程式碼中呼叫該宏，併爲該宏新增 SET_GCODE_OFFSET 命令。詳情見[切片軟體](Slicers.md)文件。

source: Recv: // Starting manual Z probe. Use TESTZ to adjust position. Recv: // Finish with ACCEPT or ABORT command. Recv: // Z position: ?????? --> 5.000 <-- ??????
ru: Recv: // Запуск ручного Z-зонда. Используйте TESTZ для настройки положения. Recv: // Завершение работы командой ACCEPT или ABORT. Recv: // Положение по оси Z: ?????? --> 5.000 <-- ??????

source: Recv: // Z position: 0.130 --> 0.230 <-- 0.280
ru: Recv: // Положение по Z: 0.130 --> 0.230 <-- 0.280

source: ACCEPT
ko: 수락하기
ru: ПРИНЯТЬ

source: Bed leveling
ko: 베드 레벨링
ru: Выравнивание кровати
zh_hant: 列印床調平

source: In order to perform the paper test, cut a small rectangular piece of paper using a pair of scissors (eg, 5x3 cm). The paper generally has a thickness of around 100 microns (0.100mm). (The exact thickness of the paper isn't crucial.)
ko: 종이 테스트를 수행하려면 가위(예: 5x3 cm)를 사용하여 작은 직사각형 종이 조각을 자릅니다. 종이의 두께는 일반적으로 약 100미크론(0.100mm)입니다. (종이의 정확한 두께는 중요하지 않습니다.)
ru: Для проведения бумажного теста необходимо отрезать ножницами небольшой прямоугольный кусок бумаги (например, 5x3 см). Толщина бумаги обычно составляет около 100 микрон (0,100 мм). (Точная толщина бумаги не имеет принципиального значения.)
zh_hant: 爲了進行塞紙測試，先用剪刀剪下一小塊長方形的紙條（例如，5x3釐米）。列印紙的厚度一般為100微米（0.100mm）左右。(紙條的確切寬度並不重要.）

source: If one always prints on a particular tape or printing surface then one may perform the paper test with that tape/surface in place. However, note that tape itself has a thickness and different tapes (or any other printing surface) will impact Z measurements. Be sure to rerun the paper test to measure each type of surface that is in use.
ko: 항상 특정 테이프 또는 인쇄 표면에 인쇄하는 경우 해당 테이프/표면을 통해 종이 테스트를 수행할 수 있습니다. 그러나 테이프 자체에는 두께가 있으며 다른 테이프(또는 다른 인쇄 표면)가 Z 측정에 영향을 미칩니다. 사용 중의 각 표면 유형을 측정하려면 용지 테스트를 다시 실행해야 합니다.
ru: Если вы всегда печатаете на определенной ленте или печатной поверхности, то тест бумаги можно проводить с этой лентой/поверхностью. Однако следует учитывать, что лента сама по себе имеет толщину, и разные ленты (или любые другие поверхности для печати) будут влиять на результаты измерений Z. Обязательно повторите тест на бумаге для измерения каждого типа используемой поверхности.
zh_hant: 如果總是在一種膠帶或床面上列印，可以在該膠帶或床面上直接進行塞紙測試。請注意，膠帶本身有厚度，不同的膠帶（或任何其他床面）將影響 Z 的測量。請確保用塞紙測試測量每一種使用的床面。

source: When the nozzle is heated, its position (relative to the bed) changes due to thermal expansion. This thermal expansion is typically around a 100 microns, which is about the same thickness as a typical piece of printer paper. The exact amount of thermal expansion isn't crucial, just as the exact thickness of the paper isn't crucial. Start with the assumption that the two are equal (see below for a method of determining the difference between the two distances).
ko: 노즐이 가열되면 열팽창으로 인해 노즐의 위치(베드에 상대적)가 변경됩니다. 이 열팽창은 일반적으로 약 100미크론이며 이는 일반적인 프린터 용지와 거의 같은 두께입니다. 종이의 정확한 두께가 중요하지 않은 것처럼 정확한 열팽창량은 중요하지 않습니다. 둘은 같다는 가정으로 시작합니다(두 거리 간의 차이를 결정하는 방법은 아래 참조).
ru: При нагреве сопла его положение (относительно станины) изменяется за счет теплового расширения. Это тепловое расширение обычно составляет около 100 мкм, т.е. примерно столько же, сколько толщина обычного листа бумаги для принтера. Точная величина теплового расширения не имеет принципиального значения, так же как и точная толщина бумаги. Начните с предположения, что эти два параметра равны (метод определения разницы между этими двумя расстояниями см. ниже).
zh_hant: 當噴嘴被加熱時，其位置（相對於床面）會因熱膨脹而發生變化。這種熱膨脹通常在100微米左右，大約是一張典型的列印紙的厚度。熱膨脹的確切程度並不關鍵，正如紙張的確切厚度並不關鍵一樣。從假設二者相等開始（見下文確定二者寬度之差的方法）。

source: After successfully performing bed leveling, one may go on to calculate a more precise value for the combined impact of "thermal expansion", "thickness of the paper", and "amount of friction felt during the paper test".
ko: 베드 레벨링을 성공적으로 수행한 후 "열팽창도", "종이의 두께" 및 "종이 테스트 중 느낀 마찰의 정도"의 복합적인 영향에 대해 더 정확한 값을 계산할 수 있습니다.
ru: После успешного выполнения выравнивания станины можно перейти к расчету более точного значения совместного влияния "теплового расширения", "толщины бумаги" и "величины трения, ощущаемого при испытании бумаги".
zh_hant: 在成功進行列印床調平後，可以繼續計算"熱膨脹"、"紙張厚度"和"紙張測試時感受到的摩擦量"綜合影響的精確值。

source: ![paper-test](img/paper-test.jpg)
ko: ![종이테스트](img/paper-test.jpg)

source: In order to perform the paper test, cut a small rectangular piece of paper using a pair of scissors (eg, 5x3 cm). The paper generally has a width of around 100 microns (0.100mm). (The exact width of the paper isn't crucial.)
es: Para realizar la prueba del papel, corte un pequeño trozo de papel rectangular con unas tijeras (por ejemplo, 5x3 cm). El papel suele tener un espesor de unas 100 micras (0,100 mm). (El espesor exacto del papel no es crucial).

source: If one always prints on a particular tape or printing surface then one may perform the paper test with that tape/surface in place. However, note that tape itself has a width and different tapes (or any other printing surface) will impact Z measurements. Be sure to rerun the paper test to measure each type of surface that is in use.
es: Si uno siempre imprime en una cinta o superficie de impresión en particular, entonces puede realizar la prueba de papel con esa cinta/superficie en su lugar. Sin embargo, tenga en cuenta que la cinta en sí tiene un ancho y que las diferentes cintas (o cualquier otra superficie de impresión) afectarán a las mediciones en Z. Asegúrese de volver a realizar la prueba del papel para medir cada tipo de superficie que se utilice.

source: When the nozzle is heated, its position (relative to the bed) changes due to thermal expansion. This thermal expansion is typically around a 100 microns, which is about the same width as a typical piece of printer paper. The exact amount of thermal expansion isn't crucial, just as the exact width of the paper isn't crucial. Start with the assumption that the two are equal (see below for a method of determining the difference between the two widths).
es: Cuando la boquilla se calienta, su posición (con respecto a la base) cambia debido a la expansión térmica. Esta expansión térmica suele ser de unas 100 micras, que es más o menos el mismo espesor que un trozo de papel de impresora típico. La cantidad exacta de expansión térmica no es crucial, como tampoco lo es el espesor exacto del papel. Empiece con la suposición de que ambos son iguales (vea más abajo un método para determinar la diferencia entre los dos anchos).
