Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Bed_Mesh.po
Languages: it, pt_br, zh_hans

source: It is possible to specify mesh parameters to modify the probed area. The following parameters are available:
it: È possibile specificare parametri mesh per modificare l'area sondata. Sono disponibili i seguenti parametri:
pt_br: É possível especificar os parâmetros da malha para modificar a área sondada. Os seguintes parâmetros estão disponíveis:
zh_hans: 可以通过指定网格参数来修改探测区域。以下参数可用：

source: Rectangular beds (cartesian):
it: Piatti rettangolari (cartesiani):
pt_br: Camas retangulares (cartesianas):
zh_hans: 矩形打印床（笛卡尔 Cartesian）：

source: Round beds (delta):
it: Piatti rotondi (delta):
pt_br: Camas circulares (delta):
zh_hans: 圆形打印床（三角洲 delta）：

source: All beds:
it: Tutti i piatti:
pt_br: Todas as camas:
zh_hans: 全部打印床：

source: Profiles
it: Profili
pt_br: Perfis
zh_hans: 配置

source: Any other saved profile can be removed in the same fashion, replacing *default* with the named profile you wish to remove.
it: Qualsiasi altro profilo salvato può essere rimosso allo stesso modo, sostituendo *default* con il nome del profilo che desideri rimuovere.
pt_br: Qualquer outro perfil salvo pode ser removido da mesma maneira, substituindo *default* pelo nome do perfil que você deseja remover.
zh_hans: 任何其他保存的配置也可以用相同的方式删除，用你想删除的配置名称替换*default*。

source: Output
pt_br: Saída
zh_hans: 输出

source: Outputs the current mesh state to the terminal. Note that the mesh itself is output
it: Invia lo stato della mesh corrente al terminale. Si noti che viene emessa la mesh stessa
pt_br: Mostra o estado atual da malha no terminal. Observe que a malha em si é exibida
zh_hans: 将当前网格状态输出到终端。请注意，输出的是网格本身

source: The PGP parameter is shorthand for "Print Generated Points". If `PGP=1` is set, the generated probed points will be output to the terminal:
it: Il parametro PGP è un'abbreviazione per "Print Generated Points". Se è impostato `PGP=1`, i punti sondati generati verranno inviati al terminale:
pt_br: O parâmetro PGP é uma abreviação para "Print Generated Points" (Exibir Pontos Gerados). Se `PGP=1` for definido, os pontos sondados gerados serão exibidos no terminal:
zh_hans: PGP 参数是“打印生成的点”的简写。如果设置了`PGP=1`，生成的探测点将输出到终端：

source: The "Tool Adjusted" points refer to the nozzle location for each point, and the "Probe" points refer to the probe location. Note that when manually probing the "Probe" points will refer to both the tool and nozzle locations.
it: I punti "Tool Adjusted" si riferiscono alla posizione dell'ugello per ciascun punto e i punti "Probe" si riferiscono alla posizione della sonda. Si noti che quando il probing è manuale i punti "sonda" si riferiscono sia alla posizione dell'utensile che dell'ugello.
pt_br: Os pontos "Ajustados pela Ferramenta" se referem à localização da ponta da extrusora (bico) para cada ponto, enquanto os pontos "Sondados" (Probe) se referem à localização da sonda. Observe que, ao realizar a sondagem manualmente, os pontos "Sondados" (Probe) se referirão tanto à localização da ferramenta quanto à localização da ponta da extrusora (bico).
zh_hans: "Tool Adjusted"（工具调整）点指每个点的喷嘴位置，"Probe"（探针）点指探头位置。请注意，手动探测时"Probe"（探针）点时将同时指工具和喷嘴位置。

source: Clear Mesh State
it: Cancella stato mesh
pt_br: Limpar Estado da Malha
zh_hans: 清除网格状态

source: This gcode may be used to clear the internal mesh state.
it: Questo gcode può essere utilizzato per cancellare lo stato della mesh interna.
pt_br: Este gcode pode ser usado para apagar o estado interno da malha.
zh_hans: 此 gcode 可用于清除内部网格状态。

source: Apply X/Y offsets
it: Applicare gli offset X/Y
pt_br: Aplicar deslocamentos em X/Y
zh_hans: 应用X/Y偏移量

source: This is useful for printers with multiple independent extruders, as an offset is necessary to produce correct Z adjustment after a tool change. Offsets should be specified relative to the primary extruder. That is, a positive X offset should be specified if the secondary extruder is mounted to the right of the primary extruder, and a positive Y offset should be specified if the secondary extruder is mounted "behind" the primary extruder.
it: Ciò è utile per le stampanti con più estrusori indipendenti, poiché è necessario un offset per produrre la corretta regolazione Z dopo un cambio utensile. Gli offset devono essere specificati rispetto all'estrusore primario. Vale a dire, è necessario specificare un offset X positivo se l'estrusore secondario è montato a destra dell'estrusore primario e un offset Y positivo se l'estrusore secondario è montato "dietro" l'estrusore primario.
pt_br: Isso é útil para impressoras com múltiplos extrusores independentes, já que um deslocamento é necessário para produzir o ajuste correto em Z após a troca de ferramenta. Os deslocamentos devem ser especificados em relação ao extrusor primário. Ou seja, um deslocamento positivo em X deve ser especificado se o extrusor secundário estiver montado à direita do extrusor primário, e um deslocamento positivo em Y deve ser especificado se o extrusor secundário estiver montado "atrás" do extrusor primário.
zh_hans: 这对有多个独立挤出头的打印机很有用，因为偏移量是必要的，以便在更换工具后产生正确的Z调整。应指定它们相对于主挤出头的偏移量。也就是说，如果第二个挤出头安装在第一个挤出头的右边，应指定一个正的X偏移量，如果第二个挤出头安装在第一个挤出头的 "后面"，应指定一个正的Y偏移量。

source: Bed Mesh
it: Matrice del Piatto
pt_br: Malha da Cama
zh_hans: 床网

source: Initiates the probing procedure for Bed Mesh Calibration.
it: Avvia la procedura di sondaggio per la calibrazione della mesh del piatto.
pt_br: Inicia o procedimento de sondagem para a Calibração da Malha da Cama (Bed Mesh Calibration).
zh_hans: 启动床网校准的探测程序。

source: The mesh will be saved into a profile specified by the `PROFILE` parameter, or `default` if unspecified. If `METHOD=manual` is selected then manual probing will occur. When switching between automatic and manual probing the generated mesh points will automatically be adjusted.
it: La mesh verrà salvata in un profilo specificato dal parametro `PROFILE`, o `default` se non specificato. Se viene selezionato `METHOD=manual`, si verificherà il rilevamento manuale. Quando si passa dal probing automatico a quello manuale, i punti mesh generati verranno regolati automaticamente.
pt_br: A malha será salva em um perfil especificado pelo parâmetro `PROFILE`, ou `default` se não for especificado. Se `METHOD=manual` for selecionado, a sondagem manual será realizada. Ao alternar entre sondagem automática e manual, os pontos gerados da malha serão ajustados automaticamente.
zh_hans: 网格将被保存到由 `PROFILE` 参数指定的配置中，如果没有指定，则使用 `default`。如果选择了 `METHOD=manual` ，那么将进行手动探测。在自动和手动探测之间切换时，生成的网格点会自动调整。

source: Bed Mesh works by intercepting gcode move commands and applying a transform to their Z coordinate. Long moves must be split into smaller moves to correctly follow the shape of the bed. The options below control the splitting behavior.
it: Bed Mesh funziona intercettando i comandi di spostamento di gcode e applicando una trasformazione alla loro coordinata Z. I movimenti lunghi devono essere suddivisi in movimenti più piccoli per seguire correttamente la forma del piatto. Le opzioni seguenti controllano il comportamento di divisione.
pt_br: A Malha da Cama funciona interceptando comandos de movimento gcode e aplicando uma transformação em suas coordenadas Z. Movimentos longos devem ser divididos em movimentos menores para seguir corretamente a forma da cama. As opções abaixo controlam o comportamento de divisão.
zh_hans: 床网的工作原理是拦截 G 代码移动命令并对其 Z 坐标进行变换。长的移动必须被分割成较小的移动以正确地遵循床的形状。下面的选项可以控制分割的行为。

source: Prior to Mesh Calibration you will need to be sure that your Probe's Z-Offset is calibrated. If using an endstop for Z homing it will need to be calibrated as well. See [Probe Calibrate](Probe_Calibrate.md) and Z_ENDSTOP_CALIBRATE in [Manual Level](Manual_Level.md) for more information.
it: Prima della calibrazione della mesh dovrai assicurarti che l'offset Z della tua sonda sia calibrato. Se si utilizza un fine corsa per l'homing Z, anche questo dovrà essere calibrato. Per ulteriori informazioni, vedere [Probe Calibrate](Probe_Calibrate.md) e Z_ENDSTOP_CALIBRATE in [Manual Level](Manual_Level.md).
pt_br: Antes de realizar a Calibração da Malha (Mesh Calibration), é necessário garantir que o Z-Offset da sua sonda esteja calibrado. Se estiver usando um fim de curso (endstop) para o homing do eixo Z, ele também precisará ser calibrado. Para mais informações, consulte [Calibraçao de Sonda](Probe_Calibrate.md) e "Z_ENDSTOP_CALIBRATE" em [Nivelamento Manual](Manual_Level.md).

source: `BED_MESH_CALIBRATE PROFILE=<name> METHOD=[manual | automatic] [<probe_parameter>=<value>] [<mesh_parameter>=<value>]` *Default Profile: default* *Default Method: automatic if a probe is detected, otherwise manual*
it: `BED_MESH_CALIBRATE PROFILE=<nome> METHOD=[manuale | automatico] [<parametro_sonda>=<valore>] [<mesh_parameter>=<valore>]` *Profilo predefinito: default* *Metodo predefinito: automatico se viene rilevata una sonda, altrimenti manuale*
pt_br: `BED_MESH_CALIBRATE PROFILE=<name> METHOD=[manual | automatic] [<probe_parameter>=<value>] [<mesh_parameter>=<value>]` *Perfil padrão: default* *Método padrão: automatic se uma sonda for detectada, caso contrário, manual*

source: See the configuration documentation above for details on how each parameter applies to the mesh.
it: Vedere la documentazione di configurazione sopra per i dettagli su come ogni parametro si applica alla mesh.
pt_br: Consulte a documentação de configuração acima para obter detalhes sobre como cada parâmetro se aplica à malha.

source: `BED_MESH_PROFILE SAVE=<name> LOAD=<name> REMOVE=<name>`
pt_br: `BED_MESH_PROFILE SAVE=<nome> LOAD=<nome> REMOVE=<nome>`

source: After a BED_MESH_CALIBRATE has been performed, it is possible to save the current mesh state into a named profile. This makes it possible to load a mesh without re-probing the bed. After a profile has been saved using `BED_MESH_PROFILE SAVE=<name>` the `SAVE_CONFIG` gcode may be executed to write the profile to printer.cfg.
it: Dopo aver eseguito un BED_MESH_CALIBRATE, è possibile salvare lo stato della mesh corrente in un profilo denominato. Ciò consente di caricare una mesh senza risondare il piatto. Dopo che un profilo è stato salvato usando `BED_MESH_PROFILE SAVE=<nome>` è possibile eseguire il gcode `SAVE_CONFIG` per scrivere il profilo su printer.cfg.
pt_br: Após a execução de um BED_MESH_CALIBRATE, é possível salvar o estado atual da malha em um perfil com um nome. Isso permite carregar uma malha sem a necessidade de sondar a cama novamente. Após salvar um perfil usando `BED_MESH_PROFILE SAVE=<nome>`, o código G (gcode) `SAVE_CONFIG` pode ser executado para escrever o perfil no arquivo printer.cfg.

source: Profiles can be loaded by executing `BED_MESH_PROFILE LOAD=<name>`.
it: I profili possono essere caricati eseguendo `BED_MESH_PROFILE LOAD=<name>`.
pt_br: Os perfis podem ser carregados executando `BED_MESH_PROFILE LOAD=<nome>`.

source: `mesh_min: 35, 6` *Required* The first probed coordinate, nearest to the origin. This coordinate is relative to the probe's location.
it: `mesh_min: 35, 6` *Richiesto* La prima coordinata rilevata, più vicina all'origine. Questa coordinata è relativa alla posizione della sonda.
pt_br: `mesh_min: 35, 6` *Obrigatório* A primeira coordenada sondada, mais próxima à origem. Esta coordenada é relativa à localização da sonda.

source: `probe_count: 5, 3` *Default Value: 3, 3* The number of points to probe on each axis, specified as X, Y integer values. In this example 5 points will be probed along the X axis, with 3 points along the Y axis, for a total of 15 probed points. Note that if you wanted a square grid, for example 3x3, this could be specified as a single integer value that is used for both axes, ie `probe_count: 3`. Note that a mesh requires a minimum probe_count of 3 along each axis.
it: `probe_count: 5, 3` *Valore predefinito: 3, 3* Il numero di punti da sondare su ciascun asse, specificato come valori interi X, Y. In questo esempio verranno tastati 5 punti lungo l'asse X, con 3 punti lungo l'asse Y, per un totale di 15 punti tastati. Nota che se desideri una griglia quadrata, ad esempio 3x3, questo potrebbe essere specificato come un singolo valore intero che viene utilizzato per entrambi gli assi, ad esempio `probe_count: 3`. Si noti che una mesh richiede un probe_count minimo di 3 lungo ciascun asse.
pt_br: `probe_count: 5, 3` *Valor padrão: 3, 3* O número de pontos a serem sondados em cada eixo, especificados como valores inteiros X, Y. Neste exemplo, 5 pontos serão sondados ao longo do eixo X e 3 pontos ao longo do eixo Y, totalizando 15 pontos sondados. Observe que, se você quisesse uma grade quadrada, por exemplo, 3x3, isso poderia ser especificado como um único valor inteiro que é usado para ambos os eixos, por exemplo, `probe_count: 3`. Lembre-se de que uma malha requer um `probe_count` mínimo de 3 ao longo de cada eixo.

source: `mesh_origin: 0, 0` *Default Value: 0, 0* The center point of the mesh. This coordinate is relative to the probe's location. While the default is 0, 0, it may be useful to adjust the origin in an effort to probe a larger portion of the bed. See the illustration below.
it: `mesh_origin: 0, 0` *Valore predefinito: 0, 0* Il punto centrale della mesh. Questa coordinata è relativa alla posizione della sonda. Sebbene il valore predefinito sia 0, 0, può essere utile regolare l'origine nel tentativo di sondare una porzione più ampia del letto. Vedi l'illustrazione qui sotto.
pt_br: `mesh_origin: 0, 0` *Valor padrão: 0, 0* O ponto central da malha. Esta coordenada é relativa à localização da sonda. Embora o padrão seja 0, 0, pode ser útil ajustar a origem para sondar uma porção maior da cama. Veja a ilustração abaixo.

source: `mesh_pps: 2, 3` *Default Value: 2, 2* The `mesh_pps` option is shorthand for Mesh Points Per Segment. This option specifies how many points to interpolate for each segment along the X and Y axes. Consider a 'segment' to be the space between each probed point. Like `probe_count`, `mesh_pps` is specified as an X, Y integer pair, and also may be specified a single integer that is applied to both axes. In this example there are 4 segments along the X axis and 2 segments along the Y axis. This evaluates to 8 interpolated points along X, 6 interpolated points along Y, which results in a 13x8 mesh. Note that if mesh_pps is set to 0 then mesh interpolation is disabled and the probed matrix will be sampled directly.
it: `mesh_pps: 2, 3` *Valore predefinito: 2, 2* L'opzione `mesh_pps` è un'abbreviazione per Mesh Points Per Segment. Questa opzione specifica quanti punti interpolare per ciascun segmento lungo gli assi X e Y. Considera un "segmento" come lo spazio tra ogni punto sondato. Come `probe_count`, `mesh_pps` è specificato come una coppia di interi X, Y e può anche essere specificato un singolo intero che viene applicato a entrambi gli assi. In questo esempio ci sono 4 segmenti lungo l'asse X e 2 segmenti lungo l'asse Y. Questo restituisce 8 punti interpolati lungo X, 6 punti interpolati lungo Y, che si traduce in una mesh 13x8. Si noti che se mesh_pps è impostato su 0, l'interpolazione della mesh è disabilitata e la matrice sondata verrà campionata direttamente.
pt_br: `mesh_pps: 2, 3` *Valor padrão: 2, 2* A opção `mesh_pps` é uma abreviação para "Mesh Points Per Segment" (Pontos de Malha por Segmento). Essa opção especifica quantos pontos serão interpolados para cada segmento ao longo dos eixos X e Y. Um 'segmento' é o espaço entre cada ponto sondado. Assim como `probe_count`, `mesh_pps` é especificado como um par de números inteiros X, Y, e também pode ser especificado como um único número inteiro que se aplica a ambos os eixos.

source: Loading the default profile
it: Caricamento del profilo predefinito
pt_br: Carregando o perfil padrão

source: Previous versions of `bed_mesh` always loaded the profile named *default* on startup if it was present. This behavior has been removed in favor of allowing the user to determine when a profile is loaded. If a user wishes to load the `default` profile it is recommended to add `BED_MESH_PROFILE LOAD=default` to either their `START_PRINT` macro or their slicer's "Start G-Code" configuration, whichever is applicable.
it: Le versioni precedenti di `bed_mesh` caricavano sempre il profilo denominato *default* all'avvio se era presente. Questo comportamento è stato rimosso per consentire all'utente di determinare quando viene caricato un profilo. Se un utente desidera caricare il profilo `predefinito`, si consiglia di aggiungere `BED_MESH_PROFILE LOAD=default` alla macro `START_PRINT` o alla configurazione "Start G-Code" del proprio slicer, a seconda di quale sia applicabile.
pt_br: Versões anteriores do `bed_mesh` sempre carregavam o perfil chamado *default* na inicialização, caso estivesse presente. Esse comportamento foi removido para permitir que o usuário determine quando um perfil é carregado. Se o usuário desejar carregar o perfil `default`, é recomendado adicionar `BED_MESH_PROFILE LOAD=default` no macro `START_PRINT` ou na configuração de "Start G-Code" do slicer, dependendo do que for aplicável.

source: Alternatively the old behavior of loading a profile at startup can be restored with a `[delayed_gcode]`:
it: In alternativa, il vecchio comportamento di caricamento di un profilo all'avvio può essere ripristinato con un `[delayed_gcode]`:
pt_br: Alternativamente, o antigo comportamento de carregar um perfil na inicialização pode ser restaurado com `[delayed_gcode]`:

source: The Bed Mesh module may be used to compensate for bed surface irregularities to achieve a better first layer across the entire bed. It should be noted that software based correction will not achieve perfect results, it can only approximate the shape of the bed. Bed Mesh also cannot compensate for mechanical and electrical issues. If an axis is skewed or a probe is not accurate then the bed_mesh module will not receive accurate results from the probing process.
pt_br: O módulo "Bed Mesh" pode ser usado para compensar irregularidades na superfície da cama a fim de obter uma primeira camada consistente em toda cama. Deve-se observar que a correção baseada em software não alcançará um resultado perfeito, podendo apenas se aproximar da forma da cama. Além disso, o "Bed Mesh" não pode corrigir problemas mecânicos e/ou elétricos. Se um eixo estiver desalinhado ou uma sonda não for precisa, o módulo "bed_mesh" não receberá resultados precisos do processo de sondagem da superfície.

source: `mesh_max: 240, 198` *Required* The probed coordinate farthest farthest from the origin. This is not necessarily the last point probed, as the probing process occurs in a zig-zag fashion. As with `mesh_min`, this coordinate is relative to the probe's location.
pt_br: `mesh_max: 240, 198` *Obrigatório* A coordenada sondada mais distante da origem. Isso não é necessariamente o último ponto sondado, pois o processo de sondagem ocorre em um padrão de zigue-zague. Assim como `mesh_min`, esta coordenada é relativa à localização da sonda.

source: The illustration below shows how the probed points are generated. As you can see, setting the `mesh_origin` to (-10, 0) allows us to specify a larger mesh radius of 85.
pt_br: A ilustração abaixo mostra como os pontos sondados são gerados. Como você pode ver, definir `mesh_origin` com (-10, 0) nos permite especificar um raio maior para a malha de 85.

source: While its possible to sample the probed matrix directly using simple bi-linear interpolation to determine the Z-Values between probed points, it is often useful to interpolate extra points using more advanced interpolation algorithms to increase mesh density. These algorithms add curvature to the mesh, attempting to simulate the material properties of the bed. Bed Mesh offers lagrange and bicubic interpolation to accomplish this.
pt_br: Embora seja possível amostrar diretamente a matriz sondada usando interpolação bilinear simples para determinar os valores Z entre os pontos sondados, muitas vezes é útil interpolar pontos extras usando algoritmos de interpolação mais avançados para aumentar a densidade da malha. Esses algoritmos adicionam curvatura à malha, tentando simular as propriedades do material da cama. A Malha da Cama oferece interpolação de Lagrange e bicúbica para realizar esse objetivo.

source: Generally the default values for these options are sufficient, in fact the default value of 5mm for the `move_check_distance` may be overkill. However an advanced user may wish to experiment with these options in an effort to squeeze out the optimal first layer.
pt_br: Geralmente, os valores padrão para essas opções são suficientes; na verdade, o valor padrão de 5 mm para `move_check_distance` pode ser exagerado. No entanto, um usuário avançado pode desejar experimentar com essas opções na tentativa de obter a camada inicial ideal.

source: `fade_target: 0` *Default Value: The average Z value of the mesh* The `fade_target` can be thought of as an additional Z offset applied to the entire bed after fade completes. Generally speaking we would like this value to be 0, however there are circumstances where it should not be. For example, lets assume your homing position on the bed is an outlier, its .2 mm lower than the average probed height of the bed. If the `fade_target` is 0, fade will shrink the print by an average of .2 mm across the bed. By setting the `fade_target` to .2, the homed area will expand by .2 mm, however, the rest of the bed will be accurately sized. Generally its a good idea to leave `fade_target` out of the configuration so the average height of the mesh is used, however it may be desirable to manually adjust the fade target if one wants to print on a specific portion of the bed.
pt_br: `fade_target: 0` *Valor padrão: O valor médio da coordenada Z da malha* O `fade_target` pode ser considerado como um deslocamento Z adicional aplicado em toda a cama após a conclusão do fade. Geralmente, gostaríamos que esse valor fosse 0, no entanto, há circunstâncias em que não deve ser. Por exemplo, suponha que sua posição de homing (inicial) na cama seja uma exceção, ou seja, ela está 0,2 mm abaixo da altura média sondada da cama. Se o `fade_target` for 0, o fade reduzirá a impressão em uma média de 0,2 mm em toda a cama. Ao definir o `fade_target` para 0,2, a área de homing se expandirá em 0,2 mm, mas o restante da cama será dimensionado com precisão. Geralmente, é uma boa ideia deixar o `fade_target` fora da configuração para que a altura média da malha seja usada; no entanto, pode ser desejável ajustar manualmente o `fade_target` se você desejar imprimir em uma parte específica da cama.

source: It should be noted that each time a BED_MESH_CALIBRATE occurs, the current state is automatically saved to the *default* profile. The *default* profile can be removed as follows:
pt_br: Deve ser observado que cada vez que ocorre um BED_MESH_CALIBRATE, o estado atual é automaticamente salvo no perfil *default*. O perfil *default* pode ser removido da seguinte forma:

source: Configuring the zero reference position
pt_br: Configurando a posição de referência zero
