Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Bed_Mesh.po
Languages: it, pt_br, zh_hans

source: Many probes are susceptible to "drift", ie: inaccuracies in probing introduced by heat or interference. This can make calculating the probe's z-offset challenging, particularly at different bed temperatures. As such, some printers use an endstop for homing the Z axis and a probe for calibrating the mesh. In this configuration it is possible offset the mesh so that the (X, Y) `reference position` applies zero adjustment. The `reference postion` should be the location on the bed where a [Z_ENDSTOP_CALIBRATE](./Manual_Level#calibrating-a-z-endstop) paper test is performed. The bed_mesh module provides the `zero_reference_position` option for specifying this coordinate:
pt_br: Muitas sondas são suscetíveis a “desvios”, ou seja: imprecisões na sondagem introduzidas por calor ou interferência. Isso pode tornar o cálculo do z-offset da sonda um desafio, especialmente em diferentes temperaturas do leito. Como tal, algumas impressoras usam um fim de curso para posicionar o eixo "Z" e uma sonda para calibrar a malha. Nesta configuração é possível deslocar a malha para que a `reference position` (X, Y) aplique ajuste zero. A `reference position` deve ser o local na cama onde um teste de papel [Z_ENDSTOP_CALIBRATE](./Manual_Level#calibrating-a-z-endstop) é realizado. O módulo "bed_mesh" fornece a opção `zero_reference_position` para especificar esta coordenada:

source: `zero_reference_position: ` *Default Value: None (disabled)* The `zero_reference_position` expects an (X, Y) coordinate matching that of the `reference position` described above. If the coordinate lies within the mesh then the mesh will be offset so the reference position applies zero adjustment. If the coordinate lies outside of the mesh then the coordinate will be probed after calibration, with the resulting z-value used as the z-offset. Note that this coordinate must NOT be in a location specified as a `faulty_region` if a probe is necessary.
pt_br: `zero_reference_position: ` *Valor padrão: Nenhum (desabilitado)* A `zero_reference_position` espera uma coordenada (X, Y) correspondente à `reference position` descrita acima. Se a coordenada estiver dentro da malha, então a malha será deslocada para que a posição de referência aplique ajuste zero. Se a coordenada estiver fora da malha, então a coordenada será sondada após a calibração, com o z-value resultante usado como z-offset. Observe que esta coordenada NÃO deve estar em um local especificado como `faulty_region` se uma sonda for necessária.

source: The deprecated relative_reference_index
pt_br: Obsoleto relative_reference_index

source: Existing configurations using the `relative_reference_index` option must be updated to use the `zero_reference_position`. The response to the [BED_MESH_OUTPUT PGP=1](#output) gcode command will include the (X, Y) coordinate associated with the index; this position may be used as the value for the `zero_reference_position`. The output will look similar to the following:
pt_br: As configurações existentes que usam a opção `relative_reference_index` devem ser atualizadas para usar a `zero_reference_position`. A resposta ao comando gcode [BED_MESH_OUTPUT PGP=1](#output) incluirá a coordenada (X, Y) associada ao índice; esta posição pode ser usada como o valor para `zero_reference_position`. A saída será semelhante à seguinte:

source: *Note: The above output is also printed in `klippy.log` during initialization.*
pt_br: *Nota: A saída acima também é impressa em `klippy.log` durante a inicialização.*

source: Using the example above we see that the `relative_reference_index` is printed along with its coordinate. Thus the `zero_reference_position` is `131.5, 108`.
pt_br: Usando o exemplo acima, vemos que o `relative_reference_index` é impresso junto com sua coordenada. Portanto, a `zero_reference_position` é `131,5, 108`.

source: The Bed Mesh module may be used to compensate for bed surface irregularties to achieve a better first layer across the entire bed. It should be noted that software based correction will not achieve perfect results, it can only approximate the shape of the bed. Bed Mesh also cannot compensate for mechanical and electrical issues. If an axis is skewed or a probe is not accurate then the bed_mesh module will not receive accurate results from the probing process.
zh_hans: 网床 插件可用于补偿热床表面的不规则性，以保证在打印过程中获得更好的第一层。 需要注意的是，基于软件的校正还不能达到完美的程度，它只能尽可能达到床的形状。网床 也无法补偿机械和电气导致的问题。 如果机器没装好结构歪了或探针不准确，则 网床 模块将无法从探测过程中获得令人满意的结果。

source: Prior to Mesh Calibration you will need to be sure that your Probe's Z-Offset is calibrated. If using an endstop for Z homing it will need to be calibrated as well. See [Probe_Calibrate](Probe_Calibrate.md) and Z_ENDSTOP_CALIBRATE in [Manual_Level](Manual_Level.md) for more information.
zh_hans: 在进行网格校准之前，请确保您已经校准了探头的 Z 偏移。 如果使用限位开关进行 Z 归位，则还需要对其进行校准。 有关详细信息，请参阅 [手动调平](Manual_Level.md) 中的 [探针校准](Probe_Calibrate.md) 和 Z_ENDSTOP_CALIBRATE。

source: `mesh_min: 35,6` *Required* The first probed coordinate, nearest to the origin. This coordinate is relative to the probe's location.
zh_hans: `mesh_min: 35,6` *必须配置* 第一个探测的坐标，距离原点最近。该坐标就是探针所在的位置。

source: `mesh_max: 240,198` *Required* The probed coordinate farthest farthest from the origin. This is not necessarily the last point probed, as the probing process occurs in a zig-zag fashion. As with `mesh_min`, this coordiante is relative to the probe's location.
zh_hans: `mesh_max: 240,198` *必须配置* 距离原点最远的探测坐标。 这不一定是探测的最后一个点，因为探测过程以锯齿形的方式运动。 与 `mesh_min` 一样，这个坐标是探针的位置。

source: `probe_count: 5,3` *Default Value: 3,3* The number of points to probe on each axis, specified as x,y integer values. In this example 5 points will be probed along the X axis, with 3 points along the Y axis, for a total of 15 probed points. Note that if you wanted a square grid, for example 3x3, this could be specified as a single integer value that is used for both axes, ie `probe_count: 3`. Note that a mesh requires a minimum probe_count of 3 along each axis.
zh_hans: `probe_count: 5,3` *默认值：3,3* 每条轴上要探测的点数，指定为 x,y 整数值。 在本示例中，将沿 X 轴探测 5 个点，沿 Y 轴探测 3 个点，总共探测 15 个点。 请注意，如果您想要一个方形网格，例如 3x3，可以将指定其为一个整数值，比如 `probe_count: 3`。 请注意，网格需要沿每个轴的最小probe_count 为3。

source: ![bedmesh_rect_basic](img/bedmesh_rect_basic.svg)
zh_hans: ![矩形网床基本配置](img/bedmesh_rect_basic.svg)

source: `mesh_origin: 0,0` *Default Value: 0,0* The center point of the mesh. This coordinate is relative to the probe's location. While the default is 0,0, it may be useful to adjust the origin in an effort to probe a larger portion of the bed. See the illustration below.
zh_hans: `mesh_origin: 0,0` *默认值： 0,0* 探测网格的中心点。 该坐标相对于探针的位置。 虽然默认值为 0,0，但为了探测床更多的部分而调整原点可能很有用。 请参阅下图。

source: The illustration below shows how the probed points are generated. As you can see, setting the `mesh_origin` to (-10, 0) allows us to specifiy a larger mesh radius of 85.
zh_hans: 下图展示了如何生成探测点。 如您所见，将 `mesh_origin` 设置为 (-10, 0) 允许我们指定更大的网格半径 85mm。

source: ![bedmesh_round_basic](img/bedmesh_round_basic.svg)
zh_hans: ![圆形网床基本配置](img/bedmesh_round_basic.svg)

source: While its possible to sample the probed matrix directly using simple bilinear interpolation to determine the Z-Values between probed points, it is often useful to interpolate extra points using more advanced interpolation algorithms to increase mesh density. These algorithms add curvature to the mesh, attempting to simulate the material properties of the bed. Bed Mesh offers lagrange and bicubic interpolation to accomplish this.
zh_hans: 虽然可以使用简单的双线性插值直接对探测网格的数据进行采样以确定探测点之间的 Z 值，但使用更高级的插值算法来插入额外的点以增加网格密度通常很有用。 这些算法向网格添加曲率，试图模拟床的材料属性。 网床提供了拉格朗日和双三次插值来实现这一点。

source: `mesh_pps: 2,3` *Default Value: 2,2* The `mesh_pps` option is shorthand for Mesh Points Per Segment. This option specifies how many points to interpolate for each segment along the x and y axes. Consider a 'segment' to be the space between each probed point. Like `probe_count`, `mesh_pps` is specified as an x,y integer pair, and also may be specified a single integer that is applied to both axes. In this example there are 4 segments along the X axis and 2 segments along the Y axis. This evaluates to 8 interpolated points along X, 6 interpolated points along Y, which results in a 13x8 mesh. Note that if mesh_pps is set to 0 then mesh interpolation is disabled and the probed matrix will be sampled directly.
zh_hans: `mesh_pps: 2,3` *默认值：2,2*`mesh_pps` 选项是每段网格点数的简写。 此选项指定沿 x 轴和 y 轴为每个线段插值的点数。 将“段”视为每个探测点之间的间隔。 与 `probe_count` 一样，`mesh_pps` 被指定为 x,y 整数对，也可以指定为应用于两个轴的单个整数。 在此示例中，沿 X 轴有 4 个线段，沿 Y 轴有 2 个线段。 这计算为沿 X 的 8 个插值点，沿 Y 的 6 个插值点，从而产生 13x8 网格。 请注意，如果 mesh_pps 设置为 0，则禁用网格插值，并且将直接对探测网格进行采样。

source: ![bedmesh_interpolated](img/bedmesh_interpolated.svg)
zh_hans: ![网床插值](img/bedmesh_interpolated.svg)

source: Generally the default values for these options are sufficient, in fact the default value of 5mm for the `move_check_distance` may be overkill. However an advanced user may wish to experiment with these options in an effort to squeeze out the optimial first layer.
zh_hans: 一般来说，这些选项的默认值就足够了，但事实上，`move_check_distance` 的默认值 5mm 可能会有点过度矫正。 所以，高端可能希望尝试使用这个选项来获得挤出最佳的第一层。

source: `fade_target: 0` *Default Value: The average Z value of the mesh* The `fade_target` can be thought of as an additional Z offset applied to the entire bed after fade completes. Generally speaking we would like this value to be 0, however there are circumstances where it should not be. For example, lets assume your homing position on the bed is an outlier, its .2 mm lower than the average probed height of the bed. If the `fade_target` is 0, fade will shrink the print by an average of .2 mm across the bed. By setting the `fade_target` to .2, the homed area will expand by .2 mm, however the rest of the bed will have an accurately sized. Generally its a good idea to leave `fade_target` out of the configuration so the average height of the mesh is used, however it may be desirable to manually adjust the fade target if one wants to print on a specific portion of the bed.
zh_hans: `fade_target: 0` *默认值：热床网格的平均Z值* `fade_target` 是在网格淡出完成后应用于整个床的额外 Z 偏移。一 般来说，这个值是 0，但有些情况下它需要改动。 例如，您在热床的归位位置与床的平均探测高度有偏差，它比床的平均探测高度低 0.2 mm。 如果 `fade_target` 为 0，淡出会将整个床的打印平均缩小 0.2 mm。 通过将 `fade_target` 设置为 0.2，归位的位置将扩大 0.2 毫米，但床的其余部分将具有准确的尺寸。 一般来说，最好不要修改 `fade_target` 而修正机器本身导致的误差，以便使用网格的平均高度，但是如果想要在床的特定部分打印，可能需要手动调整网格淡出。

source: The Relative Reference Index
it: L'Indice di Riferimento Relativo
zh_hans: 相对参考索引

source: Most probes are suceptible to drift, ie: inaccuracies in probing introduced by heat or interference. This can make calculating the probe's z-offset challenging, particuarly at different bed temperatures. As such, some printers use an endstop for homing the Z axis, and a probe for calibrating the mesh. These printers can benefit from configuring the relative reference index.
zh_hans: 大部分探针检测到的值容易产生误差，即：由温度或探测介质干扰产生的探测误差。 这加大探针Z偏移的看计算难度，尤其是在不同的热床温度下。 因此，一些打印机使用限位开关来归位 Z 轴，并使用探针来校准网格。 这些打印机可以从配置中的相对参考索引（relative_reference_index）中寻找帮助。

source: `relative_reference_index: 7` *Default Value: None (disabled)* When the probed points are generated they are each assigned an index. You can look up this index in klippy.log or by using BED_MESH_OUTPUT (see the section on Bed Mesh GCodes below for more information). If you assign an index to the `relative_reference_index` option, the value probed at this coordinate will replace the probe's z_offset. This effectively makes this coordinate the "zero" reference for the mesh.
it: `relative_reference_index: 7` *Valore predefinito: Nessuno (disabilitato)* Quando i punti sondati vengono generati, a ciascuno viene assegnato un indice. Puoi cercare questo indice in klippy.log o usando BED_MESH_OUTPUT (vedi la sezione sui GCodes Bed Mesh di seguito per maggiori informazioni). Se si assegna un indice all'opzione `relative_reference_index`, il valore rilevato a questa coordinata sostituirà lo z_offset del probe. Questo rende effettivamente questa coordinata il riferimento "zero" per la mesh.
zh_hans: `relative_reference_index: 7`*默认值：无（禁用）*生成探测点时，为每个点分配一个索引。您可以使用网床输出或在 klippy.log 中查找此索引（有关详细信息，请参阅下面的网床 G代码部分）。如果您为 `relative_reference_index` 选项分配了索引，则在该坐标处探测的值将替换探针的 Z偏移值。 这将把这个坐标作为“零高度”的参考。

source: When using the relative reference index, you should choose the index nearest to the spot on the bed where Z endstop calibration was done. Note that when looking up the index using the log or BED_MESH_OUTPUT, you should use the coordinates listed under the "Probe" header to find the correct index.
it: Quando si utilizza l'indice di riferimento relativo, è necessario scegliere l'indice più vicino al punto sul letto in cui è stata eseguita la calibrazione del fine corsa Z. Nota che quando cerchi l'indice usando il log o BED_MESH_OUTPUT, dovresti usare le coordinate elencate sotto l'intestazione "Probe" per trovare l'indice corretto.
zh_hans: 使用相对参考指数时，应选择距离床身 Z 限位器校准点最近的指数。 请注意，在网床输出或在日志中查找索引时，您应该使用“探针”标题下列出的坐标来查找正确的索引。

source: `ALGORITHM` See the configuration documentation above for details on how each parameter applies to the mesh.
zh_hans: `ALGORITHM` 关于每个参数对网格的影响，详见上方的配置文档。

source: After a BED_MESH_CALIBRATE has been performed, it is possible to save the current mesh state into a named profile. This makes it possible to load a mesh without re-probing the bed. After a profile has been saved using `BED_MESH_PROFILE SAVE=name` the `SAVE_CONFIG` gcode may be executed to write the profile to printer.cfg.
zh_hans: 在进行 BED_MESH_CALIBRATE 后，可以将当前网格状态保存到一个命名的配置中。这样就可以加载一个网格而不需要重新探测打印床。在使用`BED_MESH_PROFILE SAVE=name`保存了一个配置文件后，可以执行`SAVE_CONFIG`gcode，将配置文件写入print.cfg。

source: Profiles can be loaded by executing `BED_MESH_PROFILE LOAD=name`.
zh_hans: 可以通过运行 `BED_MESH_PROFILE LOAD=name` 来载入配置。

source: It should be noted that each time a BED_MESH_CALIBRATE occurs, the current state is automatically saved to the *default* profile. If this profile exists it is automatically loaded when Klipper starts. If this behavior is not desirable the *default* profile can be removed as follows:
zh_hans: 请注意，每次运行 BED_MESH_CALIBRATE 后，当前状态会被保存到 *default* 配置。如果这个配置在配置文件中存在，它会在 Klipper 启动时自动载入。如果不希望这种行为，可以通过以下命令删除 *default* 配置：

source: `BED_MESH_CALIBRATE PROFILE=name METHOD=[manual | automatic] [<probe_parameter>=<value>] [<mesh_parameter>=<value>]` *Default Profile: default* *Default Method: automatic if a probe is detected, otherwise manual*
zh_hans: `BED_MESH_CALIBRATE PROFILE=name METHOD=[manual | automatic] [<probe_parameter>=<value>] [<mesh_parameter>=<value>]` *默认配置文件：default* *默认方法：如果检测到探针则自动，否则手动*
