Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Bed_Level.po
Languages: es, ko, ru, zh_hant

source: Bed leveling (sometimes also referred to as "bed tramming") is critical to getting high quality prints. If a bed is not properly "leveled" it can lead to poor bed adhesion, "warping", and subtle problems throughout the print. This document serves as a guide to performing bed leveling in Klipper.
es: El nivelado de la base (aveces tambien llamado "bed tramming") es un proceso critico para obtener impresiones de gran calidad. Si la base no esta correctamente "nivelada" puede producirse una mala adherencia, "warping" (despegue de las esquinas) asi como problemas sutiles durante la impresion. Este documento sirve como una guia para realizar el nivelado de la base en Klipper.
ko: 베드 레벨링("베드 트램밍"이라고도 함)은 고품질의 인쇄물을 얻기 위해 매우 중요합니다. 베드가 제대로 "수평화"되지 않으면 베드 접착력이 떨어지고 "뒤틀림"이 발생하며 인쇄 과정에서 미묘한 문제가 발생할 수 있습니다. 이 문서는 클리퍼에서 베드 레벨링을 수행하기 위한 가이드 역할을 합니다.
ru: Выравнивание кровати (иногда также называемое "выравниванием стола") имеет решающее значение для получения высококачественных отпечатков. Если кровать не выровнен должным образом, это может привести к плохой адгезии слоя, "деформации" и незначительным проблемам по всей печати. Этот документ служит руководством по выполнению выравнивания слоя в Klipper.
zh_hant: 列印床調平（有時也被稱為 "bed tramming"）對於獲得高質量的列印結果至關重要。錯誤"調平"的列印床會造成附著力差、"翹曲"，以及整個列印過程中的細微問題。本文件是在 Klipper 中進行調平的指南。

source: It's important to understand the goal of bed leveling. If the printer is commanded to a position `X0 Y0 Z10` during a print, then the goal is for the printer's nozzle to be exactly 10mm from the printer's bed. Further, should the printer then be commanded to a position of `X50 Z10` the goal is for the nozzle to maintain an exact distance of 10mm from the bed during that entire horizontal move.
es: Es importante entender el objetivo de la nivelacion de la base. Si a la impresora le es comandado ir a la posicion `X0 Y0 Z10` durante una impresion, el objetivo de la boquilla es quedar exactamente a 10mm sobre la base de la impresora. Por lo que, si a la impresora le es comandado ir la posicion `X50 Z10` el objetivo es que la boquilla se mantenga a una distancia exacta de 10mm sobre la base durante todo el movimiento horizontal.
ko: 베드 레벨링의 목표를 이해하는 것이 중요합니다. 인쇄 중에 프린터가 `X0 Y0 Z10` 위치로 명령을 받은 경우 목표는 프린터의 노즐이 프린터 베드에서 정확히 10mm가 되도록 하는 것입니다. 또한 프린터가 `X50 Z10` 위치로 명령을 받으면 전체 수평 이동 중에 노즐이 베드에서 정확한 거리 10mm를 유지하는 것이 목적입니다.
ru: Важно понимать цель выравнивания ложа. Если во время печати принтеру дается команда занять положение `X0 Y0 Z10`, то цель состоит в том, чтобы сопло принтера находилось на расстоянии ровно 10 мм от печатной формы. Далее, если принтеру будет дана команда перейти в положение `X50 Z10`, то цель состоит в том, чтобы сопло принтера сохраняло точное расстояние в 10 мм от станины в течение всего горизонтального перемещения.
zh_hant: 瞭解列印床調平的目標很重要。如果印表機在列印過程中被命令到`X0 Y0 Z10`的位置，那麼目標是讓印表機的噴嘴距離列印床正好10毫米。此外，如果印表機被命令到`X50 Z10`的位置，目標是在整個水平移動過程中，噴嘴與床面始終保持10毫米的準確距離。

source: In order to get good quality prints the printer should be calibrated so that Z distances are accurate to within about 25 microns (.025mm). This is a small distance - significantly smaller than the width of a typical human hair. This scale can not be measured "by eye". Subtle effects (such as heat expansion) impact measurements at this scale. The secret to getting high accuracy is to use a repeatable process and to use a leveling method that leverages the high accuracy of the printer's own motion system.
es: Para obtener impresiones de buena calidad, la impresora debe estar calibrada para que las distancias Z tengan una precisión de unas 25 micras (.025mm). Esta es una distancia pequeña - significativamente menor que el ancho de un cabello humano. Esta escala no puede medirse "a ojo". Los efectos sutiles (como la expansión térmica) afectan a las mediciones a esta escala. El secreto para conseguir una gran precisión es utilizar un proceso repetible y utilizar un método de nivelación que aproveche la alta precisión del sistema de movimiento de la propia impresora.
ko: 좋은 품질의 인쇄물을 얻으려면 Z 거리가 약 25미크론(.025mm) 이내로 정확하도록 프린터를 보정해야 합니다. 이것은 일반적인 인간의 머리카락 폭보다 상당히 얇은 거리입니다. 이 척도는 눈으로 측정할 수 없습니다. 열팽창과 같은 미묘한 효과는 이 척도의 측정에 영향을 미칩니다. 높은 정확도를 얻는 비결은 반복 가능한 공정을 사용하고 프린터 자체의 모션 시스템의 높은 정확도를 활용하는 레벨링 방법을 사용하는 것입니다.
ru: Для получения отпечатков хорошего качества принтер должен быть откалиброван таким образом, чтобы расстояния Z были точными с точностью примерно до 25 микрон (0,025 мм). Это небольшое расстояние - значительно меньше ширины обычного человеческого волоса. Эта шкала не может быть измерена "на глаз". Тонкие эффекты (такие как тепловое расширение) влияют на измерения в этом масштабе. Секрет получения высокой точности заключается в использовании повторяющегося процесса и метода выравнивания, который использует высокую точность собственной системы перемещения принтера.
zh_hant: 爲了獲得良好的列印質量，印表機應進行校準，使Z軸距離的精度在約25微米（0.025毫米）。這是一個很小的距離，遠小於典型人類頭髮的寬度。這個尺度是不能 "用眼睛 "來測量的。微妙的影響（如熱膨脹）會影響這個尺度的測量。獲得高精度的秘訣是使用一個可重複，高精度，並能夠利用印表機自身運動系統的調平方法。

source: Choose the appropriate calibration mechanism
es: Elija el mecanismo de calibración apropiado
ko: 적절한 보정 메커니즘 선택하기
ru: Выберите подходящий механизм калибровки
zh_hant: 選擇適當的校準機制

source: Different types of printers use different methods for performing bed leveling. All of them ultimately depend on the "paper test" (described below). However, the actual process for a particular type of printer is described in other documents.
es: Los distintos tipos de impresoras utilizan diferentes métodos para realizar la nivelación de la cama. Todos ellos dependen, en última instancia, de la "prueba del papel" (descrita a continuación). Sin embargo, el proceso para algun tipo particular de impresora se describe en otros documentos.
ko: 프린터의 종류에 따라 베드 레벨링을 수행하는 방법이 다릅니다. 이들 모두는 궁극적으로 "종이 테스트"(아래 설명)에 의존합니다. 그러나 특정 유형의 프린터에 대한 실제 과정은 다른 문서에 설명되어 있습니다.
ru: Различные типы принтеров используют разные методы для выполнения выравнивания ложа. Все они в конечном итоге зависят от "бумажного теста" (описанного ниже). Однако фактический процесс для конкретного типа принтера описан в других документах.
zh_hant: 不同型別的印表機使用不同的方法來進行調平，但是所有這些方法最終都取決於「紙張測試「（如下所述）。特定型別印表機的實際調平過程在其他文件中有所描述。

source: Prior to running any of these calibration tools, be sure to run the checks described in the [config check document](Config_checks.md). It is necessary to verify basic printer motion before performing bed leveling.
es: Antes de ejecutar cualquiera de estas herramientas de calibración, asegúrese de realizar las comprobaciones descritas en el documento [config check](Config_checks.md). Es necesario verificar el movimiento básico de la impresora antes de realizar la nivelación de la base.
ko: 이러한 보정 도구를 실행하기 전에 [config check document](Config_checks.md)에 설명된 검사를 실행해야 합니다. 베드 레벨링을 수행하기 전에 기본적인 프린터 동작을 확인해야 합니다.
ru: Перед запуском любого из этих инструментов калибровки обязательно выполните проверки, описанные в [документе проверки конфигурации](Config_checks.md). Перед выполнением выравнивания слоя необходимо проверить основные движения принтера.
zh_hant: 在執行任何校準工具前，一定要執行在 [檢查配置文件](Config_checks.md) 中 描述的檢查步驟。在列印床調平前有必要驗證印表機的基本運動。

source: For printers with an "automatic Z probe" be sure to calibrate the probe following the directions in the [Probe Calibrate](Probe_Calibrate.md) document. For delta printers, see the [Delta Calibrate](Delta_Calibrate.md) document. For printers with bed screws and traditional Z endstops, see the [Manual Level](Manual_Level.md) document.
es: Para las impresoras con una "sensor Z automático", asegúrese de calibrar el sensor siguiendo las instrucciones del documento [Probe Calibrate](Probe_Calibrate.md). Para las impresoras delta, consulte el documento [Delta Calibrate](Delta_Calibrate.md). Para impresoras con tornillos en la base y finales de carrera tradicionales en el eje Z, consulte el documento [Manual Level](Manual_Level.md).
ko: 오토 레벨링 센서가 있는 프린터의 경우 [Probe Calibrate](Probe_Calibrate.md) 문서의 지침에 따라 레벨링 센서를 보정해야 합니다. 델타 프린터의 경우 [Delta Calibrate](Delta_Calibrate.md) 문서를 참조하십시오. 베드 나사 및 기존 Z 엔드스톱이 있는 프린터의 경우 [Manual Level](Manual_Level.md) 문서를 참조하십시오.
ru: Для принтеров с "автоматическим Z-зондом" обязательно откалибруйте зонд, следуя указаниям в документе [Probe Calibrate](Probe_Calibrate.md). Для дельта-принтеров см. документ [Delta Calibrate](Delta_Calibrate.md). Для принтеров с винтами станины и традиционными концевыми упорами Z см. документ [Manual Level](Manual_Level.md).
zh_hant: 對於帶有「自動 Z 探針」的印表機，請務必按照 [探針校準](Probe_Calibrate.md) 文件中的說明先校準探針。對於三角洲結構的印表機，請參閱 [三角洲校準](Delta_Calibrate.md) 文件。對於帶有列印床調平螺絲和傳統 Z 限位的印表機，請參閱 [手動調平](Manual_Level.md) 文件。

source: During calibration it may be necessary to set the printer's Z `position_min` to a negative number (eg, `position_min = -2`). The printer enforces boundary checks even during calibration routines. Setting a negative number allows the printer to move below the nominal position of the bed, which may help when trying to determine the actual bed position.
es: Durante la calibración puede ser necesario ajustar la `position_min` Z de la impresora a un número negativo (por ejemplo, `position_min = -2`). La impresora aplica las comprobaciones de límites incluso durante las rutinas de calibración. Establecer un número negativo permite que la impresora se mueva por debajo de la posición nominal de la base, lo que puede ayudar a intentar determinar la posición real de la base.
ko: 보정하는 동안 프린터의 Z `position_min`을 음수로 설정해야 할 수도 있습니다(예: `position_min = -2`). 프린터는 보정 루틴 중에도 경계 검사를 시행합니다. 음수를 설정하면 프린터가 베드의 수평면 아래의 위치로 이동할 수 있으므로 실제 베드 위치를 결정할 때 도움이 될 수 있습니다.
ru: Во время калибровки может потребоваться установить для параметра Z принтера `position_min` отрицательное число (например, `position_min = -2`). Принтер обеспечивает проверку границ даже во время процедуры калибровки. Установка отрицательного числа позволяет принтеру двигаться ниже номинального положения станины, что может помочь при попытке определить фактическое положение станины.
zh_hant: 在校準過程中，可能需要將印表機的Z `position_min`設定為一個負數（例如，`position_min = -2`）。即使在校準程式中，印表機也會執行邊界檢查。設定一個負數允許印表機在列印床的標稱位置以下移動，這可以幫助確定實際床面位置。

source: The "paper test"
es: La "prueba del papel"
ko: "종이 테스트"
ru: "Бумажный тест"
zh_hant: 「A4紙測試法」

source: The primary bed calibration mechanism is the "paper test". It involves placing a regular piece of "copy machine paper" between the printer's bed and nozzle, and then commanding the nozzle to different Z heights until one feels a small amount of friction when pushing the paper back and forth.
es: El principal mecanismo de calibración de la cama es la "prueba de papel". Consiste en colocar un trozo regular de "papel de fotocopiadora" entre la cama y la boquilla de la impresora, y luego comandar la boquilla a diferentes alturas Z hasta que uno sienta una pequeña cantidad de fricción al empujar el papel hacia adelante y hacia atrás.
ko: 기본 베드 보정 메커니즘은 "종이 테스트"입니다. 프린터의 베드와 노즐 사이에 일반 "복사기 용지" 조각을 놓고 용지를 앞뒤로 밀 때 약간의 마찰이 느껴질 때까지 노즐을 다른 Z 높이로 명령하는 작업이 포함됩니다.
ru: Основным механизмом калибровки станины является "бумажный тест". Он включает в себя размещение обычного листа "копировальной бумаги" между станиной принтера и соплом, а затем подачу команды соплу на разные высоты Z до тех пор, пока не будет ощущаться небольшое трение при проталкивании бумаги вперед и назад.
zh_hant: 床調平的核心校準機制是"塞紙測試"。它涉及在列印床和噴嘴之間放置一張普通列印紙，然後將噴嘴控制到不同的Z高度，直到在來回移動紙張時感覺到適量的阻力。

source: It is important to understand the "paper test" even if one has an "automatic Z probe". The probe itself often needs to be calibrated to get good results. That probe calibration is done using this "paper test".
es: Es importante entender la "prueba del papel" aunque se tenga un "sensor Z automático". A menudo es necesario calibrar el propio sensor para obtener buenos resultados. Esa calibración del sensor se realiza mediante esta "prueba de papel".
ko: 오토 레벨링 센서가 있더라도 "종이 테스트"를 이해하는 것이 중요합니다. 좋은 결과를 얻으려면 레벨링 센서 자체를 보정해야 하는 경우가 많습니다. 해당 레벨링 센서 보정은 이 "종이 테스트"를 사용하여 수행됩니다.
ru: Важно понимать "бумажный тест", даже если у вас есть "автоматический Z-зонд". Для получения хороших результатов часто требуется калибровка самого датчика. Калибровка датчика выполняется с помощью этого "бумажного теста".
zh_hant: 即使你的印表機帶有自動Z探針，理解塞紙測試依然很重要。爲了保證探針的效果，它經常會需要校準。探針的校準機制也依賴塞紙測試。

source: The first step of the paper test is to inspect the printer's nozzle and bed. Make sure there is no plastic (or other debris) on the nozzle or bed.
es: El primer paso de la prueba del papel es inspeccionar la boquilla y la base de la impresora. Asegúrese de que no hay plástico (u otros residuos) en la boquilla o en la base.
ko: 종이 테스트의 첫 번째 단계는 프린터의 노즐과 베드를 잘 살펴보는 것입니다. 노즐이나 베드에 플라스틱(또는 기타 이물질)이 없는지 확인하십시오.
ru: Первым шагом проверки бумаги является осмотр сопла и станины принтера. Убедитесь, что на сопле и станине нет пластика (или другого мусора).
zh_hant: 紙張測試的第一步是檢查印表機的噴嘴和列印床。確保噴嘴和列印床面上沒有塑料（或其他雜物）。

source: **Inspect the nozzle and bed to ensure no plastic is present!**
es: **¡Inspeccione la boquilla y la base para asegurarse de que no hay plástico!**
ko: **노즐과 베드를 검사하여 플라스틱이 없는지 확인하십시오!**
ru: **Осмотрите сопло и станину, чтобы убедиться в отсутствии пластика!**
zh_hant: **請仔細檢查噴嘴和床面，確保沒有殘留塑料存在！**

source: If there is plastic on the nozzle then heat up the extruder and use a metal tweezers to remove that plastic. Wait for the extruder to fully cool to room temperature before continuing with the paper test. While the nozzle is cooling, use the metal tweezers to remove any plastic that may ooze out.
es: Si hay plástico en la boquilla, caliente el extrusor y utilize una pinza metálica para eliminar ese plástico. Espere a que el extrusor se enfríe a temperatura ambiente antes de continuar con la prueba del papel. Mientras se enfría la boquilla, utiliza las pinzas metálicas para eliminar el plástico que pueda gotear.
ko: 노즐에 플라스틱이 있으면 압출기를 가열하고 금속 핀셋을 사용하여 플라스틱을 제거합니다. 종이 테스트를 계속하기 전에 압출기가 실온으로 완전히 식을 때까지 기다리십시오. 노즐이 냉각되는 동안 금속 핀셋을 사용하여 흘러나온 플라스틱을 제거합니다.
ru: Если на сопле остался пластик, нагрейте экструдер и удалите его металлическим пинцетом. Подождите, пока экструдер полностью остынет до комнатной температуры, прежде чем продолжить тест бумаги. Пока насадка остывает, удалите металлическим пинцетом пластик, который может вытечь.
zh_hant: 如果噴嘴上殘留了塑料，需要先加熱擠出頭並用金屬鑷子把這些塑料去除。等到擠出機完全冷卻到室溫後，再繼續進行紙張測試。當噴嘴正在冷卻時，使用金屬鑷子去除任何可能漏出的塑料。

source: **Always perform the paper test when both nozzle and bed are at room temperature!**
es: **¡Realice siempre la prueba del papel cuando tanto la boquilla como la base se encuentren a temperatura ambiente!**
ko: **노즐과 베드가 실온에 있을 때 항상 종이 테스트를 수행하십시오!**
ru: **Всегда проводите тест бумаги, когда сопло и станина находятся при комнатной температуре!**
zh_hant: **只在噴嘴和列印床都處於室溫的情況下進行塞紙測試！**

source: It may seem odd to calibrate the distance at room temperature when the goal is to have a consistent distance when heated. However, if one calibrates when the nozzle is heated, it tends to impart small amounts of molten plastic on to the paper, which changes the amount of friction felt. That makes it harder to get a good calibration. Calibrating while the bed/nozzle is hot also greatly increases the risk of burning oneself. The amount of thermal expansion is stable, so it is easily accounted for later in the calibration process.
es: Puede parecer extraño calibrar la distancia a temperatura ambiente cuando el objetivo es tener una distancia consistente cuando se calienta. Sin embargo, si se calibra cuando la boquilla se calienta, esta tiende a filtrar pequeñas cantidades de plástico fundido sobre el papel, lo que cambia la cantidad de fricción que se siente. Esto hace más difícil conseguir una buena calibración. Calibrar mientras la cama/boquilla está caliente también aumenta en gran medida el riesgo de quemarse. La cantidad de expansión térmica es estable, por lo que se puede tener en cuenta fácilmente más adelante en el proceso de calibración.
ko: 가열될 때 일정한 거리를 유지하는 것이 목표인 경우 실온에서 거리를 보정하는 것이 이상하게 보일 수 있습니다. 그러나 노즐이 가열될 때 보정하면 종이에 소량의 녹은 플라스틱이 묻게 되고, 그것은 노즐과 종이와의 마찰을 다르게 할 것입니다. 적합한 보정값을 얻기가 더 어렵습니다. 베드/노즐이 뜨거운 상태에서 보정하는 것도 화상의 위험을 크게 증가시킵니다. 열팽창량이 안정적이므로 나중에 보정 과정에서 쉽게 설명됩니다.
ru: Может показаться странным калибровать расстояние при комнатной температуре, когда цель - получить постоянное расстояние при нагревании. Однако, если калибровать при нагретом сопле, то на бумагу попадает небольшое количество расплавленного пластика, что изменяет величину ощущаемого трения. Это затрудняет получение хорошей калибровки. Калибровка при горячем ложе/сопле также значительно повышает риск обжечься. Величина теплового расширения стабильна, поэтому ее легко учесть позже в процессе калибровки.
zh_hant: 當目標是在加熱時有一個一致的距離時，在室溫下校準距離可能聽起來很奇怪。然而，如果在噴嘴加熱時進行校準，往往會有少量的熔融塑料滲入紙張，從而改變了摩擦力的大小。這會影響校準精度。在床或噴嘴熱的時候進行校準也會大大增加燒傷風險。熱膨脹量是穩定的，所以在校準過程中很容易被考慮到。

source: **Use an automated tool to determine precise Z heights!**
es: **¡Usa una herramienta automatizada para determinar las alturas precisas en Z!**
ko: **자동화된 도구를 사용하여 정확한 Z 높이를 결정하십시오!**
ru: **Используйте автоматизированный инструмент для точного определения высоты Z!**
zh_hant: **使用自動化工具來確定精確的 Z 高度！**

source: Klipper has several helper scripts available (eg, MANUAL_PROBE, Z_ENDSTOP_CALIBRATE, PROBE_CALIBRATE, DELTA_CALIBRATE). See the documents [described above](#choose-the-appropriate-calibration-mechanism) to choose one of them.
es: Klipper dispone de varios scripts de ayuda (por ejemplo, MANUAL_PROBE, Z_ENDSTOP_CALIBRATE, PROBE_CALIBRATE, DELTA_CALIBRATE). Consulte los documentos [described above](#elegir-el-mecanismo-de-calibración-apropiado) para elegir uno de ellos.
ko: 에는 사용 가능한 여러 도우미 스크립트가 있습니다(예. MANUAL_PROBE, Z_ENDSTOP_CALIBRATE, PROBE_CALIBRATE, DELTA_CALIBRATE). 그 중 하나를 선택하려면 [위에서 설명한](#choose-the-appropriate-calibration-mechanism) 문서를 참조하십시오.
ru: В Klipper есть несколько вспомогательных скриптов (например, MANUAL_PROBE, Z_ENDSTOP_CALIBRATE, PROBE_CALIBRATE, DELTA_CALIBRATE). Чтобы выбрать один из них, смотрите документы [описанные выше](#choose-the-appropriate-calibration-mechanism).
zh_hant: Klipper 有幾個輔助指令碼（例如，MANUAL_PROBE、Z_ENDSTOP_CALIBRATE、PROBE_CALIBRATE 或 DELTA_CALIBRATE）。請參閱[上述章節](#choose-the-appropriate-calibration-mechanism)來選擇它們。

source: Run the appropriate command in the OctoPrint terminal window. The script will prompt for user interaction in the OctoPrint terminal output. It will look something like:
ko: OctoPrint 터미널 창에서 적절한 명령을 실행합니다. 이 스크립트는 OctoPrint 터미널 출력에서 사용자 상호 작용을 묻는 메시지를 표시합니다. 다음과 같이 표시됩니다:
ru: Запустите соответствующую команду в окне терминала OctoPrint. Сценарий запросит взаимодействие с пользователем в выводе терминала OctoPrint. Это будет выглядеть примерно так:
zh_hant: 在OctoPrint終端視窗中執行適當的命令。該指令碼將在OctoPrint終端輸出中提示使用者互動。以下是一個例子：

source: The current height of the nozzle (as the printer currently understands it) is shown between the "--> <--". The number to the right is the height of the last probe attempt just greater than the current height, and to the left is the last probe attempt less than the current height (or ?????? if no attempt has been made).
es: La altura actual de la boquilla (tal y como lo entiende la impresora en ese momento) se muestra entre los "--> <--". El número a la derecha es la altura del último intento de sondeo justo mayor que la altura actual, y a la izquierda es el último intento de sondeo menor que la altura actual (o ?????? si no se ha hecho ningún intento).
ko: 현재 노즐의 높이는 (프린터가 현재 인식하고 있는) "--> <--" 사이에 표시됩니다. 오른쪽에 있는 숫자는 현재 높이보다 약간 더 큰 마지막 탐색 시도의 높이이고, 왼쪽에 있는 숫자는 현재 높이보다 작은 마지막 탐색 시도의 높이입니다(어떤 시도도 없었다면 ?????? 표시됨).
ru: Текущая высота сопла (как ее понимает принтер в данный момент) отображается между символами "--> <--". Число справа - это высота последней попытки зонда чуть больше текущей высоты, а слева - последняя попытка зонда меньше текущей высоты (или ??????, если попыток не было).
zh_hant: 噴嘴的（按照印表機目前的定義的）目前高度顯示在"--> <--"之間。右邊的數字是剛剛大於目前高度的最後一次探測高度，左邊的數字是小於目前高度的最後一次探測高度（如果沒有嘗試，則??????）。

source: Place the paper between the nozzle and bed. It can be useful to fold a corner of the paper so that it is easier to grab. (Try not to push down on the bed when moving the paper back and forth.)
es: Coloque el papel entre la boquilla y la base. Puede ser útil doblar una esquina del papel para que sea más fácil de agarrar. (Procura no empujar hacia abajo la base cuando muevas el papel hacia delante y hacia atrás.)
ko: 노즐과 베드 사이에 종이를 놓습니다. 종이 한 귀퉁이를 접어서 잡기 쉽게 하는 것이 유용할 수 있습니다. (종이를 앞뒤로 움직일 때 베드를 누르지 마십시오.)
ru: Поместите бумагу между соплом и станиной. Может быть полезно загнуть угол бумаги, чтобы ее было легче захватить. (Старайтесь не давить на станину при перемещении бумаги вперед-назад.)
zh_hant: 將紙放在噴嘴和床面之間。摺疊紙張的一角可以讓它更容易被抓在手裡。(來回移動紙張時，儘量不要下壓床面。）

source: Use the TESTZ command to request the nozzle to move closer to the paper. For example:
es: Utilize el comando TESTZ para comandar a la boquilla a moverse más cerca del papel. Por ejemplo:
ko: TESTZ 명령을 사용하여 노즐이 용지에 더 가깝게 이동하도록 요청합니다. 예를 들어:
ru: Используйте команду TESTZ, чтобы запросить перемещение сопла ближе к бумаге. Например:
zh_hant: 使用 TESTZ 命令將噴嘴向紙條靠近。例如：

source: The TESTZ command will move the nozzle a relative distance from the nozzle's current position. (So, `Z=-.1` requests the nozzle to move closer to the bed by .1mm.) After the nozzle stops moving, push the paper back and forth to check if the nozzle is in contact with the paper and to feel the amount of friction. Continue issuing TESTZ commands until one feels a small amount of friction when testing with the paper.
es: El comando TESTZ moverá la boquilla una distancia relativa desde la posición actual de la boquilla. (Así, `Z=-.1` comanda que la boquilla se acerque a la cama en 0,1mm). Después de que la boquilla deje de moverse, empuje el papel hacia adelante y hacia atrás para comprobar si la boquilla está en contacto con el papel y para sentir la cantidad de fricción. Continúe emitiendo comandos TESTZ hasta que se sienta una pequeña cantidad de fricción al probar con el papel.
ko: TESTZ 명령은 노즐의 현재 위치에서 상대적인 거리만큼 노즐을 이동합니다. (그래서 `Z=-.1` 명령은 노즐이 베드 쪽으로 0.1mm 가까이 이동하도록 요청합니다.) 노즐의 움직임이 멈춘 후, 종이를 앞뒤로 밀어서 노즐이 종이에 닿았는지 확인하고 마찰량을 느껴보세요. 용지로 테스트할 때 약간의 마찰을 느낄 때까지 TESTZ 명령을 계속 실행합니다.
ru: Команда TESTZ переместит сопло на относительное расстояние от текущего положения сопла. (Так, `Z=-.1` просит сопло переместиться ближе к станине на .1 мм.) После того, как сопло перестанет двигаться, подтолкните бумагу вперед-назад, чтобы проверить, соприкасается ли сопло с бумагой, и почувствовать трение. Продолжайте подавать команды TESTZ, пока не почувствуете небольшое трение при тестировании с бумагой.
zh_hant: TESTZ命令將相對噴嘴的當前位置移動指定距離。(因此，`Z=-.1` 命令噴嘴向床身靠近 0.1mm。）噴嘴停止移動後，來回推動紙張，檢查噴嘴是否與紙張接觸，並感受摩擦力的大小。繼續發出 TESTZ 命令，直到塞紙測試時感覺到少量的摩擦。

source: If too much friction is found then one can use a positive Z value to move the nozzle up. It is also possible to use `TESTZ Z=+` or `TESTZ Z=-` to "bisect" the last position - that is to move to a position half way between two positions. For example, if one received the following prompt from a TESTZ command:
ko: 너무 많은 마찰이 느껴지면 양의 Z 값을 사용하여 노즐을 위로 이동시킬 수 있습니다. `TESTZ Z=+` 또는 `TESTZ Z=-`를 사용하여 마지막 위치를 "이등분"할 수도 있습니다. 즉, 두 위치 사이의 중간 위치로 이동할 수도 있습니다. 예를 들어, TESTZ 명령에서 다음 프롬프트를 받은 경우:
ru: Если обнаружено слишком большое трение, то можно использовать положительное значение Z для перемещения сопла вверх. Также можно использовать команду `TESTZ Z=+` или `TESTZ Z=-` для "биссекции" последнего положения, т.е. для перемещения в положение, находящееся на полпути между двумя положениями. Например, если в результате выполнения команды TESTZ был получен следующий запрос:
zh_hant: 如果發現摩擦力太大，那麼可以用一個正的 Z 值將噴嘴向上移動，或者用`TESTZ Z=+`或`TESTZ Z=-`來二分上一次位置和目前位置-也就是移動到兩個位置之間的一半位置。例如，如果從 TESTZ 命令後收到以下反饋：
