Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/BLTouch.po
Languages: fr, hu, it, ko, zh_hans

source: Connecting BL-Touch
fr: Connexion du BL-Touch
hu: BL-Touch csatlakoztatása
it: Collegare BL-Touch
ko: BL-Touch 연결
zh_hans: 连接BL-Touch

source: A **warning** before you start: Avoid touching the BL-Touch pin with your bare fingers, since it is quite sensitive to finger grease. And if you do touch it, be very gentle, in order to not bend or push anything.
fr: Un **avertissement** avant de commencer : Évitez de toucher la broche BL-Touch avec vos doigts nus, car elle est très sensible à la graisse des doigts. Et si vous la touchez, soyez très doux, afin de ne pas plier ou pousser quoi que ce soit.
hu: Egy **figyelmeztetés** mielőtt elkezdené: Kerülje a BL-Touch tűjének puszta ujjal való érintését, mivel meglehetősen érzékeny az zsírra. Ha pedig mégis hozzáér, legyen nagyon óvatos, hogy ne hajlítsa vagy nyomja meg a tüskét.
it: Attenzione **warning** prima di cominciare : Evita di toccare la punta del BL-Touch a mani nude, è molto sensibili al sebo delle dita. Se sei costretto usa dei guanti ed evita di spingerla o piegarla.
ko: 시작전 **주의** : BL-touch 핀을 맨손가락으로 만지지 않도록 하라. 왜냐하면 손가락 구리스(?)가 매우 예민하기 때문이다. 만일 만지게 된다면 핀이 구부러지거나 어떤것도 밀지 않도록 하기 위해 조심스럽게 다뤄라.
zh_hans: **警告**在你开始前！：避免用你的手指接触BL-TOUCH针，因为它对手指的油脂相当敏感。如果你真的触摸它请非常轻的去触碰，以避免弯曲或推动任何东西。

source: Hook up the BL-Touch "servo" connector to a `control_pin` according to the BL-Touch documentation or your MCU documentation. Using the original wiring, the yellow wire from the triple is the `control_pin` and the white wire from the pair is the `sensor_pin`. You need to configure these pins according to your wiring. Most BL-Touch devices require a pullup on the sensor pin (prefix the pin name with "^"). For example:
fr: Connectez le connecteur "servo" de la BL-Touch à une `control_pin` selon la documentation de la BL-Touch ou celle de votre MCU. En utilisant le câblage originel, le fil jaune du câblage triple est la `control_pin` et le fil blanc du câblage double est la `sensor_pin`. Vous devez configurer ces broches en fonction de votre câblage. La plupart des dispositifs BL-Touch nécessitent un pullup sur la broche du capteur (préfixez le nom de la broche par "^"). Par exemple :
hu: Csatlakoztassa a BL-Touch "servo" csatlakozót a `control_pin` csatlakozóhoz a BL-Touch dokumentáció vagy az MCU dokumentációja szerint. Az eredeti kábelezést használva a hármasból a sárga vezeték a `control_pin` és a vezetékpárból a fehér lesz a `sensor_pin`. Ezeket a tűket a kábelezésnek megfelelően kell konfigurálnia. A legtöbb BL-Touch pullup jelet igényel a tűbeállításnál (ezért a csatlakozás nevének előtagja "^"). Például:
it: Collega il connettore "servo" BL-Touch a un `control_pin` secondo la documentazione BL-Touch o la documentazione MCU. Usando il cablaggio originale, il filo giallo del triplo è il `control_pin` e il filo bianco della coppia è il `sensor_pin`. È necessario configurare questi pin in base al cablaggio. La maggior parte dei dispositivi BL-Touch richiede un pullup sul pin del sensore (prefissare il nome del pin con "^"). Per esempio:
ko: BL-touch 서보 연결선을 bltouch 문서와 MCU 문서에 있는 `control_pin`에 곱아라. 기본선을 사용한다면 세가닥 나와 있는 것중 노란색 선은 `control_pin` 이다. 두가닥 나와 있는 것중 흰색선은 `sensor_pin` 이다. 너의 배선연결에 따라 이 핀들을 설정할 필요가 있다. 대부분의 bltouch 장치들은 센서 핀(핀 이름앞에 "^"를 가진)상에 풀업이 필요하다. 예를 들면:
zh_hans: 根据BL-TOUCH文件或你的MCU文件，将BL-TOUCH的 "servo"引脚连接到`control_pin`。使用原来的接线，三联的黄线是`control_pin`，一对的白线是`sensor_pin`。你需要根据你的布线来配置这些引脚。大多数BL-TOUCH设备要求在传感器引脚上有一个上拉（引脚名称前加"^"）。比如说：

source: It's important that the z_hop movement in safe_z_home is high enough that the probe doesn't hit anything even if the probe pin happens to be in its lowest state.
fr: Il est important que le mouvement z_hop dans safe_z_home soit suffisamment élevé pour que la sonde ne heurte rien, même si la broche de la sonde se trouve dans son état le plus bas.
hu: Fontos, hogy a z_hop mozgás a safe_z_home-ban elég nagy legyen ahhoz, hogy a mérőcsúcs ne ütközzön semmibe, még akkor sem, ha a BL-Touch mérőtüskéje a legalacsonyabb állásban van.
it: È importante che il movimento z_hop in safe_z_home sia sufficientemente alto in mode che la sonda non colpisca nulla anche se il pin della sonda si trova nel suo stato più basso.
ko: safe_z_home 으로 z_hop 이동은 프로브 핀이 가장 낮은 위치에 있는 상태에서도 다른 어떤것에도 부딪히지 않을 정도로 충분히 높이 올려서 이동하도록 하는게 중요하다.
zh_hans: 重要的是，safe_z_home 中的 z_hop 运动足够高，即使探针恰好处于最低状态，探针也不会碰到任何东西。

source: Initial tests
fr: Tests initiaux
hu: Kezdeti tesztek
it: Test iniziali
ko: 초기 테스트
zh_hans: 初次调试

source: Before moving on, verify that the BL-Touch is mounted at the correct height, the pin should be roughly 2 mm above the nozzle when retracted
fr: Avant de poursuivre, vérifiez que la BL-Touch est montée à la bonne hauteur, la tige doit se trouver à environ 2 mm au-dessus de la buse lorsqu'elle est rétractée
hu: Mielőtt továbblépne, ellenőrizze, hogy a BL-Touch a megfelelő magasságban van-e felszerelve. A mérőtüskének behúzott állapotban nagyjából 2 mm-rel a fúvóka fölött kell lennie
it: Prima di proseguire, verificare che il BL-Touch sia montato all'altezza corretta, il perno dovrebbe trovarsi a circa 2 mm sopra il nozzle quando è retratto
ko: 동작하기 앞서 bltouch 가 정확한 높이로 설치되어 있는지를 확실히 하라, 핀이 들어간 상태에서 노즐위로 대략 2mm 는 올라와 있어야 한다
zh_hans: 在开始到下一个部分之前，请检查 BL-Touch 是否安装在正确的高度，当探针收起时候，探针应该在喷头上2mm的位置

source: When you turn on the printer, the BL-Touch probe should perform a self-test and move the pin up and down a couple of times. Once the self-test is completed, the pin should be retracted and the red LED on the probe should be lit. If there are any errors, for example the probe is flashing red or the pin is down instead of up, please turn off the printer and check the wiring and configuration.
fr: Lorsque vous mettez l'imprimante sous tension, la sonde BL-Touch doit effectuer un auto-test en sortant et rétractant le pointeau plusieurs Une fois l'auto-test terminé, le pointeau doit être rétracté et le voyant rouge de la sonde doit être allumé. En cas d'erreur, par exemple si la sonde clignote en rouge ou si le pointeau est en bas au lieu d'être en haut, veuillez éteindre l'imprimante et vérifier le câblage et la configuration.
hu: Amikor bekapcsolja a nyomtatót, a BL-Touch szondának önellenőrzést kell végeznie, és néhányszor fel-le kell mozgatnia a mérőtüskét. Az önellenőrzés befejezése után a mérőtüskének vissza kell húzódnia, és a szondán lévő piros LED-nek világítania kell. Ha bármilyen hibát észlel, például a szonda pirosan villog, vagy a mérőtüske lefelé van, nem pedig behúzva, kérjük kapcsolja ki a nyomtatót, és ellenőrizze a kábelezést és a konfigurációt.
it: Quando si accende la stampante, la sonda BL-Touch dovrebbe eseguire un autotest e spostare il pin su e giù un paio di volte. Una volta completato l'autotest, il perno deve essere retratto e il LED rosso sulla sonda deve essere acceso. In caso di errori, ad esempio la sonda lampeggia in rosso o il pin è in basso anziché in alto, spegnere la stampante e controllare il cablaggio e la configurazione.
ko: 프린터를 켰을때, bltouch 프로브는 몇차례 핀이 내려왔다 올라갔다하면서 자체테스트를 진행한다. 자체 테스트를 마치면, 핀은 들어가고 빨간색 LED가 켜진다. 만약 테스트상에 에러가 발생하면, 예를 들어 핀이 나와야 하는데 들어간다거나 빨간색 불빛이 번쩍인다거나 하면, 프린터를 끄고 배선연결과 설정이 제대로 되어 있는지 체크하기 바란다.
zh_hans: 当启动打印机电源的时候，BL-Touch 探针会执行自检并上下移动探针几次。自检完成后，探针会处于收回状态，探头上的红色 LED 应亮起。如果出现任何错误，例如探头呈红色闪烁或者探针伸出而不是收回，请关闭打印机电源并检查接线和配置。

source: If the above is looking good, it's time to test that the control pin is working correctly. First run `BLTOUCH_DEBUG COMMAND=pin_down` in your printer terminal. Verify that the pin moves down and that the red LED on the probe turns off. If not, check your wiring and configuration again. Next issue a `BLTOUCH_DEBUG COMMAND=pin_up`, verify that the pin moves up, and that the red light turns on again. If it's flashing then there's some problem.
fr: Si tout ce qui précède semble bon, il est temps de tester que la broche de contrôle fonctionne correctement. Exécutez d'abord `BLTOUCH_DEBUG COMMAND=pin_down` dans votre terminal d'imprimante. Vérifiez que le pointeau se déplace vers le bas et que la LED rouge de la sonde s'éteint. Si ce n'est pas le cas, vérifiez à nouveau votre câblage et votre configuration. Ensuite, lancez une commande `BLTOUCH_DEBUG COMMAND=pin_up`, vérifiez que le pointeau se rétracte et que la lumière rouge s'allume à nouveau. Si elle clignote, il y a un problème.
hu: Ha a fentiek rendben vannak, itt az ideje tesztelni, hogy a vezérlés megfelelően működik-e. Először futtassuk le a `BLTOUCH_DEBUG COMMAND=pin_down` parancsot a konzolban. Ellenőrizze, hogy a mérőtüske lefelé mozog-e, és hogy a BL-Touchon lévő piros LED kialszik-e. Ha nem, ellenőrizze újra a kábelezést és a konfigurációt. Ezután adjon ki egy `BLTOUCH_DEBUG COMMAND=pin_up` parancsot. Ellenőrizze, hogy a mérőtüske felfelé mozdul-e, és hogy a piros LED ismét világít-e. Ha villog, akkor valamilyen probléma van.
it: Se quanto sopra sembra buono, è il momento di verificare che il pin di controllo funzioni correttamente. Per prima cosa esegui `BLTOUCH_DEBUG COMMAND=pin_down` nel terminale della tua stampante. Verificare che il pin si abbassi e che il LED rosso sulla sonda si spenga. In caso contrario, controllare nuovamente il cablaggio e la configurazione. Quindi emettere un `BLTOUCH_DEBUG COMMAND=pin_up`, verificare che il pin si muova verso l'alto e che la luce rossa si accenda di nuovo. Se lampeggia allora c'è qualche problema.
ko: 만약 지금까지 잘 진행이 되었다면, 핀이 정확히 동작하는지 테스트할 차례이다. 먼저, 터미널에서 `BLTOUCH_DEBUG COMMAND=pin_down`를 실행시켜라. 그랬을때 프로브 핀이 아래로 내려가고 빨간색 불이 꺼지는지 확인하라. 만약 그렇게 되지 않는다면 배선연결과 설정을 다시 체크하기 바란다. 다음은 `BLTOUCH_DEBUG COMMAND=pin_up` 를 실행시켜 프로브 핀이 위로 동작하고 빨간색 led 가 다시 켜지는 것을 확인하라. 만일 불빛이 점멸한다면 동일한 문제가 있다는 뜻이다.
zh_hans: 如果以上看起来不错，是时候测试控制引脚是否正常工作了。首先在打印机终端中运行 `BLTOUCH_DEBUG COMMAND=pin_down`。确认探针伸出并且探头上的红色 LED 熄灭。如果没有，请再次检查打印机的接线和配置。接下来在打印机终端输入 `BLTOUCH_DEBUG COMMAND=pin_up`，验证引脚是否向上移动，并且红灯再次亮起。如果它闪烁，则说明存在问题。

source: After completing the BL-Touch control pin and sensor pin tests, it is now time to test probing, but with a twist. Instead of letting the probe pin touch the print bed, let it touch the nail on your finger. Position the toolhead far from the bed, issue a `G28` (or `PROBE` if not using probe:z_virtual_endstop), wait until the toolhead starts to move down, and stop the movement by very gently touching the pin with your nail. You may have to do it twice, since the default homing configuration probes twice. Be prepared to turn off the printer if it doesn't stop when you touch the pin.
fr: Après avoir effectué les tests de la broche de contrôle et de la broche de détection du BL-Touch, il est maintenant temps de tester le palpage, mais avec une petite astuce. Au lieu de laisser le pointeau de la sonde toucher le lit d'impression, laissez-le toucher l'ongle de votre doigt. Positionnez la tête d'impression loin du lit, émettez un `G28` (ou `PROBE` si vous n'utilisez pas probe:z_virtual_endstop), attendez que la tête d'impression commence à descendre, et arrêtez le mouvement en touchant très doucement le pointeau avec votre ongle. Il se peut que vous deviez le faire deux fois, car la configuration par défaut de l'autoguidage sonde deux fois. Préparez-vous à éteindre l'imprimante si elle ne s'arrête pas lorsque vous touchez le pointeau.
hu: A BL-Touch vezérlő és érzékelőtüskék tesztelésének befejezése után itt az ideje a szintezés tesztelésének, de egy kis csavarral. Ahelyett, hogy a mérőtüske a tárgyasztalt érintené, a körmünkel fogjuk megérinteni. Helyezze a nyomtatófejet messze a tárgyasztaltól, adjon ki egy `G28` (vagy `PROBE`, ha nem használja a probe:z_virtual_endstopot) parancsot, várjon míg a nyomtatófej elkezd lefelé mozogni, és állítsd meg a mozgást úgy, hogy nagyon óvatosan megérinti a mérőtüskét a körmével. Lehet, hogy ezt kétszer kell megtennie, mivel az alapértelmezett kezdőpont konfiguráció kétszer mér. Készüljön fel arra is, hogy kikapcsolja a nyomtatót, ha az nem áll meg, amikor megérinti a mérőtüskét.
it: Dopo aver completato i test del pin di controllo BL-Touch e del pin del sensore, è ora il momento di testare il rilevamento, ma con una svolta. Invece di lasciare che il perno della sonda tocchi il piano di stampa, lascia che tocchi l'unghia del dito. Posizionare la testina lontano dal letto, emettere un `G28` (o `PROBE` se non si utilizza probe:z_virtual_endstop), attendere che la testina inizi a muoversi verso il basso e interrompere il movimento toccando molto delicatamente il perno con l'unghia. Potrebbe essere necessario farlo due volte, poiché la configurazione di homing predefinita esegue due sonde. Preparati a spegnere la stampante se non si ferma quando tocchi il perno.
ko: bltouch 컨트롤 핀과 센서핀 테스트를 마치고 나서, 측정 테스트를 할 차례가 된다. 하지만, 조금 다르게 할 것이다. 프로브 핀을 프린터 베드에 닿게 하는 것대신에, 손톱으로 터치할 것이다. 툴 헤드가 베드로부터 많이 떨어져 있도록 위치시켜놓고, `G28`(또는 만약 probe:z_virtual_endstop 을 사용하지 않는다면 `PROBE`)를 입력하라. 그리고 툴헤드가 아래로 내려오기 시작할 때까지 기다려라. 내려오기 시작하면 손톱으로 아주 천천히 핀을 건드려서 내려오는 움직임을 멈추도록 하라. 이것을 두번정도 해야할 것이다. 왜냐하면 기본 호밍 설정에서 두번 측정하도록 되어 있기 때문이다. 만약 핀을 건드리는데도 멈추지 않을때를 대비하여 프린터의 전원을 끌 준비를 하고 진행하도록 한다.
zh_hans: 在完成BL-TOUCH控制针和传感器针的测试后，现在是测试探针的时候了，但有一个转折。不要让探测针接触打印床，而是让它接触你手指。将工具头放在离床面较远的地方，发出`G28`（或`PROBE`，如果不使用probe:z_virtual_endstop），等待工具头开始向下移动，然后用手非常轻地触摸针脚，停止移动。你可能要做两次，因为默认的归位配置会探测两次。如果你触摸针脚时它没有停止，请关闭打印机电源。

source: If that was successful, do another `G28` (or `PROBE`) but this time let it touch the bed as it should.
fr: Si ce test a réussi, faites un autre `G28` (ou `PROBE`) mais cette fois-ci laissez-le toucher le lit comme il se doit.
hu: Ha ez sikerült, kezd újra `G28` (vagy `PROBE`) parancsal, de ezúttal hagyja, hogy a mérőtüske megérintse a tárgyasztalt.
it: Se ha avuto successo, esegui un altro `G28` (o `PROBE`) ma questa volta lascia che tocchi il letto come dovrebbe.
ko: 성공했다면, 다시 `G28` (또는 `PROBE`) 를 실행시켜라. 하지만 이번에는 손톱대신 원래 해야했던 베드를 터치하도록 하면 된다.
zh_hans: 如果成功了，再做一次`G28`（或`PROBE`），但是这次要触碰到热床。

source: BL-Touch gone bad
fr: BL-Touch défaillant
hu: A BL-Touch elromlott
it: BL-Touch andato male
ko: bltouch 불량
zh_hans: BL-Touch 出现问题

source: Once the BL-Touch is in inconsistent state, it starts blinking red. You can force it to leave that state by issuing:
fr: Une fois que le BL-Touch est dans un état incohérent, il se met à clignoter en rouge. Vous pouvez le forcer à quitter cet état en émettant :
hu: Amint a BL-Touch inkonzisztens állapotba kerül, pirosan villogni kezd. Az állapotból való kilépést a következő parancs kiadásával lehet kényszeríteni:
it: Una volta che il BL-Touch è in uno stato incoerente, inizia a lampeggiare in rosso. Puoi forzarlo a lasciare quello stato emettendo:
ko: bltouch 가 정상이 아닌 상태라면, 빨간색 불빛을 점멸할 것이다. 그럴 경우 아래 명령을 내려 강제적으로 그 상태를 벗어나게 할 수 있다. :
zh_hans: BL-Touch状态不一致的时候，它就会开始闪烁红色。可以通过以下命令强制它离开此状态：

source: This may happen if its calibration is interrupted by the probe being blocked from being extracted.
fr: Cela peut se produire si son étalonnage est interrompu par un blocage de l'extraction du pointeau.
hu: Ez akkor fordulhat elő, ha a kalibrálás megszakad, mert a mérőtüske nem jön ki a helyéről.
it: Ciò può accadere se la sua calibrazione viene interrotta dal blocco dell'estrazione della sonda.
ko: 이것은 프로브가 나오는게 막혀서 캘리브레이션이 방해를 받게 되었을때 발생할 수 있다.
zh_hans: 如果其校准被阻止伸出的探针中断，则可能会发生这种情况。

source: However, the BL-Touch may also not be able to calibrate itself anymore. This happens if the screw on its top is in the wrong position or the magnetic core inside the probe pin has moved. If it has moved up so that it sticks to the screw, it may not be able to lower its pin anymore. With this behavior you need to open the screw and use a ball-point pen to push it gently back into place. Re-Insert the pin into the BL-Touch so that it falls into the extracted position. Carefully readjust the headless screw into place. You need to find the right position so it is able to lower and raise the pin and the red light turns on and of. Use the `reset`, `pin_up` and `pin_down` commands to achieve this.
fr: Cependant, il se peut également que le BL-Touch ne soit plus capable de se calibrer lui-même. Cela se produit si la vis située sur le dessus est mal positionnée ou si le noyau magnétique à l'intérieur de la tige du pointeau a bougé. S'il s'est déplacé vers le haut au point de coller à la vis, il se peut que le BL-Touch ne soit plus capable de libérer sa tige. Dans ce cas, vous devez ouvrir la vis et utiliser un stylo à bille pour le remettre doucement en place. Réintroduisez la tige dans le BL-Touch de façon à ce qu'elle tombe dans la position extraite. Réajustez délicatement la vis sans tête du dessus. Vous devez trouver la juste position pour qu'elle soit capable d'abaisser et de relever la tige et que la lumière rouge s'allume et s'éteigne. Utilisez les commandes `reset`, `pin_up` et `pin_down` pour y parvenir.
hu: Előfordulhat azonban az is, hogy a BL-Touch már nem tudja magát kalibrálni. Ez akkor fordulhat elő, ha a tetején lévő csavar rossz helyzetben van, vagy ha a mérőtüskében lévő mágneses mag elmozdult. Ha úgy mozdult felfelé, hogy a csavarhoz tapad, előfordulhat, hogy már nem tudja leengedni a tüskét. Ilyen esetben ki kell venni a csavart, és a mérőtüskét óvatosan visszatolni a helyére. Helyezze vissza a tüskét a BL-Touch-ba úgy, hogy az a kihúzott helyzetbe essen. Óvatosan tegye vissza a hernyócsavart a helyére. Meg kell találnia a megfelelő pozíciót, hogy képes legyen leengedni és felemelni a tüskét, hogy a piros LED be és kikapcsoljon. Ehhez használja a `reset`, `pin_up` és `pin_down` parancsokat.
it: Tuttavia, anche il BL-Touch potrebbe non essere più in grado di calibrarsi. Ciò accade se la vite sulla sua sommità è nella posizione sbagliata o se il nucleo magnetico all'interno del perno della sonda si è spostato. Se si è alzato in modo che si attacchi alla vite, potrebbe non essere più in grado di abbassare il perno. Con questo comportamento è necessario aprire la vite e utilizzare una penna a sfera per spingerla delicatamente in posizione. Reinserire il perno nel BL-Touch in modo che cada nella posizione estratta. Riposizionare con cura la vite senza testa in posizione. È necessario trovare la posizione giusta in modo che sia in grado di abbassare e alzare il perno e la luce rossa si accende e si spegne. Usa i comandi `reset`, `pin_up` e `pin_down` per raggiungere questo obiettivo.
ko: 하지만, Bltouch가 더이상 자체 캘리브레이션을 할 수 없을때도 있다. 이건 상단 스크류의 위치가 잘못되어 있거나, 프로브핀 안쪽의 자석코어가 움직였을때 발생한다. 만일 위로 움직일때 스크류에 붙어버렸다면, 그 핀을 더이상 내릴 수 없을 때가 있다. 이럴 때는 스크류를 열어 볼펜을 이용해 제 위치로 조심스럽게 밀어내도록 하라. 핀이 뽑힌 위치에 떨어지도록 bltouch 안으로 핀을 다시 집어넣어라. 조심스럽게 무드볼트를 안으로 밀어넣도록 하라. 핀을 아래로 내리고 위로 올려서 빨간색 불빛이 켜지고 꺼지는 것을 통해 정확한 위치를 찾아야 한다. 이 작업을 할 때 `reset`, `pin_up` 그리고 `pin_down` 명령을 사용하라.
zh_hans: 但是，BL-TOUCH也可能无法再进行自我校准。如果它上面的螺丝处于错误的位置，或者探针内的磁芯移动了，就会发生这种情况。如果它移动了，以至于粘在了螺丝上，它可能无法再降低其针脚。有了这种行为，你需要打开螺丝，用圆珠笔将其轻轻推回原位。将销钉重新插入BL-TOUCH，使其落入拔出的位置。小心地将无头螺钉重新调整到位。你需要找到正确的位置，使其能够降低和提高销钉，并且红灯打开和关闭。使用`reset`、`pin_up`和`pin_down`命令来实现。

source: BL-Touch "clones"
fr: "Clones" du BL-Touch
hu: BL-Touch "klónok"
it: BL-Touch "cloni"
ko: BL-Touch 짝퉁

source: Important! Do not configure `pin_up_reports_not_triggered` or `pin_up_touch_mode_reports_triggered` to False without first following these directions. Do not configure either of these to False on a genuine BL-Touch. Incorrectly setting these to False can increase probing time and can increase the risk of damaging the printer.
fr: Important ! Ne configurez pas `pin_up_reports_not_triggered` ou `pin_up_touch_mode_reports_triggered` à False sans suivre ces instructions. Ne configurez pas l'une ou l'autre de ces options sur False sur un véritable BL-Touch. Une configuration incorrecte de ces paramètres sur False peut augmenter le temps de palpage et peut augmenter le risque d'endommager l'imprimante.
hu: Fontos! Ne állítsd a `pin_up_reports_not_triggered` vagy a `pin_up_touch_mode_reports_triggered` értékét False értékre anélkül, hogy előbb ne követné ezeket az utasításokat. Ne állítsd egyiket sem False értékre egy valódi BL-Touch esetében. Ezek helytelen beállítása hamis értékre növelheti a mérési időt, és növelheti a nyomtató károsodásának kockázatát.
it: Importante! Non configurare `pin_up_reports_not_triggered` o `pin_up_touch_mode_reports_triggered` su False senza prima seguire queste indicazioni. Non configurare nessuno di questi su False su un BL-Touch originale. Un'impostazione errata di questi valori su False può aumentare il tempo di ispezione e può aumentare il rischio di danneggiare la stampante.
ko: 중요! 먼저 다음 지시를 따르지 않고 `pin_up_reports_not_triggered` 나 `pin_up_touch_mode_reports_triggered` 을 False 로 설정하지 마십시오. 정품 bltouch에 이값들을 False 로 설정해서도 안됩니다. 잘못 False 로 셋팅하면 측정 시간을 증가시키고, 프린터를 손상시킬 위험이 증가할 수 있습니다.
zh_hans: 重要!在没有遵循这些指示之前，不要把 `pin_up_reports_not_triggered` 或 `pin_up_touch_mode_reports_triggered` 配置为 False。不要在BL-TOUCH上把这两样东西配置为False。不正确地将这些设置为 "False"会增加探测时间，并会增加损坏打印机的风险。
