Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/BLTouch.po
Languages: fr, hu, it, ko, zh_hans

source: Some "clone" devices do not support `touch_mode` and as a result the `QUERY_PROBE` command does not work. Despite this, it may still be possible to perform probing and homing with these devices. On these devices the `QUERY_PROBE` command during the [initial tests](#initial-tests) will not succeed, however the subsequent `G28` (or `PROBE`) test does succeed. It may be possible to use these "clone" devices with Klipper if one does not utilize the `QUERY_PROBE` command and one does not enable the `probe_with_touch_mode` feature.
fr: Certains "clones" ne supportent pas le `touch_mode` et par conséquent la commande `QUERY_PROBE` ne fonctionne pas. Malgré cela, il est possible d'effectuer un palpage et une mise à l'origine avec ces dispositifs. Sur ces dispositifs, la commande `QUERY_PROBE` pendant les [tests initiaux](#initial-tests) n'aboutira pas, mais le test suivant `G28` (ou `PROBE`) aboutira. Il est possible d'utiliser ces "clones" avec Klipper tant que l'on n'utilise pas la commande `QUERY_PROBE` et que l'on n'active pas la fonction `probe_with_touch_mode`.
hu: Néhány "klón" nem támogatja a `touch_mode` parancsot, és ennek eredményeként a `QUERY_PROBE` parancs sem működik. Ennek ellenére lehetséges, hogy ezekkel az eszközökkel még mindig lehet mérést és kezdőpont felvételt végezni. Ezeken az eszközökön a [kezdeti tesztek](#initial-tests) során a `QUERY_PROBE` parancs nem lesz sikeres, azonban az ezt követő `G28` (vagy `PROBE`) teszt sikerül. Lehetséges, hogy ezeket a "klónokat" Klipperrel lehet használni, ha nem használjuk a `QUERY_PROBE` parancsot, és nem engedélyezzük a `probe_with_touch_mode` funkciót.
it: Alcuni dispositivi "clone" non supportano `touch_mode` e di conseguenza il comando `QUERY_PROBE` non funziona. Nonostante ciò, potrebbe essere ancora possibile eseguire il rilevamento e l'homing con questi dispositivi. Su questi dispositivi il comando `QUERY_PROBE` durante i [initial tests](#initial-tests) non avrà esito positivo, tuttavia il successivo test `G28` (o `PROBE`) riesce. Potrebbe essere possibile utilizzare questi dispositivi "clone" con Klipper se non si utilizza il comando `QUERY_PROBE` e se non si abilita la funzione `probe_with_touch_mode`.

source: If the BL-Touch will be used to home the Z axis then set `endstop_pin: probe:z_virtual_endstop` in the `[stepper_z]` config section and add a `[safe_z_home]` config section to raise the z axis, home the xy axes, move to the center of the bed, and home the z axis. For example:
ko: 만약 bltouch 가 Z축 호밍할 때 사용된다면 `[stepper_z]` 에 `endstop_pin: probe:z_virtual_endstop` 로 설정하라. 그리고 `[safe_z_home]` 구성 섹션을 더하라. 그렇게 되면 일단 Z 축을 올리고, XY축 호밍을 한후에, 베드 센터로 이동해서 Z 축 호밍을 하게 될 것이다. 예를들어 :

source: The next step is to confirm that the sensor pin is working correctly. Run `BLTOUCH_DEBUG COMMAND=pin_down`, verify that the pin moves down, run `BLTOUCH_DEBUG COMMAND=touch_mode`, run `QUERY_PROBE`, and verify that command reports "probe: open". Then while gently pushing the pin up slightly with the nail of your finger run `QUERY_PROBE` again. Verify the command reports "probe: TRIGGERED". If either query does not report the correct message then check your wiring and configuration again. At the completion of this test run `BLTOUCH_DEBUG COMMAND=pin_up` and verify that the pin moves up.
ko: 다음 단계는 센서 핀이 정확히 동작하는지 확인할 차례다. `BLTOUCH_DEBUG COMMAND=pin_down`를 실행하여 핀이 아래로 내려갔는지 보고, `BLTOUCH_DEBUG COMMAND=touch_mode` 과 `QUERY_PROBE`를 실행하여 해당 명령이 "probe: open" 를 보이는지 확인하라. 그리고 손톱을 이용해 조심스럽게 핀을 천천히 밀어올리고 `QUERY_PROBE` 명령을 다시 실행해보라. 그때 "probe: TRIGGERED"가 보이는지 확인하라. 만일 둘다 제대로된 정확한 메시지가 보이지 않는다면 배선연결과 설정을 다시 체크하기 바란다. 테스트가 끝나면 `BLTOUCH_DEBUG COMMAND=pin_up` 라고 입력하고 핀이 올라가는것을 확인하기 바란다.
zh_hans: 下一步是确认传感器引脚是否正常工作。运行`BLTOUCH_DEBUG COMMAND=pin_down`，确认引脚向下移动，运行`BLTOUCH_DEBUG COMMAND=touch_mode`，运行`QUERY_PROBE`，确认命令报告 "probe: open"。然后用手指轻轻地将针头向上推，再次运行`QUERY_PROBE`。确认该命令的报告是"probe: TRIGGERED"。如果没有返回正确的信息，那么请再次检查你的接线和配置。在这个测试完成后，运行`BLTOUCH_DEBUG COMMAND=pin_up`并验证引脚是否向上移动。

source: Many BL-Touch "clone" devices work correctly with Klipper using the default configuration. However, some "clone" devices may require configuration of `pin_up_reports_not_triggered` or `pin_up_touch_mode_reports_triggered`.
ko: 수많은 bltouch 짝퉁들이 기본 설정을 이용해 클리퍼상에서 정상적으로 작동한다. 하지만, 몇몇 짝둥제품은 `pin_up_reports_not_triggered` 혹은 `pin_up_touch_mode_reports_triggered`를 설정해야할 수도 있다.
zh_hans: 许多BL-TOUCH "clone "设备使用默认配置可以与Klipper正常工作。然而，一些 "clone"的设备可能需要配置`pin_up_reports_not_triggered`或`pin_up_touch_mode_reports_triggered`。
