Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/BLTouch.po
Languages: fr, hu, it, ko, zh_hans

source: Some "clone" devices are unable to perform Klipper's internal sensor verification test. On these devices, attempts to home or probe can result in Klipper reporting a "BLTouch failed to verify sensor state" error. If this occurs, then manually run the steps to confirm the sensor pin is working as described in the [initial tests section](#initial-tests). If the `QUERY_PROBE` commands in that test always produce the expected results and "BLTouch failed to verify sensor state" errors still occur, then it may be necessary to set `pin_up_touch_mode_reports_triggered` to False in the Klipper config file.
fr: Certains "clones" sont incapables d'effectuer le test de vérification du capteur interne de Klipper. Sur ces appareils, les tentatives de mise à l'origine ou de palpage peuvent entraîner le signalement par Klipper de l'erreur "BLTouch failed to verify sensor state". Si cela se produit, exécutez manuellement les étapes pour confirmer que la broche du capteur fonctionne comme décrit dans la section [tests initiaux](#initial-tests). Si les commandes `QUERY_PROBE` de ce test produisent toujours les résultats attendus et que l'erreur "BLTouch failed to verify sensor state" se produit toujours, il peut être nécessaire de mettre `pin_up_touch_mode_reports_triggered` à False dans le fichier de configuration de Klipper.
hu: Néhány "klón" eszköz nem képes elvégezni a Klipper belső érzékelő ellenőrző tesztjét. Ezeken az eszközökön a kezdőpont vagy a szonda próbálkozásai a Klipper "BLTouch failed to verify sensor state" hibát jelentenek. Ha ez bekövetkezik, akkor kézzel futtassa le a [kezdeti tesztek szakaszban](#initial-tests) leírt lépéseket az érzékelőtüske működésének megerősítésére. Ha a `QUERY_PROBE` parancsok ebben a tesztben mindig a várt eredményt adják, és a "BLTouch failed to verify sensor state" hiba továbbra is előfordul, akkor szükséges lehet a Klipper konfigurációs fájlban a `pin_up_touch_mode_reports_triggered` értékét False-ra állítani.
it: Alcuni dispositivi "clone" non sono in grado di eseguire il test di verifica del sensore interno di Klipper. Su questi dispositivi, i tentativi di home o probe possono far sì che Klipper riporti un errore "BLTouch non è riuscito a verificare lo stato del sensore". In tal caso, eseguire manualmente i passaggi per verificare che il pin del sensore funzioni come descritto nella [initial tests section](#initial-tests). Se i comandi `QUERY_PROBE` in quel test producono sempre i risultati attesi e si verificano ancora gli errori "BLTouch non è riuscito a verificare lo stato del sensore", potrebbe essere necessario impostare `pin_up_touch_mode_reports_triggered` su False nel file di configurazione di Klipper.
ko: 몇몇 짝퉁 제품은 클리퍼의 내부적인 센서인증테스트를 진행할 수 없습니다. 이 제품들로 호밍이나 프로빙을 시도하면 클리퍼에서 "BLTouch failed to verify sensor state" 결과를 내보내게 됩니다. 만일 이런게 발생하면, [initial tests section](#initial-tests) 에 기록된 내용을 따라 수동으로 센서핀이 제대로 잘 잘동하는지를 단계별로 진행해야 한다. 만약, 그 테스트 중에 `QUERY_PROBE` 명령은 기대했던 동작하고, "BLTouch failed to verify sensor state" 에러는 계속 보인다면, 클리퍼 설정파일에서 `pin_up_touch_mode_reports_triggered` 값을 False 로 셋팅해야 할 수도 있다.
zh_hans: 一些 "clone"设备无法执行Klipper的内部传感器验证测试。在这些设备上，尝试归位或探测会导致Klipper报告 "BLTouch failed to verify sensor state"的错误。如果发生这种情况，那么请手动运行步骤，确认传感器引脚工作，如[初次调试](#initial-tests)所述。如果该测试中的`QUERY_PROBE`命令总是产生预期的结果，而 "BLTouch failed to verify sensor state "错误仍然发生，那么可能需要在Klipper配置文件中把`pin_up_touch_mode_reports_triggered`设为False。

source: A rare number of old "clone" devices are unable to report when they have successfully raised their probe. On these devices Klipper will report a "BLTouch failed to raise probe" error after every home or probe attempt. One can test for these devices - move the head far from the bed, run `BLTOUCH_DEBUG COMMAND=pin_down`, verify the pin has moved down, run `QUERY_PROBE`, verify that command reports "probe: open", run `BLTOUCH_DEBUG COMMAND=pin_up`, verify the pin has moved up, and run `QUERY_PROBE`. If the pin remains up, the device does not enter an error state, and the first query reports "probe: open" while the second query reports "probe: TRIGGERED" then it indicates that `pin_up_reports_not_triggered` should be set to False in the Klipper config file.
fr: Un nombre rare d'anciens "clones" sont incapables de signaler qu'ils ont réussi à relever leur pointeau. Sur ces appareils, Klipper signalera une erreur "BLTouch failed to raise probe" après chaque tentative de retour à l'origine ou de palpage. On peut tester ces appareils - éloigner la tête du lit, exécuter `BLTOUCH_DEBUG COMMAND=pin_down`, vérifier que le pointeau s'est déplacé vers le bas, exécuter `QUERY_PROBE`, vérifier que la commande rapporte "probe : open", exécuter `BLTOUCH_DEBUG COMMAND=pin_up`, vérifier que le pointeau s'est déplacé vers le haut, et exécuter `QUERY_PROBE`. Si la broche reste en haut, que le dispositif n'entre pas dans un état d'erreur, et que la première requête rapporte "probe : open" alors que la seconde rapporte "probe : TRIGGERED" alors cela indique que `pin_up_reports_not_triggered` doit être mis à False dans le fichier de configuration de Klipper.
hu: Néhány régi "klón" készülék nem képes jelenteni, ha sikeresen felemelte a szondát. Ezeken az eszközökön a Klipper minden egyes kezdőpont vagy mérési kísérlet után egy "BLTouch failed to raise probe" hibát jelent. Ezeket az eszközöket tesztelhetjük. Távolítsuk el a fejet a tárgyasztaltól, futtassuk a `BLTOUCH_DEBUG COMMAND=pin_down` parancsot, ellenőrizzük, hogy a mérőtüske lefelé mozdult-e, futtassuk a `QUERY_PROBE` parancsot, ellenőrizzük, hogy a "probe: OPEN" értéket kapjuk, futtassuk a `BLTOUCH_DEBUG COMMAND=pin_up`, ellenőrizzük, hogy a mérőtüske felfelé mozdult-e, és futtassuk a `QUERY_PROBE`. Ha a mérőtüske továbbra is fent marad, az eszköz nem lép hibaállapotba, és az első lekérdezés a "probe: OPEN", míg a második lekérdezés a "probe: TRIGGERED", akkor ez azt jelzi, hogy a Klipper konfigurációs fájlban a `pin_up_reports_not_triggered` értékét False-ra kell állítani.
it: Un raro numero di vecchi dispositivi "clone" non è in grado di segnalare quando hanno sollevato con successo la sonda. Su questi dispositivi Klipper segnalerà un errore "BLTouch non è riuscito a sollevare la sonda" dopo ogni tentativo di home o probe. Si può testare questi dispositivi: spostare la testa lontano dal letto, eseguire `BLTOUCH_DEBUG COMMAND=pin_down`, verificare che il pin si sia spostato verso il basso, eseguire `QUERY_PROBE`, verificare che il comando riporti "probe: open", eseguire `BLTOUCH_DEBUG COMMAND= pin_up`, verifica che il pin sia stato spostato in alto ed esegui `QUERY_PROBE`. Se il pin rimane attivo, il dispositivo non entra in uno stato di errore e la prima query riporta "probe: open" mentre la seconda query riporta "probe: TRIGGERED", quindi indica che `pin_up_reports_not_triggered` dovrebbe essere impostato su False in Klipper file di configurazione.
ko: 드물지만 오래된 짝퉁 제품들중에 성공적으로 프로브를 올려도 제대로 보고가 안되는게 있다. 이 제품들은 호밍이나 프로밍 시도후에 "BLTouch failed to raise probe" 에러를 보일것이다. 그렇다면 이런 제품들에 대해 베드를 헤드와 멀찍이 떨어뜨린 상태에서 `BLTOUCH_DEBUG COMMAND=pin_down` 를 실행시켜 핀이 아래로 내려가는 것을 확인하고, `QUERY_PROBE`를 실행하여 "probe: open" 상태임을 확인하고, `BLTOUCH_DEBUG COMMAND=pin_up`를 실행시켜 핀이 위로 올라가는 것을 확인하라. 그리고 마지막으로 `QUERY_PROBE`를 실행시켜라. 만약 핀이 위에 머물러 있다면, 이 제품은 에러상태에 들어가지 않는다. 그리고 첫 쿼리가 "probe: open"을 내고 두번째 쿼리가 "probe: TRIGGERED"를 내었다면 클리퍼 설정파일에서 `pin_up_reports_not_triggered`을 False 로 셋팅해야 함을 의미한다.
zh_hans: 少数旧的 "clone"设备无法报告它们何时成功地提高了它们的探头。在这些设备上，Klipper会在每次回家或探测尝试后报告一个 "BLTouch failed to raise probe "的错误。可以对这些设备进行测试--将磁头从床头移开，运行`BLTOUCH_DEBUG COMMAND=pin_down`，确认引脚已经向下移动，运行`QUERY_PROBE`，确认命令报告 "probe:open"，运行`BLTOUCH_DEBUG COMMAND=pin_up`，验证引脚已经上移，并运行`QUERY_PROBE`。如果引脚保持向上，设备没有进入错误状态，并且第一个查询报告 "probe: open"，而第二个查询报告 "probe:TRIGGERED"，那么它表明`pin_up_reports_not_triggered`应该在Klipper配置文件中被设置为False。

source: Some BL-Touch v3.0 and BL-Touch 3.1 devices may require configuring `probe_with_touch_mode` in the printer config file.
fr: Certains BL-Touch v3.0 et BL-Touch 3.1 peuvent nécessiter la configuration de `probe_with_touch_mode` dans le fichier de configuration de l'imprimante.
hu: Egyes BL-Touch v3.0 és BL-Touch 3.1 eszközök esetében előfordulhat, hogy a nyomtató konfigurációs fájljában a `probe_with_touch_mode` beállítása szükséges.
it: Alcuni dispositivi BL-Touch v3.0 e BL-Touch 3.1 potrebbero richiedere la configurazione di `probe_with_touch_mode` nel file di configurazione della stampante.
ko: 몇몇 Bltouch v3.0 과 v3.1 제품들은 프린터 설정파일에서 `probe_with_touch_mode` 설정이 필요할 수도 있다.
zh_hans: 一些BL-Touch v3.0和BL-Touch 3.1设备可能需要在打印机配置文件中配置`probe_with_touch_mode`。

source: If the BL-Touch v3.0 has its signal wire connected to an endstop pin (with a noise filtering capacitor), then the BL-Touch v3.0 may not be able to consistently send a signal during homing and probing. If the `QUERY_PROBE` commands in the [initial tests section](#initial-tests) always produce the expected results, but the toolhead does not always stop during G28/PROBE commands, then it is indicative of this issue. A workaround is to set `probe_with_touch_mode: True` in the config file.
fr: Si le fil de signal du BL-Touch v3.0 est connecté à une broche d'arrêt (avec un condensateur de filtrage du bruit), il se peut que le BL-Touch v3.0 ne soit pas capable d'envoyer un signal de manière constante pendant la recherche de l'origine et le palpage. Si les commandes `QUERY_PROBE` dans la section des [tests initiaux](#initial-tests) produisent toujours les résultats attendus, mais que la tête de l'outil ne s'arrête toujours pas pendant les commandes G28/PROBE, alors cela indique ce problème. Une solution de contournement est de définir `probe_with_touch_mode : True` dans le fichier de configuration.
hu: Ha a BL-Touch v3.0 jelkábelét egy (zajszűrő kondenzátorral ellátott) végállás csatlakozóhoz csatlakoztatja, akkor előfordulhat, hogy a BL-Touch v3.0 nem tud következetesen jelet küldeni a kezdőpont felvétel és a mérés során. Ha a [kezdeti tesztek szakaszban](#initial-tests) található `QUERY_PROBE` parancsok mindig a várt eredményt adják, de a nyomtatófej nem mindig áll meg a G28/PROBE parancsok alatt, akkor ez erre a problémára utal. A megoldás a `probe_with_touch_mode: True` beállítása a konfigurációs fájlban.
it: Se il BL-Touch v3.0 ha il cavo del segnale collegato a un pin endstop (con un condensatore di filtraggio del rumore), il BL-Touch v3.0 potrebbe non essere in grado di inviare un segnale in modo coerente durante l'homing e il probe. Se i comandi `QUERY_PROBE` nella [initial tests section](#initial-tests) producono sempre i risultati attesi, ma il toolhead non si ferma sempre durante i comandi G28/PROBE, allora è indicativo di questo problema. Una soluzione alternativa consiste nell'impostare `probe_with_touch_mode: True` nel file di configurazione.
ko: 만약 Bltouch 3.0 에서 신호선을 엔드스탑핀(노이즈 필터링 캐패시턴트가 연결된)에 연결했다면 호밍과 프로빙시에 지속적으로 신호를 보낼 수 없을 수도 있다. 만일 [initial tests section](#initial-tests) 에서 `QUERY_PROBE` 명령이 기대한 결과를 내면서도 툴헤드가 G28/PROBE 명령동안 매번 멈추지 않는다면 이 문제의 원인일 수 있다. 이를 피하는 방법으론 설정파일에서 `probe_with_touch_mode: True` 로 셋팅하는 것이다.
zh_hans: 如果BL-TOUCH v3.0的信号线连接到一个末端停止引脚（有一个噪音过滤电容），那么BL-TOUCH v3.0可能无法在归位和探测期间持续发送信号。如果[初次调试](#initial-tests)中的`QUERY_PROBE`命令总是产生预期的结果，但在G28/PROBE命令期间，工具头并不总是停止，那么就表明有这个问题。一个变通的办法是在`probe_with_touch_mode:True`在配置文件中。

source: The BL-Touch v3.1 may incorrectly enter an error state after a successful probe attempt. The symptoms are an occasional flashing light on the BL-Touch v3.1 that lasts for a couple of seconds after it successfully contacts the bed. Klipper should clear this error automatically and it is generally harmless. However, one may set `probe_with_touch_mode` in the config file to avoid this issue.
fr: Le BL-Touch v3.1 peut entrer incorrectement dans un état d'erreur après une tentative de sondage réussie. Les symptômes sont une lumière clignotante occasionnelle sur le BL-Touch v3.1 qui dure quelques secondes après qu'il ait réussi à entrer en contact avec le lit. Klipper devrait effacer cette erreur automatiquement et elle est généralement inoffensive. Cependant, on peut définir `probe_with_touch_mode` dans le fichier de configuration pour éviter ce problème.
hu: Előfordulhat, hogy a BL-Touch v3.1 egy sikeres mérési kísérlet után hibaállapotba kerül. Ennek tünete a BL-Touch v3.1 időnként villogó fénye, amely néhány másodpercig tart, miután sikeresen érintkezik az ággyal. A Klippernek ezt a hibát automatikusan törölnie kell, és általában ártalmatlan. A konfigurációs fájlban azonban beállíthatjuk a `probe_with_touch_mode` értéket, hogy elkerüljük ezt a problémát.
it: Il BL-Touch v3.1 potrebbe entrare erroneamente in uno stato di errore dopo un tentativo di probe riuscito. I sintomi sono una luce lampeggiante occasionale sul BL-Touch v3.1 che dura per un paio di secondi dopo che è entrato in contatto con successo con il letto. Klipper dovrebbe cancellare questo errore automaticamente ed è generalmente innocuo. Tuttavia, è possibile impostare `probe_with_touch_mode` nel file di configurazione per evitare questo problema.
ko: Bltouch v3.1 은 성공적인 프로브 시도후에 부정확하게 에러상태에 빠질 수 있다. 증상으로는 프로브가 베드에 성공적으로 닿고 나서 몇초동안 간헐적으로 불빛이 깜빡인다. 클리퍼는 자동으로 이 에러를 해결하고, 일반적으로는 큰 해가없다. 하지만, 이 이슈를 피하기 위해 설정파일에서 `probe_with_touch_mode`를 셋팅해주는게 좋을 것이다.
zh_hans: BL-TOUCH v3.1在尝试探测成功后可能会错误地进入错误状态。其症状是BL-TOUCH v3.1在成功接触床铺后，偶尔会有灯光闪烁，持续几秒钟。Klipper应该自动清除这个错误，一般来说是没有问题的。当然你可以在配置文件中设置`probe_with_touch_mode`以此避免这个问题。

source: Important! Some "clone" devices and the BL-Touch v2.0 (and earlier) may have reduced accuracy when `probe_with_touch_mode` is set to True. Setting this to True also increases the time it takes to deploy the probe. If configuring this value on a "clone" or older BL-Touch device, be sure to test the probe accuracy before and after setting this value (use the `PROBE_ACCURACY` command to test).
fr: Important ! Certains "clones" ainsi que le BL-Touch v2.0 (et antérieur) peuvent avoir une précision réduite lorsque `probe_with_touch_mode` est réglé sur True. Le réglage de cette valeur sur True augmente également le temps nécessaire au déploiement de la sonde. Si vous configurez cette valeur sur un dispositif BL-Touch "clone" ou plus ancien, assurez-vous de tester la précision de la sonde avant et après avoir défini cette valeur (utilisez la commande `PROBE_ACCURACY` pour tester).
hu: Fontos! Néhány "klón" eszköz és a BL-Touch v2.0 (és korábbi) csökkent pontosságú lehet, ha a `probe_with_touch_mode` értéke True. Ennek True értékre állítása a szonda telepítésének idejét is megnöveli. Ha ezt az értéket egy "klón" vagy régebbi BL-Touch eszközön konfigurálja, mindenképpen tesztelje a szonda pontosságát az érték beállítása előtt és után (a teszteléshez használja a `PROBE_ACCURACY` parancsot).
it: Importante! Alcuni dispositivi "clone" e BL-Touch v2.0 (e precedenti) potrebbero avere una precisione ridotta quando `probe_with_touch_mode` è impostato su True. L'impostazione su True aumenta anche il tempo necessario per distribuire la sonda. Se si configura questo valore su un dispositivo BL-Touch "clone" o precedente, assicurarsi di testare l'accuratezza della sonda prima e dopo aver impostato questo valore (utilizzare il comando `PROBE_ACCURACY` per eseguire il test).
ko: 중요! 몇몇 짝퉁 제품과 Bltouch v2.0(혹은 이전버전)은 `probe_with_touch_mode` 을 True 로 셋팅해두었을때 정확도가 감소할 수도 있다. 또한 이 값을 True 로 하는 것은 프로브 밀어내는 시간을 증가시킬 수도 있다. 만약 이 짝퉁이나 이전 bltouch 제품에서 이 값을 설정한다면 이 값을 셋팅하기 전과 후에 정확도 테스트를 반드시 해보기 바란다. (테스트는 `PROBE_ACCURACY` 명령을 사용하라).
zh_hans: 重要!当`probe_with_touch_mode`被设置为True时，一些 "clone"设备和BL-Touch v2.0（及更早）可能会降低精度。将此设置为True也会增加部署探针的时间。如果在 "克隆 "或更早的BL-TOUCH设备上配置这个值，一定要在设置这个值之前和之后测试探头的准确性（使用`PROBE_ACCURACY`命令进行测试）。

source: Multi-probing without stowing
fr: Multi-palpages sans rétraction du pointeau
hu: Többszöri szúrópróbaszerű mérés
it: Multi-sondaggio senza riporre
ko: 핀을 넣지 않고 다중측정하기
zh_hans: 无收起多次探测

source: By default, Klipper will deploy the probe at the start of each probe attempt and then stow the probe afterwards. This repetitive deploying and stowing of the probe may increase the total time of calibration sequences that involve many probe measurements. Klipper supports leaving the probe deployed between consecutive probes, which can reduce the total time of probing. This mode is enabled by configuring `stow_on_each_sample` to False in the config file.
fr: Par défaut, Klipper déploie le pointeau au début de chaque tentative de mesure et le rétracte ensuite. Ce déploiement et cette rétraction répétitifs du pointeau peuvent augmenter la durée totale des séquences d'étalonnage impliquant de nombreuses mesures du plateau. Klipper permet de laisser le pointeau déployé entre deux mesures consécutives, ce qui peut réduire la durée totale des mesures. Ce mode est activé en configurant `stow_on_each_sample` à False dans le fichier de configuration.
hu: Alapértelmezés szerint a Klipper minden egyes méréskísérlet kezdetén kitelepíti a mérőtüskét, majd utána elrakja. A szonda ismételt be és kitelepítése megnövelheti a sok mérést tartalmazó kalibrálási folyamatok teljes időtartamát. A Klipper támogatja, hogy a mérőtüskét az egymást követő mérések között is kihelyezve hagyja, ami csökkentheti a mérések teljes idejét. Ez az üzemmód a `stow_on_each_sample` False értékre való beállításával engedélyezhető a konfigurációs fájlban.
it: Per impostazione predefinita, Klipper rilascia la sonda all'inizio di ogni tentativo di sonda e poi riporrà la sonda in seguito. Questo dispiegamento e stivaggio ripetitivo della sonda può aumentare il tempo totale delle sequenze di calibrazione che coinvolgono molte misurazioni della sonda. Klipper consente di lasciare la sonda dispiegata tra test consecutivi, il che può ridurre il tempo totale di rilevamento. Questa modalità è abilitata configurando `stow_on_each_sample` su False nel file di configurazione.
ko: 기본적으로 클리퍼는 각 측정지점에서 측정을 시작할 때 프로브를 밀어내고 당기고 한다. 이 반복된 밀어내고 당기고의 과정은 많은 측정포인트를 지닌 캘리브레이션 시퀀스에서 전체 시간을 증가시키게 된다. 클리퍼는 연속된 측정포인트 사이의 이동시 프로브가 나온 상태에서 이동하게 할 수 있다. 이것은 전체 측정 시간을 줄일 수 있는 방법이다. 이 모드는 설정파일에서 `stow_on_each_sample` 값을 False 로 설정하면 사용가능하다.
zh_hans: 默认情况下，Klipper将在每次探测尝试开始时部署探针，然后在之后收起探针。这种重复部署和收起探头的做法可能会增加涉及许多探头测量的校准序列的总时间。Klipper支持在连续的探测之间留下探头，这可以减少探测的总时间。通过在配置文件中把`stow_on_each_sample`配置为False，可以启用这种模式。

source: Important! Setting `stow_on_each_sample` to False can lead to Klipper making horizontal toolhead movements while the probe is deployed. Be sure to verify all probing operations have sufficient Z clearance prior to setting this value to False. If there is insufficient clearance then a horizontal move may cause the pin to catch on an obstruction and result in damage to the printer.
fr: Important ! Si vous réglez la valeur `Stow_on_each_sample` sur False, Klipper peut effectuer des mouvements horizontaux de la tête de l'outil durant le déploiement du palpeur. Assurez-vous que toutes les opérations de palpage ont un dégagement Z suffisant avant de régler cette valeur sur False. Si l'espace est insuffisant, un mouvement horizontal peut faire en sorte que le pointeau s'accroche à une obstruction et endommager l'imprimante.
hu: Fontos! A `stow_on_each_sample` False (Hamis) beállítása ahhoz vezethet, hogy a Klipper vízszintes nyomtatófej mozgásokat végez, miközben a szonda ki van helyezve. Győződjön meg róla, hogy minden szondázási műveletnél elegendő Z-távolság van, mielőtt ezt az értéket False értékre állítaná. Ha nincs elegendő szabad tér, akkor a vízszintes mozgások során a mérőtüske beleakadhat egy akadályba, ami a nyomtató vagy mérőeszköz károsodását eredményezheti.
it: Importante! L'impostazione di `stow_on_each_sample` su False può portare Klipper a fare movimenti orizzontali della testa utensile mentre la sonda è estesa. Assicurarsi di verificare che tutte le operazioni con la probe abbiano un gioco Z sufficiente prima di impostare questo valore su False. Se lo spazio libero è insufficiente, uno spostamento orizzontale può causare l'intrappolamento del perno in un'ostruzione e causare danni alla stampante.
ko: 중요! `stow_on_each_sample` 를 False 로 설정은 프로브가 나온 상태에서 툴이 수평이동하게 만들 수 있다. 따라서 이값을 False 로 셋팅하기 앞서 모든 프로빙 과정에서 충분한 Z 간격을 확보하는지 반드시 확인하기 바란다. 만일 Z 간격이 충분치 않다면 수평이동시 핀이 장애물을 만나 부러지거나 잘못된 측정에 의해 프린터에 손상을 가져올 수도 있으니 주의하자.
zh_hans: 重要!将`Stow_on_each_sample`设置为False可能导致Klipper在测头展开时进行水平刀头运动。在将此值设置为 "False"之前，请确保所有探测操作都有足够的Z间隙。如果没有足够的间隙，那么水平移动可能会导致针卡在障碍物上并且导致打印机损坏。

source: Important! It is recommended to use `probe_with_touch_mode` configured to True when using `stow_on_each_sample` configured to False. Some "clone" devices may not detect a subsequent bed contact if `probe_with_touch_mode` is not set. On all devices, using the combination of these two settings simplifies the device signaling, which can improve overall stability.
fr: Important ! Il est recommandé d'utiliser `probe_with_touch_mode` configuré à True lorsque vous utilisez `stow_on_each_sample` configuré à False. Certains "clones" peuvent ne pas détecter un contact ultérieur du lit si `probe_with_touch_mode` n'est pas configuré. Sur tous les dispositifs, l'utilisation de la combinaison de ces deux paramètres simplifie la signalisation de l'appareil, améliorant la stabilité globale.
hu: Fontos! Ajánlott a True értékre konfigurált `probe_with_touch_mode` használata, ha a False értékre konfigurált `stow_on_each_sample` értéket használja. Néhány "klón" eszköz nem érzékeli a tárgyasztal későbbi érintését, ha a `probe_with_touch_mode` nincs beállítva. Minden eszközön e két beállítás kombinációjának használata egyszerűsíti az eszköz jelzését, ami javíthatja az általános stabilitást.
it: Importante! Si consiglia di utilizzare `probe_with_touch_mode` configurato su True quando si utilizza `stow_on_each_sample` configurato su False. Alcuni dispositivi "clone" potrebbero non rilevare un successivo contatto con il piatto se `probe_with_touch_mode` non è impostato. Su tutti i dispositivi, l'utilizzo della combinazione di queste due impostazioni semplifica la segnalazione del dispositivo, che può migliorare la stabilità generale.
ko: 중요! `stow_on_each_sample` 를 False 로 설정하면 `probe_with_touch_mode`는 True 로 해둘것을 추천한다. 몇몇 짝퉁 제품은 `probe_with_touch_mode` 이 셋팅되어 있지 않으면 연속된 베드 컨택을 감지하지 못할 수도 있다. 모든 제품에서 이 두 셋팅을 조합해 사용하면 제품의 신호를 단순화하여 전체적인 안정성을 높일 수 있을 것이다.
zh_hans: 重要!当使用`stow_on_each_sample`配置为False时，建议使用`probe_with_touch_mode`配置为True。如果没有设置`probe_with_touch_mode`，一些 "clone"设备可能检测不到后续的床位接触。在所有的设备上，使用这两个设置的组合可以简化设备的信号传递，从而提高整体稳定性。
