Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/BLTouch.po
Languages: fr, hu, it, ko, zh_hans

source: Note, however, that some "clone" devices and the BL-Touch v2.0 (and earlier) may have reduced accuracy when `probe_with_touch_mode` is set to True. On these devices it is a good idea to test the probe accuracy before and after setting `probe_with_touch_mode` (use the `PROBE_ACCURACY` command to test).
fr: Notez cependant que certains "clones" ainsi que le BL-Touch v2.0 (et antérieurs) peuvent avoir une précision réduite lorsque `probe_with_touch_mode` est réglé sur True. Sur ces appareils, c'est une bonne idée de tester la précision de la sonde avant et après avoir réglé `probe_with_touch_mode` (utilisez la commande `PROBE_ACCURACY` pour tester).
hu: Vedd figyelembe azonban, hogy néhány "klón" eszköz és a BL-Touch v2.0 (és korábbi) csökkentett pontosságú lehet, ha a `probe_with_touch_mode` értéke True. Ezeken az eszközökön érdemes tesztelni a szonda pontosságát a `probe_with_touch_mode` beállítása előtt és után (a teszteléshez használja a `PROBE_ACCURACY` parancsot).
it: Si noti, tuttavia, che alcuni dispositivi "clone" e BL-Touch v2.0 (e precedenti) potrebbero avere una precisione ridotta quando `probe_with_touch_mode` è impostato su True. Su questi dispositivi è una buona idea testare l'accuratezza della sonda prima e dopo aver impostato `probe_with_touch_mode` (usare il comando di test `PROBE_ACCURACY`).
ko: 하지만, 일부 짝퉁 제품과 BLtouch v2.0 이하의 제품은 `probe_with_touch_mode` 를 True 로 셋팅했을때 정확도가 떨어질 수도 있다. 이 제품들을 사용한다면 `probe_with_touch_mode` 을 셋팅하기 전과 후에 정확도 테스트를 해보는 것은 좋겠다. (테스트는 `PROBE_ACCURACY` 명령을 사용하라).
zh_hans: 但是请注意，当`probe_with_touch_mode`设置为True时，一些 "clone"设备和BL-Touch v2.0（以及更早）可能会降低精度。在这些设备上，最好在设置`probe_with_touch_mode`之前和之后测试探头的准确性（使用`PROBE_ACCURACY`命令来测试）。

source: Calibrating the BL-Touch offsets
fr: Étalonnage des décalages du BL-Touch
hu: A BL-Touch eltolások kalibrálása
it: Calibrazione degli offset BL-Touch
ko: Bltouch 오프셋 캘리브레이션
zh_hans: BL-TOUCH偏移校准

source: Follow the directions in the [Probe Calibrate](Probe_Calibrate.md) guide to set the x_offset, y_offset, and z_offset config parameters.
fr: Suivez les instructions du guide [Calibration de la sonde](Probe_Calibrate.md) pour définir les paramètres de configuration x_offset, y_offset et z_offset.
hu: Az x_offset, y_offset és z_offset konfigurációs paraméterek beállításához kövesse a [Szintező Kalibrálása](Probe_Calibrate.md) útmutatóban található utasításokat.
it: Seguire le istruzioni nella guida [Probe Calibrate](Probe_Calibrate.md) per impostare i parametri di configurazione x_offset, y_offset e z_offset.
ko: x_offset, y_offset, 그리고 z_offset 설정 파라메터들을 셋팅하기 위해 [Probe Calibrate](Probe_Calibrate.md)의 지시사항을 따르도록 하라.
zh_hans: 按照[Probe Calibrate](Probe_Calibrate.md)指南中的指示来设置x_offset、y_offset和z_offset配置参数。

source: It's a good idea to verify that the Z offset is close to 1mm. If not, then you probably want to move the probe up or down to fix this. You want it to trigger well before the nozzle hits the bed, so that possible stuck filament or a warped bed doesn't affect any probing action. But at the same time, you want the retracted position to be as far above the nozzle as possible to avoid it touching printed parts. If an adjustment is made to the probe position, then rerun the probe calibration steps.
fr: C'est une bonne idée de vérifier que le décalage Z est proche de 1mm. Si ce n'est pas le cas, vous devrez probablement déplacer le dispositif vers le haut ou vers le bas pour résoudre ce problème. Vous voulez qu'il se déclenche bien avant que la buse ne touche le lit, afin qu'un éventuel filament coincé ou un lit déformé n'affecte pas l'action du BL-Touch. Mais en même temps, vous voulez que la position rétractée soit aussi loin que possible au-dessus de la buse pour éviter qu'elle ne touche les pièces imprimées. Si un ajustement est effectué sur la position du BL-Touch, recommencez les étapes d'étalonnage de celui-ci.
hu: Jó ötlet ellenőrizni, hogy a Z eltolás közel 1 mm. Ha nem, akkor valószínűleg felfelé vagy lefelé kell mozgatni a szondát, hogy ezt kijavítsa. Azt szeretné, hogy aktiválódjon, mielőtt a fúvóka a tárgyasztalhoz ér, hogy a fúvókához ragadt nyomtatószál vagy a meggörbült tárgyasztal ne befolyásolja a mérési műveletet. Ugyanakkor azonban azt szeretné, ha a visszahúzott pozíció a lehető legmesszebb lenne a fúvóka felett, hogy elkerülje a nyomtatott tárgyak érintkezését. Ha a szonda pozíciójáballítása megtörtént, akkor ismételje meg a kalibrálás lépéseit.
it: È una buona idea verificare che l'offset Z sia vicino a 1 mm. In caso contrario, probabilmente vorrai spostare la sonda su o giù per risolvere il problema. Si desidera che si attivi ben prima che l'ugello colpisca il piatto, in modo che un possibile filamento bloccato o un piatto deformato non influisca sull'azione della sonda. Ma allo stesso tempo, si desidera che la posizione retratta sia il più possibile al di sopra dell'ugello per evitare che tocchi le parti stampate. Se viene effettuata una regolazione della posizione della sonda, eseguire nuovamente i passaggi di calibrazione della sonda.
ko: Z offset 은 1mm 가깝게 하는 것이 좋다. 만약 그 값이 아니라면 1mm 가 되도록 조정을 위해 프로브를 위나 아래로 이동시키면 된다. 이렇게 하면 노즐이 베드를 찍기 전에 작동하면서도 간혹 있을 수 있는 노즐에 붙은 필라멘트나 휘어진 베드가 측정에는 영향을 미치지 않을 것이다. 그러나 동시에 프로브가 당겨진 위치에서 가능하면 노즐 위쪽에 있어 프린트된 파츠를 건드리지 않도록 하고 싶을 것이다. 만약 프로브 장착 위치가 바뀐다면 프로브 캘리브레이션 과정은 다시 진행되어야 한다.
zh_hans: 确认Z轴偏移量接近1mm是个好主意。如果不是，那么你可能要将探头向上或向下移动来解决这个问题。你想让它在喷嘴碰到床面之前很好地触发，这样可能出现的卡丝或扭曲的床面就不会影响任何探测动作。但与此同时，你希望缩回的位置尽可能高于喷嘴，以避免它接触到打印件。如果对探针位置进行了调整，然后重新运行探针校准步骤。

source: BL-Touch output mode
fr: Mode de sortie du BL-Touch
hu: BL-Touch kimeneti mód
it: Modalità di output BL-Touch
ko: BL-Touch 아웃풋 모드
zh_hans: BL-Touch输出模式

source: A BL-Touch V3.0 supports setting a 5V or OPEN-DRAIN output mode, a BL-Touch V3.1 supports this too, but can also store this in its internal EEPROM. If your controller board needs the fixed 5V high logic level of the 5V mode you may set the 'set_output_mode' parameter in the [bltouch] section of the printer config file to "5V".
fr: Un BL-Touch V3.0 accepte le réglage d'un mode de sortie 5V ou OPEN-DRAIN, un BL-Touch V3.1 le supporte aussi et peut également le stocker dans son EEPROM interne. Si votre carte contrôleur a besoin du niveau logique haut de 5V du mode 5V, vous pouvez régler le paramètre 'set_output_mode' dans la section [bltouch] du fichier de configuration de l'imprimante sur "5V".
hu: A BL-Touch V3.0 támogatja az 5V vagy OPEN-DRAIN kimeneti mód beállítását, a BL-Touch V3.1 szintén támogatja ezt, de ezt a belső EEPROM-jában is el tudja tárolni. Ha az alaplapjának szüksége van az 5V-os üzemmód fix 5V magas logikai szintjére, akkor a nyomtató konfigurációs fájl [bltouch] szakaszában a 'set_output_mode' paramétert "5V" értékre állíthatja.
it: Un BL-Touch V3.0 supporta l'impostazione di una modalità di uscita 5V o OPEN-DRAIN, un BL-Touch V3.1 supporta anche questo, ma può anche memorizzarlo nella sua EEPROM interna. Se la tua scheda controller ha bisogno del livello logico alto 5V fisso della modalità 5V, puoi impostare il parametro 'set_output_mode' nella sezione [bltouch] del file di configurazione della stampante su "5V".
ko: Bltouch V3.0 은 5V 나 OPEN-DRAIN 아웃풋 모드 셋팅을 지원한다. Bltouch V3.1 은 이 두가지를 지원한다. 그러나 또한 내부 EEPROM 내에 이것을 저장할수도 있다. 만일 컨트롤러 보드가 5V 모드의 고정된 5V 하이로직 레벨이 필요하다면, 프린터 설정파일의 [bltouch]섹션에 있는 'set_output_mode' 파라메터의 값을 "5V" 로 셋팅하면 된다.
zh_hans: BL-TOUCH V3.0支持设置5V或OPEN-DRAIN输出模式，BL-TOUCH V3.1也支持，但也可以在其内部EEPROM中存储。如果你的控制器板需要5V模式的固定5V高逻辑电平，你可以把打印机配置文件[bltouch]部分的'set_output_mode'参数设置为 "5V"。

source: *** Only use the 5V mode if your controller boards input line is 5V tolerant. This is why the default configuration of these BL-Touch versions is OPEN-DRAIN mode. You could potentially damage your controller boards CPU ***
fr: ***N'utilisez le mode 5V que si la ligne d'entrée de votre carte contrôleur est tolérante à cette tension (5V). C'est pourquoi la configuration par défaut de ces versions de BL-Touch est le mode OPEN-DRAIN. Vous pourriez potentiellement endommager le CPU de votre carte contrôleur***
hu: *** Csak akkor használja az 5V-os üzemmódot, ha az alaplapnak a bemeneti vonala 5V-os toleráns. Ezért ezeknek a BL-Touch verzióknak az alapértelmezett konfigurációja a OPEN-DRAIN üzemmód. Ezzel potenciálisan károsíthatja az alaplap CPU-ját ***
it: *** Utilizzare la modalità 5V solo se la linea di ingresso della scheda controller è tollerante a 5V. Ecco perché la configurazione di default di queste versioni BL-Touch è la modalità OPEN-DRAIN. Potresti potenzialmente danneggiare la CPU delle tue schede di controllo ***
ko: *** 오직 컨트롤러 보드의 입력 라인이 5V tolerant 일때 5V 모드를 사용하라. 이는 Bltouch 버전의 기본 설정이 OPEN-DRAIN 모드이기 때문이다. 잠재적으로 당신의 큰트롤러 보드 CPU를 손상시킬지도 모른다. ***
zh_hans: *** 只有在你的控制器板的输入线能容忍5V时才使用5V模式。这就是为什么这些BL-TOUCH版本的默认配置是OPEN-DRAIN模式。你有可能损坏你的控制器板的CPU ***

source: So therefore: If a controller board NEEDs 5V mode AND it is 5V tolerant on its input signal line AND if
fr: En résumé : Si une carte contrôleur a besoin d'un mode 5V ET qu'elle est tolérante à 5V sur sa ligne de signal d'entrée ET si
hu: Ezért tehát: Ha egy alaplapnak 5V-os üzemmódra van szüksége ÉS 5V-os toleráns a bemeneti jelvonalon ÉS ha
it: Quindi: se una scheda controller HA BISOGNO della modalità 5V ED è tollerante a 5V sulla sua linea del segnale di ingresso E se
ko: 그런고로 : 만약 컨트롤러 보드가 5V 모드를 필요로 하고 입력 신호선이 5V tolerant 이라면, 그리고 또 만약
zh_hans: 因此。如果一个控制器板需要5V模式，并且它的输入信号线是5V的，并且如果

source: you have a BL-Touch Smart V3.0, you need the use 'set_output_mode: 5V' parameter to ensure this setting at each startup, since the probe cannot remember the needed setting.
fr: vous avez un BL-Touch Smart V3.0, vous devez utiliser le paramètre 'set_output_mode : 5V' pour assurer ce réglage à chaque démarrage, puisque la sonde ne peut pas se souvenir du réglage nécessaire.
hu: ha neked BL-Touch Smart V3.0 van, akkor a 'set_output_mode-ot: 5V' paramétert kell megadni, hogy minden egyes indításkor biztosítsd ezt a beállítást, mivel a szonda nem tudja megjegyezni a szükséges beállítást.
it: si dispone di un BL-Touch Smart V3.0, è necessario utilizzare il parametro 'set_output_mode: 5V' per garantire questa impostazione ad ogni avvio, poiché la sonda non ricorda l'impostazione necessaria.
ko: Bltouch Smart V3.0 을 쓴다면, 'set_output_mode: 5V' 파라메터를 매번 시작할 때 셋팅해줄 필요가 있다. 왜냐하면 프로브는 셋팅을 기억할 수 없기 때문이다.
zh_hans: 你有一个BL-TOUCH Smart V3.0，你需要使用'set_output_mode:5V'参数，以确保每次启动时的这一设置，因为探头不能记住所需的设置。

source: you have a BL-Touch Smart V3.1, you have the choice of using 'set_output_mode: 5V' or storing the mode once by use of a 'BLTOUCH_STORE MODE=5V' command manually and NOT using the parameter 'set_output_mode:'.
fr: vous avez un BL-Touch Smart V3.1, vous avez le choix d'utiliser 'set_output_mode : 5V' ou de mémoriser le mode une fois pour toutes en utilisant une commande 'BLTOUCH_STORE MODE=5V' manuellement et sans plus utiliser le paramètre 'set_output_mode:'.
hu: ha neked BL-Touch Smart V3.1 van, akkor választhatsz a 'set_output_mode: 5V' vagy az üzemmód egyszeri tárolása a 'BLTOUCH_STORE MODE=5V' parancsok közül, kézzel és NEM a 'set_output_mode:' paraméter használatával.
it: hai un BL-Touch Smart V3.1, puoi scegliere di usare 'set_output_mode: 5V' o memorizzare la modalità una volta usando un comando 'BLTOUCH_STORE MODE=5V' manualmente e NON usando il parametro 'set_output_mode:'.
ko: Bltouch Smart V3.1 을 쓴다면, 선택지가 있다. 'set_output_mode: 5V' 를 쓰거나 수동으로 한번 'BLTOUCH_STORE MODE=5V' 명령을 사용하고 그 모드를 저장하는 것이다. 이때는 'set_output_mode:' 를 사용하지 않는다.
zh_hans: 如果你有一台BL-TOUCH Smart V3.1，你可以选择使用'set_output_mode:5V "或者通过手动使用 "BLTOUCH_STORE MODE=5V "命令，而不是使用参数 "set_output_mode: "来存储模式。

source: you have some other probe: Some probes have a trace on the circuit board to cut or a jumper to set in order to (permanently) set the output mode. In that case, omit the 'set_output_mode' parameter completely.
fr: vous avez une autre sonde : Certaines sondes ont une trace sur la carte de circuit imprimé à couper ou un cavalier à régler afin de définir (de façon permanente) le mode de sortie. Dans ce cas, omettez complètement le paramètre 'set_output_mode'.
hu: ha van más szondája is: A kimeneti üzemmód (végleges) beállításához néhány szondának van egy bekötése az alaplapon, amelyet el kell vágni, vagy egy jumperrel kell beállítani. Ebben az esetben hagyja ki teljesen a 'set_output_mode' paramétert.
it: hai qualche altra sonda: alcune sonde hanno una traccia sul circuito stampato da tagliare o un ponticello da impostare per impostare (permanentemente) la modalità di uscita. In tal caso, omettere completamente il parametro 'set_output_mode'.
ko: 그밖의 다른 프로브를 쓴다면 : 일부 프로브는 회로보드에 끊을 수 있는 선이 있거나 점퍼를 가지고 있다. 이것을 통해 영구적으로 출력모드를 셋팅할 수 있다. 그 경우에는 'set_output_mode' 파라메터를 완전히 제거하도록 하라.
zh_hans: 你有一些其他的探头。有些探头在电路板上有一个需要切的或者需要设置一个跳线，以便（永久）设置输出模式。在这种情况下，完全省略 "set_output_mode "参数。

source: If you have a V3.1, do not automate or repeat storing the output mode to avoid wearing out the EEPROM of the probe.The BLTouch EEPROM is good for about 100.000 updates. 100 stores per day would add up to about 3 years of operation prior to wearing it out. Thus, storing the output mode in a V3.1 is designed by the vendor to be a complicated operation (the factory default being a safe OPEN DRAIN mode) and is not suited to be repeatedly issued by any slicer, macro or anything else, it is preferably only to be used when first integrating the probe into a printers electronics.
fr: Si vous avez une version V3.1, n'automatisez pas ou ne répétez pas la mémorisation du mode de sortie afin d'éviter d'user l'EEPROM de la sonde. L'EEPROM du BLTouch permet environ 100.000 mises à jour. 100 mises à jour par jour représentent environ 3 ans de fonctionnement avant l'usure de la mémoire. Ainsi, le stockage du mode de sortie dans la V3.1 est conçu par le vendeur pour être une opération compliquée (le défaut d'usine étant un mode sûr OPEN DRAIN) et n'est pas adapté pour être émis de manière répétée par un trancheur, une macro ou autre, il est préférable de ne l'utiliser que lors de la première intégration de la sonde dans l'électronique de l'imprimante.
hu: Ha V3.1 szondával rendelkezik, ne automatizálja vagy ismételje a kimeneti üzemmód tárolását, hogy elkerülje a szonda EEPROM-jának elhasználódását. A BLTouch EEPROM körülbelül 100.000 frissítésre alkalmas. A napi 100 tárolás körülbelül 3 évnyi működést jelentene, mielőtt elhasználódna. Így a kimeneti üzemmód tárolását a V3.1-ben a gyártó bonyolult műveletnek tervezte (a gyári alapértelmezett egy biztonságos OPEN DRAIN üzemmód), és nem alkalmas arra, hogy bármilyen szeletelő, makró vagy bármi más által ismételten kiadja, lehetőleg csak akkor használható, amikor először integrálják a szondát egy nyomtató alaplapjára.
it: Se hai una V3.1, non automatizzare o ripetere la memorizzazione della modalità di output per evitare di consumare la EEPROM della sonda. La BLTouch EEPROM è valida per circa 100.000 aggiornamenti. 100 memorizzazioni al giorno aggiungerebbero fino a circa 3 anni di attività prima di logorarlo. Pertanto, la memorizzazione della modalità di output in una V3.1 è progettata dal fornitore per essere un'operazione complicata (l'impostazione predefinita di fabbrica è una modalità OPEN DRAIN sicura) e non è adatta per essere emessa ripetutamente da qualsiasi slicer, macro o altro, esso è preferibilmente da utilizzare solo quando si integra per la prima volta la sonda nell'elettronica di una stampante.
ko: 만일 V3.1을 사용한다면 EEPROM 이 마모되지 않도록 하기 위해 출력모드 저장을 자동화 하거나 반복하지 않도록 하라. Bltouch EEPROM 은 약 100,000번 업데이트까지 가능하다. 하루에 100번 저장을 한다면 마모되기 전까지 약 3년을 쓸 수 있다. 따라서 V3.1의 출력모드 저장기능은 복잡한 작업을 하는 사람을 위해 디자인 된 것이다. (공장초기값은 안전한 OPEN DRAIN 모드이다) 그리고, 반복적으로 슬라이서나 매크로등에 의해 사용되는 용도로는 적합지 않다. 그것은 프로브를 프린터 전장부에 처음으로 적용하여 사용할 때 사용할것을 권한다.
zh_hans: 如果你有一个V3.1，不要自动或重复存储输出模式，以避免磨损探头的EEPROM。BLTouch EEPROM可用于约100.000次更新。每天存储100次，在磨损之前，加起来大约可以运行3年。因此，在V3.1中存储输出模式被供应商设计成一个复杂的操作（出厂默认值是一个 safe OPEN DRAIN 模式），不适合由任何切片软件、宏或其他东西重复发出，最好仅在首次将探头放到到打印机电子设备时使用。

source: If the BL-Touch will be used to home the Z axis then set `endstop_pin: probe:z_virtual_endstop` and remove `position_endstop` in the `[stepper_z]` config section, then add a `[safe_z_home]` config section to raise the z axis, home the xy axes, move to the center of the bed, and home the z axis. For example:
fr: Si le BL-Touch est utilisé pour amener l'axe Z à l'origine, réglez `endstop_pin : probe:z_virtual_endstop` et supprimez `position_endstop` dans la section de configuration `[stepper_z]`, puis ajoutez une section de configuration `[safe_z_home]` pour lever l'axe z, ramener les axes xy à la position d'origine, se déplacer au centre du lit et ramener l'axe z à la position d'origine. Par exemple :
hu: Ha a BL-Touch-ot a Z tengely alaphelyzetbe állítására használjuk, akkor állítsuk be az `endstop_pin:probe:z_virtual_endstop`-ra és távolítsa el a `position_endstop` és a `[stepper_z]`-t a config szakaszban, majd adjuk hozzá a `[safe_z_home]` config szakaszt a Z tengely megemeléséhez, az X,Y tengelyek kezdőpont felvételére a tárgyasztal közepére való elmozduláshoz és a Z tengely kezdőpont felvételére. Például:
it: Se il BL-Touch verrà utilizzato per l'home dell'asse Z, impostare `endstop_pin: probe:z_virtual_endstop` e rimuovere `position_endstop` nella sezione di configurazione `[stepper_z]`, quindi aggiungere una sezione di configurazione `[safe_z_home]` per aumentare il asse z, posiziona gli assi xy, spostati al centro del letto e posizionati sull'asse z. Per esempio:

source: [safe_z_home] home_xy_position: 100, 100 # Change coordinates to the center of your print bed speed: 50 z_hop: 10 # Move up 10mm z_hop_speed: 5
hu: [safe_z_home] home_xy_position: 100, 100 # A koordinátákat a tárgyasztal közepére módosítjuk. speed: 50 z_hop: 10 # Mozgás felfelé 10mm z_hop_speed: 5
it: [safe_z_home] home_xy_position: 100, 100 # Cambiare le coordinate per il centro del tuo piatto speed: 50 z_hop: 10 # Move up 10mm z_hop_speed: 5

source: The next step is to confirm that the sensor pin is working correctly. Run `BLTOUCH_DEBUG COMMAND=pin_down`, verify that the pin moves down, run `BLTOUCH_DEBUG COMMAND=touch_mode`, run `QUERY_PROBE`, and verify that command reports "probe: open". Then while gently pushing the pin up slightly with the nail of your finger run `QUERY_PROBE` again. Verify the command reports "probe: TRIGGERED". If either query does not report the correct message then it usually indicates an incorrect wiring or configuration (though some [clones](#bl-touch-clones) may require special handling). At the completion of this test run `BLTOUCH_DEBUG COMMAND=pin_up` and verify that the pin moves up.
fr: L'étape suivante consiste à confirmer que la tige du capteur fonctionne correctement. Exécutez `BLTOUCH_DEBUG COMMAND=pin_down`, vérifiez que le pointeau se déplace vers le bas, exécutez `BLTOUCH_DEBUG COMMAND=touch_mode`, exécutez `QUERY_PROBE`, et vérifiez que la commande rapporte "probe : open". Ensuite, tout en poussant légèrement le pointeau vers le haut avec l'ongle de votre doigt, exécutez à nouveau `QUERY_PROBE`. Vérifiez que la commande rapporte "probe : TRIGGERED". Si l'une ou l'autre des requêtes ne donne pas le bon message, cela indique généralement un câblage ou une configuration incorrecte (certains [clones](#bl-touch-clones) peuvent nécessiter une manipulation spéciale). A la fin de ce test, exécutez `BLTOUCH_DEBUG COMMAND=pin_up` et vérifiez que le pointeau se déplace vers le haut.
hu: A következő lépés annak megerősítése, hogy a mérőtüske megfelelően működik. Futtassa a `BLTOUCH_DEBUG COMMAND=pin_down` parancsot, és ellenőrizze, hogy a mérőtüske lefelé mozdul-e. Majd futtassa a `BLTOUCH_DEBUG COMMAND=touch_mode` parancsot. Futtassa a `QUERY_PROBE` parancsot, és ellenőrizze, hogy az üzenet "probe: OPEN". Ezután, miközben a körmével finoman felfelé nyomja a mérőtüskét, futtassa le újra a `QUERY_PROBE` parancsot. Ellenőrizze, hogy az üzenet a "probe: TRIGGERED". Ha bármelyik lekérdezés nem a megfelelő üzenetet írja, akkor az általában hibás bekötést vagy konfigurációt jelez (bár egyes [klónok](#bl-touch-clones) speciális kezelést igényelhetnek). A teszt befejezésekor futtassuk le a `BLTOUCH_DEBUG COMMAND=pin_up` parancsot, és ellenőrizzük, hogy a mérőtüske felfelé mozdul.
it: Il passaggio successivo è confermare che il pin del sensore funzioni correttamente. Esegui `BLTOUCH_DEBUG COMMAND=pin_down`, verifica che il pin si sposti verso il basso, esegui `BLTOUCH_DEBUG COMMAND=touch_mode`, esegui `QUERY_PROBE` e verifica che il comando riporti "probe: open". Quindi, spingendo leggermente verso l'alto il perno con l'unghia del dito, eseguire nuovamente `QUERY_PROBE`. Verificare che il comando riporti "probe: TRIGGERED". Se una delle query non riporta il messaggio corretto, di solito indica un cablaggio o una configurazione errati (sebbene alcuni [clones](#bl-touch-clones) potrebbero richiedere una gestione speciale). Al completamento di questo test, eseguire `BLTOUCH_DEBUG COMMAND=pin_up` e verificare che il pin si muova verso l'alto.

source: Many BL-Touch "clone" devices work correctly with Klipper using the default configuration. However, some "clone" devices may not support the `QUERY_PROBE` command and some "clone" devices may require configuration of `pin_up_reports_not_triggered` or `pin_up_touch_mode_reports_triggered`.
fr: De nombreux "clones" BL-Touch fonctionnent correctement avec Klipper en utilisant la configuration par défaut. Cependant, certains "clones" peuvent ne pas supporter la commande `QUERY_PROBE` et certains autres "clones" peuvent nécessiter la configuration de `pin_up_reports_not_triggered` ou `pin_up_touch_mode_reports_triggered`.
hu: Sok BL-Touch "klón" működik megfelelően a Klipperrel az alapértelmezett konfigurációval. Néhány "klón" azonban nem támogatja a `QUERY_PROBE` parancsot, és néhány "klón" készülékek a `pin_up_reports_not_triggered` vagy a `pin_up_touch_mode_reports_triggered` parancsok használatát követelik meg.
it: Molti dispositivi "clone" BL-Touch funzionano correttamente con Klipper utilizzando la configurazione predefinita. Tuttavia, alcuni dispositivi "clone" potrebbero non supportare il comando `QUERY_PROBE` e alcuni dispositivi "clone" potrebbero richiedere la configurazione di `pin_up_reports_not_triggered` o `pin_up_touch_mode_reports_triggered`.
