Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Bootloaders.po
Languages: fr, hu, it, zh_hans, zh_hant

source: The above should cause OpenOCD to emit some text messages and then wait (it should not immediately return to the Unix shell prompt). If OpenOCD exits on its own or if it continues to emit text messages then double check the wiring.
fr: Ce qui précède devrait amener OpenOCD à émettre des messages texte, puis à attendre (il ne doit pas immédiatement revenir à l'invite du shell). Si OpenOCD se ferme tout seul ou s'il continue à émettre des messages texte, vérifiez à nouveau le câblage.
hu: A fentieknek hatására az OpenOCD-nek ki kell adnia néhány szöveges üzenetet, majd várnia kell (nem szabad azonnal visszatérnie az Unix shell prompthoz). Ha az OpenOCD magától kilép, vagy ha továbbra is szöveges üzeneteket ad ki, akkor ellenőrizd kétszer a kábelezést.
it: Quanto sopra dovrebbe far sì che OpenOCD emetta alcuni messaggi di testo e quindi attenda (non dovrebbe tornare immediatamente al prompt della shell Unix). Se OpenOCD termina da solo o se continua a emettere messaggi di testo, ricontrolla il cablaggio.
zh_hans: 上述操作应该使OpenOCD输出一些文本信息，然后等待（它不会立即返回到Unix shell提示符）。如果OpenOCD自己退出或继续输出文本信息，那么请仔细检查接线。
zh_hant: 上述操作應該使OpenOCD輸出一些文字資訊，然後等待（它不會立即返回到Unix shell提示符）。如果OpenOCD自己退出或繼續輸出文字資訊，那麼請仔細檢查接線。

source: Once OpenOCD is running and is stable, one can send it commands via telnet. Open another ssh session and run the following:
fr: Une fois OpenOCD en cours d'exécution et stable, on peut lui envoyer des commandes via telnet. Ouvrez une autre session SSH et exécutez ce qui suit :
hu: Ha az OpenOCD fut és stabilan működik, akkor telneten keresztül parancsokat küldhetünk neki. Nyissunk egy másik SSH munkamenetet, és futtassuk a következőket:
it: Una volta che OpenOCD è in esecuzione ed è stabile, è possibile inviargli comandi tramite telnet. Apri un'altra sessione ssh ed esegui quanto segue:
zh_hans: 一旦OpenOCD运行稳定，就可以通过telnet向它发送命令。打开另一个ssh会话，运行下面的命令：
zh_hant: 一旦OpenOCD執行穩定，就可以通過telnet向它發送命令。打開另一個ssh會話，執行下面的命令：

source: (One can exit telnet by pressing ctrl+] and then running the "quit" command.)
fr: (Vous pouvez quitter telnet en appuyant sur ctrl+] puis en exécutant la commande "quit".)
hu: (A telnet-ből a ctrl+] billentyűkombinációval, majd a "quit" parancs futtatásával lehet kilépni.)
it: (Si può uscire da telnet premendo ctrl+] e quindi eseguendo il comando "quit".)
zh_hans: (可以按ctrl+]退出telnet，然后运行 "quit "命令。)
zh_hant: (可以按ctrl+]退出telnet，然後執行 "quit "命令。)

source: OpenOCD and gdb
fr: OpenOCD et gdb
hu: OpenOCD és gdb
it: OpenOCD e gdb
zh_hans: OpenOCD和gdb
zh_hant: OpenOCD和gdb

source: It is possible to use OpenOCD with gdb to debug Klipper. The following commands assume one is running gdb on a desktop class machine.
fr: Il est possible d'utiliser OpenOCD avec gdb pour déboguer Klipper. Les commandes suivantes supposent que l'on exécute gdb sur une machine de bureau.
hu: Lehetőség van az OpenOCD és a gdb használatára a Klipper hibakeresésére. A következő parancsok feltételezik, hogy a gdb egy asztali gépen fut.
it: È possibile utilizzare OpenOCD con gdb per eseguire il debug di Klipper. I seguenti comandi presuppongono che uno stia eseguendo gdb su una macchina di classe desktop.
zh_hans: 可以使用OpenOCD和gdb来调试Klipper。下面的命令假设是在台式机上运行gdb。
zh_hant: 可以使用OpenOCD和gdb來除錯Klipper。下面的命令假設是在臺式機上執行gdb。

source: Add the following to the OpenOCD config file:
fr: Ajoutez ce qui suit au fichier de configuration OpenOCD :
hu: Add hozzá a következőket az OpenOCD konfigurációs fájljához:
it: Aggiungi quanto segue al file di configurazione di OpenOCD:
zh_hans: 在OpenOCD的配置文件中加入以下内容：
zh_hant: 在OpenOCD的配置檔案中加入以下內容：

source: Restart OpenOCD on the Raspberry Pi and then run the following Unix command on the desktop machine:
fr: Redémarrez OpenOCD sur le Raspberry Pi, puis exécutez la commande Unix suivante sur la machine de bureau :
hu: Indítsd újra az OpenOCD-t a Raspberry Pi-n, majd futtasd a következő Unix parancsot az asztali gépen:
it: Riavvia OpenOCD sul Raspberry Pi e quindi esegui il seguente comando Unix sul computer desktop:
zh_hans: 在树莓派上重新启动OpenOCD，然后在台式机上运行以下Unix命令：
zh_hant: 在樹莓派上重新啟動OpenOCD，然後在臺式機上執行以下Unix命令：

source: Within gdb run:
fr: Dans gdb, exécutez :
hu: A gdb futtatása:
it: All'interno di gdb esegui:
zh_hans: 在gdb中运行：
zh_hant: 在gdb中執行：

source: (Replace "octopi" with the host name of the Raspberry Pi.) Once gdb is running it is possible to set breakpoints and to inspect registers.
fr: (Remplacez "octopi" par le nom d'hôte du Raspberry Pi.) Une fois que gdb est en cours d'exécution, il est possible de définir des points d'arrêt et d'inspecter les registres.
hu: (Cseréld ki az "octopi" -t a Raspberry Pi gazdagép nevére.) Ha a gdb fut, lehetőség van töréspontok beállítására és a regiszterek vizsgálatára.
it: (Sostituisci "octopi" con il nome host del Raspberry Pi.) Una volta che gdb è in esecuzione, è possibile impostare punti di interruzione e ispezionare i registri.
zh_hans: (用树莓派的主机名替换 "octopi"）一旦gdb运行，就可以设置断点并检查寄存器。
zh_hant: (用樹莓派的主機名替換 "octopi"）一旦gdb執行，就可以設定斷點並檢查暫存器。

source: source [find target/at91samdXX.cfg]
hu: forrás [find target/at91samdXX.cfg]
zh_hans: 来源 [查找目标/at91samdXX.cfg]
zh_hant: 來源 [查詢目標/at91samdXX.cfg]

source: source [find target/atsame5x.cfg]
hu: forrás [find target/atsame5x.cfg]
zh_hans: 来源 [查找目标/atsame5x.cfg]
zh_hant: 來源 [查詢目標/atsame5x.cfg]

source: source [find target/stm32f1x.cfg]
hu: forrás [find target/stm32f1x.cfg]
zh_hans: 来源 [查找目标/stm32f1x.cfg]
zh_hant: 來源 [查詢目標/stm32f1x.cfg]

source: You may need to hold down the reset button on the board while launching OpenOCD. It should display something like:Open On-Chip Debugger 0.10.0+dev-01204-gc60252ac-dirty (2020-04-27-16:00) Licensed under GNU GPL v2 For bug reports, read http://openocd.org/doc/doxygen/bugs.html DEPRECATED! use 'adapter speed' not 'adapter_khz' Info : BCM2835 GPIO JTAG/SWD bitbang driver Info : JTAG and SWD modes enabled Info : clock speed 40 kHz Info : SWD DPIDR 0x1ba01477 Info : stm32f1x.cpu: hardware has 6 breakpoints, 4 watchpoints Info : stm32f1x.cpu: external reset detected Info : starting gdb server for stm32f1x.cpu on 3333 Info : Listening on port 3333 for gdb connections
fr: Vous devrez peut-être maintenir enfoncé le bouton de réinitialisation de la carte pendant le lancement d'OpenOCD. Il devrait afficher quelque chose comme : Open On-Chip Debugger 0.10.0+dev-01204-gc60252ac-dirty (2020-04-27-16:00) Licensed under GNU GPL v2 For bug reports, read http://openocd.org/doc/doxygen/bugs.html DEPRECATED! use 'adapter speed' not 'adapter_khz' Info : BCM2835 GPIO JTAG/SWD bitbang driver Info : JTAG and SWD modes enabled Info : clock speed 40 kHz Info : SWD DPIDR 0x1ba01477 Info : stm32f1x.cpu: hardware has 6 breakpoints, 4 watchpoints Info : stm32f1x.cpu: external reset detected Info : starting gdb server for stm32f1x.cpu on 3333 Info : Listening on port 3333 for gdb connections
hu: Előfordulhat, hogy az OpenOCD indítása közben nyomva kell tartanod a reset gombot az alaplapon. Valami olyasmit kell megjelenítenie, mint:Open On-Chip Debugger 0.10.0+dev-01204-gc60252ac-dirty (2020-04-27-16:00) GNU GPL v2 licensz alatt A hibajelentésekhez olvasd el http://openocd.org/doc/doxygen/bugs.html ELAVULT! használd az 'adapter speed' helyett a 'adapter_khz' Info : BCM2835 GPIO JTAG/SWD bitbang vezérlő Info : JTAG és SWD módok engedélyezve Info : órajel sebesség 40 kHz Info : SWD DPIDR 0x1ba01477 Info : stm32f1x.cpu: a hardver 6 töréspontot és 4 figyelési pontot tartalmaz. Info : stm32f1x.cpu: külső reset észlelve Info : gdb szerver indítása az stm32f1x.cpu számára a 3333-as rendszeren. Info : Figyel a 3333-as porton a gdb kapcsolatokra.

source: After which you can release the reset button.
fr: Après quoi, vous pouvez relâcher le bouton de réinitialisation.
hu: Ezt követően elengedheted a reset gombot.
it: Dopodiché puoi rilasciare il pulsante di reset.
zh_hans: 之后可以松开复位按钮。
zh_hant: 之後可以鬆開復位按鈕。

source: # Uses RPi pins: GPIO25 for SWDCLK, GPIO24 for SWDIO, GPIO18 for nRST source [find interface/raspberrypi2-native.cfg] bcm2835gpio_swd_nums 25 24 bcm2835gpio_srst_num 18 transport select swd # Use hardware reset wire for chip resets reset_config srst_only adapter_nsrst_delay 100 adapter_nsrst_assert_width 100 # Specify the chip type source [find target/atsame5x.cfg] # Set the adapter speed adapter_khz 40 # Connect to chip init targets reset halt
fr: # Utilise les pins du RPI: GPIO25 pour SWDCLK, GPIO24 pour SWDIO, GPIO18 pour nRST source [find interface/raspberrypi2-native.cfg] bcm2835gpio_swd_nums 25 24 bcm2835gpio_srst_num 18 transport select swd # Utilise le reset câblé pour la raz de la puce reset_config srst_only adapter_nsrst_delay 100 adapter_nsrst_assert_width 100 # Specification du type de puce source [find target/atsame5x.cfg] # Définir la vitesse de l'adaptateur adapter_khz 40 # Connexion à la puce init targets reset halt
hu: # RPi tűket használ: GPIO25 az SWDCLK-hoz, GPIO24 az SWDIO-hoz, GPIO18 az nRST-hez. forrás [find interface/raspberrypi2-native.cfg] bcm2835gpio_swd_nums 25 24 bcm2835gpio_srst_num 18 szállítás kiválasztása swd # Hardveres reset vezeték használata a chip reseteléséhez reset_config srst_only adapter_nsrst_delay 100 adapter_nsrst_assert_width 100 # A chip típusának megadása source [find target/atsame5x.cfg] # Add meg az adapter sebességét adapter_khz 40 # Csatlakozás a chiphez init targets reset halt

source: Bootloaders
fr: Chargeurs de démarrage
hu: Bootloaderek
it: Bootloader
zh_hans: 底层引导程序
zh_hant: 底層載入程式

source: In general, the Arduino project is a good reference for bootloaders and flashing procedures on the 8-bit Atmel Atmega micro-controllers. In particular, the "boards.txt" file: <https://github.com/arduino/Arduino/blob/1.8.5/hardware/arduino/avr/boards.txt> is a useful reference.
fr: De manière générale, le projet Arduino est une bonne référence pour les chargeurs de démarrage et les procédures de flashage sur les microcontrôleurs Atmel Atmega 8 bits. En particulier, le fichier "boards.txt" : <https://github.com/arduino/Arduino/blob/1.8.5/hardware/arduino/avr/boards.txt> est une référence utile.
hu: Általánosságban az Arduino projekt jó referencia a 8 bites Atmel Atmega mikrovezérlők bootloadereiről és a égetési eljárásokról. Különösen a "boards.txt" fájl: <https://github.com/arduino/Arduino/blob/1.8.5/hardware/arduino/avr/boards.txt> hasznos referencia.
it: In generale, il progetto Arduino è un buon riferimento per bootloader e procedure di flashing sui microcontrollori Atmel Atmega a 8 bit. In particolare, il file "boards.txt": <https://github.com/arduino/Arduino/blob/1.8.5/hardware/arduino/avr/boards.txt> è un utile riferimento.
zh_hans: 总体上来说，Arduino项目是8位Atmel Atmega微控制器的引导程序和刷写程序的好的参考。特别是" boards.txt "文件。<https://github.com/arduino/Arduino/blob/1.8.5/hardware/arduino/avr/boards.txt>是一个有用的参考。
zh_hant: 總體上來說，Arduino專案是8位Atmel Atmega微控制器的載入程式和刷寫程式的好的參考。特別是" boards.txt "檔案。<https://github.com/arduino/Arduino/blob/1.8.5/hardware/arduino/avr/boards.txt>是一個有用的參考。

source: The Teensy++ device from pjrc.com comes with a proprietary bootloader. It requires a custom flashing tool from <https://github.com/PaulStoffregen/teensy_loader_cli>. One can flash an application with it using something like:
fr: L'appareil Teensy++ de pjrc.com est livré avec un chargeur de démarrage propriétaire. Il nécessite un outil de flash personnalisé de <https://github.com/PaulStoffregen/teensy_loader_cli>. On peut flasher une application avec en utilisant quelque chose comme :
hu: A pjrc.com Teensy++ eszköze saját bootloaderrel rendelkezik. Ehhez egy egyedi égető eszközre van szükség a <https://github.com/PaulStoffregen/teensy_loader_cli> oldalról. Egy alkalmazást lehet vele égetni valami ilyesmivel:
it: Il dispositivo Teensy++ di pjrc.com viene fornito con un bootloader proprietario. Richiede uno strumento di flashing personalizzato da <https://github.com/PaulStoffregen/teensy_loader_cli>. Si può eseguire il flashing di un'applicazione usando qualcosa come:
zh_hans: 来自pjrc.com的Teensy++设备带有一个专用的引导程序。它需要一个来自<https://github.com/PaulStoffregen/teensy_loader_cli>的定制刷写工具。可以用这个工具来刷写一个应用程序，例如：
zh_hant: 來自pjrc.com的Teensy++裝置帶有一個專用的載入程式。它需要一個來自<https://github.com/PaulStoffregen/teensy_loader_cli>的定製刷寫工具。可以用這個工具來刷寫一個應用程式，例如：

source: The code at <https://github.com/shumatech/BOSSA> can be used to program the SAM3. It is recommended to use version 1.9 or later.
fr: Le code sur <https://github.com/shumatech/BOSSA> peut être utilisé pour programmer le SAM3. Il est recommandé d'utiliser la version 1.9 ou ultérieure.
hu: A <https://github.com/shumatech/BOSSA> alatti kód használható a SAM3 programozásához. Az 1.9-es vagy újabb verzió használata ajánlott.
it: Il codice in <https://github.com/shumatech/BOSSA> può essere utilizzato per programmare il SAM3. Si consiglia di utilizzare la versione 1.9 o successiva.
zh_hans: <https://github.com/shumatech/BOSSA>中的代码可以用来为SAM3编程。建议使用1.9或更高版本。
zh_hant: <https://github.com/shumatech/BOSSA>中的程式碼可以用來為SAM3程式設計。建議使用1.9或更高版本。

source: The code at <https://github.com/shumatech/BOSSA> can be used to program the SAM4. It is necessary to use version `1.8.0` or higher.
fr: Le code sur <https://github.com/shumatech/BOSSA> peut être utilisé pour programmer le SAM4. Il est nécessaire d'utiliser la version `1.8.0` ou supérieure.
hu: A <https://github.com/shumatech/BOSSA> kód használható a SAM4 programozásához. Szükséges az `1.8.0` vagy magasabb verzió használata.
it: Il codice in <https://github.com/shumatech/BOSSA> può essere utilizzato per programmare il SAM4. È necessario utilizzare la versione `1.8.0` o successiva.
zh_hans: <https://github.com/shumatech/BOSSA>中的代码可以用来为SAM4编程。需要使用`1.8.0`或更高的版本。
zh_hant: <https://github.com/shumatech/BOSSA>中的程式碼可以用來為SAM4程式設計。需要使用`1.8.0`或更高的版本。

source: Obtain a bootloader - several bootloaders are available from <https://github.com/adafruit/uf2-samdx1/releases/latest>. For example:
fr: Obtenir un Chargeur de Démarrage - De nombreux Chargeurs de démarrage sont disponibles sur <https://github.com/adafruit/uf2-samdx1/releases/latest>. Par exemple :
hu: Szerezz be egy bootloadert. Számos bootloader elérhető a <https://github.com/adafruit/uf2-samdx1/releases/latest> oldalon. Például:
it: Ottieni un bootloader: diversi bootloader sono disponibili da <https://github.com/adafruit/uf2-samdx1/releases/latest>. Per esempio:
zh_hans: 获得一个引导程序--很多引导程序可以从<https://github.com/adafruit/uf2-samdx1/releases/latest>获得。例如：
zh_hant: 獲得一個載入程式--很多載入程式可以從<https://github.com/adafruit/uf2-samdx1/releases/latest>獲得。例如：

source: The "stm32duino" project has a USB capable bootloader - see: <https://github.com/rogerclarkmelbourne/STM32duino-bootloader>
fr: Le projet "stm32duino" a un chargeur de démarrage compatible USB - voir : <https://github.com/rogerclarkmelbourne/STM32duino-bootloader>
hu: Az "stm32duino" projekt rendelkezik USB-képes bootloaderrel. Lásd: <https://github.com/rogerclarkmelbourne/STM32duino-bootloader>
it: Il progetto "stm32duino" ha un bootloader compatibile con USB - vedere: <https://github.com/rogerclarkmelbourne/STM32duino-bootloader>
zh_hans: "stm32duino "项目有一个USB功能的引导程序-参见：<https://github.com/rogerclarkmelbourne/STM32duino-bootloader>
zh_hant: "stm32duino "專案有一個USB功能的載入程式-參見：<https://github.com/rogerclarkmelbourne/STM32duino-bootloader>

source: This document does not describe the method to flash a bootloader itself - see: <http://smoothieware.org/flashing-the-bootloader> for further information on that topic.
fr: Ce document ne décrit pas la méthode pour flasher le Chargeur de démarrage lui-même - voir : <http://smoothieware.org/flashing-the-bootloader> pour plus d'informations sur ce sujet.
hu: Ez a dokumentum nem írja le a bootloader égetésének módszerét. Lásd: <http://smoothieware.org/flashing-the-bootloader> a témával kapcsolatos további információkért.
it: Questo documento non descrive il metodo per eseguire il flashing di un bootloader stesso - vedere: <http://smoothieware.org/flashing-the-bootloader> per ulteriori informazioni su questo argomento.
zh_hans: 本文件没有描述刷写引导程序本身的方法--见：<http://smoothieware.org/flashing-the-bootloader>以获得关于该主题的进一步信息。
zh_hant: 本檔案沒有描述刷寫載入程式本身的方法--見：<http://smoothieware.org/flashing-the-bootloader>以獲得關於該主題的進一步資訊。

source: It is common for Smoothieboards to come with a bootloader from: <https://github.com/triffid/LPC17xx-DFU-Bootloader>. When using this bootloader the application must be compiled with a start address of 16KiB. The easiest way to flash an application with this bootloader is to copy the application file (eg, `out/klipper.bin`) to a file named `firmware.bin` on an SD card, and then to reboot the micro-controller with that SD card.
fr: Il est courant que les Smoothieboards soient livrés avec un chargeur de démarrage de : <https://github.com/triffid/LPC17xx-DFU-Bootloader>. Lors de l'utilisation de ce chargeur de démarrage, l'application doit être compilée avec une adresse de démarrage de 16 Ko. Le moyen le plus simple de flasher une application avec ce chargeur de démarrage est de copier le fichier d'application (par exemple, `out/klipper.bin`) dans un fichier nommé `firmware.bin` sur une carte SD, et puis de redémarrer le microcontrôleur avec cette carte SD.
hu: A Smoothieboardok általában a következő bootloaderrel érkeznek: <https://github.com/triffid/LPC17xx-DFU-Bootloader>. Ha ezt a bootloadert használjuk, az alkalmazást 16KiB kezdőcímmel kell lefordítani. Az alkalmazás égetésének legegyszerűbb módja ezzel a bootloaderrel az alkalmazásfájl (pl. `out/klipper.bin`) másolása egy SD-kártyán lévő `firmware.bin` nevű fájlra, majd a mikrokontroller újraindítása ezzel az SD-kártyával.
it: È comune che per le Smoothieboard venga fornito con un bootloader da: <https://github.com/triffid/LPC17xx-DFU-Bootloader>. Quando si utilizza questo bootloader, l'applicazione deve essere compilata con un indirizzo iniziale di 16 KiB. Il modo più semplice per eseguire il flashing di un'applicazione con questo bootloader è copiare il file dell'applicazione (ad es. `out/klipper.bin`) in un file denominato `firmware.bin` su una scheda SD, quindi riavviare il microcontrollore con quella scheda SD.
zh_hans: Smoothieboards通常带有一个来自<https://github.com/triffid/LPC17xx-DFU-Bootloader>的bootloader。当使用这个引导程序时，应用程序必须以16KiB的起始地址进行编译。用这个引导程序刷写应用程序的最简单方法是将应用程序文件（例如`out/klipper.bin`）复制到SD卡上一个名为`firmware.bin`的文件，然后用该SD卡重新启动微控制器。
zh_hant: Smoothieboards通常帶有一個來自<https://github.com/triffid/LPC17xx-DFU-Bootloader>的bootloader。當使用這個載入程式時，應用程式必須以16KiB的起始地址進行編譯。用這個載入程式刷寫應用程式的最簡單方法是將應用程式檔案（例如`out/klipper.bin`）複製到SD卡上一個名為`firmware.bin`的檔案，然後用該SD卡重新啟動微控制器。

source: This section describes how one can install and launch OpenOCD. It is derived from the instructions at: <https://learn.adafruit.com/programming-microcontrollers-using-openocd-on-raspberry-pi>
fr: Cette section décrit comment installer et lancer OpenOCD. Elle dérive des instructions disponibles sur : <https://learn.adafruit.com/programming-microcontrollers-using-openocd-on-raspberry-pi>
hu: Ez a szakasz leírja, hogyan lehet telepíteni és elindítani az OpenOCD-t. A következő oldalon található utasításokból származik: <https://learn.adafruit.com/programming-microcontrollers-using-openocd-on-raspberry-pi>
it: Questa sezione descrive come installare e avviare OpenOCD. È derivato dalle istruzioni su: <https://learn.adafruit.com/programming-microcontrollers-using-openocd-on-raspberry-pi>
zh_hans: 本节描述了如何安装和启动OpenOCD。它来自于以下的说明：<https://learn.adafruit.com/programming-microcontrollers-using-openocd-on-raspberry-pi>
zh_hant: 本節描述瞭如何安裝和啟動OpenOCD。它來自於以下的說明：<https://learn.adafruit.com/programming-microcontrollers-using-openocd-on-raspberry-pi>

source: Note that if one is using a Raspberry Pi for the 3.3V serial, the stm32flash protocol uses a serial parity mode which the Raspberry Pi's "mini UART" does not support. See <https://www.raspberrypi.com/documentation/computers/configuration.html#configuring-uarts> for details on enabling the full uart on the Raspberry Pi GPIO pins.
fr: Notez que si l'on utilise un Raspberry Pi pour le port série 3.3V, le protocole stm32flash utilise un mode de parité série que le "mini UART" du Raspberry Pi ne prend pas en charge. Voir <https://www.raspberrypi.com/documentation/computers/configuration.html#configuring-uarts> pour plus de détails sur l'activation de l'uart complet sur les broches GPIO du Raspberry Pi.
hu: Vedd figyelembe, hogy ha Raspberry Pi-t használ a 3,3V-os soros kapcsolathoz, az stm32flash protokoll olyan soros paritásmódot használ, amelyet a Raspberry Pi "mini UART" nem támogat. Lásd <https://www.raspberrypi.com/documentation/computers/configuration.html#configuring-uarts> a teljes uart engedélyezéséről a Raspberry Pi GPIO tűin.
it: Si noti che se si utilizza un Raspberry Pi per la seriale da 3,3 V, il protocollo stm32flash utilizza una modalità di parità seriale che il "mini UART" di Raspberry Pi non supporta. Vedere <https://www.raspberrypi.com/documentation/computers/configuration.html#configuring-uarts> per i dettagli sull'abilitazione dell'uart completo sui pin GPIO di Raspberry Pi.
zh_hans: 注意，如果使用树莓派的3.3V串口，stm32flash协议使用的串行奇偶校验模式，树莓派的 "mini UART "并不支持。关于在树莓派的GPIO引脚上启用完整的UART的细节，见<https://www.raspberrypi.com/documentation/computers/configuration.html#configuring-uarts>。
zh_hant: 注意，如果使用樹莓派的3.3V串列埠，stm32flash協議使用的序列奇偶校驗模式，樹莓派的 "mini UART "並不支援。關於在樹莓派的GPIO引腳上啟用完整的UART的細節，見<https://www.raspberrypi.com/documentation/computers/configuration.html#configuring-uarts>。

source: The [HID bootloader](https://github.com/Serasidis/STM32_HID_Bootloader) is a compact, driverless bootloader capable of flashing over USB. Also available is a [fork with builds specific to the SKR Mini E3 1.2](https://github.com/Arksine/STM32_HID_Bootloader/releases/latest).
fr: Le [chargeur de démarrage HID](https://github.com/Serasidis/STM32_HID_Bootloader) est un chargeur de démarrage compact et sans pilote capable de flasher via USB. Un [fork avec des builds spécifiques au SKR Mini E3 1.2](https://github.com/Arksine/STM32_HID_Bootloader/releases/latest) est également disponible.
hu: A [HID bootloader](https://github.com/Serasidis/STM32_HID_Bootloader) egy kompakt, driver nélküli bootloader, amely képes USB-n keresztül égetni. Szintén elérhető egy [fork az SKR Mini E3 1.2 specifikus buildekkel](https://github.com/Arksine/STM32_HID_Bootloader/releases/latest).
it: Il [bootloader HID](https://github.com/Serasidis/STM32_HID_Bootloader) è un bootloader compatto e senza driver in grado di eseguire il flashing attraverso USB. È inoltre disponibile un [fork con build specifiche per SKR Mini E3 1.2](https://github.com/Arksine/STM32_HID_Bootloader/releases/latest).
zh_hans: [HID bootloader](https://github.com/Serasidis/STM32_HID_Bootloader)是一个紧凑的、不包含驱动的启动引导程序，能够通过USB进行刷写。此外，还有一个[针对SKR Mini E3 1.2构建的分支](https://github.com/Arksine/STM32_HID_Bootloader/releases/latest)。
zh_hant: [HID bootloader](https://github.com/Serasidis/STM32_HID_Bootloader)是一個緊湊的、不包含驅動的啟動載入程式，能夠通過USB進行刷寫。此外，還有一個[針對SKR Mini E3 1.2構建的分支](https://github.com/Arksine/STM32_HID_Bootloader/releases/latest)。

source: STM32F103/STM32F072 with MSC bootloader
fr: STM32F103/STM32F072 avec chargeur de démarrage MSC
hu: STM32F103/STM32F072 MSC bootloaderrel
it: STM32F103/STM32F072 con bootloader MSC

source: The [MSC bootloader](https://github.com/Telekatz/MSC-stm32f103-bootloader) is a driverless bootloader capable of flashing over USB.
fr: Le [chargeur de démarrage MSC](https://github.com/Telekatz/MSC-stm32f103-bootloader) est un chargeur de démarrage sans pilote capable de flasher via USB.
hu: Az [MSC bootloader](https://github.com/Telekatz/MSC-stm32f103-bootloader) egy USB-n keresztül égethető, driver nélküli bootloader.
it: Il [bootloader MSC](https://github.com/Telekatz/MSC-stm32f103-bootloader) è un bootloader senza driver in grado di eseguire il flashing su USB.
