Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Bootloaders.po
Languages: fr, hu, it, zh_hans, zh_hant

source: In contrast, the "Arduino M0" uses a 16KiB bootloader (the application must be compiled with a start address of 16KiB). To flash an application on this bootloader, reset the micro-controller and run the flash command within the first few seconds of boot - something like:
fr: En revanche, "l'Arduino M0" utilise un bootloader de 16KiB (l'application doit être compilée avec une adresse de démarrage de 16KiB). Pour flasher une application sur ce chargeur de démarrage, réinitialisez le microcontrôleur et exécutez la commande flash dans les premières secondes du démarrage - quelque chose comme :
hu: Ezzel szemben az "Arduino M0" 16KiB bootloadert használ (az alkalmazást 16KiB kezdőcímmel kell lefordítani). Egy alkalmazás égetéséhez ezen a bootloaderen, állítsd vissza a mikrokontrollert, és futtasd a flash parancsot a bootolás első néhány másodpercében. Valami ilyesmi:
it: Al contrario, "Arduino M0" utilizza un bootloader da 16 KiB (l'applicazione deve essere compilata con un indirizzo iniziale di 16 KiB). Per eseguire il flashing di un'applicazione su questo bootloader, ripristinare il microcontrollore ed eseguire il comando flash entro i primi secondi dall'avvio, qualcosa del tipo:
zh_hans: 相比之下，"Arduino M0 "使用一个 16KiB 的启动引导程序（程序必须用 16KiB 的起始地址进行编译）。使用这个启动引导程序来刷写一个程序，请重置微控制器，并在启动的头几秒钟内运行刷写命令--类似如下命令：
zh_hant: 相比之下，"Arduino M0 "使用一個 16KiB 的啟動載入程式（程式必須用 16KiB 的起始地址進行編譯）。使用這個啟動載入程式來刷寫一個程式，請重置微控制器，並在啟動的頭幾秒鐘內執行刷寫命令--類似如下命令：

source: SAMD51 micro-controllers (Adafruit Metro-M4 and similar)
fr: Micro-contrôleurs SAMD51 (Adafruit Metro-M4 et similaires)
hu: SAMD51 mikrovezérlők (Adafruit Metro-M4 és hasonló)
it: Microcontrollori SAMD51 (Adafruit Metro-M4 e simili)
zh_hans: SAMD51 微控制器(Adafruit Metro-M4及类似的开发板)
zh_hant: SAMD51 微控制器(Adafruit Metro-M4及類似的開發板)

source: Like the SAMD21, the SAMD51 bootloader is flashed via the ARM Serial Wire Debug (SWD) interface. To flash a bootloader with [OpenOCD on a Raspberry Pi](#running-openocd-on-the-raspberry-pi) use the following chip config:
fr: Comme le SAMD21, le chargeur de démarrage SAMD51 est flashé via l'interface ARM Serial Wire Debug (SWD). Pour flasher un chargeur de démarrage avec [OpenOCD sur un Raspberry Pi](#running-openocd-on-the-raspberry-pi) utilisez la configuration de puce suivante :
hu: A SAMD21-hez hasonlóan a SAMD51 bootloader is az ARM Serial Wire Debug (SWD) interfészen keresztül töltődik fel. Az [OpenOCD futtatása a Raspberry PI-n](#az-openocd-futtatasa-a-raspberry-pi-n) bootloader égetéséhez használd a következő chipkonfigurációt:
it: Come il SAMD21, il bootloader SAMD51 viene eseguito il flashing tramite l'interfaccia ARM Serial Wire Debug (SWD). Per eseguire il flashing di un bootloader con [OpenOCD su un Raspberry Pi](#running-openocd-on-the-raspberry-pi) utilizzare la seguente configurazione del chip:
zh_hans: 和 SAMD21 一样，SAMD51 的启动引导程序也是通过 ARM 串行线调试（SWD）接口刷写的。要用[运行 OpenOCD的 Raspberry Pi](#running-openocd-on-the-raspberry-pi)刷写引导程序，请使用以下芯片配置：
zh_hant: 和 SAMD21 一樣，SAMD51 的啟動載入程式也是通過 ARM 序列線除錯（SWD）介面刷寫的。要用[執行 OpenOCD的 Raspberry Pi](#running-openocd-on-the-raspberry-pi)刷寫載入程式，請使用以下晶片配置：

source: The SAMD51 uses a 16KiB bootloader (the application must be compiled with a start address of 16KiB). To flash an application use something like:
fr: Le SAMD51 utilise un chargeur de démarrage de 16 Ko (l'application doit être compilée avec une adresse de démarrage de 16 Ko). Pour flasher une application, utilisez quelque chose comme :
hu: A SAMD51 16KiB-es bootloadert használ (az alkalmazást 16KiB kezdőcímmel kell lefordítani). Egy alkalmazás égetéséhez használj valami hasonlót:
it: Il SAMD51 utilizza un bootloader da 16 KiB (l'applicazione deve essere compilata con un indirizzo iniziale di 16 KiB). Per eseguire il flashing di un'applicazione, utilizzare qualcosa come:
zh_hans: SAMD51 使用 16KiB 的启动引导程序（应用程序必须以16KiB的起始地址进行编译）。要刷写一个应用程序，请使用类似以下的方法：
zh_hant: SAMD51 使用 16KiB 的啟動載入程式（應用程式必須以16KiB的起始地址進行編譯）。要刷寫一個應用程式，請使用類似以下的方法：

source: STM32F103 micro-controllers (Blue Pill devices)
fr: Microcontrôleurs STM32F103 (dispositifs Blue Pill)
hu: STM32F103 mikrovezérlők (Blue Pill eszközök)
it: Microcontrollori STM32F103 (dispositivi Blue Pill)
zh_hans: STM32F103 微控制器（Blue Pill 开发板）
zh_hant: STM32F103 微控制器（Blue Pill 開發板）

source: After flashing, set both "boot 0" and "boot 1" back to low so that future resets boot from flash.
fr: Après avoir flashé, réglez à la fois "boot 0" et "boot 1" sur bas afin que les futures réinitialisations démarrent à partir du flash.
hu: Az égetés után állítsd vissza a "boot 0" és a "boot 1" értéket alacsonyra, hogy a jövőben az égetésről induló rendszer újrainduljon.
it: Dopo aver caricato la memoria flash, imposta "boot 0" e "boot 1" su basso in modo che in futuro ripristini l'avvio da flash.
zh_hans: 刷写后，将 "boot 0 "和 "boot 1 "都恢复设为低电平，以便在复位后从闪存启动。
zh_hant: 刷寫后，將 "boot 0 "和 "boot 1 "都恢復設為低電平，以便在復位后從快閃記憶體啟動。

source: STM32F103 with stm32duino bootloader
fr: STM32F103 avec chargeur de démarrage stm32duino
hu: STM32F103 stm32duino bootloaderrel
it: STM32F103 con bootloader stm32duino
zh_hans: 带有 stm32duino 引导加载程序的 STM32F103
zh_hant: 帶有 stm32duino 引導載入程式的 STM32F103

source: This bootloader can be flashed via 3.3V serial with something like:
fr: Ce chargeur de démarrage peut être flashé via un port série 3,3 V avec quelque chose comme :
hu: Ez a bootloader 3,3V-os soros kapcsolaton keresztül égethető valami hasonlóval:
it: Questo bootloader può essere flashato tramite seriale 3.3V con qualcosa come:
zh_hans: 这个引导程序可以通过3.3V的串口用类似以下的命令来刷写：
zh_hant: 這個載入程式可以通過3.3V的串列埠用類似以下的命令來刷寫：

source: This bootloader uses 8KiB of flash space (the application must be compiled with a start address of 8KiB). Flash an application with something like:
fr: Ce chargeur de démarrage utilise 8 Ko d'espace flash (l'application doit être compilée avec une adresse de démarrage de 8 Ko). Flashez une application avec quelque chose comme :
hu: Ez a bootloader 8KiB-es flash memóriát használ (az alkalmazást 8KiB kezdőcímmel kell lefordítani). Égess egy alkalmazást valami ilyesmivel:
it: Questo bootloader utilizza 8KiB di spazio flash (l'applicazione deve essere compilata con un indirizzo iniziale di 8KiB). Caricare in memoria flash un'applicazione con qualcosa come:
zh_hans: 这个引导程序使用 8KiB 的闪存空间（应用程序必须以 8KiB 的起始地址编译）。刷写应用程序需要使用类似以下的命令：
zh_hant: 這個載入程式使用 8KiB 的快閃記憶體空間（應用程式必須以 8KiB 的起始地址編譯）。刷寫應用程式需要使用類似以下的命令：

source: The bootloader typically runs for only a short period after boot. It may be necessary to time the above command so that it runs while the bootloader is still active (the bootloader will flash a board led while it is running). Alternatively, set the "boot 0" pin to low and "boot 1" pin to high to stay in the bootloader after a reset.
fr: Le chargeur de démarrage ne s'exécute généralement que pendant une courte période après le démarrage. Il peut être nécessaire de chronométrer la commande ci-dessus pour qu'elle s'exécute pendant que le chargeur de démarrage est toujours actif (le chargeur de démarrage fait clignoter une LED de la carte pendant son exécution). Vous pouvez également définir la broche "boot 0" sur low et la broche "boot 1" sur high pour rester en mode chargeur de démarrage après une réinitialisation.
hu: A bootloader általában csak rövid ideig fut a rendszerindítás után. Szükség lehet arra, hogy a fenti parancsot úgy időzítsük, hogy az akkor fusson le, amikor a bootloader még aktív (a bootloader üzem közben villogtat egy a lapon lévő ledet). Alternatív megoldásként a "boot 0" csapot állítsd alacsonyra, a "boot 1" csapot pedig magasra, hogy a bootloaderben maradj a reset után.
it: Il bootloader in genere viene eseguito solo per un breve periodo dopo l'avvio. Potrebbe essere necessario sincronizzare il comando sopra in modo che venga eseguito mentre il bootloader è ancora attivo (il bootloader farà lampeggiare un led della scheda mentre è in esecuzione). In alternativa, imposta il pin "boot 0" su basso e il pin "boot 1" su alto per rimanere nel bootloader dopo un ripristino.
zh_hans: 启动引导程序通常只在启动后的一小段时间运行。在输入以上命令的时候，需要确保启动引导程序还在运行（启动引导程序运行的时候会控制板上的led闪烁）。此外，启动后如果设置“boot 0”引脚为低，设置“boot 1”引脚为高则可以一直停留在启动引导程序。
zh_hant: 啟動載入程式通常只在啟動后的一小段時間執行。在輸入以上命令的時候，需要確保啟動載入程式還在執行（啟動載入程式執行的時候會控制板上的led閃爍）。此外，啟動后如果設定「boot 0」引腳為低，設定「boot 1」引腳為高則可以一直停留在啟動載入程式。

source: STM32F103 with HID bootloader
fr: STM32F103 avec chargeur de démarrage HID
hu: STM32F103 HID bootloaderrel
it: STM32F103 con bootloader HID
zh_hans: 带有 HID 引导程序的STM32F103
zh_hant: 帶有 HID 載入程式的STM32F103

source: It is not possible to use stm32flash for the SKR Mini E3 as the boot0 pin is tied directly to ground and not broken out via header pins. It is recommended to use a STLink V2 with STM32Cubeprogrammer to flash the bootloader. If you don't have access to a STLink it is also possible to use a [Raspberry Pi and OpenOCD](#running-openocd-on-the-raspberry-pi) with the following chip config:
fr: Il n'est pas possible d'utiliser stm32flash pour le SKR Mini E3 car la broche boot0 est directement liée à la terre et non connectée via des broches d'en-tête. Il est recommandé d'utiliser un STLink V2 avec le programmeur STM32Cube pour flasher le bootloader. Si vous n'avez pas accès à un STLink, il est également possible d'utiliser un [Raspberry Pi et OpenOCD](#running-openocd-on-the-raspberry-pi) avec la configuration de puce suivante :
hu: Az SKR Mini E3 esetében nem lehet stm32flash-t használni, mivel a boot0 láb közvetlenül a földre van kötve, és nincs alaplapi tűkiállása. A bootloader égetéséhez ajánlott STLink V2-t használni STM32Cube programozóval. Ha nincs vagy nem fér hozzá egy STLink-hez, akkor lehetséges egy [OpenOCD futtatása a Raspberry PI-n](#az-openocd-futtatasa-a-raspberry-pi-n) használata is a következő chip konfigurációval:
it: Non è possibile utilizzare stm32flash per SKR Mini E3 poiché il pin boot0 è collegato direttamente a terra e non disponibile tramite pin header. Si consiglia di utilizzare un STLink V2 con STM32Cubeprogrammer per eseguire il flashing del bootloader. Se non hai accesso a un STLink è anche possibile utilizzare un [Raspberry Pi e OpenOCD](#running-openocd-on-the-raspberry-pi) con la seguente configurazione del chip:
zh_hans: SKR Mini E3无法使用stm32flash ，因为boot 0引脚被直接接到GND且没有跳线断开。推荐使用STLink V2通过STM32Cubeprogrammer刷写启动引导程序。如果你没有STLink ，也可以按照以下芯片配置使用[树莓派和OpenOCD](#running-openocd-on-the-raspberry-pi) 刷写：
zh_hant: SKR Mini E3無法使用stm32flash ，因為boot 0引腳被直接接到GND且沒有跳線斷開。推薦使用STLink V2通過STM32Cubeprogrammer刷寫啟動載入程式。如果你沒有STLink ，也可以按照以下晶片配置使用[樹莓派和OpenOCD](#running-openocd-on-the-raspberry-pi) 刷寫：

source: If you wish you can make a backup of the current flash with the following command. Note that it may take some time to complete:
fr: Si vous le souhaitez, vous pouvez faire une sauvegarde du flash actuel avec la commande suivante. Notez que cela peut prendre un certain temps :
hu: Ha szeretnéd, a következő paranccsal készíthetsz biztonsági másolatot az aktuális flash memóriáról. Vedd figyelembe, hogy ez némi időt vehet igénybe:
it: Se lo desideri puoi fare un backup della flash corrente con il seguente comando. Tieni presente che il completamento potrebbe richiedere del tempo:
zh_hans: 如果你愿意，可以使用下面的命令备份当前闪存上的程序。请注意，这可能需要一些时间来完成备份：
zh_hant: 如果你願意，可以使用下面的命令備份目前快閃記憶體上的程式。請注意，這可能需要一些時間來完成備份：

source: finally, you can flash with commands similar to:
fr: vous pouvez flasher avec des commandes similaires à :
hu: végül, a következő parancsokhoz hasonló parancsokkal égethetsz:
it: infine, puoi eseguire il flashing con comandi simili a:
zh_hans: 最后，你可以用类似以下的命令刷写固件：
zh_hant: 最後，你可以用類似以下的命令刷寫韌體：

source: NOTES:
hu: MEGJEGYZÉSEK:
it: NOTE:
zh_hans: 注意：
zh_hant: 注意：

source: The example above erases the chip then programs the bootloader. Regardless of the method chosen to flash it is recommended to erase the chip prior to flashing.
fr: L'exemple ci-dessus efface la puce puis programme le bootloader. Quelle que soit la méthode choisie pour flasher, il est recommandé d'effacer la puce avant de flasher.
hu: A fenti példa törli a chipet, majd beprogramozza a bootloadert. Az égetéshez választott módszertől függetlenül ajánlott a chipet az égetés előtt törölni.
it: L'esempio sopra cancella il chip, quindi programma il bootloader. Indipendentemente dal metodo scelto per eseguire il flashing, si consiglia di cancellare il chip prima del flashing.
zh_hans: 上面的例子是先擦除芯片，然后再写入引导程序。无论选择哪种方法刷写，都建议在刷写前擦除芯片。
zh_hant: 上面的例子是先擦除晶片，然後再寫入載入程式。無論選擇哪種方法刷寫，都建議在刷寫前擦除晶片。

source: Prior flashing the SKR Mini E3 with this bootloader you should be aware that you will no longer be able to update firmware via the sdcard.
fr: Avant de flasher le SKR Mini E3 avec ce chargeur de démarrage, vous devez savoir que vous ne pourrez plus mettre à jour le firmware via la carte SD.
hu: Mielőtt az SKR Mini E3-at ezzel a bootloader-el égetnéd, tudnod kell, hogy a firmware frissítése már nem lesz lehetséges az SD-kártyán keresztül.
it: Prima di eseguire il flashing di SKR Mini E3 con questo bootloader, dovresti essere consapevole che non sarai più in grado di aggiornare il firmware tramite la sdcard.
zh_hans: 在用这个引导程序刷写SKR Mini E3之前，你需要知道之后你将不能再通过SD卡更新固件。
zh_hant: 在用這個載入程式刷寫SKR Mini E3之前，你需要知道之後你將不能再通過SD卡更新韌體。

source: This bootloader requires 2KiB of flash space (the application must be compiled with a start address of 2KiB).
fr: Ce chargeur de démarrage nécessite 2 Ko d'espace flash (l'application doit être compilée avec une adresse de démarrage de 2 Ko).
hu: Ez a bootloader 2KiB-os flash memóriát igényel (az alkalmazást 2KiB kezdőcímmel kell lefordítani).
it: Questo bootloader richiede 2KiB di spazio flash (l'applicazione deve essere compilata con un indirizzo iniziale di 2KiB).
zh_hans: 这个引导程序需要2KiB的闪存空间（应用程序必须以2KiB的起始地址进行编译）。
zh_hant: 這個載入程式需要2KiB的快閃記憶體空間（應用程式必須以2KiB的起始地址進行編譯）。

source: The hid-flash program is used to upload a binary to the bootloader. You can install this software with the following commands:
fr: Le programme hid-flash est utilisé pour télécharger un binaire sur le bootloader. Vous pouvez installer ce logiciel avec les commandes suivantes :
hu: A hid-flash program egy bináris fájl feltöltésére szolgál a bootloader-re. Ezt a szoftvert a következő parancsokkal telepítheted:
it: Il programma hid-flash viene utilizzato per caricare un file binario sul bootloader. È possibile installare questo software con i seguenti comandi:
zh_hans: hid-flash程序是用来上传二进制文件到启动引导程序的。你可以用以下命令安装这个软件：
zh_hant: hid-flash程式是用來上傳二進制檔案到啟動載入程式的。你可以用以下命令安裝這個軟體：

source: If the bootloader is running you can flash with something like:
fr: Si le chargeur de démarrage est en cours d'exécution, vous pouvez flasher avec quelque chose comme :
hu: Ha a bootloader fut, akkor égethetsz valami olyasmivel, mint:
it: Se il bootloader è in esecuzione, puoi eseguire il flash con qualcosa del tipo:
zh_hans: 如果bootloader正在运行，你可以用这个来刷写：
zh_hant: 如果bootloader正在執行，你可以用這個來刷寫：

source: alternatively, you can use `make flash` to flash klipper directly:
fr: Vous pouvez aussi utiliser `make flash` pour flasher directement klipper :
hu: alternatívaként használhatod a `make flash` parancsot a klipper közvetlen égetéséhez:
it: in alternativa, puoi usare `make flash` per flashare klipper direttamente:
zh_hans: 或者，你可以使用`make flash`来直接刷写klipper：
zh_hant: 或者，你可以使用`make flash`來直接刷寫klipper：

source: OR if klipper has been previously flashed:
fr: OU si klipper a déjà été flashé :
hu: VAGY ha a klippert korábban már égették:
it: O se klipper è stato precedentemente flashato:
zh_hans: 或者，如果klipper之前已经被写入过：
zh_hant: 或者，如果klipper之前已經被寫入過：

source: STM32F4 micro-controllers (SKR Pro 1.1)
fr: Micro-contrôleurs STM32F4 (SKR Pro 1.1)
hu: STM32F4 mikrovezérlők (SKR Pro 1.1)
it: Microcontrollori STM32F4 (SKR Pro 1.1)
zh_hans: STM32F4 微控制器 (SKR Pro 1.1)
zh_hant: STM32F4 微控制器 (SKR Pro 1.1)

source: This bootloader requires 16Kib of flash space on the STM32F4 (the application must be compiled with a start address of 16KiB).
fr: Ce chargeur de démarrage nécessite 16 Ko d'espace flash sur le STM32F4 (l'application doit être compilée avec une adresse de démarrage de 16 Ko).
hu: Ez a bootloader 16Kib-es flash memóriát igényel az STM32F4-en (az alkalmazást 16KiB kezdőcímmel kell lefordítani).
it: Questo bootloader richiede 16Kib di spazio flash sull'STM32F4 (l'applicazione deve essere compilata con un indirizzo iniziale di 16KiB).
zh_hans: 这个引导程序在STM32F4上需要16Kib的闪存空间（应用程序必须以16KiB的起始地址进行编译）。
zh_hant: 這個載入程式在STM32F4上需要16Kib的快閃記憶體空間（應用程式必須以16KiB的起始地址進行編譯）。

source: As with the STM32F1, the STM32F4 uses the hid-flash tool to upload binaries to the MCU. See the instructions above for details on how to build and use hid-flash.
fr: Comme avec le STM32F1, le STM32F4 utilise l'outil hid-flash pour télécharger des fichiers binaires sur le MCU. Voir les instructions ci-dessus pour plus de détails sur la façon de construire et d'utiliser hid-flash.
hu: Az STM32F1-hez hasonlóan az STM32F4 is a hid-flash eszközt használd a binárisok MCU-ra történő feltöltéséhez. A hid-flash elkészítésének és használatának részletei a fenti utasításokban találhatók.
it: Come con l'STM32F1, l'STM32F4 utilizza lo strumento hid-flash per caricare i file binari nell'MCU. Consulta le istruzioni sopra per i dettagli su come creare e utilizzare hid-flash.
zh_hans: 与STM32F1一样，STM32F4使用hid-flash工具来上传二进制文件到MCU。关于如何构建和使用hid-flash的细节，请参见上面的说明。
zh_hant: 與STM32F1一樣，STM32F4使用hid-flash工具來上傳二進制檔案到MCU。關於如何構建和使用hid-flash的細節，請參見上面的說明。

source: It may be necessary to manually enter the bootloader, this can be done by setting "boot 0" low, "boot 1" high and plugging in the device. After programming is complete unplug the device and set "boot 1" back to low so the application will be loaded.
fr: Il peut être nécessaire d'entrer manuellement dans le chargeur de démarrage, cela peut être fait en définissant "boot 0" au niveau bas, "boot 1" au niveau haut et en branchant l'appareil. Une fois la programmation terminée, débranchez l'appareil et re-réglez "boot 1" au niveau bas pour que l'application soit chargée.
hu: Szükség lehet a bootloader manuális belépésére, ez a "boot 0" alacsony, "boot 1" magas érték beállításával és az eszköz csatlakoztatásával történhet. A programozás befejezése után húzd ki az eszközt, és állítsd vissza a "boot 1" értéket alacsonyra, hogy az alkalmazás betöltődjön.
it: Potrebbe essere necessario inserire manualmente il bootloader, questo può essere fatto impostando "boot 0" basso, "boot 1" alto e collegando il dispositivo. Al termine della programmazione, scollegare il dispositivo e impostare "boot 1" su basso in modo che l'applicazione venga caricata.
zh_hans: 可能需要手动进入引导程序，这可以通过设置 "boot 0 "为低电平，"boot 1 "为高电平并上电来完成。编程完成后，设备断电，将 "boot 1 "重设为低电平，这样应用程序就会被加载。
zh_hant: 可能需要手動進入載入程式，這可以通過設定 "boot 0 "為低電平，"boot 1 "為高電平並上電來完成。程式設計完成後，裝置斷電，將 "boot 1 "重設為低電平，這樣應用程式就會被載入。

source: LPC176x micro-controllers (Smoothieboards)
fr: Micro-contrôleurs LPC176x (Smoothieboards)
hu: LPC176x mikrovezérlők (Smoothieboards)
it: Microcontrollori LPC176x (Smoothieboards)
zh_hans: LPC176x微控制器（Smoothieboards）
zh_hant: LPC176x微控制器（Smoothieboards）

source: Running OpenOCD on the Raspberry PI
fr: Exécuter OpenOCD sur le Raspberry PI
hu: Az OpenOCD futtatása a Raspberry PI-n
it: Eseguire OpenOCD su Raspberry PI
zh_hans: 在树莓派上运行OpenOCD
zh_hant: 在樹莓派上執行OpenOCD

source: OpenOCD is a software package that can perform low-level chip flashing and debugging. It can use the GPIO pins on a Raspberry Pi to communicate with a variety of ARM chips.
fr: OpenOCD est un logiciel qui peut effectuer un flashage et un débogage de puce de bas niveau. Il peut utiliser les broches GPIO d'un Raspberry Pi pour communiquer avec une variété de puces ARM.
hu: Az OpenOCD egy olyan szoftvercsomag, amely képes alacsony szintű égetésekre és hibakeresésre. A Raspberry Pi GPIO-tűit használhatod a különböző ARM-chipekkel való kommunikációra.
it: OpenOCD è un pacchetto software in grado di eseguire il flashing e il debug di chip di basso livello. Può utilizzare i pin GPIO su un Raspberry Pi per comunicare con una varietà di chip ARM.
zh_hans: OpenOCD是一个软件包，可以进行底层的芯片编程和调试。它可以使用树莓派上的GPIO引脚与各种ARM芯片通信。
zh_hant: OpenOCD是一個軟體包，可以進行底層的晶片程式設計和除錯。它可以使用樹莓派上的GPIO引腳與各種ARM晶片通訊。

source: Begin by downloading and compiling the software (each step may take several minutes and the "make" step may take 30+ minutes):
fr: Commencez par télécharger et compiler le logiciel (chaque étape peut prendre plusieurs minutes et l'étape "make" peut prendre plus de 30 minutes) :
hu: Kezd a szoftver letöltésével és fordításával (minden lépés több percet vehet igénybe, és a "make" lépés több mint 30 percet is igénybe vehet):
it: Inizia scaricando e compilando il software (ogni passaggio può richiedere diversi minuti e il passaggio "make" può richiedere più di 30 minuti):
zh_hans: 开始下载和编译软件（每个步骤可能需要数分钟，"make "步骤可能需要30分钟以上）：
zh_hant: 開始下載和編譯軟體（每個步驟可能需要數分鐘，"make "步驟可能需要30分鐘以上）：

source: Configure OpenOCD
fr: Configurer OpenOCD
hu: Az OpenOCD konfigurálása
it: Configurare OpenOCD
zh_hans: 配置OpenOCD
zh_hant: 配置OpenOCD

source: Create an OpenOCD config file:
fr: Créez un fichier de configuration OpenOCD :
hu: OpenOCD konfigurációs fájl létrehozása:
it: Crea un file di configurazione OpenOCD:
zh_hans: 创建一个OpenOCD配置文件：
zh_hant: 建立一個OpenOCD配置檔案：

source: Use a config similar to the following:
fr: Utilisez une configuration similaire à la suivante :
hu: Használj a következőhöz hasonló konfigurációt:
it: Utilizzare una configurazione simile alla seguente:
zh_hans: 使用类似于以下的配置：
zh_hant: 使用類似於以下的配置：

source: Wire the Raspberry Pi to the target chip
fr: Câblez le Raspberry Pi sur la puce cible
hu: A Raspberry Pi és a célchip összekötése
it: Collega il Raspberry Pi al chip di destinazione
zh_hans: 将树莓派与目标芯片相连
zh_hant: 將樹莓派與目標晶片相連

source: Poweroff both the the Raspberry Pi and the target chip before wiring! Verify the target chip uses 3.3V prior to connecting to a Raspberry Pi!
fr: Éteignez à la fois le Raspberry Pi et la puce cible avant le câblage ! Vérifiez que la puce cible utilise bien du 3,3 V avant de la connecter au Raspberry Pi !
hu: Kapcsold ki mind a Raspberry Pi-t, mind a célchipet a kábelezés előtt! Ellenőrizd, hogy a célchip 3,3V-ot használ-e a Raspberry Pi csatlakoztatása előtt!
it: Spegni sia il Raspberry Pi che il chip di destinazione prima del cablaggio! Verificare che il chip di destinazione utilizzi 3,3 V prima di connettersi a un Raspberry Pi!
zh_hans: 在接线之前，请关闭树莓派和目标芯片的电源! 在连接到树莓派之前，请确认目标芯片使用3.3V电压!
zh_hant: 在接線之前，請關閉樹莓派和目標晶片的電源! 在連線到樹莓派之前，請確認目標晶片使用3.3V電壓!

source: Connect GND, SWDCLK, SWDIO, and RST on the target chip to GND, GPIO25, GPIO24, and GPIO18 respectively on the Raspberry Pi.
fr: Connectez GND, SWDCLK, SWDIO et RST sur la puce cible à GND, GPIO25, GPIO24 et GPIO18 sur le Raspberry Pi.
hu: Csatlakoztasd a célchip GND, SWDCLK, SWDIO és RST tűit a Raspberry Pi GND, GPIO25, GPIO24 és GPIO18 tűihez.
it: Collega GND, SWDCLK, SWDIO e RST sul chip di destinazione rispettivamente a GND, GPIO25, GPIO24 e GPIO18 sul Raspberry Pi.
zh_hans: 将目标芯片上的GND、SWDCLK、SWDIO和RST分别连接到树莓派上的GND、GPIO25、GPIO24和GPIO18。
zh_hant: 將目標晶片上的GND、SWDCLK、SWDIO和RST分別連線到樹莓派上的GND、GPIO25、GPIO24和GPIO18。

source: Then power up the Raspberry Pi and provide power to the target chip.
fr: Mettez ensuite le Raspberry Pi sous tension et alimentez la puce cible.
hu: Ezután kapcsold be a Raspberry Pi-t, és adj áramot a cél chip-nek.
it: Quindi accendi il Raspberry Pi e fornisci alimentazione al chip di destinazione.
zh_hans: 然后给树莓派上电，再给目标芯片供电。
zh_hant: 然後給樹莓派上電，再給目標晶片供電。

source: Run OpenOCD
fr: Exécutez OpenOCD
hu: OpenOCD futtatása
it: Eseguire OpenOCD
zh_hans: 运行OpenOCD
zh_hant: 執行OpenOCD

source: Run OpenOCD:
fr: Exécutez OpenOCD :
hu: Futtasd az OpenOCD-t:
it: Esegui OpenOCD:
zh_hans: 运行OpenOCD：
zh_hant: 執行OpenOCD：
