Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Bootloaders.po
Languages: fr, hu, it, zh_hans, zh_hant

source: This document provides information on common bootloaders found on micro-controllers that Klipper supports.
fr: Ce document fournit des informations sur les "chargeurs de démarrage" ou "Bootloaders" courants trouvés sur les microcontrôleurs pris en charge par Klipper.
hu: Ez a dokumentum a Klipper által támogatott mikrovezérlőkön található gyakori bootloaderekkel kapcsolatos információkat tartalmazza.
it: Questo documento fornisce informazioni sui bootloader comuni scoperti sui microcontrollori che sono supportati da Klipper.
zh_hans: 本文档介绍Klipper支持的用于微控制器的底层引导程序（bootloader）。
zh_hant: 本文件介紹Klipper支援的用於微控制器的底層載入程式（bootloader）。

source: The bootloader is 3rd-party software that runs on the micro-controller when it is first powered on. It is typically used to flash a new application (eg, Klipper) to the micro-controller without requiring specialized hardware. Unfortunately, there is no industry wide standard for flashing a micro-controller, nor is there a standard bootloader that works across all micro-controllers. Worse, it is common for each bootloader to require a different set of steps to flash an application.
fr: Le chargeur de démarrage est un logiciel tiers qui s'exécute sur le microcontrôleur lors de sa première mise sous tension. Il est généralement utilisé pour flasher une nouvelle application (par exemple, Klipper) sur le microcontrôleur sans nécessiter de matériel spécialisé. Malheureusement, il n'existe pas de norme à l'échelle de l'industrie pour flasher un microcontrôleur, ni de chargeur de démarrage standard qui fonctionne sur tous les microcontrôleurs. Pire encore, il est courant que chaque chargeur de démarrage nécessite un ensemble d'étapes différent pour flasher une application.
hu: A bootloader egy harmadik féltől származó szoftver, amely a mikrovezérlőn fut, amikor az először bekapcsol. Általában egy új alkalmazás (pl. Klipper) égetésére használják a mikrokontrollerre anélkül, hogy speciális hardverre lenne szükség. Sajnos a mikrokontrollerek égetésére nincs iparági szabvány, és nincs olyan szabványos bootloader sem, amely minden mikrokontrolleren működik. Ami még rosszabb, hogy minden egyes bootloader más és más lépéseket igényel az alkalmazás égetéséhez.
it: Il bootloader è un software di terze parti che viene eseguito sul microcontrollore quando viene acceso per la prima volta. Viene generalmente utilizzato per eseguire il flashing di una nuova applicazione (ad es. Klipper) sul microcontrollore senza richiedere hardware specializzato. Sfortunatamente, non esiste uno standard a livello di settore per il flashing di un microcontrollore, né esiste un bootloader standard che funzioni su tutti i microcontrollori. Peggio ancora, è comune che ogni bootloader richieda una serie di passaggi diversa per eseguire il flashing di un'applicazione.
zh_hans: 引导程序是第三方软件，在微控制器上电后优先运行。该程序可以在不需要特殊硬件（如烧录器）下对微控制器的程序进行刷写（如写入Klipper程序）。然而，目前还没有一刷写微控制器的工业标准，也没有一个适用于所有微控制器的标准引导程序。更麻烦的是，每种引导加载程序需要不同的步骤以触发刷写功能。
zh_hant: 載入程式是第三方軟體，在微控制器上電后優先執行。該程式可以在不需要特殊硬體（如燒錄器）下對微控制器的程式進行刷寫（如寫入Klipper程式）。然而，目前還沒有一刷寫微控制器的工業標準，也沒有一個適用於所有微控制器的標準載入程式。更麻煩的是，每種引導載入程式需要不同的步驟以觸發刷寫功能。

source: If one can flash a bootloader to a micro-controller then one can generally also use that mechanism to flash an application, but care should be taken when doing this as one may inadvertently remove the bootloader. In contrast, a bootloader will generally only permit a user to flash an application. It is therefore recommended to use a bootloader to flash an application where possible.
fr: Si l'on peut flasher un chargeur de démarrage sur un microcontrôleur, on peut généralement également utiliser ce mécanisme pour flasher une application, mais il faut faire attention en faisant cela car on peut supprimer le chargeur de démarrage par inadvertance. En revanche, un chargeur de démarrage permettra généralement à un utilisateur de flasher une application. Il est donc recommandé d'utiliser le chargeur de démarrage pour flasher une application lorsque cela est possible.
hu: Ha egy mikrokontrollerre tudunk bootloadert égetni, akkor általában ezt a mechanizmust használhatjuk egy alkalmazás égetésére is, de óvatosan kell eljárni, mert véletlenül eltávolíthatjuk a bootloadert. Ezzel szemben a bootloader általában csak egy alkalmazás égetését teszi lehetővé. Ezért ajánlott, ha lehetséges, bootloadert használni egy alkalmazás égetésére.
it: Se si può eseguire il flashing di un bootloader su un microcontrollore, generalmente si può anche utilizzare quel meccanismo per eseguire il flashing di un'applicazione, ma è necessario prestare attenzione quando si esegue questa operazione poiché si potrebbe rimuovere inavvertitamente il bootloader. Al contrario, un bootloader generalmente consentirà solo a un utente di eseguire il flashing di un'applicazione. Si consiglia pertanto di utilizzare un bootloader per eseguire il flashing di un'applicazione, ove possibile.
zh_hans: 如果能用某种方式将 bootloader 刷写到微控制器，使用该方式通常也能完成程序刷写操作，但是，这种直接刷写可能会将 bootloader 覆盖掉。相对地，bootloader 只允许用户刷写应用程序区域。因此，尽可能使用 bootloader 完成程序的刷写。
zh_hant: 如果能用某種方式將 bootloader 刷寫到微控制器，使用該方式通常也能完成程式刷寫操作，但是，這種直接刷寫可能會將 bootloader 覆蓋掉。相對地，bootloader 只允許使用者刷寫應用程式區域。因此，儘可能使用 bootloader 完成程式的刷寫。

source: This document attempts to describe common bootloaders, the steps needed to flash a bootloader, and the steps needed to flash an application. This document is not an authoritative reference; it is intended as a collection of useful information that the Klipper developers have accumulated.
fr: Ce document tente de décrire les chargeurs de démarrage courants, les étapes nécessaires pour flasher un chargeur de démarrage et les étapes nécessaires pour flasher une application. Ce document n'est pas une référence faisant autorité ; il est conçu comme une collection d'informations utiles que les développeurs de Klipper ont accumulées.
hu: Ez a dokumentum megpróbálja leírni a gyakori bootloadereket, a bootloader égetéséhez szükséges lépéseket és az alkalmazás égetéséhez szükséges lépéseket. Ez a dokumentum nem tekintélyes hivatkozás. A Klipper fejlesztői által összegyűjtött hasznos információk gyűjteményének szánjuk.
it: Questo documento tenta di descrivere i bootloader comuni, i passaggi necessari per eseguire il flashing di un bootloader e i passaggi necessari per eseguire il flashing di un'applicazione. Questo documento non è un riferimento autorevole; è inteso come una raccolta di informazioni utili che gli sviluppatori di Klipper hanno accumulato.
zh_hans: 该文档将尽可能介绍常见的bootloaders，刷入bootloader所需的步骤和触发bootloader进行程序刷写的流程。该文档亦非官方指引，这只是在Klipper开发人员使用过程中收集到的有用信息。
zh_hant: 該文件將盡可能介紹常見的bootloaders，刷入bootloader所需的步驟和觸發bootloader進行程式刷寫的流程。該文件亦非官方指引，這只是在Klipper開發人員使用過程中收集到的有用資訊。

source: AVR micro-controllers
fr: Micro-contrôleurs AVR
hu: AVR mikrovezérlők
it: Microcontrollori AVR
zh_hans: AVR 微控制器
zh_hant: AVR 微控制器

source: To flash a bootloader itself, the AVR chips require an external hardware flashing tool (which communicates with the chip using SPI). This tool can be purchased (for example, do a web search for "avr isp", "arduino isp", or "usb tiny isp"). It is also possible to use another Arduino or Raspberry Pi to flash an AVR bootloader (for example, do a web search for "program an avr using raspberry pi"). The examples below are written assuming an "AVR ISP Mk2" type device is in use.
fr: Pour flasher le chargeur de démarrage, les puces AVR nécessitent un outil de flashage matériel externe (qui communique avec la puce à l'aide de SPI). Cet outil peut être acheté (par exemple, effectuez une recherche sur internet avec "avr isp", "arduino isp" ou "usb tiny isp"). Il est également possible d'utiliser un autre Arduino ou Raspberry Pi pour flasher un chargeur de démarrage AVR (par exemple, faites une recherche sur le internet pour "programmer un avr à l'aide de raspberry pi"). Les exemples ci-dessous sont écrits en supposant qu'un appareil de type "AVR ISP Mk2" est utilisé.
hu: A bootloader égetéséhez az AVR chipekhez külső hardveres égető eszközre van szükség (amely SPI segítségével kommunikál a chippel). Ez az eszköz megvásárolható (például keress rá az interneten az "avr isp", "arduino isp" vagy "usb tiny isp" szavakra). Az is lehetséges, hogy egy másik Arduino vagy Raspberry Pi segítségével égess egy AVR bootloadert (például keress rá az interneten a "program an avr using raspberry pi" kifejezésre). Az alábbi példákat egy "AVR ISP Mk2" típusú eszköz használatát feltételezve írtuk.
it: Per eseguire il flashing di un bootloader, i chip AVR richiedono uno strumento di flashing hardware esterno (che comunica con il chip tramite SPI). Questo strumento può essere acquistato (ad esempio, eseguire una ricerca sul Web per "avr isp", "arduino isp" o "usb tiny isp"). È anche possibile utilizzare un altro Arduino o Raspberry Pi per eseguire il flashing di un bootloader AVR (ad esempio, eseguire una ricerca sul Web per "programmare un avr utilizzando raspberry pi"). Gli esempi seguenti sono scritti presupponendo che sia in uso un dispositivo di tipo "AVR ISP Mk2".
zh_hans: 要刷写引导程序本身，AVR 芯片需要一个外部硬件刷写工具（它使用 SPI 与芯片进行通信）。这个工具可以购买（例如，在网上搜索 "avr isp"、"arduino isp "或 "usb tiny isp"）。也可以使用另一个Arduino或Raspberry Pi来闪存AVR引导程序（例如，在网上搜索 "用raspberry pi编程AVR"）。下面的例子是在假设使用 "AVR ISP Mk2 "类型的设备的情况下编写的。
zh_hant: 要刷寫載入程式本身，AVR 晶片需要一個外部硬體刷寫工具（它使用 SPI 與晶片進行通訊）。這個工具可以購買（例如，在網上搜索 "avr isp"、"arduino isp "或 "usb tiny isp"）。也可以使用另一個Arduino或Raspberry Pi來快閃記憶體AVR載入程式（例如，在網上搜索 "用raspberry pi程式設計AVR"）。下面的例子是在假設使用 "AVR ISP Mk2 "型別的裝置的情況下編寫的。

source: The "avrdude" program is the most common tool used to flash atmega chips (both bootloader flashing and application flashing).
fr: Le logiciel "avrdude" est l'outil le plus utilisé pour flasher les puces atmega (à la fois pour flasher le chargeur de démarrage et l'application).
hu: Az "avrdude" program a leggyakrabban használt eszköz az atmega chipek égetésére (mind a bootloader, mind az alkalmazások égetésére).
it: Il programma "avrdude" è lo strumento più comune utilizzato per eseguire il flashing dei chip atmega (sia flash del bootloader che flash dell'applicazione).
zh_hans: "avrdude "程序是最常用的工具，用于刷写atmega芯片（包括引导程序刷写和应用程序刷写）。
zh_hant: "avrdude "程式是最常用的工具，用於刷寫atmega晶片（包括載入程式刷寫和應用程式刷寫）。

source: This chip is typically found in the "Arduino Mega" and is very common in 3d printer boards.
fr: Cette puce se trouve généralement dans les "Arduino Mega" qui sont très courante parmi les cartes d'imprimante 3d.
hu: Ez a chip jellemzően az "Arduino Mega" chipben található, és nagyon gyakori a 3D nyomtató lapokban.
it: Questo chip si trova in genere nell'"Arduino Mega" ed è molto comune nelle schede per stampanti 3D.
zh_hans: 这个芯片通常出现在 "Arduino Mega" 中，在3D打印机主板中也十分普遍。
zh_hant: 這個晶片通常出現在 "Arduino Mega" 中，在3D印表機主板中也十分普遍。

source: To flash the bootloader itself use something like:
fr: Pour flasher le chargeur de démarrage lui-même, utilisez quelque chose comme :
hu: A bootloader égetéséhez használj valami olyasmit, mint:
it: Per eseguire il flashing del bootloader stesso usa qualcosa come:
zh_hans: 要刷写引导程序本身，请使用类似以下的方法：
zh_hant: 要刷寫載入程式本身，請使用類似以下的方法：

source: To flash an application use something like:
fr: Pour flasher une application, utilisez quelque chose comme :
hu: Egy alkalmazás égetéséhez használj valami olyasmit, mint:
it: Per eseguire il flashing di un'applicazione, utilizzare qualcosa come:
zh_hans: 要刷写一个应用程序使用：
zh_hant: 要刷寫一個應用程式使用：

source: This chip is typically found in earlier versions of the "Arduino Mega".
fr: Cette puce se trouve généralement dans les anciennes versions de "l'Arduino Mega".
hu: Ez a chip jellemzően az "Arduino Mega" korábbi verzióiban található.
it: Questo chip si trova in genere nelle prime versioni di "Arduino Mega".
zh_hans: 这个芯片通常出现在早期版本的 "Arduino Mega "中。
zh_hant: 這個晶片通常出現在早期版本的 "Arduino Mega "中。

source: This chip is commonly found in "Melzi" style 3d printer boards.
fr: Cette puce se trouve couramment dans les cartes d'imprimante 3d de style "Melzi".
hu: Ez a chip gyakran megtalálható a "Melzi" stílusú 3D nyomtató alaplapokban.
it: Questo chip si trova comunemente nelle schede per stampanti 3D in stile "Melzi".
zh_hans: 这种芯片通常出现在 "Melzi "式的3D打印机主板上。
zh_hant: 這種晶片通常出現在 "Melzi "式的3D印表機主板上。

source: Note that a number of "Melzi" style boards come preloaded with a bootloader that uses a baud rate of 57600. In this case, to flash an application use something like this instead:
fr: Notez qu'un certain nombre de cartes de style "Melzi" sont préinstallées avec un chargeur de démarrage qui utilise un débit de 57600 bauds. Dans ce cas, pour flasher une application, utilisez plutôt quelque chose comme ceci :
hu: Megjegyzendő, hogy számos "Melzi" stílusú alaplap előre betöltött bootloaderrel érkezik, amely 57600-as átviteli sebesség használatával működik. Ebben az esetben egy alkalmazás égetéséhez használj helyette valami ilyesmit:
it: Si noti che un certo numero di schede in stile "Melzi" sono precaricate con un bootloader che utilizza una velocità di trasmissione di 57600 baud. In questo caso, per eseguire il flashing di un'applicazione utilizzare invece qualcosa di simile:
zh_hans: 注意，一些 "Melzi "风格的板子预载了一个使用57600波特率的引导程序。在这种情况下，要刷写一个应用程序，请使用类似这样的东西来代替：
zh_hant: 注意，一些 "Melzi "風格的板子預載了一個使用57600波特率的載入程式。在這種情況下，要刷寫一個應用程式，請使用類似這樣的東西來代替：

source: This document does not cover the method to flash a bootloader to the At90usb1286 nor does it cover general application flashing to this device.
fr: Ce document ne couvre pas la méthode pour flasher un chargeur de démarrage sur l'At90usb1286 ni le flashage général des applications sur cet appareil.
hu: Ez a dokumentum nem foglalkozik az At90usb1286 bootloader égetési módszerével, és nem foglalkozik az általános alkalmazás égetésével sem.
it: Questo documento non copre il metodo per eseguire il flashing di un bootloader su At90usb1286 né copre il flashing di applicazioni generali su questo dispositivo.
zh_hans: 本文件不包括向At90usb1286刷写引导程序的方法，也不包括向该设备刷写一般应用。
zh_hant: 本檔案不包括向At90usb1286刷寫載入程式的方法，也不包括向該裝置刷寫一般應用。

source: The atmega168 has limited flash space. If using a bootloader, it is recommended to use the Optiboot bootloader. To flash that bootloader use something like:
fr: L'atmega168 a un espace flash limité. Si vous utilisez un chargeur de démarrage, il est recommandé d'utiliser le chargeur de démarrage Optiboot. Pour flasher ce chargeur de démarrage, utilisez quelque chose comme :
hu: Az atmega168 korlátozott flash-tárhellyel rendelkezik. Ha bootloader-t használ, ajánlott az Optiboot bootloader-t használni. A bootloader égetéséhez használj valami hasonlót:
it: L'atmega168 ha uno spazio flash limitato. Se si utilizza un bootloader, si consiglia di utilizzare il bootloader Optiboot. Per eseguire il flashing di quel bootloader usa qualcosa come:
zh_hans: atmega168的闪存空间有限。如果使用引导程序，建议使用Optiboot bootloader。要刷写该引导程序，请使用这个的方法：
zh_hant: atmega168的快閃記憶體空間有限。如果使用載入程式，建議使用Optiboot bootloader。要刷寫該載入程式，請使用這個的方法：

source: To flash an application via the Optiboot bootloader use something like:
fr: Pour flasher une application via le chargeur de démarrage Optiboot, utilisez quelque chose comme :
hu: Az Optiboot bootloader-el történő alkalmazás égetéséhez használj valami hasonlót:
it: Per eseguire il flashing di un'applicazione tramite il bootloader Optiboot, utilizzare qualcosa come:
zh_hans: 要通过Optiboot bootloader 刷写一个应用程序，请使用以下方法：
zh_hant: 要通過Optiboot bootloader 刷寫一個應用程式，請使用以下方法：

source: SAM3 micro-controllers (Arduino Due)
fr: Micro-contrôleurs SAM3 (Arduino Due)
hu: SAM3 mikrovezérlők (Arduino Due)
it: Microcontrollori SAM3 (Arduino Due)
zh_hans: SAM3 微控制器 (Arduino Due)
zh_hant: SAM3 微控制器 (Arduino Due)

source: It is not common to use a bootloader with the SAM3 mcu. The chip itself has a ROM that allows the flash to be programmed from 3.3V serial port or from USB.
fr: Il n'est pas courant d'utiliser un chargeur de démarrage avec le mcu SAM3. La puce elle-même possède une ROM qui permet de programmer le flash à partir du port série 3,3 V ou de l'USB.
hu: A SAM3 MCU-val nem szokás bootloadert használni. Maga a chip rendelkezik egy ROM-mal, amely lehetővé teszi a flash programozását 3,3V-os soros portról vagy USB-ről.
it: Non è comune utilizzare un bootloader con l'mcu SAM3. Il chip stesso ha una ROM che permette di programmare il flash da porta seriale 3.3V o da USB.
zh_hans: 通常在 SAM 3 微控制器上不使用引导程序。芯片自带一个允许从3.3V 串口或从USB进行编程的ROM。
zh_hant: 通常在 SAM 3 微控制器上不使用載入程式。晶片自帶一個允許從3.3V 串列埠或從USB進行程式設計的ROM。

source: To enable the ROM, the "erase" pin is held high during a reset, which erases the flash contents, and causes the ROM to run. On an Arduino Due, this sequence can be accomplished by setting a baud rate of 1200 on the "programming usb port" (the USB port closest to the power supply).
fr: Pour activer la ROM, la broche "effacement" est maintenue haute pendant une réinitialisation, ce qui efface le contenu flash et provoque l'exécution de la ROM. Sur un Arduino Due, cette séquence peut être accomplie en définissant un débit en bauds de 1200 sur le "port usb de programmation" (le port USB le plus proche de l'alimentation).
hu: A ROM engedélyezéséhez az "erase" tűt magasan kell tartani a visszaállítás során, ami törli a flash tartalmát, és a ROM-ot elindítja. Az Arduino Due-n ezt a sorrendet úgy lehet elérni, hogy 1200-as adatátviteli sebességet állítunk be a "programozási usb-porton" (a tápegységhez legközelebbi USB-porton).
it: Per abilitare la ROM, il pin "erase" viene tenuto alto durante un reset, che cancella il contenuto della flash e fa funzionare la ROM. Su un Arduino Due, questa sequenza può essere realizzata impostando un baud rate di 1200 sulla "porta usb di programmazione" (la porta USB più vicina all'alimentatore).
zh_hans: 为了启用ROM，将"erase"引脚在复位过程中保持高电平，这将擦除闪存的内容，并使ROM运行。在Arduino Due上，这个程序可以通过在 "programming usb port"（编程USB口，最靠近电源的USB端口）上设置1200的波特率来完成。
zh_hant: 爲了啟用ROM，將"erase"引腳在復位過程中保持高電平，這將擦除快閃記憶體的內容，並使ROM執行。在Arduino Due上，這個程式可以通過在 "programming usb port"（程式設計USB口，最靠近電源的USB埠）上設定1200的波特率來完成。

source: SAM4 micro-controllers (Duet Wifi)
fr: Micro-contrôleurs SAM4 (Duet Wifi)
hu: SAM4 mikrovezérlők (Duet Wifi)
it: Microcontrollori SAM4 (Duet Wifi)
zh_hans: SAM4 微控制器 (Duet Wifi)
zh_hant: SAM4 微控制器 (Duet Wifi)

source: It is not common to use a bootloader with the SAM4 mcu. The chip itself has a ROM that allows the flash to be programmed from 3.3V serial port or from USB.
fr: Il n'est pas courant d'utiliser un bootloader avec le mcu SAM4. La puce elle-même possède une ROM qui permet de programmer le flash à partir du port série 3,3 V ou de l'USB.
hu: A SAM4 MCU-val nem szokás bootloadert használni. Maga a chip rendelkezik egy ROM-mal, amely lehetővé teszi a flash programozását 3,3V-os soros portról vagy USB-ről.
it: Non è comune utilizzare un bootloader con l'mcu SAM4. Il chip stesso ha una ROM che permette di programmare la memoria flash da porta seriale 3.3V o da USB.
zh_hans: 通常在 SAM4 微控制器中不使用引导程序。芯片自带一个可以从 3.3V 串口或 USB 进行编程的ROM。
zh_hant: 通常在 SAM4 微控制器中不使用載入程式。晶片自帶一個可以從 3.3V 串列埠或 USB 進行程式設計的ROM。

source: To enable the ROM, the "erase" pin is held high during a reset, which erases the flash contents, and causes the ROM to run.
fr: Pour activer la ROM, la broche "effacement" est maintenue haute pendant une réinitialisation, ce qui efface le contenu flash et provoque l'exécution de la ROM.
hu: A ROM engedélyezéséhez az "erase" csapot magasan kell tartani a visszaállítás során, ami törli a flash tartalmát, és a ROM-ot elindítja.
it: Per abilitare la ROM, il pin "erase" viene tenuto alto durante un reset, che cancella il contenuto della memoria flash e fa funzionare la ROM.
zh_hans: 为了启用ROM，在复位过程中要将"erase"引脚保持为高电平，这将擦除闪存内容，并使ROM运行。
zh_hant: 爲了啟用ROM，在復位過程中要將"erase"引腳保持為高電平，這將擦除快閃記憶體內容，並使ROM執行。

source: SAMD21 micro-controllers (Arduino Zero)
fr: Micro-contrôleurs SAMD21 (Arduino Zero)
hu: SAMD21 mikrovezérlők (Arduino Zero)
it: Microcontrollori SAMD21 (Arduino Zero)
zh_hans: SAMD21微控制器（Arduino Zero）
zh_hant: SAMD21微控制器（Arduino Zero）

source: The SAMD21 bootloader is flashed via the ARM Serial Wire Debug (SWD) interface. This is commonly done with a dedicated SWD hardware dongle. Alternatively, one can use a [Raspberry Pi with OpenOCD](#running-openocd-on-the-raspberry-pi).
fr: Le chargeur de démarrage SAMD21 est flashé via l'interface ARM Serial Wire Debug (SWD). Cela se fait généralement avec un dongle matériel SWD dédié. Alternativement, on peut utiliser un [Raspberry Pi avec OpenOCD](#running-openocd-on-the-raspberry-pi).
hu: A SAMD21 bootloader az ARM Serial Wire Debug (SWD) interfészen keresztül töltődik fel. Ez általában egy dedikált SWD hardver dongle segítségével történik. Alternatívaként használhatunk egy [OpenOCD futtatást a Raspberry PI-n](#az-openocd-futtatasa-a-raspberry-pi-n).
it: Il bootloader SAMD21 viene caricato in memoria flashing tramite l'interfaccia ARM Serial Wire Debug (SWD). Questo viene fatto comunemente con un dongle hardware SWD dedicato. In alternativa, è possibile utilizzare un [Raspberry Pi con OpenOCD](#running-openocd-on-the-raspberry-pi).
zh_hans: SAMD21 引导加载程序通过 ARM 串行线调试 （SWD） 接口进行刷写，通常需要一个专用的 SWD 硬件转换器或者使用[安装了 OpenOCD 的 Raspberry Pi](#running-openocd-on-the-raspberry-pi)来完成。
zh_hant: SAMD21 引導載入程式通過 ARM 序列線除錯 （SWD） 介面進行刷寫，通常需要一個專用的 SWD 硬體轉換器或者使用[安裝了 OpenOCD 的 Raspberry Pi](#running-openocd-on-the-raspberry-pi)來完成。

source: To flash a bootloader with OpenOCD use the following chip config:
fr: Pour flasher un chargeur de démarrage avec OpenOCD, utilisez la configuration de puce suivante :
hu: A bootloader OpenOCD-vel történő égetéséhez használd a következő chip konfigurációt:
it: Per eseguire il flashing di un bootloader con OpenOCD, utilizzare la seguente configurazione del chip:
zh_hans: 要使用 OpenOCD 刷写引导加载程序，请使用以下芯片配置：
zh_hant: 要使用 OpenOCD 刷寫引導載入程式，請使用以下晶片配置：

source: Obtain a bootloader - for example:
fr: Procurez-vous un bootloader - par exemple :
hu: Szerezz be egy bootloadert - például:
it: Ottieni un bootloader, ad esempio:
zh_hans: 获取引导加载程序 - 例如：
zh_hant: 獲取引導載入程式 - 例如：

source: Flash with OpenOCD commands similar to:
fr: Flashez avec des commandes OpenOCD similaires à :
hu: Égetés az OpenOCD parancsokhoz hasonló parancsokkal:
it: Carica la memoria Flash con comandi OpenOCD simili a:
zh_hans: 使用类似下面的 OpenOCD 命令来刷写：
zh_hant: 使用類似下面的 OpenOCD 命令來刷寫：

source: The most common bootloader on the SAMD21 is the one found on the "Arduino Zero". It uses an 8KiB bootloader (the application must be compiled with a start address of 8KiB). One can enter this bootloader by double clicking the reset button. To flash an application use something like:
fr: Le chargeur de démarrage le plus courant sur le SAMD21 est celui que l'on trouve sur le "Arduino Zero". Il utilise un chargeur de démarrage de 8 Ko (l'application doit être compilée avec une adresse de démarrage de 8 Ko). On peut entrer dans ce chargeur de démarrage en double-cliquant sur le bouton de réinitialisation. Pour flasher une application, utilisez quelque chose comme :
hu: A SAMD21 leggyakoribb bootloadere az "Arduino Zero" -ban található. Ez egy 8KiB-es bootloadert használ (az alkalmazást 8KiB kezdőcímmel kell lefordítani). Ebbe a bootloaderbe a reset gombra való dupla kattintással lehet belépni. Egy alkalmazás égetéséhez használj valami hasonlót:
it: Il bootloader più comune sul SAMD21 è quello che si trova sull' "Arduino Zero". Utilizza un bootloader da 8KiB (l'applicazione deve essere compilata con un indirizzo iniziale di 8KiB). Si può entrare in questo bootloader facendo doppio clic sul pulsante di ripristino. Per eseguire il flashing di un'applicazione, utilizzare qualcosa come:
zh_hans: SAMD21上最常见的启动引导程序可以在 "Arduino Zero "上找到。它使用一个 8KiB 的引导程序（应用程序必须以 8KiB 的起始地址进行编译），按下复位按钮两次就可以进入。要刷写一个程序，请使用类似以下的方法：
zh_hant: SAMD21上最常見的啟動載入程式可以在 "Arduino Zero "上找到。它使用一個 8KiB 的載入程式（應用程式必須以 8KiB 的起始地址進行編譯），按下復位按鈕兩次就可以進入。要刷寫一個程式，請使用類似以下的方法：
