Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/CANBUS_protocol.po
Languages: fr, it, ko, zh_hans, zh_hant

source: Micro-controller id assignment
fr: Assignation de l'identifiant du micro-contrôleur
it: Assegnazione dell'id del microcontrollore
ko: 마이크로 컨트롤러 ID 할당
zh_hans: 微控制器 ID 分配
zh_hant: 微控制器 ID 分配

source: Klipper uses only CAN 2.0A standard size CAN bus packets, which are limited to 8 data bytes and an 11-bit CAN bus identifier. In order to support efficient communication, each micro-controller is assigned at run-time a unique 1-byte CAN bus nodeid (`canbus_nodeid`) for general Klipper command and response traffic. Klipper command messages going from host to micro-controller use the CAN bus id of `canbus_nodeid * 2 + 256`, while Klipper response messages from micro-controller to host use `canbus_nodeid * 2 + 256 + 1`.
fr: Klipper utilise uniquement les paquets CAN bus 2.0A de taille standard, limités à 8 octets de données et à un identificateur de bus CAN de 11 bits. Afin de permettre des communications efficaces, un identifiant (`canbus_nodeid`) de 1 octet est affecté à chaque microcontrôleur pour gérer les commandes et réponses Klipper. Les commandes Klipper émises du microcontrôleur vers l'hôte utilisent l'id du bus CAN `canbus_nodeid * 2 + 256`, tandis que les messages de retour du microcontrôleur vers l'hôte utilisent `canbus_nodeid' *2 + 256 + 1`.
it: Klipper utilizza solo pacchetti CAN bus di dimensioni standard CAN 2.0A, che sono limitati a 8 byte di dati e un identificatore bus CAN a 11 bit. Per supportare una comunicazione efficiente, a ogni microcontrollore viene assegnato in fase di esecuzione un ID nodo bus CAN univoco a 1 byte ("canbus_nodeid") per il traffico generale di comandi e risposte Klipper. I messaggi di comando di Klipper che vanno dall'host al microcontrollore utilizzano l'ID bus CAN di `canbus_nodeid * 2 + 256`, mentre i messaggi di risposta di Klipper dal microcontrollore all'host usano `canbus_nodeid * 2 + 256 + 1`.
ko: Klipper는 8 데이터 바이트와 11비트 CAN bus identifier로 제한되는 CAN 2.0A 표준 크기 CAN bus 패킷만 사용합니다. 효율적인 통신을 지원하기 위해 각 마이크로 컨트롤러에는 일반 Klipper 명령 및 응답 트래픽에 대해 고유한 1바이트 CAN bus 노드 ID(`canbus_nodeid`)가 런타임에 할당됩니다. 호스트에서 마이크로 컨트롤러로 가는 Klipper 명령 메시지는 `canbus_nodeid * 2 + 256`의 CAN bus ID를 사용하는 반면, 마이크로 컨트롤러에서 호스트로 가는 Klipper 응답 메시지는 `canbus_nodeid * 2 + 256 + 1`을 사용합니다.
zh_hans: Klipper使用 CAN 2.0A 标准尺寸的 CAN 总线数据包，它被限制在8个数据字节和一个11位的CAN总线标识。为了保证高效的通信，每个微控制器在运行时被分配一个唯一的 1 字节的CAN总线节点 ID（`canbus_nodeid`）用于一般的 Klipper 命令和响应通信。从主机到微控制器的 Klipper 命令信息使用`canbus_nodeid * 2 + 256` 的CAN总线 ID，而从微控制器到主机的 Klipper 响应信息使用`canbus_nodeid * 2 + 256 + 1`。
zh_hant: Klipper使用 CAN 2.0A 標準尺寸的 CAN 匯流排數據包，它被限制在8個數據位元組和一個11位的CAN匯流排標識。爲了保證高效的通訊，每個微控制器在執行時被分配一個唯一的 1 位元組的CAN匯流排節點 ID（`canbus_nodeid`）用於一般的 Klipper 命令和響應通訊。從主機到微控制器的 Klipper 命令資訊使用`canbus_nodeid * 2 + 256` 的CAN匯流排 ID，而從微控制器到主機的 Klipper 響應資訊使用`canbus_nodeid * 2 + 256 + 1`。

source: Each micro-controller has a factory assigned unique chip identifier that is used during id assignment. This identifier can exceed the length of one CAN packet, so a hash function is used to generate a unique 6-byte id (`canbus_uuid`) from the factory id.
fr: Chaque microcontrôleur possède un identifiant unique attribué en usine qui est utilisé lors de l'attribution de l'id. Cet identifiant pout dépasser la taille d'un paquet CAN, un fonction de hash est utilisée pour génerer un id unique de 6 octets (`canbus_uuid`) à partir de l'id 'usine'.
it: Ogni microcontrollore ha un identificatore di chip univoco assegnato in fabbrica che viene utilizzato durante l'assegnazione dell'ID. Questo identificatore può superare la lunghezza di un pacchetto CAN, quindi una funzione hash viene utilizzata per generare un ID univoco a 6 byte (`canbus_uuid`) dall'ID di fabbrica.
ko: 각 마이크로 컨트롤러에는 ID 할당 중에 사용되는 공장 할당 고유 칩 식별자가 있습니다. 이 식별자는 하나의 CAN 패킷 길이를 초과할 수 있으므로 해시 함수를 사용하여 공장 ID에서 고유한 6바이트 ID(`canbus_uuid`)를 생성합니다.
zh_hans: 每个微控制器出厂时都有一个用于ID分配的唯一的芯片标识符。这个标识符可以超过一个 CAN 数据包的长度，一个哈希函数会用出厂标识符生成一个唯一的 6 字节标识（`canbus_uuid`）。
zh_hant: 每個微控制器出廠時都有一個用於ID分配的唯一的晶片識別符號。這個識別符號可以超過一個 CAN 數據包的長度，一個雜湊函式會用出廠識別符號產生一個唯一的 6 位元組標識（`canbus_uuid`）。

source: Admin messages
fr: Messages 'Admin'
it: Messaggi dell'amministratore
ko: 관리자 메시지
zh_hans: 管理消息
zh_hant: 管理訊息

source: Admin messages are used for id assignment. Admin messages sent from host to micro-controller use the CAN bus id `0x3f0` and messages sent from micro-controller to host use the CAN bus id `0x3f1`. All micro-controllers listen to messages on id `0x3f0`; that id can be thought of as a "broadcast address".
fr: Les messages 'administratifs' sont utilisés pour l'attribution des id. Ces messages envoyés de l'hôte vers le microcontrôleur utilisent l'id `0x3f0̀` et les messages envoyés du microcontrôleur vers l'hôte utilisent l'id `0x3f1`. Tous les microcontrôleurs écoutent les messages en provenance de `0x3f0`. Cet id peut être considéré comme une adresse de multidiffusion.
it: I messaggi dell'amministratore vengono utilizzati per l'assegnazione dell'ID. I messaggi di amministrazione inviati dall'host al microcontrollore utilizzano l'ID bus CAN "0x3f0" e i messaggi inviati dal microcontrollore all'host utilizzano l'ID bus CAN "0x3f1". Tutti i microcontrollori ascoltano i messaggi sull'id `0x3f0`; quell'ID può essere considerato un "indirizzo di trasmissione".
ko: 관리자 메시지는 ID 할당에 사용됩니다. 호스트에서 마이크로 컨트롤러로 전송된 관리자 메시지는 CAN bus ID `0x3f0`을 사용하고 마이크로 컨트롤러에서 호스트로 전송되는 메시지는 CAN bus ID`0x3f1`을 사용합니다. 모든 마이크로 컨트롤러는 id `0x3f0`의 메시지를 수신합니다. 이 id는 "브로드캐스트 주소"로 생각할 수 있습니다.
zh_hans: 管理信息用于 ID 分配。从主机发送到微控制器的管理消息使用CAN总线的 ID `0x3f0`，而从微控制器发送到主机的消息使用CAN总线的 ID `0x3f1`。所有的微控制器都听从ID `0x3f0`上的消息；这个 ID 可以被认为是一个"广播地址"。
zh_hant: 管理資訊用於 ID 分配。從主機發送到微控制器的管理訊息使用CAN匯流排的 ID `0x3f0`，而從微控制器發送到主機的訊息使用CAN匯流排的 ID `0x3f1`。所有的微控制器都聽從ID `0x3f0`上的訊息；這個 ID 可以被認為是一個"廣播地址"。

source: CMD_QUERY_UNASSIGNED message
fr: Message CMD_QUERY_UNASSIGNED
it: messaggio CMD_QUERY_UNASSIGNED
ko: CMD_QUERY_UNASSIGNED 메시지
zh_hans: CMD_QUERY_UNASSIGNED 消息
zh_hant: CMD_QUERY_UNASSIGNED 訊息

source: This command queries all micro-controllers that have not yet been assigned a `canbus_nodeid`. Unassigned micro-controllers will respond with a RESP_NEED_NODEID response message.
fr: Cette commande interroge tous les microcontrôleurs pour lesquels aucun `canbus_nodeid`n'a été assigné. Ces microcontrôleurs non assignés, retournent un message RESP_NEED_NODEID.
it: Questo comando interroga tutti i microcontrollori a cui non è stato ancora assegnato un `canbus_nodeid`. I microcontrollori non assegnati risponderanno con un messaggio di risposta RESP_NEED_NODEID.
ko: 이 명령은 아직 `canbus_nodeid`가 할당되지 않은 모든 마이크로 컨트롤러를 나타냅니다. 할당되지 않은 마이크로 컨트롤러는 RESP_NEED_NODEID 응답 메시지로 응답합니다.
zh_hans: 该命令查询所有尚未被分配 `canbus_nodeid` 的微控制器。未分配的微控制器将以 RESP_NEED_NODEID 响应消息进行回应。
zh_hant: 該命令查詢所有尚未被分配 `canbus_nodeid` 的微控制器。未分配的微控制器將以 RESP_NEED_NODEID 響應訊息進行迴應。

source: The CMD_QUERY_UNASSIGNED message format is: `<1-byte message_id = 0x00>`
fr: Le format du message CMD_QUERY_UNASSIGNED est : `<1-octet message_id = 0x00>`
it: Il formato del messaggio CMD_QUERY_UNASSIGNED è: `<1 byte message_id = 0x00>`
ko: CMD_QUERY_UNASSIGNED 메시지 형식은 다음과 같습니다: `<1-byte message_id = 0x00>`
zh_hans: CMD_QUERY_UNASSIGNED 消息格式是：`<1-byte message_id = 0x00>`
zh_hant: CMD_QUERY_UNASSIGNED 訊息格式是：`<1-byte message_id = 0x00>`

source: This command assigns a `canbus_nodeid` to the micro-controller with a given `canbus_uuid`.
fr: Cette commande attribue un `canbus_nodeid` à partir du `canbus_uuid` du microcontrôleur.
it: Questo comando assegna un `canbus_nodeid` al microcontrollore con un dato `canbus_uuid`.
ko: 이 명령은`canbus_uuid`가 지정된 마이크로 컨트롤러에 `canbus_nodeid`를 할당합니다.
zh_hans: 这个命令根据微处理器给定的 `canbus_uuid` 给相应的微处理器分配一个 `canbus_nodeid`。
zh_hant: 這個命令根據微處理器給定的 `canbus_uuid` 給相應的微處理器分配一個 `canbus_nodeid`。

source: RESP_NEED_NODEID message
fr: Message RESP_NEED_NODEID
it: Messaggio RESP_NEED_NODEID
ko: RESP_NEED_NODEID 메시지
zh_hans: RESP_NEED_NODEID 消息
zh_hant: RESP_NEED_NODEID 訊息

source: Data Packets
fr: Paquets de données
it: Pacchetti dati
ko: 데이터 패킷
zh_hans: 数据包
zh_hant: 數據包

source: The packet data in messages using the node's receive CAN bus id (`canbus_nodeid * 2 + 256`) are simply appended to a buffer, and when a complete [mcu protocol message](Protocol.md) is found its contents are parsed and processed. The data is treated as a byte stream - there is no requirement for the start of a Klipper message block to align with the start of a CAN bus packet.
fr: Les données des paquets des messages utilisant l'identifiant de réception du bus CAN du nœud (`canbus_nodeid * 2 + 256`)' sont simplement ajoutés à la fin du tampon et lorsque un [mcu protocol message](Protocol.md) complet est trouvé son contenu est analysé et traité. Les données sont traitées comme un flux d'octets - il n'est pas nécessaire que le début d'un bloc de message Klipper soit aligné avec le début d'un paquet CAN bus.
it: I dati del pacchetto nei messaggi che utilizzano l'ID bus CAN di ricezione del nodo (`canbus_nodeid * 2 + 256`) vengono semplicemente aggiunti a un buffer e quando viene trovato un [mcu protocol message](Protocol.md) completo, il suo contenuto viene analizzato ed elaborato . I dati vengono trattati come un flusso di byte: non è necessario che l'inizio di un blocco di messaggi Klipper sia allineato con l'inizio di un pacchetto bus CAN.
ko: 노드의 수신 CAN bus ID(`canbus_nodeid * 2 + 256`)를 사용하는 메시지의 패킷 데이터는 단순히 버퍼에 추가되고 완전한 [mcu protocol message](Protocol.md) 가 발견되면 해당 내용을 구문 분석하고 처리합니다. 데이터는 바이트 스트림으로 처리됩니다 - CAN bus 패킷의 시작과 정렬하기 위해 Klipper 메시지 블록의 시작에 대한 요구 사항은 없습니다.
zh_hans: 带有节点接收 CAN 总线ID（`canbus_nodeid * 2 + 256`）的消息中的数据包被简单地添加到一个缓冲区，当一个完整的[mcu 协议消息](Protocol.md)被找到时，其内容会被解析和处理。数据被视为一个字节流-- Klipper 消息块的开始位置与CAN总线数据包的开始位置不需要对齐。
zh_hant: 帶有節點接收 CAN 匯流排ID（`canbus_nodeid * 2 + 256`）的訊息中的數據包被簡單地新增到一個緩衝區，當一個完整的[mcu 協議訊息](Protocol.md)被找到時，其內容會被解析和處理。數據被視為一個位元組流-- Klipper 訊息塊的開始位置與CAN匯流排數據包的開始位置不需要對齊。

source: Similarly, mcu protocol message responses are sent from micro-controller to host by copying the message data into one or more packets with the node's transmit CAN bus id (`canbus_nodeid * 2 + 256 + 1`).
fr: De la même manière, les réponses sont renvoyées du micrcontrôleur à l'hôte en copiant les données du message dans un ou plusieurs paquets avec l'identifiant canbus (`canbus_nodeid * 2 + 256 + 1`).
it: Allo stesso modo, le risposte ai messaggi del protocollo mcu vengono inviate dal microcontrollore all'host copiando i dati del messaggio in uno o più pacchetti con l'ID del bus CAN di trasmissione del nodo (`canbus_nodeid * 2 + 256 + 1`).
ko: 유사하게, mcu 프로토콜 메시지 응답은 노드의 전송 CAN bus ID(`canbus_nodeid * 2 + 256 + 1`)와 함께 메시지 데이터를 하나 이상의 패킷으로 복사하여 마이크로 컨트롤러에서 호스트로 전송됩니다.
zh_hans: 类似地，mcu 协议消息响应通过将消息数据插入到具有节点发送 CAN 总线 ID 的一个或多个数据包（`canbus_nodeid * 2 + 256 + 1`）并从微控制器发送到主机。
zh_hant: 類似地，mcu 協議訊息響應通過將訊息數據插入到具有節點發送 CAN 匯流排 ID 的一個或多個數據包（`canbus_nodeid * 2 + 256 + 1`）並從微控制器發送到主機。

source: CANBUS protocol
fr: Protocole CANBUS
it: Protocollo CANBUS
ko: CANBUS 프로토콜
zh_hans: CANBUS 协议
zh_hant: CANBUS 協議

source: This document describes the protocol Klipper uses to communicate over [CAN bus](https://en.wikipedia.org/wiki/CAN_bus). See <CANBUS.md> for information on configuring Klipper with CAN bus.
fr: Ce document décrit le protocole qu'utilise Klipper pour communiquer sur la couche [CAN bus](https://en.wikipedia.org/wiki/CAN_bus). Voir <CANBUS.md> pour plus d'informations sur la configuration de canbus avec Klipper.
it: Questo documento descrive il protocollo utilizzato da Klipper per comunicare su [CAN bus](https://en.wikipedia.org/wiki/CAN_bus). Vedere <CANBUS.md> per informazioni sulla configurazione di Klipper con CANBUS.
zh_hans: 本文档描述了 Klipper 通过[CAN总线](https://en.wikipedia.org/wiki/CAN_bus)进行通信的协议。参见<CANBUS.md>了解如何在 Klipper 中配置 CAN 总线。
zh_hant: 本文件描述了 Klipper 通過[CAN匯流排](https://en.wikipedia.org/wiki/CAN_bus)進行通訊的協議。參見<CANBUS.md>瞭解如何在 Klipper 中配置 CAN 匯流排。

source: CMD_SET_KLIPPER_NODEID message
fr: Message CMD_SET_KLIPPER_NODEID
it: CMD_SET_KLIPPER_NODEID messaggio

source: The CMD_SET_KLIPPER_NODEID message format is: `<1-byte message_id = 0x01><6-byte canbus_uuid><1-byte canbus_nodeid>`
fr: Le format du message CMD_SET_KLIPPER_NODEID est : `<1 octet pour le message_id = 0x01><6 octets pour le canbus_uuid><1 octet pour le canbus_nodeid>`
it: Il formato del messaggio CMD_SET_KLIPPER_NODEID è: `<1-byte message_id = 0x01><6-byte canbus_uuid><1-byte canbus_nodeid>`

source: The RESP_NEED_NODEID message format is: `<1-byte message_id = 0x20><6-byte canbus_uuid><1-byte set_klipper_nodeid = 0x01>`
fr: Le format du message RESP_NODE_NODEID est : `<1 octet pour le message_id = 0x20><6 octets pour le canbus_uuid><1 octet pour le set_klipper_nodeid=0x01>`
it: Il formato del messaggio RESP_NEED_NODEID è: `<1-byte message_id = 0x20><6-byte canbus_uuid><1-byte set_klipper_nodeid = 0x01>`

source: A micro-controller that has been assigned a nodeid via the CMD_SET_KLIPPER_NODEID command can send and receive data packets.
fr: Un microcontôleur ayant reçu un nodeid par la commande CMD_SET_KLIPPER_NODEID peut envoyer et recevoir des paquets de données.
it: Un microcontrollore a cui è stato assegnato un nodeid tramite il comando CMD_SET_KLIPPER_NODEID può inviare e ricevere pacchetti di dati.

source: CMD_SET_NODEID message
ko: CMD_SET_NODEID 메시지
zh_hans: CMD_SET_NODEID 消息
zh_hant: CMD_SET_NODEID 訊息

source: The CMD_SET_NODEID message format is: `<1-byte message_id = 0x01><6-byte canbus_uuid><1-byte canbus_nodeid>`
ko: CMD_SET_NODEID 메시지 형식은 다음과 같습니다: `<1-byte message_id = 0x01><6-byte canbus_uuid><1-byte canbus_nodeid>`
zh_hans: CMD_SET_NODEID消息格式是：`<1字节message_id = 0x01><6字节canbus_uuid><1字节canbus_nodeid>`
zh_hant: CMD_SET_NODEID訊息格式是：`<1位元組message_id = 0x01><6位元組canbus_uuid><1位元組canbus_nodeid>`

source: The RESP_NEED_NODEID message format is: `<1-byte message_id = 0x20><6-byte canbus_uuid>`
ko: RESP_NEED_NODEID 메시지 형식은 다음과 같습니다: `<1-byte message_id = 0x20><6-byte canbus_uuid>`
zh_hans: RESP_NEED_NODEID消息格式为：`<1字节message_id = 0x20><6字节canbus_uuid>`
zh_hant: RESP_NEED_NODEID訊息格式為：`<1位元組message_id = 0x20><6位元組canbus_uuid>`

source: A micro-controller that has been assigned a nodeid via the CMD_SET_NODEID command can send and receive data packets.
ko: CMD_SET_NODEID 명령을 통해 nodeid가 할당된 마이크로 컨트롤러는 데이터 패킷을 보내고 받을 수 있습니다.
zh_hans: 通过 CMD_SET_NODEID 命令分配了节点 ID 的微控制器可以发送和接收数据包。
zh_hant: 通過 CMD_SET_NODEID 命令分配了節點 ID 的微控制器可以發送和接收數據包。
