Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/CANBUS.po
Languages: fr, hu, ko

source: This document describes Klipper's CAN bus support.
fr: Ce document décrit la prise en charge du CAN bus de Klipper.
hu: Ez a dokumentum a Klipper CAN busz támogatását írja le.
ko: 이 문서는 Klipper의 CAN bus 지원에 대해 설명합니다.

source: Device Hardware
fr: Matériel de l'appareil
hu: Eszköz Hardver
ko: 장치 하드웨어

source: Host Hardware
fr: Matériel de l'hôte
hu: Gazdagép Hardver

source: It is also necessary to configure the host operating system to use the adapter. This is typically done by creating a new file named `/etc/network/interfaces.d/can0` with the following contents:
fr: Il faut aussi configurer le système d'exploitation hôte pour utiliser l'adaptateur. Cela se fait généralement en créant un nouveau fichier nommé `/etc/network/interfaces.d/can0` avec le contenu suivant :
hu: Az adapter használatához a gazdagép operációs rendszert is konfigurálni kell. Ez általában úgy történik, hogy létrehozunk egy új `/etc/network/interfaces.d/can0` nevű fájlt a következő tartalommal:
ko: 또한 어댑터를 사용하도록 호스트 운영 체제를 구성해야 합니다. 이것은 일반적으로 다음과 같이 /etc/network/interfaces.d/can0이라는 새 파일을 생성하여 수행됩니다:

source: Terminating Resistors
fr: Résistances de terminaison
hu: Az ellenállások megszüntetése
ko: 종단 저항

source: A CAN bus should have two 120 ohm resistors between the CANH and CANL wires. Ideally, one resistor located at each the end of the bus.
fr: Un bus CAN doit avoir deux résistances de 120 ohms entre les fils CANH et CANL. Idéalement, une résistance située à chaque extrémité du bus.
hu: A CAN-buszon két 120 ohmos ellenállásnak kell lennie a CANH és CANL vezetékek között. Ideális esetben egy-egy ellenállás a busz mindkét végén található.
ko: CAN bus 에는 CANH와 CANL 와이어 사이에 2개의 120옴 저항이 있어야 합니다. 이상적으로는 각 끝에 하나의 저항이 있습니다.

source: To test that the resistors are correct, one can remove power to the printer and use a multi-meter to check the resistance between the CANH and CANL wires - it should report ~60 ohms on a correctly wired CAN bus.
fr: Pour tester que les résistances sont correctes, on peut couper l'alimentation de l'imprimante et utiliser un multimètre pour vérifier la résistance entre les fils CANH et CANL - la résistance doit être d'environ 60 ohms sur un bus CAN correctement câblé.
hu: Az ellenállások értékének teszteléséhez a nyomtatót áramtalaníthatja, és egy multi-méterrel ellenőrizheti a CANH és CANL vezetékek közötti ellenállást. Egy helyesen bekötött CAN-buszon ~60 ohmot kell mérnie.
ko: 저항이 올바른지 테스트하기 위해 프린터의 전원을 끄고 멀티미터를 사용하여 CANH와 CANL 와이어 사이의 저항을 확인할 수 있습니다. 올바르게 배선된 CAN bus에서 ~60옴이 나와야 합니다.

source: Finding the canbus_uuid for new micro-controllers
fr: Trouver le canbus_uuid pour les nouveaux microcontrôleurs
hu: A canbus_uuid keresése új mikrovezérlőkhöz
ko: 새로운 마이크로 컨트롤러를 위한 canbus_uuid 찾기

source: Each micro-controller on the CAN bus is assigned a unique id based on the factory chip identifier encoded into each micro-controller. To find each micro-controller device id, make sure the hardware is powered and wired correctly, and then run:
fr: Chaque microcontrôleur sur le bus CAN se voit attribuer un identifiant unique basé sur un identifiant de puce codé en usine dans chaque microcontrôleur. Pour trouver les identifiant canbus des microcontrôleurs, assurez-vous que le matériel est correctement alimenté et câblé, puis exécutez :
hu: A CAN-buszon lévő minden mikrovezérlőhöz egyedi azonosítót rendelnek a gyári chipazonosító alapján, amely minden mikrovezérlőbe kódolva van. Az egyes mikrokontrollerek eszközazonosítójának megtalálásához győződjön meg arról, hogy a hardver megfelelően van bekapcsolva és bekötve, majd futtassa le:
ko: CAN bus의 각 마이크로 컨트롤러에는 각 마이크로 컨트롤러에 인코딩된 공장 칩 식별자를 기반으로 고유한 ID가 할당됩니다. 각 마이크로 컨트롤러 장치 ID를 찾으려면 하드웨어에 전원이 공급되고 올바르게 연결되었는지 확인한 후 다음을 실행합니다:

source: If uninitialized CAN devices are detected the above command will report lines like the following:
fr: Si des périphériques CAN non initialisés sont détectés, la commande ci-dessus remontera des lignes comme celles-ci :
hu: Ha nem inicializált CAN-eszközöket észlel, a fenti parancs a következő sorokat fogja jelenteni:
ko: 초기화되지 않은 CAN 장치가 감지되면 위의 명령 후 다음과 같은 행을 보여줍니다 :

source: Each device will have a unique identifier. In the above example, `11aa22bb33cc` is the micro-controller's "canbus_uuid".
fr: Chaque appareil aura un identifiant unique. Dans l'exemple ci-dessus, `11aa22bb33cc` est le "canbus_uuid" du microcontrôleur.
hu: Minden eszköz egyedi azonosítóval rendelkezik. A fenti példában `11aa22bb33cc` a mikrokontroller "canbus_uuid" azonosítója.
ko: 각 장치에는 고유한 식별자가 있습니다. 위의 예에서는 `11aa22bb33cc`가 마이크로 컨트롤러의 "canbus_uuid"입니다.

source: Note that the `canbus_query.py` tool will only report uninitialized devices - if Klipper (or a similar tool) configures the device then it will no longer appear in the list.
fr: Notez que l'outil `canbus_query.py` ne signalera que les appareils non initialisés - si Klipper (ou un outil similaire) configure l'appareil, il n'apparaîtra plus dans la liste.
hu: Vegye figyelembe, hogy a `canbus_query.py` eszköz csak az inicializálatlan eszközöket jelzi. Ha a Klipper (vagy egy hasonló eszköz) konfigurálja az eszközt, akkor az már nem jelenik meg a listában.
ko: `canbus_query.py `도구는 초기화되지 않은 장치만 보고합니다. 만약 Klipper(또는 유사한 도구)가 장치를 구성하면 더 이상 목록에 나타나지 않습니다.

source: Configuring Klipper
fr: Configuration de Klipper
hu: A Klipper beállítása
ko: Klipper 설정

source: Update the Klipper [mcu configuration](Config_Reference.md#mcu) to use the CAN bus to communicate with the device - for example:
fr: Mettez à jour la configuration de Klipper [configuration mcu](Config_Reference.md#mcu) afin d'utiliser le bus CAN pour communiquer avec l'appareil - par exemple :
hu: Frissítse a Klipper [mcu konfigurációt](Config_Reference.md#mcu), hogy a CAN-buszon keresztül kommunikáljon az eszközzel - például:
ko: 장치와 통신하기 위해 CAN bus를 사용하도록 Klipper [mcu configuration](Config_Reference.md#mcu) 을 업데이트합니다. 예를 들면 다음과 같습니다:

source: CANBUS
fr: BUS CAN

source: To compile for CAN, run `make menuconfig` and select "CAN bus" as the communication interface. Finally, compile the micro-controller code and flash it to the target board.
fr: Pour compiler le firmware de votre matériel canbus, exécutez `make menuconfig` et sélectionnez « CAN bus » comme interface de communication. Enfin, compilez le code du microcontrôleur et flashez-le sur la carte cible.
hu: A CAN-hez való fordításhoz futtassa a `make menuconfig` parancsot, és válassza a "CAN busz" kommunikációs interfészt. Végül fordítsa le a mikrokontroller kódját, és égesse a céllapra.

source: USB to CAN bus bridge mode
fr: Mode pont USB vers bus CAN
hu: USB és CAN-busz közötti híd üzemmód

source: Some important notes when using this mode:
fr: Quelques remarques importantes lors de l'utilisation de ce mode :
hu: Néhány fontos megjegyzés ennek az üzemmódnak a használatához:

source: It is necessary to configure the `can0` (or similar) interface in Linux in order to communicate with the bus. However, Linux CAN bus speed and CAN bus bit-timing options are ignored by Klipper. Currently, the CAN bus frequency is specified during "make menuconfig" and the bus speed specified in Linux is ignored.
fr: Il est nécessaire de configurer l'interface `can0` (ou similaire) sous Linux afin de communiquer avec le bus. Cependant, la vitesse du bus CAN Linux et les options de synchronisation des bits du bus CAN sont ignorées par Klipper. Actuellement, la fréquence du bus CAN est spécifiée lors de "make menuconfig" et la vitesse du bus spécifiée dans Linux est ignorée.
hu: A busszal való kommunikációhoz szükséges a `can0` (vagy hasonló) interfész konfigurálása Linuxban. A Linux CAN-busz sebességét és a CAN-busz bit-időzítési beállításait azonban a Klipper figyelmen kívül hagyja. Jelenleg a CAN-busz frekvenciáját a "make menuconfig" futtatása során kell megadni, és a Linuxban megadott buszsebességet figyelmen kívül hagyjuk.

source: Klipper currently supports CAN on stm32, SAME5x, and rp2040 chips. In addition, the micro-controller chip must be on a board that has a CAN transceiver.
fr: Klipper supporte actuellement CAN sur les puces stm32, SAME5x et rp2040. Le microcontrôleur doit être sur une carte qui possède aussi un transpondeur CAN.

source: In order to use a CAN bus, it is necessary to have a host adapter. It is recommended to use a "USB to CAN adapter". There are many different USB to CAN adapters available from different manufacturers. When choosing one, we recommend verifying that the firmware can be updated on it. (Unfortunately, we've found some USB adapters run defective firmware and are locked down, so verify before purchasing.) Look for adapters that can run Klipper directly (in its "USB to CAN bridge mode") or that run the [candlelight firmware](https://github.com/candle-usb/candleLight_fw).
fr: Pour utiliser un bus CAN, il est nécessaire d'avoir un adaptateur hôte. Il est recommandé d'utiliser un adaptateur "USB to CAN". Il existe de nombreux adaptateurs USB différents pour CAN disponibles auprès de différents fabricants. Lors de votre choix, nous vous recommandons de vérifier que le micrologiciel peut être mis à jour. (Malheureusement, nous avons trouvé quelques adaptateurs USB avec un micrologiciel défectueux et non modifiable, donc vérifiez avant l'achat.) Recherchez des adaptateurs qui peuvent exécuter Klipper directement (dans son mode "USB to CAN bridge") ou qui exécutent [candlelight firmware](https://github.com/candle-usb/candleLight_fw).

source: Note that some devices have a builtin 120 ohm resistor that can not be easily removed. Some devices do not include a resistor at all. Other devices have a mechanism to select the resistor (typically by connecting a "pin jumper"). Be sure to check the schematics of all devices on the CAN bus to verify that there are two and only two 120 Ohm resistors on the bus.
fr: Certains appareils ont une résistance intégrée de 120 ohm qui ne peut pas être facilement supprimée, d'autres n'ont pas de résistance et d'autres ont un mécanisme pour sélectionner la résistance (généralement en connectant un "cavalier"). Assurez-vous de vérifier les schémas de tous les appareils du bus CAN pour vérifier qu'il y a deux et seulement deux résistances de 120 Ohm sur le bus .

source: Some micro-controllers support selecting "USB to CAN bus bridge" mode during Klipper's "make menuconfig". This mode may allow one to use a micro-controller as both a "USB to CAN bus adapter" and as a Klipper node.
fr: Certains microcontrôleurs prennent en charge la sélection du mode "USB to CAN bus bridge" pendant la phase "make menuconfig" de Klipper". Ce mode peut permettre d'utiliser un microcontrôleur à la fois comme un adaptateur de bus USB vers CAN et comme nœud Klipper (mcu).

source: When Klipper uses this mode the micro-controller appears as a "USB CAN bus adapter" under Linux. The "Klipper bridge mcu" itself will appear as if it was on this CAN bus - it can be identified via `canbus_query.py` and it must be configured like other CAN bus Klipper nodes.
fr: Lorsque Klipper utilise ce mode, le microcontrôleur apparaît comme un "USB CAN bus adapter" sous Linux. Le mcu "Klipper apparaîtra comme s'il était sur le bus CAN - il peut être identifié via `canbus_query.py` et il doit être configuré comme les autres noeuds Klipper de bus CAN.

source: Whenever the "bridge mcu" is reset, Linux will disable the corresponding `can0` interface. To ensure proper handling of FIRMWARE_RESTART and RESTART commands, it is recommended to use `allow-hotplug` in the `/etc/network/interfaces.d/can0` file. For example:
fr: Dès que le "bridge mcu" est réinitialisé, Linux désactivera l'interface correspondante `can0`. Pour assurer une bonne manipulation des commandes FIRMWARE_RESTART et RESTART, il est recommandé d'utiliser `allow-hotplug` dans le fichier `/etc/network/interfaces.d/can0`. Par exemple :

source: The "bridge mcu" is not actually on the CAN bus. Messages to and from the bridge mcu will not be seen by other adapters that may be on the CAN bus.
fr: Le « pont mcu » n'est pas en fait sur le bus CAN. Les messages entrant et sortant du bridge mcu ne seront pas vus par les autres adaptateurs présents sur le bus CAN.

source: The available bandwidth to both the "bridge mcu" itself and all devices on the CAN bus is effectively limited by the CAN bus frequency. As a result, it is recommended to use a CAN bus frequency of 1000000 when using "USB to CAN bus bridge mode".
fr: La bande passante disponible pour tous les appareils du bus CAN (et du bridge mcu) est limitée par la fréquence de bus CAN. Par conséquent, il est recommandé d'utiliser une fréquence de bus CAN de 1000000 lors de l'utilisation du mode "USB to CAN bus bridge".

source: Even at a CAN bus frequency of 1000000, there may not be sufficient bandwidth to run a `SHAPER_CALIBRATE` test if both the XY steppers and the accelerometer all communicate via a single "USB to CAN bus" interface.
fr: Même à une fréquence de bus CAN de 1000000, il peut ne pas y avoir assez de bande passante pour exécuter un test `SHAPER_CALIBRATE` si les deux steppers XY et l'accéléromètre communiquent tous par une seule interface "USB to CAN bus".

source: A USB to CAN bridge board will not appear as a USB serial device, it will not show up when running `ls /dev/serial/by-id`, and it can not be configured in Klipper's printer.cfg file with a `serial:` parameter. The bridge board appears as a "USB CAN adapter" and it is configured in the printer.cfg as a [CAN node](#configuring-klipper).
fr: Une carte de pont USB à CAN n'apparaîtra pas en tant que périphérique série USB, elle ne s'affichera pas lors de l'execution de la commande `ls /dev/serial/by-id`, et elle ne peut pas être configurée dans le fichier Klipper avec un paramètre `serial:`. La carte pont apparaît comme un « adaptateur CAN USB » et est configuré dans le printer.cfg en tant que [Nœud CAN](#configuring-klipper).

source: Tips for troubleshooting
fr: Conseils pour le dépannage

source: See the [CAN bus troubleshooting](CANBUS_Troubleshooting.md) document.
fr: Voir le document [Dépannage du Bus CAN](CANBUS_Troubleshooting.md).

source: Klipper currently only supports CAN on stm32 chips. In addition, the micro-controller chip must support CAN and it must be on a board that has a CAN transceiver.
hu: A Klipper jelenleg csak az STM32 chipeken támogatja a CAN-t. Ezenkívül a mikrokontroller chipnek támogatnia kell a CAN-t, és olyan lapon kell lennie, amely rendelkezik CAN adó-vevővel.
ko: Klipper는 현재 stm32 칩에서만 CAN을 지원합니다. 또한 마이크로 컨트롤러 칩은 CAN을 지원해야 하며 CAN 트랜시버가 보드에 있어야 합니다.

source: In order to use a CAN bus, it is necessary to have a host adapter. There are currently two common options:
hu: A CAN-busz használatához szükség van egy host-adapterre. Jelenleg két elterjedt lehetőség van:
ko: CAN bus를 사용하려면, 호스트 어댑터가 필요합니다. 현재까지 두 가지 일반적인 옵션이 있습니다 :

source: Use a [Waveshare Raspberry Pi CAN hat](https://www.waveshare.com/rs485-can-hat.htm) or one of its many clones.
hu: Használjon egy [Waveshare Raspberry Pi CAN sapkát](https://www.waveshare.com/rs485-can-hat.htm) vagy annak számos klónja közül egyet.
ko: [Waveshare Raspberry Pi CAN hat](https://www.waveshare.com/rs485-can-hat.htm) 을 사용하거나, 다른 클론제품을 사용합니다.

source: Note that the "Raspberry Pi CAN hat" also requires [changes to config.txt](https://www.waveshare.com/wiki/RS485_CAN_HAT).
hu: Ne feledje, hogy a "Raspberry Pi CAN sapka" is megköveteli a [config.txt módosítását](https://www.waveshare.com/wiki/RS485_CAN_HAT).
ko: Note : "Raspberry Pi CAN hat"도 마찬가지로 [changes to config.txt](https://www.waveshare.com/wiki/RS485_CAN_HAT) 변경이 필요합니다.

source: Note that some devices have a builtin 120 ohm resistor (for example, the "Waveshare Raspberry Pi CAN hat" has a soldered on resistor that can not be easily removed). Some devices do not include a resistor at all. Other devices have a mechanism to select the resistor (typically by connecting a "pin jumper"). Be sure to check the schematics of all devices on the CAN bus to verify that there are two and only two 120 Ohm resistors on the bus.
hu: Vegye figyelembe, hogy egyes eszközök beépített 120 ohmos ellenállással rendelkeznek (például a "Waveshare Raspberry Pi CAN sapka" egy beforrasztott ellenállással rendelkezik, amelyet nem lehet könnyen eltávolítani). Egyes eszközök egyáltalán nem tartalmaznak ellenállást. Más eszközök rendelkeznek egy mechanizmussal az ellenállás kiválasztására (általában egy "pin jumper" csatlakoztatásával). Mindenképpen ellenőrizze a CAN-buszon lévő összes eszköz kapcsolási rajzát, hogy a buszon két és csak két 120 Ohm-os ellenállás van-e.
ko: 일부 장치에는 120옴 저항이 내장되어 있습니다.(예: "Waveshare Raspberry Pi CAN 모자"에는 쉽게 제거할 수 없는 저항이 납땜되어 있음). 일부 장치에는 저항이 전혀 포함되어 있지 않습니다. 다른 장치에는 저항을 선택하는 메커니즘이 있습니다(일반적으로 "핀 점퍼"로 연결). CAN bus에 있는 모든 장치의 회로도를 확인하여 2개의 120 Ohm 저항이 있는지 확인하십시오.

source: Found canbus_uuid=11aa22bb33cc
hu: Talált canbus_uuid=11aa22bb33cc

source: Use a USB CAN adapter (for example <https://hacker-gadgets.com/product/cantact-usb-can-adapter/>). There are many different USB to CAN adapters available - when choosing one, we recommend verifying it can run the [candlelight firmware](https://github.com/candle-usb/candleLight_fw). (Unfortunately, we've found some USB adapters run defective firmware and are locked down, so verify before purchasing.)
hu: Használjon USB CAN-adaptert (például <https://hacker-gadgets.com/product/cantact-usb-can-adapter/>). Számos különböző USB-CAN adapter áll rendelkezésre - az adapter kiválasztásakor javasoljuk, hogy ellenőrizze, hogy képes-e a [candlelight firmware](https://github.com/candle-usb/candleLight_fw) futtatására. (Sajnos azt tapasztaltuk, hogy néhány USB-adapter hibás firmware-t futtat, és le van zárva, ezért vásárlás előtt ellenőrizze.)

source: Some micro-controllers support selecting "USB to CAN bus bridge" mode during "make menuconfig". This mode may allow one to use a micro-controller as both a "USB to CAN bus adapter" and as a Klipper node.
hu: Egyes mikrovezérlők támogatják az "USB to CAN bus bridge" üzemmód kiválasztását a "make menuconfig" során. Ez az üzemmód lehetővé teheti, hogy egy mikrokontrollert "USB CAN busz adapterként" és Klipper csomópontként is használjunk.

source: When Klipper uses this mode the micro-controller appears as a "USB CAN bus adapter" under Linux. The "Klipper bridge mcu" itself will appear as if was on this CAN bus - it can be identified via `canbus_query.py` and configured like other CAN bus Klipper nodes. It will appear alongside other devices that are actually on the CAN bus.
hu: Amikor a Klipper ezt az üzemmódot használja, a mikrokontroller "USB CAN busz adapterként" jelenik meg Linux alatt. Maga a "Klipper bridge mcu" úgy jelenik meg, mintha ezen a CAN buszon lenne. A `canbus_query.py` segítségével azonosítható és konfigurálható, mint a többi CAN buszos Klipper csomópont. A többi, ténylegesen a CAN-buszon lévő eszköz mellett fog megjelenni.

source: The "bridge mcu" is not actually on the CAN bus. Messages to and from it do not consume bandwidth on the CAN bus. The mcu can not be seen by other adapters that may be on the CAN bus.
hu: A "bridge mcu" valójában nem a CAN-buszon van. A hozzá érkező és tőle érkező üzenetek nem fogyasztanak sávszélességet a CAN-buszon. Az MCU-t nem láthatják más adapterek, amelyek esetleg a CAN-buszon vannak.

source: Whenever the "bridge mcu" is reset, Linux will disable the corresponding `can0` interface. Generally, this may require running commands such as "ip up" to restart the interface. Thus, Klipper FIRMWARE_RESTART commands (or regular RESTART after a config change) may require restarting the `can0` interface.
hu: Amikor a "bridge mcu" visszaáll, a Linux letiltja a megfelelő `can0` interfészt. Általában ehhez olyan parancsok futtatására lehet szükség, mint például az "ip up", hogy újraindítsa az interfészt. Így a Klipper FIRMWARE_RESTART parancsok (vagy egy konfigurációváltás után a szokásos RESTART) a `can0` interfész újraindítását igényelhetik.

source: To compile for CAN, run "make menuconfig" and select "CAN bus" as the communication interface. Finally, compile the micro-controller code and flash it to the target board.
ko: CAN용으로 컴파일하려면 "make menuconfig"를 실행하고 communication interface에서 "CAN bus"를 선택하십시오. 마지막으로 마이크로 컨트롤러 코드를 컴파일하고 대상 보드에 플래시합니다.

source: Use a USB CAN adapter (for example [https://hacker-gadgets.com/product/cantact-usb-can-adapter/](https://hacker-gadgets.com/product/cantact-usb-can-adapter/)). There are many different USB to CAN adapters available - when choosing one, we recommend verifying it can run the [candlelight firmware](https://github.com/candle-usb/candleLight_fw). (Unfortunately, we've found some USB adapters run defective firmware and are locked down, so verify before purchasing.)
ko: USB CAN 어댑터 사용합니다. (예를들어 [https://hacker-gadgets.com/product/cantact-usb-can-adapter/](https://hacker-gadgets.com/product/cantact-usb-can-adapter/)). 사용할 수 있는 USB-CAN 어댑터는 다양합니다. 하나를 선택할 때, [candlelight firmware](https://github.com/candle-usb/candleLight_fw) 를 실행할 수 있는지 확인하는 것이 좋습니다. (안타깝게도 일부 USB 어댑터가 결함이 있는 펌웨어를 실행하고 잠겨 있는 것으로 확인되었으므로 구매하기 전에 확인하십시오.)
