Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Command_Templates.po
Languages: hu, it, zh_hant

source: Its possible for a delayed gcode to repeat by updating itself in the gcode option:
hu: Lehetséges, hogy egy késleltetett G-kód megismétlődik a G-kód opcióban történő frissítéssel:
it: È possibile che un gcode ritardato si ripeta aggiornandosi nell'opzione gcode:
zh_hant: 通過在 G-Code 選項中自我更新，延遲的 G-Code 可能會重複：

source: The above delayed_gcode will send "// Extruder Temp: [ex0_temp]" to Octoprint every 2 seconds. This can be canceled with the following gcode:
hu: A fenti delayed_gcode 2 másodpercenként elküldi az "// Extruder Temp: [ex0_temp]" kódot az Octoprintnek. Ez a következő G-kóddal törölhető:
it: Il codice delayed_gcode sopra riportato invierà "// Extruder Temp: [ex0_temp]" a Octoprint ogni 2 secondi. Questo può essere annullato con il seguente gcode:
zh_hant: 上面的delayed_gcode 將每2 秒向Octoprint 發送“// Extruder Temp: [ex0_temp]”。這可以使用以下 G-Code 取消：

source: Menu templates
hu: Menüsablonok
it: Modelli di menu
zh_hant: 功能表範本

source: If a [display config section](Config_Reference.md#display) is enabled, then it is possible to customize the menu with [menu](Config_Reference.md#menu) config sections.
hu: Ha a [display config section](Config_Reference.md#display) engedélyezve van, akkor lehetőség van a menü testreszabására a [menu](Config_Reference.md#menu) konfigurációs szakaszokkal.
it: Se è abilitata una [sezione di configurazione display](Config_Reference.md#display), è possibile personalizzare il menu con le sezioni di configurazione [menu](Config_Reference.md#menu).
zh_hant: 如果啟用了 [display config section](Config_Reference.md#display)，則可以使用 [menu](Config_Reference.md#menu) 配置部分自定義菜單。

source: The following read-only attributes are available in menu templates:
hu: A menüsablonokban a következő csak olvasható attribútumok állnak rendelkezésre:
it: I seguenti attributi di sola lettura sono disponibili nei modelli di menu:
zh_hant: 菜單模板中提供以下只讀屬性：

source: `menu.width` - element width (number of display columns)
hu: `menu.width` - az elem szélessége (a megjelenített oszlopok száma)
it: `menu.width` - larghezza dell'elemento (numero di colonne di visualizzazione)
zh_hant: `menu.width` - 元素寬度（顯示列數）

source: `menu.ns` - element namespace
hu: `menu.ns` - elem névtere
it: `menu.ns` - namespace del elemento
zh_hant: `menu.ns` - 元素命名空間

source: `menu.event` - name of the event that triggered the script
hu: `menu.event` - a szkriptet kiváltó esemény neve
it: `menu.event` - nome dell'evento che ha attivato lo script
zh_hant: "menu.event" - 觸發腳本的事件的名稱

source: `menu.input` - input value, only available in input script context
hu: `menu.input` - beviteli érték, csak input script kontextusban érhető el
it: `menu.input` - valore di input, disponibile solo nel contesto dello script di input
zh_hant: `menu.input` - 輸入數值，僅在輸入腳本上下文中可用

source: The following actions are available in menu templates:
hu: A menüsablonokban a következő műveletek érhetők el:
it: Le seguenti azioni sono disponibili nei modelli di menu:
zh_hant: 選單範本中提供了以下操作：

source: `menu.back(force, update)`: will execute menu back command, optional boolean parameters `<force>` and `<update>`.
hu: `menu.back(force, update)`: végrehajtja a menü vissza parancsát, az opcionális logikai paramétereket `<force>` és `<update>`.
it: `menu.back(force, update)`: eseguirà il comando menu back, parametri booleani opzionali `<force>` e `<update>`.
zh_hant: `menu.back(force, update)`：將執行菜單返回命令，可選"是/否"參數`<force>`和`<update>`。

source: When `<force>` is set True then it will also stop editing. Default value is False.
hu: Ha a `<force>` értéke True, akkor a szerkesztés is leáll. Az alapértelmezett érték False.
it: Quando `<force>` è impostato su True, interromperà anche la modifica. Il valore predefinito è False.
zh_hant: 當 `<force>` 設置為"是"時，它也會停止編輯。默認值為"否"。

source: When `<update>` is set False then parent container items are not updated. Default value is True.
hu: Ha az `<update>` értéke False, akkor a felsőbb tárolóelemek nem frissülnek. Az alapértelmezett érték True.
it: Quando `<update>` è impostato su False, gli elementi del contenitore padre non vengono aggiornati. Il valore predefinito è True.
zh_hant: 當 `<update>` 設置為 "否" 時，不會更新父容器項。默認值為"是"。

source: `menu.exit(force)` - will execute menu exit command, optional boolean parameter `<force>` default value False.
hu: `menu.exit(force)` - végrehajtja a menüből való kilépés parancsát, opcionális boolean paraméter `<force>` alapértelmezett értéke False.
it: `menu.exit(force)` - eseguirà il comando di uscita dal menu, parametro booleano opzionale `<force>` valore predefinito False.
zh_hant: `menu.exit(force)` - 將執行菜單退出命令，可選"是/否"參數 `<force>` 默認值為 "否"。

source: Save Variables to disk
hu: Változók mentése lemezre
it: Salvare variabili su disco
zh_hant: 將變數保存到磁碟

source: If a [save_variables config section](Config_Reference.md#save_variables) has been enabled, `SAVE_VARIABLE VARIABLE=<name> VALUE=<value>` can be used to save the variable to disk so that it can be used across restarts. All stored variables are loaded into the `printer.save_variables.variables` dict at startup and can be used in gcode macros. to avoid overly long lines you can add the following at the top of the macro:
hu: Ha a [save_variables config section](Config_Reference.md#save_variables) engedélyezve van, a `SAVE_VARIABLE VARIABLE=<name> VALUE=<value>` használható a változó lemezre mentésére, hogy az újraindítások során is használható legyen. Minden tárolt változó betöltődik a `printer.save_variables.variables` dict-be indításkor, és felhasználható a G-kód makrókban. A túl hosszú sorok elkerülése érdekében a makró elejére a következőket írhatjuk:
it: Se è stata abilitata una [sezione di configurazione save_variables](Config_Reference.md#save_variables), `SAVE_VARIABLE VARIABLE=<nome> VALUE=<valore>` può essere utilizzato per salvare la variabile su disco in modo che possa essere utilizzata tra i riavvii. Tutte le variabili memorizzate vengono caricate nel dict `printer.save_variables.variables` all'avvio e possono essere utilizzate nelle macro gcode. per evitare righe troppo lunghe puoi aggiungere quanto segue nella parte superiore della macro:
zh_hant: 如果啟用了 [save_variables config section](Config_Reference.md#save_variables)，則可以使用 `SAVE_VARIABLE VARIABLE=<name> VALUE=<value>` 將變數保存到磁盤，以便在重新啟動時使用它。所有存儲的變數都會在啟動時加載到`printer.save_variables.variables` dict 中，並且可以在G-Code 巨集中使用。為避免行過長，您可以在巨集頂部添加以下內容：

source: As an example, it could be used to save the state of 2-in-1-out hotend and when starting a print ensure that the active extruder is used, instead of T0:
hu: Példaként a 2 az 1-ben nyomtatófej állapotának mentésére használható, és nyomtatás indításakor győződjön meg arról, hogy az aktív fejet használja a T0 helyett:
it: Ad esempio, potrebbe essere utilizzato per salvare lo stato dell'hotend 2-in-1-out e quando si avvia una stampa assicurarsi che venga utilizzato l'estrusore attivo, anziché T0:
zh_hant: 例如，它可用於保存 二入一出熱頭的狀態，並在開始打印時確保使用活動的擠出機，而不是 T0：

source: [gcode_macro blink_led] gcode: SET_PIN PIN=my_led VALUE=1 G4 P2000 SET_PIN PIN=my_led VALUE=0
it: [gcode_macro led_lampeggiante] gcode: SET_PIN PIN=my_led VALUE=1 G4 P2000 SET_PIN PIN=my_led VALUE=0

source: [gcode_macro blink_led] description: Blink my_led one time gcode: SET_PIN PIN=my_led VALUE=1 G4 P2000 SET_PIN PIN=my_led VALUE=0
it: [gcode_macro led_lampeggiante] description: Esegue lampeggio del led una volta gcode: SET_PIN PIN=my_led VALUE=1 G4 P2000 SET_PIN PIN=my_led VALUE=0

source: [gcode_macro start_probe] variable_bed_temp: 0 gcode: # Save target temperature to bed_temp variable SET_GCODE_VARIABLE MACRO=start_probe VARIABLE=bed_temp VALUE={printer.heater_bed.target} # Disable bed heater M140 # Perform probe PROBE # Call finish_probe macro at completion of probe finish_probe [gcode_macro finish_probe] gcode: # Restore temperature M140 S{printer["gcode_macro start_probe"].bed_temp}
it: [gcode_macro start_probe] variable_bed_temp: 0 gcode: # Salva la temperatura target nella variabile bed_temp SET_GCODE_VARIABLE MACRO=start_probe VARIABLE=bed_temp VALUE={printer.heater_bed.target} # Disattiva il riscaldamento del piatto M140 # Esegue sonda PROBE # Chiama la macro finish_probe al completamento finish_probe [gcode_macro finish_probe] gcode: # Ripristinare la temperatura del piatto M140 S{printer["gcode_macro start_probe"].bed_temp}

source: Commands templates
hu: Parancssablonok
it: Modelli di comandi
zh_hant: 命令模板

source: The "rawparams" variable
hu: A "rawparams" változó
it: La variabile "rawparams"
zh_hant: "rawparams" 變數

source: The full unparsed parameters for the running macro can be access via the `rawparams` pseudo-variable.
hu: A futó makró teljes, be nem elemzett paraméterei a `rawparams` pszeudováltozóval érhetők el.
it: È possibile accedere ai parametri completi non analizzati per la macro in esecuzione tramite la pseudo-variabile `rawparams`.
zh_hant: 運行巨集的完整未解析參數可以通過 `rawparams` 偽變數訪問。

source: The terminal will display the description when you use the `HELP` command or the autocomplete function.
hu: A terminál megjeleníti a leírást, ha a `HELP` parancsot vagy az automatikus kitöltés funkciót használja.
it: Il terminale visualizzerà la descrizione quando si utilizza il comando `HELP` o la funzione di completamento automatico.
zh_hant: 當您使用“HELP”命令或自動完成功能時，終端將顯示描述。

source: Note that this will include any comments that were part of the original command.
it: Nota che questo includerà tutti i commenti che facevano parte del comando originale.

source: See the [sample-macros.cfg](../config/sample-macros.cfg) file for an example showing how to override the `M117` command using `rawparams`.
it: Vedere il file [sample-macros.cfg](../config/sample-macros.cfg) per un esempio che mostra come sovrascrivere il comando `M117` usando `rawparams`.

source: This is quite useful if you want to change the behavior of certain commands like the `M117`. For example:
hu: Ez nagyon hasznos, ha meg akarod változtatni bizonyos parancsok viselkedését, mint például az `M117`. Például:
zh_hant: 如果您想更改某些命令（如“M117”）的行為，這非常有用。例如：
