Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Command_Templates.po
Languages: hu, it, zh_hant

source: This document provides information on implementing G-Code command sequences in gcode_macro (and similar) config sections.
hu: Ez a dokumentum a G-kód parancssorozatok gcode_macro (és hasonló) konfigurációs szakaszokban történő implementálásáról nyújt információt.
it: Questo documento fornisce informazioni sull'implementazione di sequenze di comandi G-Code nelle sezioni di configurazione gcode_macro (e simili).
zh_hant: 本文件描述了 gcode_macro（和其他類似）配置分段中實現 G-Code 命令序列的方法。

source: G-Code Macro Naming
hu: G-kód makró elnevezése
it: Denominazione macro G-Code
zh_hant: G 程式碼宏命名

source: Case is not important for the G-Code macro name - MY_MACRO and my_macro will evaluate the same and may be called in either upper or lower case. If any numbers are used in the macro name then they must all be at the end of the name (eg, TEST_MACRO25 is valid, but MACRO25_TEST3 is not).
hu: A G-kódos makronév esetében a nagy- és kisbetűs írásmód nem fontos - a MY_MACRO és a my_macro ugyanúgy kiértékelődik, és kicsi vagy nagybetűvel is meghívható. Ha a makronévben számokat használunk, akkor azoknak a név végén kell állniuk (pl. a TEST_MACRO25 érvényes, de a MACRO25_TEST3 nem).
it: Le maiuscole non sono importanti per il nome della macro G-Code: MY_MACRO e my_macro saranno considerate allo stesso modo e possono essere chiamati in maiuscolo o minuscolo. Se nel nome della macro vengono utilizzati dei numeri, devono trovarsi tutti alla fine del nome (ad es. TEST_MACRO25 è valido, ma MACRO25_TEST3 non lo è).
zh_hant: G-Code 宏的名稱大小寫並不重要。比如，MY_MACRO 和 my_macro 是等效的，可以用大寫或小寫來呼叫。如果在宏的名稱中使用任何數字，那麼它們必須都在名稱的末尾（例如，TEST_MACRO25是合法的，但MACRO25_TEST3是不合法的）。

source: Formatting of G-Code in the config
hu: A G-kód formázása a konfigurációban
it: Formattazione di G-Code nel config
zh_hant: 配置中 G-Code的格式

source: Indentation is important when defining a macro in the config file. To specify a multi-line G-Code sequence it is important for each line to have proper indentation. For example:
hu: A behúzás fontos, amikor makrót definiál a konfigurációs fájlban. Többsoros G-kód szekvencia megadásához fontos, hogy minden sorban megfelelő behúzás legyen. Például:
it: L'indentazione è importante quando si definisce una macro nel file di configurazione. Per specificare una sequenza G-Code su più righe è importante che ogni riga abbia un'indentazione adeguata. Per esempio:
zh_hant: 在配置檔案中定義一個宏時需要注意縮排。在定義多行的G程式碼序列時每行都要有適當的縮排。例如：

source: Note how the `gcode:` config option always starts at the beginning of the line and subsequent lines in the G-Code macro never start at the beginning.
hu: Figyeljük meg, hogy a `gcode:` config opció mindig a sor elején kezdődik, valamint a G-kód makró további sorai soha nem kezdődnek a sor elején.
it: Nota come l'opzione di configurazione `gcode:` inizia sempre all'inizio della riga e le righe successive nella macro G-Code non iniziano mai all'inizio.
zh_hant: 請注意，`gcode:` 配置選項總是從行首開始，而 G-Code 宏中的後續行從不從行首開始。

source: Add a description to your macro
hu: Leírás hozzáadása a makróhoz
it: Aggiungi una descrizione alla tua macro
zh_hant: 向宏新增描述

source: To help identify the functionality a short description can be added. Add `description:` with a short text to describe the functionality. Default is "G-Code macro" if not specified. For example:
hu: A funkció azonosításának megkönnyítése érdekében rövid leírás adható hozzá. Adjunk hozzá `description:` egy rövid szöveget a funkció leírására. Ha nincs megadva, az alapértelmezett érték "G-kód makró". Például:
it: Per aiutare a identificare la funzionalità è possibile aggiungere una breve descrizione. Aggiungi `descrizione:` con un breve testo per descrivere la funzionalità. L'impostazione predefinita è "Macro codice G" se non specificato. Per esempio:
zh_hant: 可以通過新增 `description:` 和簡短的描述來幫助理解該功能。如果沒有指定，預設為"G-Code macro"。例如：

source: Save/Restore state for G-Code moves
hu: Állapot mentése/visszaállítása G-kódos mozgásokhoz
it: Salva/ripristina lo stato per i movimenti G-Code
zh_hant: 儲存/恢復 G-Code 移動的狀態

source: Unfortunately, the G-Code command language can be challenging to use. The standard mechanism to move the toolhead is via the `G1` command (the `G0` command is an alias for `G1` and it can be used interchangeably with it). However, this command relies on the "G-Code parsing state" setup by `M82`, `M83`, `G90`, `G91`, `G92`, and previous `G1` commands. When creating a G-Code macro it is a good idea to always explicitly set the G-Code parsing state prior to issuing a `G1` command. (Otherwise, there is a risk the `G1` command will make an undesirable request.)
hu: Sajnos a G-kód parancsnyelv használata kihívást jelenthet. A nyomtatófej mozgatásának szabványos mechanizmusa a `G1` parancson keresztül történik (a `G0` parancs a `G1` parancs álnevének tekinthető, és felcserélhető vele). Ez a parancs azonban a "G-kód elemzési állapotára" támaszkodik: `M82`, `M83`, `G90` általi beállításra, `G91`, `G92` és a korábbi `G1` parancsok is. Egy G-kód makró létrehozásakor célszerű mindig kifejezetten beállítani a G-kód elemzési állapotát a `G1` parancs kiadása előtt. (Ellenkező esetben fennáll annak a veszélye, hogy a `G1` parancs nemkívánatos kérést fog végrehajtani.)
it: Sfortunatamente, il linguaggio di comando G-Code può essere difficile da usare. Il meccanismo standard per spostare la testa di stampa è tramite il comando `G1` (il comando `G0` è un alias per `G1` e può essere usato in modo intercambiabile con esso). Tuttavia, questo comando si basa sull'impostazione dello "stato di analisi del codice G" da `M82`, `M83`, `G90`, `G91`, `G92` e precedenti comandi `G1`. Quando si crea una macro G-Code è una buona idea impostare sempre in modo esplicito lo stato di analisi del G-Code prima di emettere un comando `G1`. (Altrimenti, c'è il rischio che il comando `G1` faccia una richiesta indesiderabile.)
zh_hant: 不幸的是，G-Code 命令語言在使用上有些難度。移動工具頭的標準機制是通過 `G1` 命令（`G0` 命令是 `G1` 的別名，它們互換使用）。然而，這個命令依賴於由`M82`、`M83`、`G90`、`G91`、`G92`, 以及先前的`G1`命令所設定的"G-Code解析狀態"。在建立 G-Code 宏時，最好在發出`G1`命令之前，先明確 G-Code 解析狀態。(否則，`G1` 命令就有可能提出一個不符合預期的請求。）

source: A common way to accomplish that is to wrap the `G1` moves in `SAVE_GCODE_STATE`, `G91`, and `RESTORE_GCODE_STATE`. For example:
hu: Ennek egyik gyakori módja, hogy a `G1` mozdulatokat `SAVE_GCODE_STATE`-be csomagoljuk, `G91`, és `RESTORE_GCODE_STATE`-ba. Például:
it: Un modo comune per farlo è avvolgere le mosse `G1` in `SAVE_GCODE_STATE`, `G91` e `RESTORE_GCODE_STATE`. Per esempio:
zh_hant: 實現這一目標的常見方法是將 `G1` 移動包裝在 `SAVE_GCODE_STATE`、`G91`和`RESTORE_GCODE_STATE`中。例如：

source: The `G91` command places the G-Code parsing state into "relative move mode" and the `RESTORE_GCODE_STATE` command restores the state to what it was prior to entering the macro. Be sure to specify an explicit speed (via the `F` parameter) on the first `G1` command.
hu: A `G91` parancs a G-kód elemzési állapotot "relatív mozgatási módba" helyezi, a `RESTORE_GCODE_STATE` parancs pedig visszaállítja a makró belépése előtti állapotot. Ügyeljen arra, hogy az első `G1` parancsnál adjon meg explicit sebességet (az `F` paraméterrel).
it: Il comando `G91` pone lo stato di analisi del codice G in "modalità di spostamento relativo" e il comando `RESTORE_GCODE_STATE` ripristina lo stato a quello che era prima di entrare nella macro. Assicurati di specificare una velocità esplicita (tramite il parametro `F`) sul primo comando `G1`.
zh_hant: `G91` 命令將 G-Code解析狀態置於“相對移動模式”，而 `RESTORE_GCODE_STATE` 命令將狀態恢復到進入巨集之前的狀態。確保在第一個“G1”命令上指定一個明確的速度（通過“F”參數）。

source: Template expansion
hu: Sablon bővítés
it: Espansione del modello
zh_hant: 模板擴充套件

source: The gcode_macro `gcode:` config section is evaluated using the Jinja2 template language. One can evaluate expressions at run-time by wrapping them in `{ }` characters or use conditional statements wrapped in `{% %}`. See the [Jinja2 documentation](http://jinja.pocoo.org/docs/2.10/templates/) for further information on the syntax.
hu: A gcode_macro `gcode:` konfigurációs szakasz kiértékelése a Jinja2 sablonnyelv használatával történik. A kifejezéseket kiértékelhetjük futásidőben `{ }` karakterekbe csomagolva, vagy használhatunk feltételes utasításokat `{% %}` karakterekbe csomagolva. A szintaxissal kapcsolatos további információkért lásd a [Jinja2 dokumentáció](http://jinja.pocoo.org/docs/2.10/templates/).
it: La sezione di configurazione di gcode_macro `gcode:` viene valutata utilizzando il linguaggio del modello Jinja2. È possibile valutare le espressioni in fase di esecuzione racchiudendole in caratteri `{ }` o utilizzando istruzioni condizionali racchiuse in `{% %}`. Vedere la [documentazione Jinja2](http://jinja.pocoo.org/docs/2.10/templates/) per ulteriori informazioni sulla sintassi.
zh_hant: gcode_macro `gcode:` 配置部分使用 Jinja2 模板語言進行評估。可以通過將表達式包裝在“{}”字符中或使用條件語句包裝在“{% %}”中來在運行時評估表達式。有關語法的更多信息，請參閱 [Jinja2 文檔](http://jinja.pocoo.org/docs/2.10/templates/).

source: An example of a complex macro:
hu: Példa egy összetett makróra:
it: Un esempio di macro complessa:
zh_hant: 一個更復雜的宏示例：

source: Macro parameters
hu: Makró paraméterek
it: Parametri Macro
zh_hant: 宏觀參數

source: It is often useful to inspect parameters passed to the macro when it is called. These parameters are available via the `params` pseudo-variable. For example, if the macro:
hu: Gyakran hasznos a makrónak a meghívásakor átadott paraméterek vizsgálata. Ezek a paraméterek a `params` álváltozóval érhetők el. Például, ha a makró:
it: Spesso è utile controllare i parametri passati alla macro quando viene chiamata. Questi parametri sono disponibili tramite la pseudo-variabile `params`. Ad esempio, se la macro:
zh_hant: 在調用巨集時檢查傳遞給巨集的參數通常很有用。這些參數可通過 `params` 偽變數獲得。例如，如果巨集：

source: were invoked as `SET_PERCENT VALUE=.2` it would evaluate to `M117 Now at 20%`. Note that parameter names are always in upper-case when evaluated in the macro and are always passed as strings. If performing math then they must be explicitly converted to integers or floats.
hu: `SET_PERCENT VALUE=.2` értéket adna, akkor `M117 Most 20%-os értéken`. Vegye figyelembe, hogy a paraméternevek a makróban történő kiértékeléskor mindig nagybetűsek, és mindig karakterláncként kerülnek átadásra. Ha matematikai műveletet hajtunk végre, akkor azokat explicit módon egész számokká vagy lebegőszámokká kell konvertálni.
it: sono stati invocati come `SET_PERCENT VALUE=.2` verrebbero valutati in `M117 Now at 20%`. Si noti che i nomi dei parametri sono sempre in maiuscolo quando vengono valutati nella macro e vengono sempre passati come stringhe. Se si eseguono calcoli matematici, devono essere convertiti esplicitamente in numeri interi o float.
zh_hant: 被調用為“SET_PERCENT VALUE=.2”，它將評估為“M117 Now at 20%”。請注意，在宏中求值時，參數名稱始終為大寫，並且始終作為字符串傳遞。如果執行數學運算，則必須將它們顯式轉換為整數或浮點數。

source: It's common to use the Jinja2 `set` directive to use a default parameter and assign the result to a local name. For example:
hu: Gyakori a Jinja2 `set` direktíva használata egy alapértelmezett paraméter használatához és az eredmény hozzárendelése egy helyi névhez. Például:
it: È comune usare la direttiva Jinja2 `set` per usare un parametro predefinito e assegnare il risultato a un nome locale. Per esempio:
zh_hant: 通常使用 Jinja2 `set` 指令來使用默認參數並將結果分配給本地名稱。例如：

source: The "printer" Variable
hu: A "nyomtató" változó
it: La variabile "printer"
zh_hant: "printer"變數

source: It is possible to inspect (and alter) the current state of the printer via the `printer` pseudo-variable. For example:
hu: A nyomtató aktuális állapotát a `printer` álváltozóval lehet ellenőrizni (és megváltoztatni). Például:
it: È possibile ispezionare (e modificare) lo stato corrente della stampante tramite la pseudo-variabile `printer`. Per esempio:
zh_hant: 可以通過 `printer` 偽變數檢查（和更改）打印機的當前狀態。例如：

source: Available fields are defined in the [Status Reference](Status_Reference.md) document.
hu: A rendelkezésre álló mezők a [Referencia állapot](Status_Reference.md) dokumentumban vannak meghatározva.
it: I campi disponibili sono definiti nel documento [Status Reference](Status_Reference.md).
zh_hant: [Status Reference](Status_Reference.md) 文檔中定義了可用字段。

source: Important! Macros are first evaluated in entirety and only then are the resulting commands executed. If a macro issues a command that alters the state of the printer, the results of that state change will not be visible during the evaluation of the macro. This can also result in subtle behavior when a macro generates commands that call other macros, as the called macro is evaluated when it is invoked (which is after the entire evaluation of the calling macro).
hu: Fontos! A makrók először teljes egészében kiértékelésre kerülnek, és csak ezután kerülnek végrehajtásra a kapott parancsok. Ha egy makró olyan parancsot ad ki, amely megváltoztatja a nyomtató állapotát, az állapotváltozás eredményei nem lesznek láthatóak a makró kiértékelése során. Ez akkor is furcsa viselkedést eredményezhet, ha egy makró más makrókat, hívó parancsokat generál, mivel a meghívott makró a meghíváskor kerül kiértékelésre (ami a hívó makró teljes kiértékelése után történik).
it: Importante! Le macro vengono prima valutate per intero e solo dopo vengono eseguiti i comandi risultanti. Se una macro emette un comando che altera lo stato della stampante, i risultati di tale cambiamento di stato non saranno visibili durante la valutazione della macro. Ciò può anche comportare un comportamento impercettibile quando una macro genera comandi che chiamano altre macro, poiché la macro chiamata viene valutata quando viene richiamata (che avviene dopo l'intera valutazione della macro chiamante).
zh_hant: 重要！首先對巨集進行整體評估，然後才執行結果命令。如果宏發出更改打印機狀態的命令，則在評估宏期間將看不到該狀態更改的結果。當巨集生成調用其他巨集的命令時，這也可能導致微妙的行為，因為被調用的巨集在調用時進行評估（這是在調用巨集的整個評估之後）。

source: By convention, the name immediately following `printer` is the name of a config section. So, for example, `printer.fan` refers to the fan object created by the `[fan]` config section. There are some exceptions to this rule - notably the `gcode_move` and `toolhead` objects. If the config section contains spaces in it, then one can access it via the `[ ]` accessor - for example: `printer["generic_heater my_chamber_heater"].temperature`.
hu: A konvenció szerint a `printer` után közvetlenül következő név a config szakasz neve. Így például a `printer.fan` a `[fan]` config szakasz által létrehozott ventilátor objektumra utal. Van néhány kivétel ez alól a szabály alól. Nevezetesen a `gcode_move` és a `toolhead` objektumok. Ha a config szakasz szóközöket tartalmaz, akkor a `[ ]` jellel lehet elérni. Például: `printer["generic_heater my_chamber_heater"].temperature`.
it: Per convenzione, il nome immediatamente successivo a `printer` è il nome di una sezione di configurazione. Quindi, ad esempio, `printer.fan` si riferisce all'oggetto fan creato dalla sezione di configurazione `[fan]`. Ci sono alcune eccezioni a questa regola, in particolare gli oggetti `gcode_move` e `toolhead`. Se la sezione di configurazione contiene spazi, è possibile accedervi tramite l'accessor `[ ]`, ad esempio: `printer["generic_heater my_chamber_heater"].temperature`.
zh_hant: 按照慣例，緊跟在 `printer` 後面的名稱是配置部分的名稱。因此，例如，`printer.fan` 指的是由 `[fan]` 配置部分創建的風扇對象。這條規則有一些例外——特別是 `gcode_move` 和 `toolhead` 對象。如果配置部分包含空格，則可以通過 `[ ]` 訪問器訪問它 - 例如：`printer["generic_heater my_chamber_heater"].temperature`。

source: Note that the Jinja2 `set` directive can assign a local name to an object in the `printer` hierarchy. This can make macros more readable and reduce typing. For example:
hu: Vegyük észre, hogy a Jinja2 `set` direktíva a `printer` hierarchiában lévő objektumhoz rendelhet helyi nevet. Ez olvashatóbbá teheti a makrókat és csökkentheti a gépelést. Például:
it: Si noti che la direttiva Jinja2 `set` può assegnare un nome locale a un oggetto nella gerarchia `printer`. Ciò può rendere le macro più leggibili e ridurre la digitazione. Per esempio:
zh_hant: 請注意，Jinja2 `set` 指令可以為 `printer` 層次結構中的對象分配本地名稱。這可以使宏更具可讀性並減少鍵入。例如：

source: Actions
hu: Tevékenységek
it: Azioni
zh_hant: 可用操作

source: There are some commands available that can alter the state of the printer. For example, `{ action_emergency_stop() }` would cause the printer to go into a shutdown state. Note that these actions are taken at the time that the macro is evaluated, which may be a significant amount of time before the generated g-code commands are executed.
hu: A nyomtató állapotának megváltoztatására néhány parancs áll rendelkezésre. Például az `{ action_emergency_stop() }` a nyomtatót leállítási állapotba helyezi. Vegye figyelembe, hogy ezek a műveletek a makró kiértékelésének időpontjában történnek, ami jelentős idővel a generált G-kód parancsok végrehajtása előtt történhet.
it: Sono disponibili alcuni comandi che possono alterare lo stato della stampante. Ad esempio, `{ action_emergency_stop() }` provocherebbe l'arresto della stampante. Si noti che queste azioni vengono eseguite nel momento in cui viene valutata la macro, il che potrebbe richiedere un periodo di tempo significativo prima dell'esecuzione dei comandi g-code generati.
zh_hant: 有一些可用的命令可以改變打印機的狀態。例如，`{ action_emergency_stop() }` 會導致打印機進入關機狀態。請注意，這些操作是在評估宏時執行的，這可能是執行生成的 G-Code命令之前的大量時間。

source: Available "action" commands:
hu: Elérhető "művelet" parancsok:
it: Comandi "azione" disponibili:
zh_hant: 可用的「操作」命令：

source: `action_respond_info(msg)`: Write the given `msg` to the /tmp/printer pseudo-terminal. Each line of `msg` will be sent with a "// " prefix.
hu: `action_respond_info(msg)`: A megadott `msg` kiírása a /tmp/printer álterminálra. Az `msg` minden egyes sora "// " előtaggal lesz elküldve.
it: `action_respond_info(msg)`: scrive il dato `msg` sullo pseudo-terminale /tmp/printer. Ogni riga di `msg` verrà inviata con un prefisso "//".
zh_hant: `action_respond_info(msg)`：將給定的`msg`寫入/tmp/printer偽終端。 `msg` 的每一行都會以“//”前綴發送。

source: `action_raise_error(msg)`: Abort the current macro (and any calling macros) and write the given `msg` to the /tmp/printer pseudo-terminal. The first line of `msg` will be sent with a "!! " prefix and subsequent lines will have a "// " prefix.
hu: `action_raise_error(msg)`: Megszakítja az aktuális makrót (és minden hívó makrót), és a megadott `msg` üzenetet kiírja a /tmp/printer pseudo-terminálra. Az `msg` első sora "!! " előtaggal, a további sorok pedig "// " előtaggal lesznek elküldve.
it: `action_raise_error(msg)`: annulla la macro corrente (e qualsiasi macro chiamante) e scrivie il dato `msg` sullo pseudo-terminale /tmp/printer. La prima riga di `msg` verrà inviata con un prefisso "!!" e le righe successive avranno un prefisso "//".
zh_hant: `action_raise_error(msg)`：中止當前巨集（和任何調用巨集）並將給定的`msg`寫入/tmp/printer偽終端。 `msg` 的第一行將使用“!!”前綴發送，後續行將使用“//”前綴。

source: `action_emergency_stop(msg)`: Transition the printer to a shutdown state. The `msg` parameter is optional, it may be useful to describe the reason for the shutdown.
hu: `action_emergency_stop(msg)`: A nyomtatót leállítási állapotba helyezi. Az `msg` paraméter opcionális, hasznos lehet a leállítás okának leírása.
it: `action_emergency_stop(msg)`: fa passare la stampante a uno stato di spegnimento. Il parametro `msg` è opzionale, può essere utile per descrivere il motivo dell'arresto.
zh_hant: `action_emergency_stop(msg)`：將打印機轉換為關機狀態。 `msg` 參數是可選的，它可能有助於描述關閉的原因。

source: `action_call_remote_method(method_name)`: Calls a method registered by a remote client. If the method takes parameters they should be provided via keyword arguments, ie: `action_call_remote_method("print_stuff", my_arg="hello_world")`
hu: `action_call_remote_method(method_name)`: Egy távoli ügyfél által regisztrált metódus hívása. Ha a metódus paramétereket fogad el, akkor azokat kulcsszavas argumentumokkal kell megadni, azaz: `action_call_remote_method("print_stuff", my_arg="hello_world")`
it: `action_call_remote_method(method_name)`: chiama un metodo registrato da un client remoto. Se il metodo accetta parametri, questi dovrebbero essere forniti tramite argomenti chiave, ad esempio: `action_call_remote_method("print_stuff", my_arg="hello_world")`
zh_hant: `action_call_remote_method(method_name)`：調用遠程客戶端註冊的方法。如果方法採用參數，則應通過關鍵字參數提供，即：`action_call_remote_method("print_stuff", my_arg="hello_world")`

source: Variables
hu: Változók
it: Variabili
zh_hant: 變數

source: The SET_GCODE_VARIABLE command may be useful for saving state between macro calls. Variable names may not contain any upper case characters. For example:
hu: A SET_GCODE_VARIABLE parancs hasznos lehet a makróhívások közötti állapotmentéshez. A változók nevei nem tartalmazhatnak nagybetűket. Például:
it: Il comando SET_GCODE_VARIABLE può essere utile per salvare lo stato tra le chiamate di macro. I nomi delle variabili non possono contenere caratteri maiuscoli. Per esempio:
zh_hant: SET_GCODE_VARIABLE 命令可能有助於在巨集調用之間保存狀態。變量名不能包含任何大寫字符。例如：

source: Be sure to take the timing of macro evaluation and command execution into account when using SET_GCODE_VARIABLE.
hu: A SET_GCODE_VARIABLE használatakor mindenképpen vegye figyelembe a makró kiértékelésének és a parancs végrehajtásának időzítését.
it: Assicurarsi di tenere in considerazione i tempi della valutazione della macro e dell'esecuzione dei comandi quando si utilizza SET_GCODE_VARIABLE.
zh_hant: 使用 SET_GCODE_VARIABLE 時，請務必考慮巨集評估和命令執行的時間。

source: Delayed Gcodes
hu: Késleltetett G-kódok
it: Gcode ritardati
zh_hant: 延遲 G-Code

source: The [delayed_gcode] configuration option can be used to execute a delayed gcode sequence:
hu: A [delayed_gcode] konfigurációs opció késleltetett G-kód szekvencia végrehajtásához használható:
it: L'opzione di configurazione [delayed_gcode] può essere utilizzata per eseguire una sequenza gcode ritardata:
zh_hant: [delayed_gcode] 配置選項可用於執行延遲的 G-Code 序列：

source: When the `load_filament` macro above executes, it will display a "Load Complete!" message after the extrusion is finished. The last line of gcode enables the "clear_display" delayed_gcode, set to execute in 10 seconds.
hu: Amikor a fenti `load_filament` makró végrehajtódik, az extrudálás befejezése után megjelenik egy "Load Complete!" üzenet. A G-kód utolsó sora engedélyezi a "clear_display" delayed_gcode-ot, amely 10 másodperc múlva végrehajtásra van beállítva.
it: Quando viene eseguita la macro `load_filament` sopra, visualizzerà un "Load Complete!" messaggio al termine dell'estrusione. L'ultima riga di gcode abilita il delay_gcode "clear_display", impostato per essere eseguito in 10 secondi.
zh_hant: 當上面的`load_filament`宏執行時，它會顯示“加載完成！”擠壓完成後的消息。 G-Code 的最後一行啟用了“clear_display”delayed_gcode，設置為在 10 秒內執行。

source: The `initial_duration` config option can be set to execute the delayed_gcode on printer startup. The countdown begins when the printer enters the "ready" state. For example, the below delayed_gcode will execute 5 seconds after the printer is ready, initializing the display with a "Welcome!" message:
hu: Az `initial_duration` konfigurációs beállítás beállítható úgy, hogy a nyomtató indításakor végrehajtsa a delayed_gcode parancsot. A visszaszámlálás akkor kezdődik, amikor a nyomtató a "ready" állapotba lép. Az alábbi delayed_gcode például a nyomtató elkészülte után 5 másodperccel végrehajtja a műveletet, és a kijelzőt "Üdvözlés!" üzenettel inicializálja:
it: L'opzione di configurazione `initial_duration` può essere impostata per eseguire il delay_gcode all'avvio della stampante. Il conto alla rovescia inizia quando la stampante entra nello stato "ready". Ad esempio, il codice delay_g riportato di seguito verrà eseguito 5 secondi dopo che la stampante è pronta, inizializzando il display con un messaggio"Welcome!":
zh_hant: `initial_duration` 配置選項可以設置為在打印機啟動時執行delayed_gcode。當打印機進入“就緒”狀態時開始倒計時。例如，下面的delayed_gcode將在打印機準備好5秒後執行，用“歡迎！”初始化顯示信息：
