Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Config_Reference.po
Languages: fr, zh_hans

source: [sx1509 my_sx1509] i2c_address: # I2C address used by this expander. Depending on the hardware # jumpers this is one out of the following addresses: 62 63 112 # 113. This parameter must be provided. #i2c_mcu: #i2c_bus: #i2c_speed: # See the "common I2C settings" section for a description of the # above parameters. #i2c_bus: # If the I2C implementation of your micro-controller supports # multiple I2C busses, you may specify the bus name here. The # default is to use the default micro-controller i2c bus.
fr: [sx1509 my_sx1509] i2c_address: # Adresse I2C utilisée par cet expandeur. Selon le matériel # il s'agit de l'une des adresses suivantes : 62 63 112 # 113. Ce paramètre doit être fourni. #i2c_mcu: #i2c_bus: #i2c_speed: # Voir la section "paramètres I2C communs" pour une description des # paramètres ci-dessus. #i2c_bus: # Si l'implémentation I2C de votre micro-contrôleur prend en charge plusieurs bus I2C, # vous pouvez spécifier le nom du bus ici. La valeur par # défaut est d'utiliser le bus i2c par défaut du micro-contrôleur.
zh_hans: [sx1509 my_sx1509] i2c_address: # 该扩展器使用的I2C地址。根据硬件跳线，这是以下地址之一： # 62 63 112 113。 # 必须提供此参数。 #i2c_mcu: #i2c_bus: #i2c_speed: # 有关上述参数的描述，请参见“常用I2C设置”章节。 #i2c_bus: # 如果您的微控制器的I2C实现支持多个I2C总线， # 您可以在此处指定总线名称。 # 默认值是使用默认的微控制器i2c总线。

source: [adc_scaled my_name] vref_pin: # The ADC pin to use for VREF monitoring. This parameter must be # provided. vssa_pin: # The ADC pin to use for VSSA monitoring. This parameter must be # provided. #smooth_time: 2.0 # A time value (in seconds) over which the vref and vssa # measurements will be smoothed to reduce the impact of measurement # noise. The default is 2 seconds.
fr: [adc_scaled my_name] vref_pin : # La broche ADC à utiliser pour le contrôle de VREF. Ce paramètre doit être # fourni. vssa_pin : # La broche ADC à utiliser pour la surveillance VSSA. Ce paramètre doit être # fourni. #smooth_time : 2.0 # Une durée (en secondes) durant laquelle les mesures de vref et vssa # seront lissées pour réduire l'impact du bruit des mesures. # La valeur par défaut est de 2 secondes.
zh_hans: [adc_scaled my_name] vref_pin: # 用于监测 VREF 的 ADC 引脚。这个参数必须被提供。 vssa_pin: # 用于监测 VSSA 的 ADC 引脚。这个参数必须被提供。 #smooth_time: 2.0 # 一个时间参数（以秒为计）区间用于平滑 VREF 和 # VSSA 测量来减少测量的干扰。默认为2秒。

source: [palette2] serial: # The serial port to connect to the Palette 2. #baud: 115200 # The baud rate to use. The default is 115200. #feedrate_splice: 0.8 # The feedrate to use when splicing, default is 0.8 #feedrate_normal: 1.0 # The feedrate to use after splicing, default is 1.0 #auto_load_speed: 2 # Extrude feedrate when autoloading, default is 2 (mm/s) #auto_cancel_variation: 0.1 # Auto cancel print when ping varation is above this threshold
fr: [palette2] serial: # Le port série à connecter à la Palette 2. #baud: 115200 # Le débit en bauds à utiliser. La valeur par défaut est 115200. #feedrate_splice: 0.8 # Le taux d'avance à utiliser lors de l'épissage, la valeur par défaut est 0.8. #feedrate_normal: 1.0 # L'avance à utiliser après l'épissage, la valeur par défaut est 1.0. #auto_load_speed: 2 # Vitesse d'extrusion lors du chargement automatique, par défaut 2 (mm/s). #auto_cancel_variation: 0.1 # Annulation automatique de l'impression lorsque la variation du ping est supérieure à ce seuil.

source: #spi_speed: # The SPI speed (in hz) to use when communicating with the device. # The default depends on the type of device. #spi_bus: # If the micro-controller supports multiple SPI busses then one may # specify the micro-controller bus name here. The default depends on # the type of micro-controller. #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # Specify the above parameters to use "software based SPI". This # mode does not require micro-controller hardware support (typically # any general purpose pins may be used). The default is to not use # "software spi".
fr: #spi_speed: # La vitesse SPI (en hz) à utiliser lors de la communication avec le périphérique. # La valeur par défaut dépend du type de périphérique. #spi_bus: # Si le micro-contrôleur supporte plusieurs bus SPI alors on peut # spécifier le nom du bus du micro-contrôleur ici. La valeur par défaut dépend du # type de micro-contrôleur. #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # Spécifiez les paramètres ci-dessus pour utiliser le "SPI logiciel". Ce mode # ne nécessite pas le support matériel du micro-contrôleur (typiquement # n'importe quelle broche d'usage général peut être utilisée). La valeur par défaut est # de ne pas utiliser le "spi logiciel".
zh_hans: #spi_speed: # 必须提供此参数。设备通信时使用的SPI速度（以hz为单位）。 # 默认取决于设备类型。 #spi_bus: # 如果微控制器支持多个SPI总线，则可以在此处指定微控制器总线名称。 # 默认取决于微控制器的类型。 #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # 指定上述参数以使用"基于软件的SPI"。这种模式不需要微控制器硬件支持 # （通常可以使用任何通用目的引脚）。 # 默认情况下不使用"软件spi"。

source: This tool allows a single micro-controller pin to be defined multiple times in a config file without normal error checking. This is intended for diagnostic and debugging purposes. This section is not needed where Klipper supports using the same pin multiple times, and using this override may cause confusing and unexpected results.
fr: Cet outil permet de définir plusieurs fois une même broche de microcontrôleur dans un fichier de configuration sans vérification normale des erreurs. Ceci est destiné à des fins de diagnostic et de débogage. Cette section n'est pas nécessaire lorsque Klipper prend en charge l'utilisation de la même broche plusieurs fois, et l'utilisation de cette dérogation peut entraîner des résultats confus et inattendus.

source: [duplicate_pin_override] pins: # A comma separated list of pins that may be used multiple times in # a config file without normal error checks. This parameter must be # provided.
fr: [duplicate_pin_override] pins: # Une liste de broches séparées par des virgules pouvant être utilisées plusieurs fois dans # un fichier de configuration sans contrôles d'erreurs normaux. Ce paramètre doit être # fourni.
zh_hans: [duplicate_pin_override] pins: # 一个逗号分隔的引脚列表，允许其中的引脚在配置文件中被多次使用而不触发错误检查。 # 必须提供此参数。

source: SAMD SERCOM configuration to specify which pins to use on a given SERCOM. One may define any number of sections with a "samd_sercom" prefix. Each SERCOM must be configured prior to using it as SPI or I2C peripheral. Place this config section above any other section that makes use of SPI or I2C buses.
fr: Configuration de SAMD SERCOM pour indiquer les broches à utiliser sur un matériel SERCOM. On peut définir un nombre quelconque de sections avec le préfixe "samd_sercom". Chaque SERCOM doit être configuré avant de pouvoir être utilisé comme périphérique SPI ou I2C. Placez cette section de configuration au-dessus de toute autre section qui utilise les bus SPI ou I2C.
zh_hans: SAMD SERCOM配置，指定在一个给定的SERCOM上使用哪些引脚。可以用 "samd_sercom "前缀来定义任何数量的分段。每个SERCOM必须在使用它作为SPI或I2C外围设备之前进行配置。将这个配置分段必须在任何其他使用SPI或I2C总线的分段之上。

source: [samd_sercom my_sercom] sercom: # The name of the sercom bus to configure in the micro-controller. # Available names are "sercom0", "sercom1", etc.. This parameter # must be provided. tx_pin: # MOSI pin for SPI communication, or SDA (data) pin for I2C # communication. The pin must have a valid pinmux configuration # for the given SERCOM peripheral. This parameter must be provided. #rx_pin: # MISO pin for SPI communication. This pin is not used for I2C # communication (I2C uses tx_pin for both sending and receiving). # The pin must have a valid pinmux configuration for the given # SERCOM peripheral. This parameter is optional. clk_pin: # CLK pin for SPI communication, or SCL (clock) pin for I2C # communication. The pin must have a valid pinmux configuration # for the given SERCOM peripheral. This parameter must be provided.
fr: [samd_sercom my_sercom] sercom: # Le nom du bus sercom à configurer dans le micro-contrôleur. # Les noms disponibles sont "sercom0", "sercom1", etc. Ce paramètre # doit être fourni. tx_pin: # Broche MOSI pour la communication SPI, ou broche SDA (données) pour la communication I2C. # La broche doit avoir une configuration pinmux valide pour le périphérique SERCOM donné. Ce # paramètre doit être fourni. #rx_pin: # Broche MISO pour la communication SPI. Cette broche n'est pas utilisée pour la communication I2C # (I2C utilise tx_pin pour l'envoi et la réception). # La broche doit avoir une configuration pinmux valide pour le périphérique SERCOM donné. # Ce paramètre est optionnel. clk_pin: # La broche CLK pour la communication SPI, ou la broche SCL (horloge) pour la communication I2C. # La broche doit avoir une configuration pinmux valide pour le périphérique SERCOM donné. Ce # paramètre doit être fourni
zh_hans: [samd_sercom my_sercom] sercom: # 在微控制器中配置的sercom总线的名称。可用的名称是 "sercom0"、 # "sercom1"，等等。 # 必须提供此参数。 tx_pin: # 用于SPI通信的MOSI引脚，或用于I2C通讯的SDA（数据）引脚。 # 该引脚必须有一个用于给定的SERCOM外围设备的有效pinmux配置。 # 必须提供此参数。 #rx_pin: # 用于SPI通信的MISO引脚。该引脚不用于I2C通信(I2C使用tx_pin来发送和接收)。 # 该引脚必须有一个用于给定的SERCOM外围设备的有效pinmux配置。 # 这个参数是可选的。 clk_pin。 # 用于SPI通信的CLK引脚，或用于I2C通信的SCL(时钟)引脚。 # 该引脚必须有一个用于给定的SERCOM外围设备的有效pinmux配置。 # 必须提供此参数。

source: Configuration reference
fr: Référence de configuration
zh_hans: 配置参考

source: Controller cooling fan (one may define any number of sections with a "controller_fan" prefix). A "controller fan" is a fan that will be enabled whenever its associated heater or its associated stepper driver is active. The fan will stop whenever an idle_timeout is reached to ensure no overheating will occur after deactivating a watched component.
fr: Ventilateur de refroidissement du contrôleur (on peut définir un nombre quelconque de sections avec le préfixe "controller_fan"). Un "ventilateur de contrôleur" est un ventilateur activé chaque fois que l'élément chauffant ou le pilote pas à pas qui lui est associé est actif. Le ventilateur s'arrêtera chaque fois qu'un idle_timeout sera atteint afin de garantir qu'aucune surchauffe ne se produise après la désactivation d'un composant surveillé.
zh_hans: 控制器冷却风扇（可以定义任意数量带有"controller_fan"前缀的分段）。"控制器风扇"(Controller fan)是一个只要关联的加热器或步进驱动程序处于活动状态就会启动的风扇。风扇会在空闲超时(idle_timeout)后停止，以确保被监视组件不再活跃后不会过热。

source: See the [rotation distance document](Rotation_Distance.md) for information on calculating the `rotation_distance` parameter. See the [Multi-MCU homing](Multi_MCU_Homing.md) document for information on homing using multiple micro-controllers.
fr: Voir le document [distance de rotation](Rotation_Distance.md) pour des informations sur le calcul du paramètre `rotation_distance`. Voir le document [Multi-MCU homing](Multi_MCU_Homing.md) pour des informations sur l'utilisation de plusieurs microcontrôleurs lors d'une mise à l'origine.
zh_hans: 关于计算`rotation_distance` 参数的方法，请参见[旋转距离文档](Rotation_Distance.md)。关于使用多个微控制器的归位的方法，请参见[Multi-MCU homing](Multi_MCU_Homing.md)文件。

source: [probe] pin: # Probe detection pin. If the pin is on a different microcontroller # than the Z steppers then it enables "multi-mcu homing". This # parameter must be provided. #deactivate_on_each_sample: True # This determines if Klipper should execute deactivation gcode # between each probe attempt when performing a multiple probe # sequence. The default is True. #x_offset: 0.0 # The distance (in mm) between the probe and the nozzle along the # x-axis. The default is 0. #y_offset: 0.0 # The distance (in mm) between the probe and the nozzle along the # y-axis. The default is 0. z_offset: # The distance (in mm) between the bed and the nozzle when the probe # triggers. This parameter must be provided. #speed: 5.0 # Speed (in mm/s) of the Z axis when probing. The default is 5mm/s. #samples: 1 # The number of times to probe each point. The probed z-values will # be averaged. The default is to probe 1 time. #sample_retract_dist: 2.0 # The distance (in mm) to lift the toolhead between each sample (if # sampling more than once). The default is 2mm. #lift_speed: # Speed (in mm/s) of the Z axis when lifting the probe between # samples. The default is to use the same value as the 'speed' # parameter. #samples_result: average # The calculation method when sampling more than once - either # "median" or "average". The default is average. #samples_tolerance: 0.100 # The maximum Z distance (in mm) that a sample may differ from other # samples. If this tolerance is exceeded then either an error is # reported or the attempt is restarted (see # samples_tolerance_retries). The default is 0.100mm. #samples_tolerance_retries: 0 # The number of times to retry if a sample is found that exceeds # samples_tolerance. On a retry, all current samples are discarded # and the probe attempt is restarted. If a valid set of samples are # not obtained in the given number of retries then an error is # reported. The default is zero which causes an error to be reported # on the first sample that exceeds samples_tolerance. #activate_gcode: # A list of G-Code commands to execute prior to each probe attempt. # See docs/Command_Templates.md for G-Code format. This may be # useful if the probe needs to be activated in some way. Do not # issue any commands here that move the toolhead (eg, G1). The # default is to not run any special G-Code commands on activation. #deactivate_gcode: # A list of G-Code commands to execute after each probe attempt # completes. See docs/Command_Templates.md for G-Code format. Do not # issue any commands here that move the toolhead. The default is to # not run any special G-Code commands on deactivation.
fr: [probe] pin: # Broche de détection de la sonde. Si la broche se trouve sur un microcontrôleur différent # que les moteurs pas à pas de l'axe Z alors elle active le "multi-mcu homing". Ce paramètre # doit être fourni. #deactivate_on_each_sample: True # Ceci détermine si Klipper doit exécuter le gcode de désactivation # entre chaque tentative de palpage lors d'une séquence de palpages multiples. # La valeur par défaut est True. #x_offset: 0.0 # La distance (en mm) entre la sonde et la buse le long de l'axe x. # La valeur par défaut est 0. #y_offset: 0.0 # La distance (en mm) entre la sonde et la buse le long de l'axe y. # La valeur par défaut est 0. z_offset: # La distance (en mm) entre le lit et la buse lorsque la sonde se déclenche. # Ce paramètre doit être fourni. #speed: 5.0 # Vitesse (en mm/s) de l'axe Z lors du palpage. La valeur par défaut est 5mm/s. #samples: 1 # Le nombre de fois où il faut palper chaque point. Les valeurs z palpées seront # moyennées. La valeur par défaut est de palper 1 fois. #sample_retract_dist: 2.0 # Distance (en mm) à parcourir pour soulever la tête de l'outil entre chaque échantillon # (en cas d'échantillonnage multiple). La valeur par défaut est 2mm. #lift_speed: # Vitesse (en mm/s) de l'axe Z lors du levage de la sonde entre les échantillons. # La valeur par défaut est la même que celle du paramètre 'speed'. #samples_result: average # La méthode de calcul lorsque l'on échantillonne plusieurs fois - soit # "médiane" (median) ou "moyenne" (average). La valeur par défaut est "moyenne". #samples_tolerance: 0.100 # La distance Z maximale (en mm) à laquelle un échantillon peut différer des autres # échantillons. Si cette tolérance est dépassée, soit une erreur est signalée # soit la tentative est recommencée (cf. samples_tolerance_retries). # La valeur par défaut est 0.100mm. #samples_tolerance_retries: 0 # Le nombre de fois qu'il faut réessayer si l'on trouve un échantillon qui dépasse la # tolérance des échantillons. Lors d'une nouvelle tentative, tous les échantillons en cours # sont rejetés et la tentative de sondage est relancée. # Si un ensemble valide d'échantillons n'est pas obtenu dans le nombre de tentatives donné, # une erreur est signalée. La valeur par défaut est zéro, ce qui entraîne le signalement d'une # erreur au premier échantillon dépassant la tolérance de samples_tolerance. #activate_gcode: # Une liste de commandes G-Code à exécuter avant chaque tentative de palpage. # Voir docs/Command_Templates.md pour le format G-Code. Cela peut être # utile si la sonde doit être activée d'une manière particulière. Ne pas # envoyer ici de commandes déplaçant la tête de l'outil (par exemple, G1). La valeur # par défaut est de ne pas exécuter de commandes G-code spéciales lors de l'activation. #deactivate_gcode: # Une liste de commandes G-Code à exécuter après la fin de chaque tentative de palpage # terminée. Voir docs/Command_Templates.md pour le format G-Code. Ne pas # envoyer ici de commandes déplaçant la tête de l'outil. La valeur par défaut est de # ne pas exécuter de commandes G-code spéciales lors de la désactivation.
zh_hans: [probe] pin: # 探针检测引脚。如果引脚在与Z轴步进电机不同的微控制器上， # 则启用“多MCU归位”。 # 必须提供此参数。 #deactivate_on_each_sample: True # 这决定了在执行多次探测尝试时，Klipper是否应在每次尝试之间 # 执行取消激活(deactivate)G代码。 # 默认为True。 #x_offset: 0.0 # 探针和喷嘴在x轴上的距离（以mm为单位）。 # 默认为0。 #y_offset: 0.0 # 探针和喷嘴在y轴上的距离（以mm为单位）。 # 默认为0。 z_offset: # 当探针触发时，床和喷嘴之间的距离（以mm为单位）。 # 必须提供此参数。 #speed: 5.0 # 探测时Z轴的速度（以mm/s为单位）。 # 默认为5mm/s。 #samples: 1 # 探测每个点的次数。探测的z值将被平均。 # 默认是探测1次。 #sample_retract_dist: 2.0 # 在每个样本之间提升打印头的距离（以mm为单位）（如果采样超 # 过一次）。 # 默认为2mm。 #lift_speed: # 在样本之间提升探针时Z轴的速度（以mm/s为单位）。 # 默认使用与'speed'参数相同的值。 #samples_result: average # 采样超过一次时的计算方法 - median(中位数) 或average（平均值）。 # 默认为 average。 #samples_tolerance: 0.100 # 样本可能与其他样本的最大Z距离（以mm为单位）差异。 # 如果超出此公差，则报告错误或重新开始尝试（参见 # samples_tolerance_retries）。 # 默认为0.100mm。 #samples_tolerance_retries: 0 # 如果发现超过samples_tolerance的样本，重试的次数。 # 在重试时，丢弃所有当前的样本并重新开始探针尝试。 # 如果在给定的重试次数内未获得有效的样本集，则报告错误。 # 默认值为0，这导致在第一个超过samples_tolerance的样本上报告错误。 #activate_gcode: # 在每次探针尝试之前执行的G-Code命令列表。有关G-Code格式，请参见 # docs/Command_Templates.md。如果需要以某种方式激活探针， # 这可能会很有用。不要在此处发送任何移动打印头的命令（例如，G1）。 # 默认情况下，激活时不运行任何特殊的G-Code命令。 #deactivate_gcode: # 在每次探针尝试完成后执行的G-Code命令列表。有关G-Code格式， # 请参见docs/Command_Templates.md。不要在此处发送任何移动 # 工具头的命令。 # 默认情况下，取消激活时不运行任何特殊的G-Code命令。
