Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Config_Reference.po
Languages: fr, zh_hans

source: Note that the [linux mcu](RPi_microcontroller.md) implementation does not currently support directly connected neopixels. The current design using the Linux kernel interface does not allow this scenario because the kernel GPIO interface is not fast enough to provide the required pulse rates.
fr: Notez que l'implémentation du [mcu linux](RPi_microcontroller.md) ne supporte pas actuellement les néopixels directement connectés. La conception actuelle utilisant l'interface du noyau Linux ne permet pas ce scénario car l'interface GPIO du noyau n'est pas assez rapide pour fournir les taux d'impulsion requis.
zh_hans: 注意！[linux mcu](RPi_microcontroller.md)的实现目前不支持直接连接的neopixels。目前使用Linux内核接口的设计不允许这种情况发生，因为内核的GPIO接口速度不够快，无法提供所需的脉冲率。

source: [neopixel my_neopixel] pin: # The pin connected to the neopixel. This parameter must be # provided. #chain_count: # The number of Neopixel chips that are "daisy chained" to the # provided pin. The default is 1 (which indicates only a single # Neopixel is connected to the pin). #color_order: GRB # Set the pixel order required by the LED hardware (using a string # containing the letters R, G, B, W with W optional). Alternatively, # this may be a comma separated list of pixel orders - one for each # LED in the chain. The default is GRB. #initial_RED: 0.0 #initial_GREEN: 0.0 #initial_BLUE: 0.0 #initial_WHITE: 0.0 # See the "led" section for information on these parameters.
fr: [neopixel my_neopixel] pin: # La broche connectée au neopixel. Ce paramètre doit être # fourni. #chain_count: # Le nombre de puces Neopixel connectées en "chaîne" à la broche fournie. # La valeur par défaut est 1 (ce qui indique qu'un seul Neopixel est connecté à la broche). #color_order: GRB # Définit l'ordre des pixels requis par le matériel LED (en utilisant une chaîne # contenant les lettres R, G, B, W avec W en option). Alternativement, il peut s'agir d'une liste # d'ordres de pixels séparés par des virgules - un pour chaque LED de la chaîne. # La valeur par défaut est GRB. #initial_RED: 0.0 #initial_GREEN: 0.0 #initial_BLUE: 0.0 #initial_WHITE: 0.0 # Voir la section "led" pour des informations sur ces paramètres.
zh_hans: [neopixel 我的neopixel] pin: # 连接到neopixel的引脚。 # 必须提供此参数。 #chain_count: # 菊链中 neopixel 芯片的数量。 # 默认为1（代表有一个neopixel芯片连接到了这个引脚）。 #color_order: GRB # 设置LED硬件的RGB像素顺序（提供一个包含字母R（红），G（绿） # ，B（蓝）和W（白）的字符串，W是可选的）。或者也可以用一个 # 逗号分隔字符列表来描述像素顺序。 # 默认为GRB。 #initial_RED: 0.0 #initial_GREEN: 0.0 #initial_BLUE: 0.0 #initial_WHITE: 0.0 # 以上参数请参阅“led”章节。

source: [safe_z_home] home_xy_position: # A X, Y coordinate (e.g. 100, 100) where the Z homing should be # performed. This parameter must be provided. #speed: 50.0 # Speed at which the toolhead is moved to the safe Z home # coordinate. The default is 50 mm/s #z_hop: # Distance (in mm) to lift the Z axis prior to homing. This is # applied to any homing command, even if it doesn't home the Z axis. # If the Z axis is already homed and the current Z position is less # than z_hop, then this will lift the head to a height of z_hop. If # the Z axis is not already homed the head is lifted by z_hop. # The default is to not implement Z hop. #z_hop_speed: 15.0 # Speed (in mm/s) at which the Z axis is lifted prior to homing. The # default is 15 mm/s. #move_to_previous: False # When set to True, the X and Y axes are reset to their previous # positions after Z axis homing. The default is False.
fr: [safe_z_home] home_xy_position: # Une coordonnée X, Y (par exemple 100, 100) où la mise à l'origine Z doit être # être effectuée. Ce paramètre doit être fourni. #speed: 50.0 # Vitesse à laquelle la tête de l'outil est déplacée vers la position de référence Z sûre. # La valeur par défaut est 50 mm/s #z_hop: # Distance (en mm) pour lever l'axe Z avant le retour au point d'origine. Cette valeur est # appliquée à toute commande d'initialisation, même si elle n'initialise pas l'axe Z. # Si l'axe Z est déjà ramené à la position de base et que la position Z actuelle est inférieure # à z_hop, alors ceci élèvera la tête à une hauteur de z_hop. Si l'axe Z n'est pas déjà centré, # la tête est relevée de z_hop. # La valeur par défaut est de ne pas implémenter le relevage en Z. #z_hop_speed: 15.0 # Vitesse (en mm/s) à laquelle l'axe Z est relevé avant le retour à la position initiale. La # valeur par défaut est de 15 mm/s. #move_to_previous: False # Lorsqu'il a la valeur True, les axes X et Y sont réinitialisés à leurs positions précédentes après # le retour à la position initiale de l'axe Z. La valeur par défaut est False.
zh_hans: [safe_z_home] home_xy_position: # 一个X，Y坐标（例如100，100），在这个坐标上应该进行Z归位。 # 必须提供此参数 #speed: 50.0 # 工具头移动到安全Z原点的速度。 # 默认为50毫米/秒 #z_hop: # 在归位前抬升Z轴的距离（mm）。这将用于任何归位命令，即使 # 它没有将Z轴归位。 # 如果Z轴已经归位，并且当前的Z轴位置小于z_hop，那么这条命令 # 将把打印头提升到z_hop的高度。如果 # Z轴尚未归位，则打印头将被提升z_hop的高度。 # 默认不执行Z抬升。 #z_hop_speed: 15.0 # 在归位之前，Z轴抬升的速度（单位：mm/s）。 # 默认为15mm/s。 #move_to_previous: False # 当设置为 "True "时，X轴和Y轴在Z轴归位后会重置到之前的位置。 # 默认为false。

source: [virtual_sdcard] path: # The path of the local directory on the host machine to look for # g-code files. This is a read-only directory (sdcard file writes # are not supported). One may point this to OctoPrint's upload # directory (generally ~/.octoprint/uploads/ ). This parameter must # be provided. #on_error_gcode: # A list of G-Code commands to execute when an error is reported.
fr: [virtual_sdcard] path: # Le chemin d'accès au répertoire local sur la machine hôte de recherche # des fichiers g-code. Il s'agit d'un répertoire en lecture seule (les écritures de fichiers sdcard # ne sont pas supportées). On peut le faire pointer vers le répertoire de téléchargement # d'OctoPrint (généralement ~/.octoprint/uploads/ ). Ce paramètre doit # être fourni. #on_error_gcode: # Une liste de commandes G-Code à exécuter lorsqu'une erreur est signalée.

source: Enables support to exclude or cancel individual objects during the printing process.
fr: Permet de prendre en charge l'exclusion ou l'annulation d'objets individuels pendant le processus d'impression.
zh_hans: 启用对在打印过程中排除或取消单个对象的支持。

source: See the [exclude objects guide](Exclude_Object.md) and [command reference](G-Codes.md#excludeobject) for additional information. See the [sample-macros.cfg](../config/sample-macros.cfg) file for a Marlin/RepRapFirmware compatible M486 G-Code macro.
fr: Voir le [guide des objets exclus](Exclude_Object.md) et la [référence de la commande](G-Codes.md#excludeobject) pour plus d'informations. Voir le fichier [sample-macros.cfg](../config/sample-macros.cfg) pour une macro G-Code M486 compatible avec Marlin/RepRapFirmware.
zh_hans: 有关其他信息，请参阅 [排除对象指南](Exclude_Object.md) 和 [命令参考](G-Codes.md#excludeobject)。请参阅 [sample-macros.cfg](../config/sample-macros.cfg) 文件了解与 Marlin/RepRapFirmware 兼容的 M486 G 代码宏。

source: Note that Klipper's current micro-controller support for i2c is generally not tolerant to line noise. Unexpected errors on the i2c wires may result in Klipper raising a run-time error. Klipper's support for error recovery varies between each micro-controller type. It is generally recommended to only use i2c devices that are on the same printed circuit board as the micro-controller.
fr: Notez que le support actuel des micro-contrôleurs de Klipper pour i2c n'est généralement pas tolérant au bruit de ligne. Des erreurs inattendues sur les fils i2c peuvent entraîner une erreur d'exécution de Klipper. Le support de Klipper pour la récupération des erreurs varie selon le type de micro-contrôleur. Il est généralement recommandé de n'utiliser que des dispositifs i2c qui se trouvent sur la même carte de circuit imprimé que le microcontrôleur.

source: Most Klipper micro-controller implementations only support an `i2c_speed` of 100000. The Klipper "linux" micro-controller supports a 400000 speed, but it must be [set in the operating system](RPi_microcontroller.md#optional-enabling-i2c) and the `i2c_speed` parameter is otherwise ignored. The Klipper "rp2040" micro-controller supports a rate of 400000 via the `i2c_speed` parameter. All other Klipper micro-controllers use a 100000 rate and ignore the `i2c_speed` parameter.
fr: La plupart des implémentations de micro-contrôleurs Klipper ne supportent qu'une `i2c_speed` de 100000. Le micro-contrôleur Klipper "linux" supporte une vitesse de 400000, mais elle doit être [définie dans le système d'exploitation](RPi_microcontroller.md#optional-enabling-i2c) sinon le paramètre `i2c_speed` est ignoré. Le micro-contrôleur Klipper "rp2040" supporte un taux de 400000 via le paramètre `i2c_speed`. Tous les autres micro-contrôleurs Klipper utilisent un taux de 100000 et ignorent le paramètre `i2c_speed`.

source: #i2c_address: # The i2c address of the device. This must specified as a decimal # number (not in hex). The default depends on the type of device. #i2c_mcu: # The name of the micro-controller that the chip is connected to. # The default is "mcu". #i2c_bus: # If the micro-controller supports multiple I2C busses then one may # specify the micro-controller bus name here. The default depends on # the type of micro-controller. #i2c_speed: # The I2C speed (in Hz) to use when communicating with the device. # The Klipper implementation on most micro-controllers is hard-coded # to 100000 and changing this value has no effect. The default is # 100000.
fr: #i2c_address: # L'adresse i2c du périphérique. Elle doit être spécifiée sous la forme d'un nombre décimal # (pas en hexadécimal). La valeur par défaut dépend du type de périphérique. #i2c_mcu: # Le nom du micro-contrôleur auquel la puce est connectée. # La valeur par défaut est "mcu". #i2c_bus: # Si le micro-contrôleur supporte plusieurs bus I2C, on peut spécifier le bus du micro-contrôleur. # La valeur par défaut dépend du type de micro-contrôleur. #i2c_speed: # La vitesse I2C (en Hz) à utiliser lors de la communication avec le périphérique. # L'implémentation de Klipper pour la plupart des micro-contrôleurs est codée en dur à 100000, # modifier cette valeur n'a aucun effet. La valeur par défaut est 100000.

source: Klipper includes definitions for many types of temperature sensors. These sensors may be used in any config section that requires a temperature sensor (such as an `[extruder]` or `[heater_bed]` section).
fr: Klipper inclut les définitions de nombreux types de capteurs de température. Ces capteurs peuvent être utilisés dans n'importe quelle section de la configuration nécessitant un capteur de température (comme une section `[extruder]` ou `[heater_bed]`).
zh_hans: Klipper内置了许多类型的温度传感器的定义。这些传感器可用于任何需要温度传感器的配置分段（如`[extruder]` 或`[heater_bed]` 分段）。

source: [printer] kinematics: # The type of printer in use. This option may be one of: cartesian, # corexy, corexz, hybrid_corexy, hybrid_corexz, rotary_delta, delta, # deltesian, polar, winch, or none. This parameter must be specified. max_velocity: # Maximum velocity (in mm/s) of the toolhead (relative to the # print). This parameter must be specified. max_accel: # Maximum acceleration (in mm/s^2) of the toolhead (relative to the # print). This parameter must be specified. #max_accel_to_decel: # A pseudo acceleration (in mm/s^2) controlling how fast the # toolhead may go from acceleration to deceleration. It is used to # reduce the top speed of short zig-zag moves (and thus reduce # printer vibration from these moves). The default is half of # max_accel. #square_corner_velocity: 5.0 # The maximum velocity (in mm/s) that the toolhead may travel a 90 # degree corner at. A non-zero value can reduce changes in extruder # flow rates by enabling instantaneous velocity changes of the # toolhead during cornering. This value configures the internal # centripetal velocity cornering algorithm; corners with angles # larger than 90 degrees will have a higher cornering velocity while # corners with angles less than 90 degrees will have a lower # cornering velocity. If this is set to zero then the toolhead will # decelerate to zero at each corner. The default is 5mm/s.
fr: [printer] kinematics: # Le type d'imprimante utilisé. Cette option peut être l'une des suivantes : cartésienne, # corexy, corexz, hybrid_corexy, hybrid_corexz, rotary_delta, delta, # deltesian, polar, winch, ou none. Ce paramètre doit être spécifié. max_velocity: # Vitesse maximale (en mm/s) de la tête d'outil (par rapport à l'impression). # Ce paramètre doit être spécifié. max_accel: # Accélération maximale (en mm/s^2) de la tête de l'outil (par rapport à l'impression). # Ce paramètre doit être spécifié. #max_accel_to_decel: # Une pseudo-accélération (en mm/s^2) contrôlant la vitesse à laquelle la tête # de l'outil peut passer de l'accélération à la décélération. Elle est utilisée pour # réduire la vitesse maximale des courts mouvements en zigzag (et donc réduire les vibrations # de l'imprimante dues à ces mouvements). La valeur par défaut est la moitié de # max_accel. #square_corner_velocity: 5.0 # La vitesse maximale (en mm/s) à laquelle la tête d'outil peut parcourir un angle de 90 degrés. # Une valeur non nulle peut réduire les changements dans les débits de l'extrudeuse en permettant # des changements de vitesse instantanés de la tête d'outil pendant les virages. # Cette valeur configure l'algorithme interne de prise de virage à vitesse centripète ; les virages dont # l'angle est supérieur à 90 degrés auront une vitesse de prise de virage plus élevée tandis que # les angles inférieurs à 90 degrés auront une vitesse de virage plus faible. # Si ce paramètre est défini sur zéro, la tête d'outil décélérera jusqu'à zéro à chaque coin. # La valeur par défaut est 5mm/s.
zh_hans: [printer] kinematics: # 使用的打印机类型。此选项可以是以下之一：cartesian， # corexy, corexz, hybrid_corexy, hybrid_corexz, rotary_delta, delta， # deltesian, polar, winch, 或 none。必须指定此参数。 max_velocity: # 工具头的最大速度（以mm/s计）。相对于打印件。 # 必须指定此参数。 max_accel: # 工具头的最大加速度（以mm/s^2计）。相对于打印件。 # 必须指定此参数。 #max_accel_to_decel: # 一种伪加速度（以mm/s^2计），控制工具头从加速到减速的速度。 # 它用于降低短距离锯齿形移动的最高速度（从而减少这些移动造成 # 的打印机振动）。 # 默认值是max_accel的一半。 #square_corner_velocity: 5.0 # 工具头可能以90度角度转角的最大速度（以mm/s计）。一个非零值 # 可以通过在转角时使工具头的速度瞬时改变，来减少挤出机流速的 # 变化。此值配置内部向心速度转角算法；大于90度的角度会有更高的 # 转角速度，而小于90度的角度会有较低的转角速度。如果此值设置为零， # 则工具头在每个角落都将减速到零。 # 默认值是5mm/s。

source: Deltesian Kinematics
fr: Cinématique deltesienne
zh_hans: Delta 运动学

source: See [example-deltesian.cfg](../config/example-deltesian.cfg) for an example deltesian kinematics config file.
fr: Voir [example-deltesian.cfg](../config/example-deltesian.cfg) pour un exemple de fichier de configuration de cinématique deltesienne.
zh_hans: 参见[example-deltesian.cfg](.../config/example-deltesian.cfg)，以了解三角洲运动学配置文件实例。

source: Only parameters specific to deltesian printers are described here - see [common kinematic settings](#common-kinematic-settings) for available parameters.
fr: Seuls les paramètres spécifiques aux imprimantes deltesiennes sont décrits ici - voir [paramètres cinématiques communs](#common-kinematic-settings) pour les paramètres disponibles.
zh_hans: 这里只描述了特定于deltesian打印机的参数 - 有关可用参数，请参见[常见运动学设置](#common-kinematic-settings)。

source: [printer] kinematics: deltesian max_z_velocity: # For deltesian printers, this limits the maximum velocity (in mm/s) of # moves with z axis movement. This setting can be used to reduce the # maximum speed of up/down moves (which require a higher step rate # than other moves on a deltesian printer). The default is to use # max_velocity for max_z_velocity. #max_z_accel: # This sets the maximum acceleration (in mm/s^2) of movement along # the z axis. Setting this may be useful if the printer can reach higher # acceleration on XY moves than Z moves (eg, when using input shaper). # The default is to use max_accel for max_z_accel. #minimum_z_position: 0 # The minimum Z position that the user may command the head to move # to. The default is 0. #min_angle: 5 # This represents the minimum angle (in degrees) relative to horizontal # that the deltesian arms are allowed to achieve. This parameter is # intended to restrict the arms from becomming completely horizontal, # which would risk accidental inversion of the XZ axis. The default is 5. #print_width: # The distance (in mm) of valid toolhead X coordinates. One may use # this setting to customize the range checking of toolhead moves. If # a large value is specified here then it may be possible to command # the toolhead into a collision with a tower. This setting usually # corresponds to bed width (in mm). #slow_ratio: 3 # The ratio used to limit velocity and acceleration on moves near the # extremes of the X axis. If vertical distance divided by horizontal # distance exceeds the value of slow_ratio, then velocity and # acceleration are limited to half their nominal values. If vertical # distance divided by horizontal distance exceeds twice the value of # the slow_ratio, then velocity and acceleration are limited to one # quarter of their nominal values. The default is 3. # The stepper_left section is used to describe the stepper controlling # the left tower. This section also controls the homing parameters # (homing_speed, homing_retract_dist) for all towers. [stepper_left] position_endstop: # Distance (in mm) between the nozzle and the bed when the nozzle is # in the center of the build area and the endstops are triggered. This # parameter must be provided for stepper_left; for stepper_right this # parameter defaults to the value specified for stepper_left. arm_length: # Length (in mm) of the diagonal rod that connects the tower carriage to # the print head. This parameter must be provided for stepper_left; for # stepper_right, this parameter defaults to the value specified for # stepper_left. arm_x_length: # Horizontal distance between the print head and the tower when the # printers is homed. This parameter must be provided for stepper_left; # for stepper_right, this parameter defaults to the value specified for # stepper_left. # The stepper_right section is used to desribe the stepper controlling the # right tower. [stepper_right] # The stepper_y section is used to describe the stepper controlling # the Y axis in a deltesian robot. [stepper_y]
fr: [printer] kinematics: deltesian max_z_velocity: # Pour les imprimantes deltesiennes, ceci limite la vitesse maximale (en mm/s) des # déplacements avec un mouvement sur l'axe z. Ce paramètre peut être utilisé pour réduire la # vitesse maximale des déplacements vers le haut/bas (qui nécessitent un taux de pas plus élevé # que les autres mouvements sur une imprimante deltesienne). La valeur par défaut est d'utiliser # max_velocity pour max_z_velocity. #max_z_accel: # Ceci définit l'accélération maximale (en mm/s^2) du mouvement le long de l'axe z. # Ce paramètre peut être utile si l'imprimante peut atteindre une plus grande # accélération plus élevée sur les mouvements XY que sur les mouvements Z (par exemple, lors # de l'utilisation de la compensation de la résonance). # La valeur par défaut est d'utiliser max_accel pour max_z_accel. #minimum_z_position : 0 # Position Z minimale à laquelle l'utilisateur peut ordonner à la tête de se déplacer. # La valeur par défaut est 0. #min_angle: 5 # Ceci représente l'angle minimum (en degrés) par rapport à l'horizontale # que les bras deltesiens sont autorisés à atteindre. Ce paramètre est # destiné à empêcher les bras de devenir complètement horizontaux, # ce qui risquerait de provoquer une inversion accidentelle de l'axe XZ. # La valeur par défaut est 5. #print_width: # La distance (en mm) des coordonnées X valides de la tête de l'outil. On peut utiliser # ce paramètre pour personnaliser la vérification de la plage des mouvements de la tête de # l'outil. Si une grande valeur est spécifiée ici, il peut être possible de faire entrer # la tête de l'outil en collision avec une colonne. Ce paramètre correspond généralement # à la largeur du banc (en mm). #slow_ratio: 3 # Rapport utilisé pour limiter la vitesse et l'accélération des mouvements proches des extrêmes # extrêmes de l'axe X. Si la distance verticale divisée par la distance horizontale # dépasse la valeur de slow_ratio, la vitesse et l'accélération sont limitées à la moitié de leur # valeur nominale. Si la distance verticale divisée par la distance horizontale dépasse deux fois # la valeur de slow_ratio, alors la vitesse et l'accélération sont limitées à un quart de leurs # valeurs nominales. La valeur par défaut est 3. # La section stepper_left est utilisée pour décrire le moteur pas à pas contrôlant la colonne gauche. # Cette section contrôle également les paramètres d'orientation (homing_speed, homing_retract_dist) # pour toutes les colonnes. [stepper_left] position_endstop: # Distance (en mm) entre la buse et le lit lorsque la buse se trouve au centre de la zone de construction. # Ce paramètre doit être fourni pour stepper_left ; pour le paramètre stepper_right ce paramètre prend # par défaut la valeur spécifiée pour stepper_left. arm_length: # Longueur (en mm) de la tige diagonale qui relie le chariot de la colonne à la tête d'impression. Ce # paramètre doit être fourni pour stepper_left. Pour le paramètre stepper_right, ce paramètre prend par # défaut la valeur spécifiée pour stepper_left. arm_x_length: # Distance horizontale entre la tête d'impression et la colonne lorsque l'imprimante est mise à l'origine. # Ce paramètre doit être fourni pour stepper_left ; pour stepper_right, ce paramètre prend par défaut # la valeur spécifiée pour stepper_left. # La section stepper_right est utilisée pour décrire le moteur pas à pas contrôlant la colonne de droite. [stepper_right] # La section stepper_y est utilisée pour décrire le moteur pas à pas contrôlant l'axe Y d'un robot deltesien. [stepper_y]
