Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Config_Reference.po
Languages: fr, zh_hans

source: This document is a reference for options available in the Klipper config file.
fr: Ce document est la référencedes options disponibles dans le fichier de configuration de Klipper.
zh_hans: 本文档是 Klipper 配置文件中可用配置分段的参考。

source: The descriptions in this document are formatted so that it is possible to cut-and-paste them into a printer config file. See the [installation document](Installation.md) for information on setting up Klipper and choosing an initial config file.
fr: Les descriptions de ce document sont formatées de manière à ce qu'il soit possible de les copier-coller dans un fichier de configuration d'imprimante. Consultez le [document d'installation](Installation.md) pour obtenir des informations sur la configuration de Klipper et le choix d'un fichier de configuration initial.
zh_hans: 本文档中的描述已经格式化，以便可以将它们剪切并粘贴到打印机配置文件中。 见 [安装文档](Installation.md) 有关设置 Klipper 和选择初始配置文件的信息。

source: Micro-controller configuration
fr: Configuration du microcontrôleur
zh_hans: 微控制器配置

source: Format of micro-controller pin names
fr: Format du nom des broches du microcontrôleur
zh_hans: 微控制器引脚名字的格式

source: Many config options require the name of a micro-controller pin. Klipper uses the hardware names for these pins - for example `PA4`.
fr: De nombreuses options de configuration nécessitent le nom d'une broche du micro-contrôleur. Klipper utilise les noms matériel pour ces broches - par exemple `PA4`.
zh_hans: 许多配置选项需要微控制器引脚的名称。Klipper 使用了这些引脚的硬件名称 - 例如`PA4`。

source: Pin names may be preceded by `!` to indicate that a reverse polarity should be used (eg, trigger on low instead of high).
fr: Les noms des broches peuvent être précédés de `!` pour indiquer qu'une polarité inverse doit être utilisée (par exemple, déclencher sur le bas au lieu du haut).
zh_hans: 在 引脚名称前加 `!`来表示相反的电极极性（ 例如触发条件时低电平而不是高电平）。

source: Input pins may be preceded by `^` to indicate that a hardware pull-up resistor should be enabled for the pin. If the micro-controller supports pull-down resistors then an input pin may alternatively be preceded by `~`.
fr: Les broches d'entrée peuvent être précédées de `^` pour indiquer qu'une résistance pull-up matérielle doit être activée pour cette broche. Si le micro-contrôleur supporte les résistances pull-down, une broche d'entrée peut également être précédée de `~`.
zh_hans: 在引脚名称前面加 `^` ，以指示该引脚启用硬件上拉电阻。如果微控制器支持下拉电阻器，那么输入引脚也可以在前面加上`~`。

source: Note, some config sections may "create" additional pins. Where this occurs, the config section defining the pins must be listed in the config file before any sections using those pins.
fr: Notez que certaines sections de configuration peuvent "créer" des broches supplémentaires. Lorsque cela se produit, la section de configuration définissant les broches doit être répertoriée dans le fichier de configuration avant toute section utilisant ces broches.
zh_hans: 注意，某些配置部分可能会“创建”额外的引脚。 如果发生这种情况，定义引脚的配置部分必须在使用这些引脚的任何部分之前列在配置文件中。

source: Configuration of the primary micro-controller.
fr: Configuration du microcontrôleur primaire.
zh_hans: 主微控制器的配置。

source: Additional micro-controllers (one may define any number of sections with an "mcu" prefix). Additional micro-controllers introduce additional pins that may be configured as heaters, steppers, fans, etc.. For example, if an "[mcu extra_mcu]" section is introduced, then pins such as "extra_mcu:ar9" may then be used elsewhere in the config (where "ar9" is a hardware pin name or alias name on the given mcu).
fr: Microcontrôleurs supplémentaires (on peut définir un nombre quelconque de sections avec un préfixe "mcu"). Les microcontrôleurs supplémentaires introduisent des broches additionnelles pouvant être configurées comme des éléments de chauffage, des pilotes moteurs, des ventilateurs, etc. Par exemple, si une section "[mcu extra_mcu]" est ajoutée, des broches telles que "extra_mcu:ar9" pourront être utilisées ailleurs dans la configuration (où "ar9" est un nom de broche matérielle ou un nom d'alias sur le mcu donné).
zh_hans: 额外的微控制器（可以定义任意数量的带有“mcu”前缀的部分）。 额外的微控制器引入了额外的引脚，这些引脚可以配置为加热器、步进器、风扇等。例如，如果引入了“[mcu extra_mcu]”部分，那么诸如“extra_mcu:ar9”之类的引脚就可以在其他地方使用 ，在配置中（其中“ar9”是给定 mcu 上的硬件引脚名称或别名）。

source: Common kinematic settings
fr: Paramètres cinématiques courants
zh_hans: 常见的运动学设置

source: The printer section controls high level printer settings.
fr: La section imprimante contrôle les paramètres de haut niveau de l'imprimante.
zh_hans: 打印机控制的高级设置部分。

source: Stepper motor definitions. Different printer types (as specified by the "kinematics" option in the [printer] config section) require different names for the stepper (eg, `stepper_x` vs `stepper_a`). Below are common stepper definitions.
fr: Définitions des pilotes de moteurs pas à pas. Différents types d'imprimantes (comme spécifié par l'option "kinematics" dans la section [printer]) requièrent différents noms pour le moteur pas à pas (par exemple, `stepper_x` vs `stepper_a`). Ci-dessous, vous trouverez les définitions les plus courantes.
zh_hans: 步进电机定义。 不同的打印机类型（由 [打印] 配置部分中的“运动学”选项指定）步进器需要定义不同的名称（例如，`stepper_x` 与 `stepper_a`）。 以下是常见的步进器定义。

source: Cartesian Kinematics
fr: Cinématique cartésienne
zh_hans: 笛卡尔运动学

source: See [example-cartesian.cfg](../config/example-cartesian.cfg) for an example cartesian kinematics config file.
fr: Voir [example-cartesian.cfg](../config/example-cartesian.cfg) pour un exemple de fichier de configuration de cinématique cartésienne.
zh_hans: cartesian 运动学配置文件参考[example-cartesian.cfg](../config/example-cartesian.cfg)

source: Only parameters specific to cartesian printers are described here - see [common kinematic settings](#common-kinematic-settings) for available parameters.
fr: Seuls les paramètres spécifiques aux imprimantes cartésiennes sont décrits ici - voir [paramètres cinématiques communs](#common-kinematic-settings) pour les paramètres disponibles.
zh_hans: 此处描述的参数只适用于笛卡尔打印机，有关可用参数，请参阅 [常用运动设置](#common-kinematic-settings)。

source: Linear Delta Kinematics
fr: Cinématique Delta linéaire
zh_hans: 线性三角洲运动学

source: See [example-delta.cfg](../config/example-delta.cfg) for an example linear delta kinematics config file. See the [delta calibrate guide](Delta_Calibrate.md) for information on calibration.
fr: Voir [example-delta.cfg](../config/example-delta.cfg) pour un exemple de fichier de configuration de cinématique delta linéaire. Voir le [guide de calibrage delta](Delta_Calibrate.md) pour des informations sur le calibrage.
zh_hans: linear delta运动学配置文件参考[example-delta.cfg](../config/example-delta.cfg)。 关于校准方法 [三角洲校准指南](Delta_Calibrate.md)。

source: Only parameters specific to linear delta printers are described here - see [common kinematic settings](#common-kinematic-settings) for available parameters.
fr: Seuls les paramètres spécifiques aux imprimantes delta linéaires sont décrits ici - voir [paramètres cinématiques communs](#common-kinematic-settings) pour les paramètres disponibles.
zh_hans: 此处仅描述了线性三角洲打印机的特定参数 - 有关可用参数，请参阅 [常用运动设置](#common-kinematic-settings)。

source: CoreXY Kinematics
fr: Cinématique CoreXY
zh_hans: CoreXY 运动学

source: See [example-corexy.cfg](../config/example-corexy.cfg) for an example corexy (and h-bot) kinematics file.
fr: Voir [example-corexy.cfg](../config/example-corexy.cfg) pour un exemple de fichier cinématique corexy (et h-bot).
zh_hans: corexy或者h-bot运动学配置文件参考[example-corexy.cfg](./config/example-corexy.cfg)

source: Only parameters specific to corexy printers are described here - see [common kinematic settings](#common-kinematic-settings) for available parameters.
fr: Seuls les paramètres spécifiques aux imprimantes corexy sont décrits ici - voir [paramètres cinématiques communs](#common-kinematic-settings) pour les paramètres disponibles.
zh_hans: 这里只描述了 CoreXY 打印机特有的参数 -- 有关可用参数，请参阅 [常见运动学设置](#common-kinematic-settings)。

source: CoreXZ Kinematics
fr: Cinématique CoreXZ
zh_hans: CoreXY 运动学

source: See [example-corexz.cfg](../config/example-corexz.cfg) for an example corexz kinematics config file.
fr: Voir [example-corexz.cfg](../config/example-corexz.cfg) pour un exemple de fichier de configuration de cinématique corexz.
zh_hans: corexz 运动学配置文件参考[example-corexz.cfg](../config/example-corexz.cfg)

source: Only parameters specific to corexz printers are described here - see [common kinematic settings](#common-kinematic-settings) for available parameters.
fr: Seuls les paramètres spécifiques aux imprimantes corexz sont décrits ici - voir [paramètres cinématiques communs](#common-kinematic-settings) pour les paramètres disponibles.
zh_hans: 此处描述的参数只适用于笛卡尔打印机—有关全部可用参数，请参阅 [常用的运动学设置](#common-kinematic-settings)。

source: Hybrid-CoreXY Kinematics
fr: Cinématique Hybride-CoreXY
zh_hans: Hybrid-CoreXY (混合型 CoreXY) 运动学

source: See [example-hybrid-corexy.cfg](../config/example-hybrid-corexy.cfg) for an example hybrid corexy kinematics config file.
fr: Voir [example-hybrid-corexy.cfg](../config/example-hybrid-corexy.cfg) pour un exemple de fichier de configuration de cinématique hybride corexy.
zh_hans: hybrid corexy运动学配置文件参考[example-hybrid-corexy.cfg](../config/example-hybrid-corexy.cfg)

source: This kinematic is also known as Markforged kinematic.
fr: Cette cinématique est également connue sous le nom de cinématique Markforged.
zh_hans: 该运动学也称为 Markforged 运动学。

source: Only parameters specific to hybrid corexy printers are described here see [common kinematic settings](#common-kinematic-settings) for available parameters.
fr: Seuls les paramètres spécifiques aux imprimantes hybrides corexy sont décrits ici ; voir [paramètres cinématiques communs](#common-kinematic-settings) pour les paramètres disponibles.
zh_hans: 此处仅描述了线性三角洲打印机的特定参数—有关全部可用参数，请参阅 [常用的运动学设置](#common-kinematic-settings)。

source: Hybrid-CoreXZ Kinematics
fr: Cinématique Hybride-CoreXZ
zh_hans: Hybrid-CoreXZ (混合型 CoreXZ) 运动学

source: See [example-hybrid-corexz.cfg](../config/example-hybrid-corexz.cfg) for an example hybrid corexz kinematics config file.
fr: Voir [example-hybrid-corexz.cfg](../config/example-hybrid-corexz.cfg) pour un exemple de fichier de configuration de cinématique hybride corexz.
zh_hans: hybrid corexz 运动学配置文件参考 [example-hybrid-corexz.cfg](../config/example-hybrid-corexz.cfg)

source: Polar Kinematics
fr: Cinématique polaire
zh_hans: 极坐标运动学

source: See [example-polar.cfg](../config/example-polar.cfg) for an example polar kinematics config file.
fr: Voir [example-polar.cfg](../config/example-polar.cfg) pour un exemple de fichier de configuration de cinématique polaire.
zh_hans: polar运动学配置文件参考 [example-polar.cfg](../config/example-polar.cfg)

source: Only parameters specific to polar printers are described here - see [common kinematic settings](#common-kinematic-settings) for available parameters.
fr: Seuls les paramètres spécifiques aux imprimantes polaires sont décrits ici - voir [paramètres cinématiques communs](#common-kinematic-settings) pour les paramètres disponibles.
zh_hans: 这里只描述了极地打印机特有的参数—全部可用的参数请见[常用的运动学设置](#common-kinematic-settings)。

source: Rotary delta Kinematics
fr: Cinématique rotative delta
zh_hans: Rotary delta 运动学

source: See [example-rotary-delta.cfg](../config/example-rotary-delta.cfg) for an example rotary delta kinematics config file.
fr: Voir [example-rotary-delta.cfg](../config/example-rotary-delta.cfg) pour un exemple de fichier de configuration de cinématique rotative delta.
zh_hans: Rotary Delta运动学配置文件参考[example-rotary-delta.cfg](../config/example-rotary-delta.cfg)

source: Only parameters specific to rotary delta printers are described here - see [common kinematic settings](#common-kinematic-settings) for available parameters.
fr: Seuls les paramètres spécifiques aux imprimantes rotatives delta sont décrits ici - voir [paramètres cinématiques communs](#common-kinematic-settings) pour les paramètres disponibles.
zh_hans: 此处仅介绍特定于旋转三角洲打印机的参数—有关可用参数，请参阅[常用的运动学设置](#common-kinematic-settings)。

source: ROTARY DELTA KINEMATICS ARE A WORK IN PROGRESS. Homing moves may timeout and some boundary checks are not implemented.
fr: LA CINÉMATIQUE ROTATIVE DELTA EST UN TRAVAIL EN COURS. Les mouvements d'orientation peuvent dépasser le temps imparti et certains contrôles de limites ne sont pas implémentés.
zh_hans: ROTARY DELTA运动学正在进行的修复工作。归位动作可能会超时并且一些边界检查也没有实现。

source: Cable winch Kinematics
fr: Cinématique du treuil à câble
zh_hans: 缆绳绞盘运动学

source: See the [example-winch.cfg](../config/example-winch.cfg) for an example cable winch kinematics config file.
fr: Voir le fichier [example-winch.cfg](../config/example-winch.cfg) pour un exemple de fichier de configuration cinématique d'un treuil à câble.
zh_hans: 有关缆绳绞盘运动学配置文件的例子，参见[example-winch.cfg](./config/example-winch.cfg)。

source: Only parameters specific to cable winch printers are described here - see [common kinematic settings](#common-kinematic-settings) for available parameters.
fr: Seuls les paramètres spécifiques aux imprimantes à treuil sont décrits ici - voir [paramètres cinématiques communs](#common-kinematic-settings) pour les paramètres disponibles.
zh_hans: 这里只描述了缆绳铰盘式(cable winch)打印机特有的参数 — 全部可用的参数见[常用的运动学设置](#common-kinematic-settings)。

source: None Kinematics
fr: Aucune cinématique
zh_hans: 无运动学

source: It is possible to define a special "none" kinematics to disable kinematic support in Klipper. This may be useful for controlling devices that are not typical 3d-printers or for debugging purposes.
fr: Il est possible de définir une cinématique particulière "aucune (none)" pour désactiver le support cinématique dans Klipper. Cela peut être utile pour contrôler des périphériques qui ne sont pas des imprimantes 3D typiques ou encore à des fins de débogage.
zh_hans: 可以定义特殊的 "none" 运动学来禁用 Klipper 中的运动学支持。可以用于控制不是 3D 打印机的设备或调试。

source: Common extruder and heated bed support
fr: Extrudeur commun et support du lit chauffant
zh_hans: 常见的挤出机和热床支持

source: The heater_bed section describes a heated bed. It uses the same heater settings described in the "extruder" section.
fr: La section heater_bed concerne le lit chauffant. Elle utilise les mêmes paramètres de chauffage que ceux décrits dans la section "extrudeuse".
zh_hans: heater_bed分段定义了一个热床。它有和“extruder”分段的加热器设置选项。

source: Bed level support
fr: Support du nivelage du lit
zh_hans: 打印床调平支持

source: Mesh Bed Leveling. One may define a bed_mesh config section to enable move transformations that offset the z axis based on a mesh generated from probed points. When using a probe to home the z-axis, it is recommended to define a safe_z_home section in printer.cfg to home toward the center of the print area.
fr: Nivelage du maillage du lit. On peut définir une section de configuration bed_mesh pour activer les transformations de déplacement qui décalent l'axe z en fonction d'un maillage généré à partir de points sondés. Lorsqu'on utilise une sonde pour définir l'origine de l'axe z, il est recommandé de définir une section safe_z_home dans printer.cfg pour réaliser cette mise à l'origine au centre de la zone d'impression.
zh_hans: 网床调平。定义一个 bed_mesh 配置分段来启用基于探测点生成网格的 Z 轴偏移移动变换。当使用探针归位 Z 轴时，建议通过 printer.cfg 中定义一个 safe_z_home 分段使 Z 轴归位在打印区域的中心执行。

source: Visual Examples:
fr: Exemples visuels :
zh_hans: 可视化示例：

source: Bed tilt compensation. One may define a bed_tilt config section to enable move transformations that account for a tilted bed. Note that bed_mesh and bed_tilt are incompatible; both cannot be defined.
fr: Compensation de l'inclinaison du lit. On peut définir une section de configuration bed_tilt pour activer les transformations de déplacement tenant compte d'un lit incliné. Notez que bed_mesh et bed_tilt sont incompatibles ; les deux ne peuvent pas être définis en même temps.
zh_hans: 打印床倾斜补偿。可以定义一个 bed_tilt 配置分段来启用移动变换倾斜打印床补偿。请注意，bed_mesh 和 bed_tilt 不兼容：两者无法同时被定义。

source: Tool to help adjust bed leveling screws. One may define a [bed_screws] config section to enable a BED_SCREWS_ADJUST g-code command.
fr: Outil d'aide au réglage des vis de mise à niveau du lit. On peut définir une section de configuration [bed_screws] pour activer une commande g-code BED_SCREWS_ADJUST.

source: Tool to help adjust bed screws tilt using Z probe. One may define a screws_tilt_adjust config section to enable a SCREWS_TILT_CALCULATE g-code command.
fr: Outil d'aide au réglage de l'inclinaison des vis du lit à l'aide du palpeur Z. On peut définir une section de configuration screws_tilt_adjust pour activer une commande g-code SCREWS_TILT_CALCULATE.

source: Moving gantry leveling using 4 independently controlled Z motors. Corrects hyperbolic parabola effects (potato chip) on moving gantry which is more flexible. WARNING: Using this on a moving bed may lead to undesirable results. If this section is present then a QUAD_GANTRY_LEVEL extended G-Code command becomes available. This routine assumes the following Z motor configuration:
fr: Mise à niveau du portique mobile à l'aide de 4 moteurs Z contrôlés indépendamment. Corrige les effets de paraboles hyperboliques (chips de pommes de terre) sur le portique mobile qui est plus flexible. AVERTISSEMENT : L'utilisation de cette section sur un lit mobile peut conduire à des résultats indésirables. Si cette section est présente, une commande G-Code étendue QUAD_GANTRY_LEVEL devient disponible. Cette routine suppose la configuration suivante du moteur Z :
zh_hans: 调平使用4个独立Z轴电机的动龙门。纠正动龙门架由于龙门活动性造成的双曲抛物线效应（薯片形）。警告：在移动打印床上使用该功能可能会导致不理想的结果。如果该分段存在，可以使用 QUAD_GANTRY_LEVEL 扩展G代码命令。该程序假定Z轴电机配置如下：

source: Customized homing
fr: Mise à l'origine personnalisée
zh_hans: 自定义归零

source: Homing override. One may use this mechanism to run a series of g-code commands in place of a G28 found in the normal g-code input. This may be useful on printers that require a specific procedure to home the machine.
fr: Homing override. On peut utiliser ce mécanisme pour exécuter une série de commandes g-code à la place d'un G28 trouvé dans l'entrée g-code normale. Cela peut être utile sur les imprimantes qui nécessitent une procédure spécifique du retour au point d'origine de la machine.
zh_hans: 归位覆写。可以使用这种机制来运行一系列 G-Code 命令来替代常规的G28。通常用于需要特定过程才能将机器归零的打印机。

source: Stepper phase adjusted endstops. To use this feature, define a config section with an "endstop_phase" prefix followed by the name of the corresponding stepper config section (for example, "[endstop_phase stepper_z]"). This feature can improve the accuracy of endstop switches. Add a bare "[endstop_phase]" declaration to enable the ENDSTOP_PHASE_CALIBRATE command.
fr: Interrupteurs de fin de course ajustés à la phase du pilote de moteur pas à pas. Pour utiliser cette fonction, définissez une section de configuration avec un préfixe "endstop_phase" suivi du nom de la section de configuration du pilote de moteur pas à pas correspondante (par exemple, "[endstop_phase stepper_z]"). Cette fonctionnalité peut améliorer la précision des interrupteurs de fin de course. Ajouter une déclaration nue "[endstop_phase]" pour activer la commande ENDSTOP_PHASE_CALIBRATE.
zh_hans: 步进器相位调整限位（Stepper phase adjusted endstops）。要使用这个功能，需要定义一个配置部分，其前缀为 "endstop_phase"，后面是相应的步进配置部分的名称（例如，"[endstop_phase stepper_z]"）。这个功能可以提高限位开关的准确性。在配置文件添加"[endstop_phase]"的参数以启用ENDSTOP_PHASE_CALIBRATE命令。

source: G-Code macros and events
fr: Macros et événements G-Code
zh_hans: G 代码宏和事件

source: G-Code macros (one may define any number of sections with a "gcode_macro" prefix). See the [command template guide](Command_Templates.md) for more information.
fr: Macros G-Code (on peut définir un nombre quelconque de sections avec le préfixe "gcode_macro"). Voir le [guide des modèles de commande](Command_Templates.md) pour plus d'informations.
zh_hans: G-Code宏（"gcode_macro"前缀定义的G-Code 宏分段没有数量限制）。更多信息请参见[命令模板指南](Command_Templates.md)。

source: Idle timeout. An idle timeout is automatically enabled - add an explicit idle_timeout config section to change the default settings.
fr: Délai d'inactivité. Un délai d'inactivité est automatiquement activé - ajoutez une section de configuration idle_timeout explicite pour modifier les paramètres par défaut.
zh_hans: 空闲超时。默认启用空闲超时 - 添加显式 idle_timeout 配置分段以更改默认设置。

source: Optional G-Code features
fr: Fonctionnalités optionnelles du G-code
zh_hans: 可选的 G-Code 特性

source: A virtual sdcard may be useful if the host machine is not fast enough to run OctoPrint well. It allows the Klipper host software to directly print gcode files stored in a directory on the host using standard sdcard G-Code commands (eg, M24).
fr: Une carte SD virtuelle peut être utile si la machine hôte n'est pas assez rapide pour faire fonctionner OctoPrint correctement. Elle permet au logiciel hôte Klipper d'imprimer directement les fichiers gcode stockés dans un répertoire sur l'hôte en utilisant les commandes G-Code standard de la carte SD (par exemple, M24).
zh_hans: 如果主机的速度不足以很好地运行 OctoPrint，虚拟 SD 卡可能有帮助。它允许 Klipper 主机软件使用标准的 SD 卡G代码命令（例如，M24）直接打印存储在主机目录中的 gcode 文件。

source: Some printers with stage-clearing features, such as a part ejector or a belt printer, can find use in looping sections of the sdcard file. (For example, to print the same part over and over, or repeat the a section of a part for a chain or other repeated pattern).
fr: Certaines imprimantes dotées de fonctions d'éjections des pièces imprimées, comme un éjecteur de pièces ou une imprimante à courroie, peuvent trouver une utilité dans la mise en boucle de sections du fichier de la carte SD (par exemple, pour imprimer la même pièce encore et encore, ou répéter une section d'une pièce pour une chaîne ou un autre motif répété).
zh_hans: 一些具有阶段清空功能的打印机，如打印件移除器或带式打印机，可以找到并使用sdcard文件中循环部分。(例如，重复打印同一个零件，或者重复一个零件的某一节，以形成连锁或其他重复模式）。

source: Support for gcode arc (G2/G3) commands.
fr: Support des commandes gcode de courbes (arc) (G2/G3).
zh_hans: 支持G代码弧线(G2/G3)命令。

source: Resonance compensation
fr: Compensation de la résonance
zh_hans: 共振补偿

source: Config file helpers
fr: Assistants de fichiers de configuration
zh_hans: 配置文件助手

source: Board pin aliases (one may define any number of sections with a "board_pins" prefix). Use this to define aliases for the pins on a micro-controller.
fr: Alias des broches de la carte (on peut définir un nombre quelconque de sections avec le préfixe "board_pins"). Utilisez ceci pour définir des alias de broches d'un micro-contrôleur.
zh_hans: 控制板引脚别名（可以定义任意数量的带有 "board_pins "前缀的分段）。用它来定义微控制器上的引脚的别名。

source: Include file support. One may include additional config file from the main printer config file. Wildcards may also be used (eg, "configs/*.cfg").
fr: Prise en charge de l'inclusion de fichiers. On peut inclure des fichiers de configuration supplémentaires à partir du fichier de configuration principal de l'imprimante. Les caractères génériques peuvent également être utilisés (par exemple, "configs/*.cfg").
zh_hans: 引入文件支持。可以在主打印机配置文件中引用额外的配置文件。支持通配符（例如，`configs/*.cfg`）。

source: Bed probing hardware
fr: Matériel de nivelage du lit
zh_hans: 热床探测硬件
