Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Config_Reference.po
Languages: fr, zh_hans

source: [printer] kinematics: hybrid_corexy max_z_velocity: # This sets the maximum velocity (in mm/s) of movement along the z # axis. The default is to use max_velocity for max_z_velocity. max_z_accel: # This sets the maximum acceleration (in mm/s^2) of movement along # the z axis. The default is to use max_accel for max_z_accel. # The stepper_x section is used to describe the X axis as well as the # stepper controlling the X-Y movement. [stepper_x] # The stepper_y section is used to describe the stepper controlling # the Y axis. [stepper_y] # The stepper_z section is used to describe the stepper controlling # the Z axis. [stepper_z]
fr: [printer] kinematics: hybrid_corexy max_z_velocity: # Ceci définit la vitesse maximale (en mm/s) du mouvement le long de l'axe z # La valeur par défaut est d'utiliser max_velocity pour max_z_velocity. max_z_acce : # Ceci définit l'accélération maximale (en mm/s^2) du mouvement le long de l'axe z. # La valeur par défaut est d'utiliser max_accel pour max_z_accel. # La section stepper_x est utilisée pour décrire l'axe X ainsi que le moteur pas à pas # contrôlant le mouvement X-Y. [stepper_x] # La section stepper_y est utilisée pour décrire le moteur pas à pas contrôlant # l'axe Y. [stepper_y] # La section stepper_z est utilisée pour décrire le moteur pas à pas contrôlant # l'axe Z. [stepper_z]
zh_hans: [printer] kinematics: hybrid_corexy max_z_velocity: # 定义了沿z轴运动的最大速度（单位：mm/s）。 # 默认使用使用max_velocity定义max_z_velocity。 max_z_accel: # 定义了沿Z轴运动的最大加速度(以mm/s^2为单位)。 # 默认使用max_accel定义max_z_accel。 # stepper_x分段用于描述X轴，以及控制X-Y运动的步进器。 [stepper_x] # stepper_y分段用于描述控制Y轴的步进器。 [stepper_y] # stepper_z分段用于描述控制Z轴的步进器。 [stepper_z]

source: [printer] kinematics: hybrid_corexz max_z_velocity: # This sets the maximum velocity (in mm/s) of movement along the z # axis. The default is to use max_velocity for max_z_velocity. max_z_accel: # This sets the maximum acceleration (in mm/s^2) of movement along # the z axis. The default is to use max_accel for max_z_accel. # The stepper_x section is used to describe the X axis as well as the # stepper controlling the X-Z movement. [stepper_x] # The stepper_y section is used to describe the stepper controlling # the Y axis. [stepper_y] # The stepper_z section is used to describe the stepper controlling # the Z axis. [stepper_z]
fr: [printer] kinematics: hybrid_corexz max_z_velocity: # Ceci définit la vitesse maximale (en mm/s) du mouvement le long de l'axe z # La valeur par défaut est d'utiliser max_velocity pour max_z_velocity. max_z_accel: # Ceci définit l'accélération maximale (en mm/s^2) du mouvement le long de # l'axe z. La valeur par défaut est d'utiliser max_accel pour max_z_accel. # La section stepper_x est utilisée pour décrire l'axe X ainsi que le moteur pas à pas # contrôlant le mouvement X-Z. [stepper_x] # La section stepper_y est utilisée pour décrire le moteur pas à pas contrôlant # l'axe Y. [stepper_y] # La section stepper_z est utilisée pour décrire le moteur pas à pas contrôlant # l'axe Z. [stepper_z]
zh_hans: [printer] kinematics: hybrid_corexz max_z_velocity: # 定义了沿z轴运动的最大速度（单位：mm/s）。 # 默认使用max_velocity定义max_z_velocity。 max_z_accel: # 定义了沿Z轴运动的最大加速度(以mm/s^2为单位)。 # 默认使用max_accel定义max_z_accel。 # stepper_x 分段描述了X轴，以及控制X-Z运动的步进器。 [stepper_x] # stepper_y分段描述了Y轴和控制Y轴的步进器。 [stepper_y] # stepper_z分段描述了Z轴和控制Z轴的步进器。 [stepper_z]

source: [printer] kinematics: rotary_delta max_z_velocity: # For delta printers this limits the maximum velocity (in mm/s) of # moves with z axis movement. This setting can be used to reduce the # maximum speed of up/down moves (which require a higher step rate # than other moves on a delta printer). The default is to use # max_velocity for max_z_velocity. #minimum_z_position: 0 # The minimum Z position that the user may command the head to move # to. The default is 0. shoulder_radius: # Radius (in mm) of the horizontal circle formed by the three # shoulder joints, minus the radius of the circle formed by the # effector joints. This parameter may also be calculated as: # shoulder_radius = (delta_f - delta_e) / sqrt(12) # This parameter must be provided. shoulder_height: # Distance (in mm) of the shoulder joints from the bed, minus the # effector toolhead height. This parameter must be provided. # The stepper_a section describes the stepper controlling the rear # right arm (at 30 degrees). This section also controls the homing # parameters (homing_speed, homing_retract_dist) for all arms. [stepper_a] gear_ratio: # A gear_ratio must be specified and rotation_distance may not be # specified. For example, if the arm has an 80 toothed pulley driven # by a pulley with 16 teeth, which is in turn connected to a 60 # toothed pulley driven by a stepper with a 16 toothed pulley, then # one would specify a gear ratio of "80:16, 60:16". This parameter # must be provided. position_endstop: # Distance (in mm) between the nozzle and the bed when the nozzle is # in the center of the build area and the endstop triggers. This # parameter must be provided for stepper_a; for stepper_b and # stepper_c this parameter defaults to the value specified for # stepper_a. upper_arm_length: # Length (in mm) of the arm connecting the "shoulder joint" to the # "elbow joint". This parameter must be provided for stepper_a; for # stepper_b and stepper_c this parameter defaults to the value # specified for stepper_a. lower_arm_length: # Length (in mm) of the arm connecting the "elbow joint" to the # "effector joint". This parameter must be provided for stepper_a; # for stepper_b and stepper_c this parameter defaults to the value # specified for stepper_a. #angle: # This option specifies the angle (in degrees) that the arm is at. # The default is 30 for stepper_a, 150 for stepper_b, and 270 for # stepper_c. # The stepper_b section describes the stepper controlling the rear # left arm (at 150 degrees). [stepper_b] # The stepper_c section describes the stepper controlling the front # arm (at 270 degrees). [stepper_c] # The delta_calibrate section enables a DELTA_CALIBRATE extended # g-code command that can calibrate the shoulder endstop positions. [delta_calibrate] radius: # Radius (in mm) of the area that may be probed. This is the radius # of nozzle coordinates to be probed; if using an automatic probe # with an XY offset then choose a radius small enough so that the # probe always fits over the bed. This parameter must be provided. #speed: 50 # The speed (in mm/s) of non-probing moves during the calibration. # The default is 50. #horizontal_move_z: 5 # The height (in mm) that the head should be commanded to move to # just prior to starting a probe operation. The default is 5.
fr: [printer] kinematics: rotary_delta max_z_velocity: # Pour les imprimantes delta, ceci limite la vitesse maximale (en mm/s) des déplacements avec un # mouvement sur l'axe z. Ce paramètre peut être utilisé pour réduire la vitesse maximale des # mouvements de montée/descente (qui nécessitent un taux de pas plus élevé que les autres mouvements # sur une imprimante delta). La valeur par défaut est d'utiliser max_velocity pour max_z_velocity. #minimum_z_position: 0 # La position Z minimale à laquelle l'utilisateur peut ordonner à la tête de se déplacer. # l La valeur par défaut est 0. shoulder_radius: # Rayon (en mm) du cercle horizontal formé par les trois articulations de l'effecteur., moins le rayon du # cercle formé par l'articulation de l'effecteur.. # Ce paramètre peut également être calculé comme suit # shoulder_radius = (delta_f - delta_e) / sqrt(12) # Ce paramètre doit être fourni. shoulder_height: # Distance (en mm) des joints de l'effecteur.par rapport au lit, moins la hauteur de la tête de l'outil sur # l'effecteur. Ce paramètre doit être fourni. # La section stepper_a décrit le moteur pas à pas contrôlant le bras arrière droit (à 30 degrés). # Cette section contrôle également les paramètres de la mise à l'origine (homing_speed, # homing_retract_dist) pour tous les bras. [stepper_a] gear_ratio: # Un rapport de vitesse doit être spécifié et la rotation_distance ne peut pas être spécifiée. # Par exemple, si le bras a une poulie de 80 dents entraînée par une poulie de 16 dents, qui est à son # tour reliée à une poulie de 60 dents entraînée par un moteur pas à pas dont l'arbre est muni d'une poulie # à 16 dents, alors on spécifierait un rapport de vitesse de "80:16, 60:16". Ce paramètre # doit être fourni. position_endstop: # Distance (en mm) entre la buse et le lit lorsque la buse se trouve au centre de la zone de construction # et que la butée se déclenche. Ce paramètre doit être fourni pour le stepper_a ; pour le stepper_b et # le stepper_c, ce paramètre prend par défaut la valeur spécifiée pour stepper_a. upper_arm_length: # Longueur (en mm) du bras reliant l'"articulation de l'effecteur" à l'"articulation du coude". # Ce paramètre doit être fourni pour stepper_a ; pour stepper_b et stepper_c, ce paramètre prend par # défaut la valeur spécifiée pour stepper_a. lower_arm_length: # Longueur (en mm) du bras reliant l'"articulation du coude" à l'"articulation de l'effecteur". # Ce paramètre doit être fourni pour stepper_a ; pour stepper_b et stepper_c, ce paramètre prend # par défaut la valeur spécifiée pour stepper_a. #angle: # Cette option spécifie l'angle (en degrés) auquel se trouve le bras. # La valeur par défaut est 30 pour stepper_a, 150 pour stepper_b et 270 pour stepper_c. # La section stepper_b décrit le moteur pas à pas contrôlant le bras arrière gauche (à 150 degrés). [stepper_b] # La section stepper_c décrit le moteur pas à pas qui contrôle le bras avant (à 270 degrés). [stepper_c] # La section delta_calibrate active une commande G-code étendue DELTA_CALIBRATE permettant # de calibrer les positions de la butée de l'effecteur. [delta_calibrate] radius: # Rayon (en mm) de la zone pouvant être palpée. Il s'agit du rayon des coordonnées de palpage # de la buse; si vous utilisez un palpeur automatique avec un décalage XY, choisissez un rayon # suffisamment petit pour que la sonde s'adapte toujours au lit. Ce paramètre doit être fourni. #speed: 50 # La vitesse (en mm/s) des mouvements sans palpage pendant l'étalonnage. # La valeur par défaut est 50. #horizontal_move_z: 5 # La hauteur (en mm) à laquelle la tête doit être remontée pour se déplacer # juste avant de lancer une opération de palpage. La valeur par défaut est 5.
zh_hans: [打印机] kinematics: rotary_delta max_z_velocity: # 对于delta打印机，此设置限制了带有z轴移动的移动的最大速度（以 # mm/s为单位）。可以使用此设置来降低上下移动的最大速度（在 # delta打印机上，这些移动需要比其他移动更高的步进速率）。 # 默认max_z_velocity使用max_velocity。 #minimum_z_position: 0 # 用户可以命令头部移动到的最小Z位置。 # 默认为0。 shoulder_radius: # 三个肩部关节形成的水平圆的半径（以毫米为单位），减去效应器 # 关节形成的圆的半径。此参数也可以计算为： # shoulder_radius = (delta_f - delta_e) / sqrt(12) # 必须提供此参数。 shoulder_height: # 肩部关节与床之间的距离（以毫米为单位），减去效应器工具头高度。 # 必须提供此参数。 # stepper_a分段描述了控制后右臂（30度方位）的步进电机。此部分还控制 # 所有臂的归位参数（homing_speed，homing_retract_dist）。 [stepper_a] gear_ratio: # 必须指定一个gear_ratio，且可能不指定rotation_distance。例如，如果臂上 # 有一个80齿的滑轮，由16齿的滑轮驱动，该滑轮又连接到一个由16齿的步 # 进电机驱动的60齿滑轮，则应指定gear_ratio为"80:16, 60:16"。 # 必须提供此参数。 position_endstop: # 喷嘴在构建区域中心并触发终点开关时，喷嘴与床之间的距离（以毫米为 # 单位）。 # 必须为stepper_a提供此参数；对于stepper_b和stepper_c，此参数默认为 # stepper_a指定的值。 upper_arm_length: # 连接"肩部关节"和"肘部关节"的手臂的长度（以毫米为单位）。 # 必须为stepper_a提供此参数；对于stepper_b和stepper_c，此参数默认为 # stepper_a指定的值。 lower_arm_length: # 连接"肩部关节"和"效应器关节"的手臂的长度（以毫米为单位）。 # 必须为stepper_a提供此参数；对于stepper_b和stepper_c，此参数默认为 # stepper_a指定的值。 #angle: # 此选项指定手臂的角度（以度为单位）。 # 默认情况下，stepper_a为30度，stepper_b为150度，stepper_c为270度。 # stepper_b分段描述了控制后左臂（150度方位）的步进电机。 [stepper_b] # stepper_c分段描述了控制前臂（270度方位）的步进电机。 [stepper_c] # delta_calibrate分段启用了一个DELTA_CALIBRATE扩展G代码命令，可以 # 校准肩部终点位置。 [delta_calibrate] radius: # 可以探测的区域的半径（以毫米为单位）。这是要探测的喷嘴坐标的半径； # 如果使用带有XY偏移的自动探针，则选择一个半径足够小，以便探针总是 # 适合在床上。 # 必须提供此参数。 #speed: 50 # 校准期间非探测移动的速度（以毫米/秒为单位）。 # 默认为50。 #horizontal_move_z: 5 # 开始探测操作之前，头部应被命令移动到的高度（以毫米为单位）。 # 默认为5。

source: [printer] kinematics: none max_velocity: 1 max_accel: 1 # The max_velocity and max_accel parameters must be defined. The # values are not used for "none" kinematics.
fr: [printer] kinematics: none max_velocity: 1 max_accel: 1 # Les paramètres max_velocity et max_accel doivent être définis. Les # valeurs par défaut ne sont pas utilisées pour la cinématique "none".
zh_hans: [printer] kinematics: none max_velocity: 1 max_accel: 1 # 必须定义 max_velocity 和 max_accel，但是 它们不会被“none”运动学使用。

source: [heater_bed] heater_pin: sensor_type: sensor_pin: control: min_temp: max_temp: # See the "extruder" section for a description of the above parameters.
fr: [heater_bed] heater_pin: sensor_type: sensor_pin: control: min_temp: max_temp: # Voir la section "extruder" pour une description des paramètres ci-dessus.
zh_hans: [heater_bed] heater_pin: sensor_type: sensor_pin: control: min_temp: max_temp: # 以上参数详见“extruder”配置分段。

source: [homing_override] gcode: # A list of G-Code commands to execute in place of G28 commands # found in the normal g-code input. See docs/Command_Templates.md # for G-Code format. If a G28 is contained in this list of commands # then it will invoke the normal homing procedure for the printer. # The commands listed here must home all axes. This parameter must # be provided. #axes: xyz # The axes to override. For example, if this is set to "z" then the # override script will only be run when the z axis is homed (eg, via # a "G28" or "G28 Z0" command). Note, the override script should # still home all axes. The default is "xyz" which causes the # override script to be run in place of all G28 commands. #set_position_x: #set_position_y: #set_position_z: # If specified, the printer will assume the axis is at the specified # position prior to running the above g-code commands. Setting this # disables homing checks for that axis. This may be useful if the # head must move prior to invoking the normal G28 mechanism for an # axis. The default is to not force a position for an axis.
fr: [homing_override] gcode: # Une liste de commandes G-Code à exécuter à la place des commandes G28 # trouvées dans l'entrée g-code normale. Voir docs/Command_Templates.md # pour le format G-Code. Si un G28 est contenu dans cette liste de commandes # alors la procédure de mise à l'origine de l'imprimante sera invoquée. # Les commandes énumérées ici doivent ramener tous les axes à la position initiale. # Ce paramètre doit être fourni. #axes: xyz # Les axes à remplacer. Par exemple, si ce paramètre est défini sur "z", alors le script # d'annulation ne sera exécuté que lorsque l'axe z est mis à l'origine (par ex. # une commande "G28" ou "G28 Z"). Remarque : le script de neutralisation doit # toujours gérer tous les axes. La valeur par défaut est "xyz" ce qui fait que le script # de remplacement sera exécuté à la place de toutes les commandes G28. #set_position_x: #set_position_y: #set_position_z: # Si spécifié, l'imprimante supposera que l'axe est à la position spécifiée avant # d'exécuter les commandes g-code ci-dessus. Le fait de définir ceci désactive les # contrôles d'orientation pour cet axe. Cela peut être utile si la tête doit se déplacer # avant d'invoquer le mécanisme G28 normal d'un axe. # La valeur par défaut est de ne pas forcer une position pour un axe.
zh_hans: [homing_override] gcode： # 覆盖常规 G28 命令的 G 代码命令序列。 # G 代码格式请参阅 docs/Command_Templates.md。如果 # G28 包含在此命令列表中，常规版本的G28会被调用并进 # 行打印机的正常归位过程。此处列出的命令必须归位所 # 有轴。 # 必须提供此参数。 #axes: xyz # 要覆盖的轴。例如，如果将其设置为"z"，则覆盖脚本将 # 仅在 z 轴被归位时运行（例如，通过"G28" 或 "G28 Z0" # 命令）。请注意，覆盖脚本仍然需要归位所有轴。 # 默认值为"xyz"，覆盖全部所有 G28 命令。 #set_position_x： #set_position_y： #set_position_z： # 如果指定，打印机将假定轴在运行上述 G 代码命令序列 # 之前的位置。该设置会禁用相应轴的归位检查。在打印 # 头必须在执行常规 G28 机制前移动相应的轴时有用。 # 默认不假定轴的位置。

source: [endstop_phase stepper_z] #endstop_accuracy: # Sets the expected accuracy (in mm) of the endstop. This represents # the maximum error distance the endstop may trigger (eg, if an # endstop may occasionally trigger 100um early or up to 100um late # then set this to 0.200 for 200um). The default is # 4*rotation_distance/full_steps_per_rotation. #trigger_phase: # This specifies the phase of the stepper motor driver to expect # when hitting the endstop. It is composed of two numbers separated # by a forward slash character - the phase and the total number of # phases (eg, "7/64"). Only set this value if one is sure the # stepper motor driver is reset every time the mcu is reset. If this # is not set, then the stepper phase will be detected on the first # home and that phase will be used on all subsequent homes. #endstop_align_zero: False # If true then the position_endstop of the axis will effectively be # modified so that the zero position for the axis occurs at a full # step on the stepper motor. (If used on the Z axis and the print # layer height is a multiple of a full step distance then every # layer will occur on a full step.) The default is False.
fr: [endstop_phase stepper_z] #endstop_accuracy: # Définit la précision attendue (en mm) de la butée. Cela représente la distance d'erreur # maximale que la butée peut déclencher (par exemple, si une butée peut occasionnellement # se déclencher 100um en avance ou jusqu'à 100um en retard alors réglez cette valeur # sur 0.200 pour 200um). La valeur par défaut est 4*rotation_distance/full_steps_per_rotation. #trigger_phase: # Spécifie la phase du pilote du moteur pas à pas à attendre lorsque l'on atteint la butée. # Composé de deux nombres séparés par une barre oblique - la phase et le nombre total # de phases (par exemple, "7/64"). Ne définissez cette valeur que si vous êtes sûr que le # pilote du moteur pas à pas est réinitialisé à chaque fois que le mcu est réinitialisé. # Si cette valeur n'est pas définie, alors la phase du moteur pas à pas sera détectée à la # première mise à l'origine et cette phase sera utilisée sur toutes les origines suivantes. #endstop_align_zero: False # Si vrai, la position_endstop de l'axe sera effectivement modifiée de manière à ce que la # position zéro de l'axe se produise sur un pas complet du moteur pas à pas. (Si utilisé sur # l'axe Z et que la hauteur de la couche d'impression est un multiple de la distance parcourue # par un pas complet, alors chaque couche se produira sur un pas complet). # La valeur par défaut est False.
zh_hans: [endstop_phase stepper_z] #endstop_accuracy: # 设置预期的限位精度（以毫米(mm)为单位）。 代表了相位可能 # 触发的最大误差距离（比如，一个可能会提早 100um 触发或延迟 # 100um 触发的限位需要将该值设为 0.200,也就是 200um）。 # 默认为 4*rotation_distance/full_steps_per_rotation。 #trigger_phase: # 该参数定义了相位触发时预期的步进电机驱动相位。这通常是两 # 个由正斜杠符号分隔的整数 - 相位和总相位数（例如 "7/64"）。 # 只有当步进电机驱动在 mcu 重置时也会重置才需要该参数。 # 如果没有定义，步进相位会在第一次归位时检测并被用于后续归位。 #endstop_align_zero: False # 如果是 True 则打印机的 position_endstop 相应轴的零点位置是步进 # 电机的一个全步位置。(在Z轴上，如果打印层高是全步的倍数，每 # 层都会在全步上。） # 默认为 False。

source: [gcode_macro my_cmd] #gcode: # A list of G-Code commands to execute in place of "my_cmd". See # docs/Command_Templates.md for G-Code format. This parameter must # be provided. #variable_<name>: # One may specify any number of options with a "variable_" prefix. # The given variable name will be assigned the given value (parsed # as a Python literal) and will be available during macro expansion. # For example, a config with "variable_fan_speed = 75" might have # gcode commands containing "M106 S{ fan_speed * 255 }". Variables # can be changed at run-time using the SET_GCODE_VARIABLE command # (see docs/Command_Templates.md for details). Variable names may # not use upper case characters. #rename_existing: # This option will cause the macro to override an existing G-Code # command and provide the previous definition of the command via the # name provided here. This can be used to override builtin G-Code # commands. Care should be taken when overriding commands as it can # cause complex and unexpected results. The default is to not # override an existing G-Code command. #description: G-Code macro # This will add a short description used at the HELP command or while # using the auto completion feature. Default "G-Code macro"
fr: [gcode_macro my_cmd] #gcode: # Une liste de commandes G-Code à exécuter à la place de "my_cmd". Voir # docs/Command_Templates.md pour le format G-Code. Ce paramètre doit # être fourni. #variable_<name>: # On peut spécifier un nombre quelconque d'options avec le préfixe "variable_". # Le nom de variable donné se verra attribué la valeur donnée (analysée en tant # que littéral par Python) et sera disponible pendant l'expansion de la macro. # Par exemple, une configuration avec "variable_fan_speed = 75" pourrait avoir # des commandes gcode contenant "M106 S{ fan_speed * 255 }". Ces variables # peuvent alors être modifiées au moment de l'exécution en utilisant la commande # SET_GCODE_VARIABLE (voir docs/Command_Templates.md pour plus de détails). # Les noms de variables peuvent ne pas utiliser de caractères majuscules. #rename_existing: # Cette option permet à la macro de remplacer une commande G-Code existante # et fournira la définition précédente de la commande via le nom fourni ici. Ceci # peut être utilisé pour remplacer les commandes G-Code originelles. Il convient # d'être prudent lorsque l'on remplace des commandes, cela pouvant provoquer # des résultats complexes et inattendus. La valeur par défaut est de ne pas # remplacer une commande G-Code existante. #description: Macro G-Code # Ceci ajoutera une courte description utilisée à la commande HELP ou lors de # l'utilisation de la fonction de complétion automatique. # Par défaut : "G-Code macro".
zh_hans: [gcode_macro 命令] 。 #gcode: # 一个替代"命令" 执行的 G 代码命令的列表。请看 # docs/Command_Templates.md 了解支持的 G 代码格式。 # 必须提供此参数。 #variable_<名称>: # 可以指定任意数量的带有"变量_"前缀的设置。 # 定义的变量名将被赋予给定的值（并被解析为作为一个 # Python Literal），并在宏扩展时可用。 # 例如，一个带有"variable_fan_speed = 75"的 G-Code 命令的 # G 代码列表中可以包含"M106 S{ fan_speed * 255 }"。变量 # 可以在运行时使用 SET_GCODE_VARIABLE 命令进行修改 # （详见docs/Command_Templates.md）。变量名称 # 不能使用大写字母。 #rename_existing: # 这个选项将导致宏覆盖一个现有的 G-Code 命令，并通过 # 这里提供的名称引用该命令的先前定义。覆盖命令时应注 # 意，因为它可能会导致复杂和意外的错误。 # 默认不覆盖现有的 G-Code 命令。 #description: G-Code macro # 在 HELP 命令或自动完成中使用的简单描述。 # 默认为"G-Code macro"。

source: [delayed_gcode my_delayed_gcode] gcode: # A list of G-Code commands to execute when the delay duration has # elapsed. G-Code templates are supported. This parameter must be # provided. #initial_duration: 0.0 # The duration of the initial delay (in seconds). If set to a # non-zero value the delayed_gcode will execute the specified number # of seconds after the printer enters the "ready" state. This can be # useful for initialization procedures or a repeating delayed_gcode. # If set to 0 the delayed_gcode will not execute on startup. # Default is 0.
fr: [delayed_gcode my_delayed_gcode] gcode: # Une liste de commandes G-Code à exécuter lorsque la durée du délai est écoulée. # Les modèles G-Code sont supportés. Ce paramètre doit être fourni. #initial_duration: 0.0 # Durée du délai initial (en secondes). Si elle est définie à une valeur non nulle, le gcode # différé s'exécutera le nombre de secondes spécifié après que l'imprimante passe à # l'état "prêt". Ceci peut être utile pour les procédures d'initialisation ou lors d'une # répétition de delayed_gcode. Si la valeur est 0, le delayed_gcode ne sera pas exécuté # au démarrage. # La valeur par défaut est 0.
zh_hans: [delayed_gcode my_delayed_gcode]。 gcode: # 当延迟时间结束后执行的G代码命令列表。支持G代码模板。 # 必须提供这个参数。 #initial_duration:0.0 # 初始延迟的持续时间(以秒为单位)。如果设置为一个 # 非零值，delayed_gcode 将在打印机进入 "就绪 "状态后指定 # 秒数后执行。可能对初始化程序或重复的 delayed_gcode 有 # 用。如果设置为 0，delayed_gcode 将在启动时不执行。 # 默认为0。

source: [save_variables] filename: # Required - provide a filename that would be used to save the # variables to disk e.g. ~/variables.cfg
fr: [save_variables] filename: # Obligatoire - fournir un nom de fichier qui sera utilisé pour enregistrer les # variables sur le disque, par exemple ~/variables.cfg.
zh_hans: [save_variables] filename: # 必须提供一个可以用来保存参数到磁盘的文件名。 # 例如 . ~/variables.cfg
