Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Config_Reference.po
Languages: fr, zh_hans

source: [display] lcd_type: # Set to either "ssd1306" or "sh1106" for the given display type. #i2c_mcu: #i2c_bus: #i2c_speed: # Optional parameters available for displays connected via an i2c # bus. See the "common I2C settings" section for a description of # the above parameters. #cs_pin: #dc_pin: #spi_speed: #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # The pins connected to the lcd when in "4-wire" spi mode. See the # "common SPI settings" section for a description of the parameters # that start with "spi_". The default is to use i2c mode for the # display. #reset_pin: # A reset pin may be specified on the display. If it is not # specified then the hardware must have a pull-up on the # corresponding lcd line. #contrast: # The contrast to set. The value may range from 0 to 256 and the # default is 239. #vcomh: 0 # Set the Vcomh value on the display. This value is associated with # a "smearing" effect on some OLED displays. The value may range # from 0 to 63. Default is 0. #invert: False # TRUE inverts the pixels on certain OLED displays. The default is # False. #x_offset: 0 # Set the horizontal offset value on SH1106 displays. The default is # 0. ...
fr: [display] lcd_type: # Définir à "ssd1306" ou "sh1106" pour le type d'affichage donné. #i2c_mcu: #i2c_bus: #i2c_speed: # Paramètres optionnels disponibles pour des écrans connectés via un bus i2c. # Voir la section "Paramètres I2C communs" pour une description des # paramètres ci-dessus. #cs_pin: #dc_pin: #spi_speed: #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # Les broches connectées au lcd en mode spi "4-wire". Voir la section # "paramètres SPI communs" pour une description des paramètres # commençant par "spi_". Le défaut est d'utiliser le mode i2c pour l'écran # d'affichage. #reset_pin: # Une broche de réinitialisation peut être spécifiée sur l'affichage. Si elle # n'est pas spécifiée, le matériel doit avoir un pull-up sur la ligne # lcd correspondante. #contrast: # Le contraste à définir. La valeur peut aller de 0 à 256 , la valeur par # défaut est 239. #vcomh: 0 # Définit la valeur Vcomh sur l'écran. Cette valeur est associée à un effet # de "bavure" sur certains écrans OLED. La valeur peut être comprise # de 0 à 63. La valeur par défaut est 0. #invert: False # TRUE inverse les pixels sur certains écrans OLED. La valeur par défaut est # False. #x_offset: 0 # Définit la valeur du décalage horizontal sur les écrans SH1106. La valeur par # défaut est 0. ...
zh_hans: [display] lcd_type: # 对于给定的显示屏类型，设置为 “ssd1306" 或 "sh1106"。 #i2c_mcu: #i2c_bus: #i2c_speed: # 连接到I2C总线的显示屏的可选参数， 以上参数详见通 # 用 I2C 设置章节。 #cs_pin: #dc_pin: #spi_speed: #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # 使用4线 SPI 模式时连接到 lcd 的引脚。以 "spi_" 开头的 # 参数详见 “通用 SPI 设置” 章节。 # 显示屏默认使用 I2C 模式 #reset_pin: # 可以指定一个显示屏上的重置引脚，如果不指定，硬件 # 必须在相应的 lcd 线路上有一个拉高电阻。 #contrast: # 可设置的对比度。 # 数值必须在 0 和 256 之间，默认为 239。 #vcomh: 0 # 设置显示屏的 Vcomh 值。这个值与一些OLED显示屏的 # 模糊效果有关。这个数值可以在 0 和 63 之间。 # 默认为0。 #invert: False # TRUE 可以在一些OLED显示屏上反转像素 # 默认为 False。 #x_offset: 0 # 设置在 SH1106 显示屏上的水平偏移。 # 默认为0。 ...

source: [display_data my_group_name my_data_name] position: # Comma separated row and column of the display position that should # be used to display the information. This parameter must be # provided. text: # The text to show at the given position. This field is evaluated # using command templates (see docs/Command_Templates.md). This # parameter must be provided.
fr: [display_data my_group_name my_data_name] position: # Ligne et colonne séparées par des virgules de la position de l'affichage à # utiliser pour afficher l'information. Ce paramètre doit être fourni. text: # Le texte à afficher à la position donnée. Ce champ est évalué en utilisant les # modèles de commande (voir docs/Command_Templates.md). # Ce paramètre doit être fourni.
zh_hans: [display_data my_group_name my_data_name] position: # 用于显示信息的屏幕位置，由逗号分隔行与列表示。 # 这个参数必须被提供。 text: # 在指定位置显示的文本。本字段必须用命令样板进行评估。 # （查看 docs/Command_Templates.md）。 # 这个参数必须被提供。

source: [display_glyph my_display_glyph] #data: # The display data, stored as 16 lines consisting of 16 bits (1 per # pixel) where '.' is a blank pixel and '*' is an on pixel (e.g., # "****************" to display a solid horizontal line). # Alternatively, one can use '0' for a blank pixel and '1' for an on # pixel. Put each display line into a separate config line. The # glyph must consist of exactly 16 lines with 16 bits each. This # parameter is optional. #hd44780_data: # Glyph to use on 20x4 hd44780 displays. The glyph must consist of # exactly 8 lines with 5 bits each. This parameter is optional. #hd44780_slot: # The hd44780 hardware index (0..7) to store the glyph at. If # multiple distinct images use the same slot then make sure to only # use one of those images in any given screen. This parameter is # required if hd44780_data is specified.
fr: [display_glyph my_display_glyph] #data: # Les données d'affichage, stockées sous forme de 16 lignes composées de 16 bits (1 par # pixel) où '.' est un pixel vide et '*' est un pixel actif (par ex, "****************" pour afficher # une ligne horizontale pleine). # On peut également utiliser '0' pour un pixel vide et '1' pour un pixel actif. # Placez chaque ligne d'affichage sur une ligne de configuration distincte. Le glyphe doit être # composé d'exactement 16 lignes de 16 bits chacune. Ce paramètre est facultatif. #hd44780_data: # Glyphe à utiliser sur les écrans 20x4 hd44780. Le glyphe doit être composé d'exactement # 8 lignes de 5 bits chacune. Ce paramètre est facultatif. #hd44780_slot: # L'index matériel hd44780 (0..7) pour stocker le glyphe. Si plusieurs images distinctes # utilisent le même slot, assurez-vous de n'utiliser qu'une seule de ces images dans un # écran donné. Ce paramètre est requis si hd44780_data est spécifié.
zh_hans: [display_glyph my_display_glyph] #data: # 被存储为16 行，每行 16 位（1位代表1个像素）的显示数据。“.”是一个 # 空白的像素，而‘*’是一个开启的像素（例如，"****************" # 可以用来显示一条横向的实线。除此以外，也可以用“0”作为空 # 白的像素，而‘1’作为开启的像素。需要将每个显示的行放到配置文件 # 中独立的一行。每个字形都必须包含且仅包含 16 行，每行 16 位。 # 这是一个可选参数。 #hd44780_data: # 用于 20x4 hd44780 显示屏的字形。字形必须包含且仅包含 8 行， # 每行 5 位。 # 这是一个可选参数。 #hd44780_slot: # 用于存储字形的 hd44780 硬件索引（0..7）。如果多个独特的图片使用 # 了相同的索引位置，需要保证在任何屏幕上只使用其中一个图片。 # 如果定义了 hd44780_data ，则必须提供此参数。

source: [display my_extra_display] # See the "display" section for available parameters.
fr: [display my_extra_display] # Voir la section "affichage" (display) pour les paramètres disponibles.
zh_hans: [display my_extra_display] 。 # 可用参数参见 "显示 "分段。

source: # Common parameters available for all menu config sections. #[menu __some_list __some_name] #type: disabled # Permanently disabled menu element, only required attribute is 'type'. # Allows you to easily disable/hide existing menu items. #[menu some_name] #type: # One of command, input, list, text: # command - basic menu element with various script triggers # input - same like 'command' but has value changing capabilities. # Press will start/stop edit mode. # list - it allows for menu items to be grouped together in a # scrollable list. Add to the list by creating menu # configurations using "some_list" as a prefix - for # example: [menu some_list some_item_in_the_list] # vsdlist - same as 'list' but will append files from virtual sdcard # (will be removed in the future) #name: # Name of menu item - evaluated as a template. #enable: # Template that evaluates to True or False. #index: # Position where an item needs to be inserted in list. By default # the item is added at the end. #[menu some_list] #type: list #name: #enable: # See above for a description of these parameters. #[menu some_list some_command] #type: command #name: #enable: # See above for a description of these parameters. #gcode: # Script to run on button click or long click. Evaluated as a # template. #[menu some_list some_input] #type: input #name: #enable: # See above for a description of these parameters. #input: # Initial value to use when editing - evaluated as a template. # Result must be float. #input_min: # Minimum value of range - evaluated as a template. Default -99999. #input_max: # Maximum value of range - evaluated as a template. Default 99999. #input_step: # Editing step - Must be a positive integer or float value. It has # internal fast rate step. When "(input_max - input_min) / # input_step > 100" then fast rate step is 10 * input_step else fast # rate step is same input_step. #realtime: # This attribute accepts static boolean value. When enabled then # gcode script is run after each value change. The default is False. #gcode: # Script to run on button click, long click or value change. # Evaluated as a template. The button click will trigger the edit # mode start or end.
fr: # Paramètres communs disponibles pour toutes les sections de configuration de menu. #[menu __some_list __some_name] #type: disabled # Élément de menu désactivé de façon permanente, le seul attribut requis est 'type'. # Vous permet de désactiver/masquer facilement des éléments de menu existants. #[menu some_name] #type: # Un élément parmi command, input, list, text : # command - élément de menu de base avec divers déclencheurs de script. # input - même chose que 'command' mais avec des capacités de changement de valeur. # Pressez pour démarrer/arrêter le mode d'édition. # list - permet de regrouper les éléments du menu dans une liste déroulante. # Ajoutez à la liste en créant des configurations de menu en utilisant # "some_list" comme préfixe - par exemple : # [menu some_list some_item_in_the_list]. # vsdlist - identique à 'list' mais ajoutera les fichiers de la carte SD virtuelle # (sera supprimé dans le futur) #name: # Nom de l'élément de menu - évalué comme un modèle. #enable: # Modèle évalué à True ou False. #index: # Position où l'élément doit être inséré dans la liste. Par défaut # l'élément est ajouté à la fin. #[menu some_list] #type: list #name: #enable: # Voir ci-dessus pour une description de ces paramètres. #[menu some_list some_command] #type: command #name: #enable: # Voir ci-dessus pour une description de ces paramètres. #gcode: # Script à exécuter lors d'un clic sur un bouton ou un clic long. Évalué comme un # modèle. #[menu some_list some_input] #type: input #name: #enable: # Voir ci-dessus pour une description de ces paramètres. #input: # Valeur initiale à utiliser lors de l'édition - évaluée comme un modèle. # Le résultat doit être de type flottant. #input_min: # Valeur minimale de l''intervalle - évaluée comme un modèle. Par défaut -99999. #input_max: # Valeur maximale de l'intervalle - évaluée comme un modèle. Par défaut 99999. #input_step: # Pas d'édition - Doit être un nombre entier positif ou une valeur flottante. Possède # un pas de vitesse rapide interne. Lorsque "(input_max - input_min) / input_step > 100" # alors le pas de vitesse rapide est 10 * input_step sinon le pas de vitesse rapide # est le même que celui de l'input_step. #realtime: # Cet attribut accepte une valeur booléenne statique. Lorsqu'il est activé, alors le script # gcode est exécuté après chaque changement de valeur. La valeur par défaut est False. #gcode: # Script à exécuter lors d'un clic sur un bouton, d'un clic long ou d'un changement de valeur. # Évalué comme un modèle. Le clic sur le bouton déclenchera le début ou fin du mode d'édition.
zh_hans: # 所有的菜单配置分段都有的通用参数。 #[menu __some_list __some_name] #type: disabled # 永久禁用这个菜单元素，唯一需要的属性是 "type"。 # 允许你简单啊的禁用/隐藏现有的菜单项目。 #[menu some_name] #type: # command（命令）, input（输入）, list（列表）, text（文字）之一： # command - 可以触发各种脚本的基本菜单元素。 # input - 类似 “command” 但是可以修改数值。 # 点击来进入/退出修改模式。 # list - 这允许菜单项被组织成一个可滚动的列表。通过创建由 "some_list" # 开头的菜单配置 - 例如：[menu some_list some_item_in_the_list] # vsdlist - 和“list”一样，但是会自动从虚拟SD卡中添加文件。 # （将在未来被移除） #name: # 菜单项的名称 - 被视为模板 #enable: # 视为 True 或 False 的模板。 #index: # 项目插入到列表的位置。 # 默认添加到结尾。 #[menu some_list] #type: list #name: #enable: # 见上文对这些参数的描述。 #[menu some_list some_command] #type: command #name: #enable: # 见上文对这些参数的描述。 #gcode: # 点击按钮或长按时运行的G代码脚本。被视为模板。 #[menu some_list some_input] #type: input #name: #enable: # 见上文对这些参数的描述。 #input: # 用于修改的初始数值 - 被视为模板。 # 结果必须为浮点数。 #input_min: # 范围的最小值 - 被视为模板。默认-99999。 #input_max: # 范围的最大值 - 被视为模板。 默认-99999。 #input_step: # 修改的步长 - 必须是一个正整数或浮点数。它有内置快进 # 步长。当"(input_max - input_min) / # input_step > 100" 时，快进步长是 10 * input_step， 否则 # 步长和 input_step 相同。 #realtime: # 此属性接受静态布尔值。 在启用时，G代码脚本将会在每 # 次数值变化时执行。 # 默认为False（否）。 #gcode: # 点击按钮、长按或数值变化时运行的G代码脚本。 # 被视为模板。点击按钮会进入或退出修改模式。

source: [filament_switch_sensor my_sensor] #pause_on_runout: True # When set to True, a PAUSE will execute immediately after a runout # is detected. Note that if pause_on_runout is False and the # runout_gcode is omitted then runout detection is disabled. Default # is True. #runout_gcode: # A list of G-Code commands to execute after a filament runout is # detected. See docs/Command_Templates.md for G-Code format. If # pause_on_runout is set to True this G-Code will run after the # PAUSE is complete. The default is not to run any G-Code commands. #insert_gcode: # A list of G-Code commands to execute after a filament insert is # detected. See docs/Command_Templates.md for G-Code format. The # default is not to run any G-Code commands, which disables insert # detection. #event_delay: 3.0 # The minimum amount of time in seconds to delay between events. # Events triggered during this time period will be silently # ignored. The default is 3 seconds. #pause_delay: 0.5 # The amount of time to delay, in seconds, between the pause command # dispatch and execution of the runout_gcode. It may be useful to # increase this delay if OctoPrint exhibits strange pause behavior. # Default is 0.5 seconds. #switch_pin: # The pin on which the switch is connected. This parameter must be # provided.
fr: [filament_switch_sensor my_sensor] #pause_on_runout: True # Lorsque défini sur True, une PAUSE sera exécutée immédiatement après qu'un runout # soit détecté. Notez que si pause_on_runout est False et que le runout_gcode est omis, # la détection du runout est désactivée. Par défaut, est True. #runout_gcode: # Une liste de commandes G-Code à exécuter après la détection d'une fin de filament. # Voir docs/Command_Templates.md pour le format G-Code. Si pause_on_runout est # réglé sur True, ce G-code sera exécuté après la fin de la PAUSE. Par défaut, aucune # commande G-Code n'est exécutée. #insert_gcode: # Une liste de commandes G-Code à exécuter après qu'une insertion de filament soit détectée. # Voir docs/Command_Templates.md pour le format G-Code. La valeur par défaut est de # n'exécuter aucune commande G-Code, ce qui désactive la détection de l'insertion. #event_delay 3.0 # La durée minimale en secondes à attendre entre les événements. # Des événements déclenchés durant cette période seront silencieusement ignorés. # La valeur par défaut est de 3 secondes. #pause_delay: 0.5 # Le délai, en secondes, entre l'envoi de la commande de pause et l'exécution du runout_gcode. # Il peut être utile d'augmenter ce délai si OctoPrint présente un comportement étrange lors de # la pause. La valeur par défaut est 0.5 secondes. #switch_pin: # La broche sur laquelle l'interrupteur est connecté. # Ce paramètre doit être fourni.
zh_hans: [filament_switch_sensor my_sensor]。 #pause_on_runout: True # 当设置为 "True "时，会在检测到耗尽后立即暂停打印机。 # 请注意, 如果 pause_on_runout 为 False 并且没有定义。 # runout_gcode的话, 耗尽检测将被禁用。 # 默认为 True。 #runout_gcode: # 在检测到耗材耗尽后会执行的G代码命令列表。 # 有关G-Code 格式请见 docs/Command_Templates.md。 # 如果 pause_on_runout 被设置为 True，这个G-Code将在 # 暂停后执行。 # 默认情况是不运行任何 G-Code 命令。 #insert_gcode: # 在检测到耗材插入后会执行的 G-Code 命令列表。 # 关于G代码格式，请参见 docs/Command_Templates.md。 # 默认不运行任何 G-Code 命令，这将禁用耗材插入检测。 #event_delay: 3.0 # 事件之间的最小延迟时间（秒）。 # 在这个时间段内触发的事件将被默许忽略。 # 默认为3秒。 #pause_delay: 0.5 # 暂停命令和执行 runout_gcode 之间的延迟时间, 单位是秒。 # 如果在OctoPrint的情况下，增加这个延迟可能改善暂 # 停的可靠性。如果OctoPrint表现出奇怪的暂停行为， # 考虑增加这个延迟。 # 默认为0.5秒。 #switch_pin: # 连接到检测开关的引脚。 # 必须提供此参数。

source: [filament_motion_sensor my_sensor] detection_length: 7.0 # The minimum length of filament pulled through the sensor to trigger # a state change on the switch_pin # Default is 7 mm. extruder: # The name of the extruder section this sensor is associated with. # This parameter must be provided. switch_pin: #pause_on_runout: #runout_gcode: #insert_gcode: #event_delay: #pause_delay: # See the "filament_switch_sensor" section for a description of the # above parameters.
fr: [filament_motion_sensor my_sensor] detection_length: 7.0 # La longueur minimale du filament tiré à travers le capteur déclenchant # un changement d'état sur la broche de commutation. # La valeur par défaut est 7 mm. extruder: # Le nom de la section de l'extrudeuse à laquelle ce capteur est associé. # Ce paramètre doit être fourni. switch_pin: #pause_on_runout: #runout_gcode: #insert_gcode: #event_delay: #pause_delay: # Voir la section "filament_switch_sensor" pour une description des # paramètres ci-dessus.
zh_hans: [filament_motion_sensor my_sensor] detection_length: 7.0 # 触发传感器 switch_pin 引脚状态变化的最小距离。 # 默认为 7 mm。 extruder: # 该传感器相关联的挤出机。 # 必须提供此参数。 switch_pin: #pause_on_runout: #runout_gcode: #insert_gcode: #event_delay: #pause_delay: # 以上参数详见“filament_switch_sensor”章节。

source: [tsl1401cl_filament_width_sensor] #pin: #default_nominal_filament_diameter: 1.75 # (mm) # Maximum allowed filament diameter difference as mm. #max_difference: 0.2 # The distance from sensor to the melting chamber as mm. #measurement_delay: 100
fr: [tsl1401cl_filament_width_sensor] #pin: #default_nominal_filament_diameter: 1.75 # (mm) # Différence maximale de diamètre de filament autorisée en mm. #max_différence: 0.2 # La distance entre le capteur et la chambre de fusion en mm. #measurement_delay: 100

source: [hall_filament_width_sensor] adc1: adc2: # Analog input pins connected to the sensor. These parameters must # be provided. #cal_dia1: 1.50 #cal_dia2: 2.00 # The calibration values (in mm) for the sensors. The default is # 1.50 for cal_dia1 and 2.00 for cal_dia2. #raw_dia1: 9500 #raw_dia2: 10500 # The raw calibration values for the sensors. The default is 9500 # for raw_dia1 and 10500 for raw_dia2. #default_nominal_filament_diameter: 1.75 # The nominal filament diameter. This parameter must be provided. #max_difference: 0.200 # Maximum allowed filament diameter difference in millimeters (mm). # If difference between nominal filament diameter and sensor output # is more than +- max_difference, extrusion multiplier is set back # to %100. The default is 0.200. #measurement_delay: 70 # The distance from sensor to the melting chamber/hot-end in # millimeters (mm). The filament between the sensor and the hot-end # will be treated as the default_nominal_filament_diameter. Host # module works with FIFO logic. It keeps each sensor value and # position in an array and POP them back in correct position. This # parameter must be provided. #enable: False # Sensor enabled or disabled after power on. The default is to # disable. #measurement_interval: 10 # The approximate distance (in mm) between sensor readings. The # default is 10mm. #logging: False # Out diameter to terminal and klipper.log can be turn on|of by # command. #min_diameter: 1.0 # Minimal diameter for trigger virtual filament_switch_sensor. #use_current_dia_while_delay: False # Use the current diameter instead of the nominal diameter while # the measurement delay has not run through. #pause_on_runout: #runout_gcode: #insert_gcode: #event_delay: #pause_delay: # See the "filament_switch_sensor" section for a description of the # above parameters.
fr: [hall_filament_width_sensor] adc1: adc2: # Broches d'entrée analogiques connectées au capteur. Ces paramètres doivent # être fournis. #cal_dia1: 1.50 #cal_dia2: 2.00 # Les valeurs d'étalonnage (en mm) pour les capteurs. La valeur par défaut est # 1,50 pour cal_dia1 et 2,00 pour cal_dia2. #raw_dia1: 9500 #raw_dia2: 10500 # Les valeurs brutes d'étalonnage des capteurs. La valeur par défaut est 9500 # pour raw_dia1 et 10500 pour raw_dia2. #default_nominal_filament_diameter: 1.75 # Le diamètre nominal du filament. Ce paramètre doit être fourni. #max_difference: 0.200 # Différence maximale autorisée de diamètre du filament en millimètres (mm). # Si la différence entre le diamètre nominal du filament et la sortie du capteur # est supérieure à +- max_difference, le multiplicateur d'extrusion est ramené à # à %100. La valeur par défaut est de 0,200. #measurement_delay: 70 # La distance entre le capteur et la chambre de fusion/la buse en # millimètres (mm). Le filament situé entre le capteur et la buse # sera traité comme le default_nominal_filament_diameter. # Ce module hôte fonctionne avec une logique FIFO. Il conserve chaque valeur # de capteur dans un tableau et les remet (POP) dans la bonne position. Ce # paramètre doit être fourni. #enable: False # Capteur activé ou désactivé après la mise sous tension. La valeur par défaut est # désactivé. #measurement_interval: 10 # La distance approximative (en mm) entre les lectures du capteur. La valeur # par défaut est de 10mm. #logging: False # Le diamètre de sortie vers le terminal et vers klipper.log peut être activé par # ce paramètre. #min_diameter: 1.0 # Diamètre minimal pour déclencher le capteur virtuel filament_switch_sensor. #use_current_dia_while_delay: False # Utiliser le diamètre actuel au lieu du diamètre nominal pendant que le délai # de mesure n'est pas écoulé. #pause_on_runout: #runout_gcode: #insert_gcode: #event_delay: #pause_delay: # Voir la section "filament_switch_sensor" pour une description des # paramètres ci-dessus.
zh_hans: [hall_filament_width_sensor] adc1: adc2: # 连接到传感器的模拟输入引脚。 # 必须提供这些参数。 #cal_dia1: 1.50 #cal_dia2: 2.00 # 传感器的校准值（单位：毫米）。 # 默认 cal_dia1 为1.50，cal_dia2 为 2.00。 #raw_dia1: 9500 #raw_dia2: 10500 # 传感器的原始校准值。默认raw_dial1 为 9500 # 而 raw_dia2 为 10500。 #default_nominal_filament_diameter: 1.75 # 标称耗材直径。 # 必须提供此参数。 #max_difference: 0.200 # 允许的耗材最大直径差异，单位是毫米（mm）。 # 如果耗材标称直径和传感器输出之间的差异 # 超过正负 max_difference，挤出倍数将被设回 # 到100%。 # 默认为0.200。 #measurement_delay: 70 # 从传感器到熔腔/热端的距离，单位是毫米 (mm)。 # 传感器和热端之间的耗材将被视为标称直径。主机 # 模块采用先进先出的逻辑工作。它将每个传感器的值和 # 位置在一个数组中，并会在正确的位置使用传感器值。 # 必须提供这个参数。 #enable:False # 传感器在开机后启用或禁用。 # 默认是 False。 #measurement_interval: 10 # 传感器读数之间的近似距离(mm)。 # 默认为10mm。 #logging:False # 输出直径到终端和 klipper.log，可以通过命令启用或禁用。 #min_diameter: 1.0 # 触发虚拟 filament_switch_sensor 的最小直径。 #use_current_dia_while_delay: False # 在未被测量的 measurement_delay 部分耗材使用当前耗材 # 传感器报告的直径而不是标称直径。 #pause_on_runout: #runout_gcode: #insert_gcode: #event_delay: #pause_delay: # 关于上述参数的描述请参见"filament_switch_sensor"章节。
