Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Config_Reference.po
Languages: fr, zh_hans

source: [printer] kinematics: delta max_z_velocity: # For delta printers this limits the maximum velocity (in mm/s) of # moves with z axis movement. This setting can be used to reduce the # maximum speed of up/down moves (which require a higher step rate # than other moves on a delta printer). The default is to use # max_velocity for max_z_velocity. #max_z_accel: # This sets the maximum acceleration (in mm/s^2) of movement along # the z axis. Setting this may be useful if the printer can reach higher # acceleration on XY moves than Z moves (eg, when using input shaper). # The default is to use max_accel for max_z_accel. #minimum_z_position: 0 # The minimum Z position that the user may command the head to move # to. The default is 0. delta_radius: # Radius (in mm) of the horizontal circle formed by the three linear # axis towers. This parameter may also be calculated as: # delta_radius = smooth_rod_offset - effector_offset - carriage_offset # This parameter must be provided. #print_radius: # The radius (in mm) of valid toolhead XY coordinates. One may use # this setting to customize the range checking of toolhead moves. If # a large value is specified here then it may be possible to command # the toolhead into a collision with a tower. The default is to use # delta_radius for print_radius (which would normally prevent a # tower collision). # The stepper_a section describes the stepper controlling the front # left tower (at 210 degrees). This section also controls the homing # parameters (homing_speed, homing_retract_dist) for all towers. [stepper_a] position_endstop: # Distance (in mm) between the nozzle and the bed when the nozzle is # in the center of the build area and the endstop triggers. This # parameter must be provided for stepper_a; for stepper_b and # stepper_c this parameter defaults to the value specified for # stepper_a. arm_length: # Length (in mm) of the diagonal rod that connects this tower to the # print head. This parameter must be provided for stepper_a; for # stepper_b and stepper_c this parameter defaults to the value # specified for stepper_a. #angle: # This option specifies the angle (in degrees) that the tower is # at. The default is 210 for stepper_a, 330 for stepper_b, and 90 # for stepper_c. # The stepper_b section describes the stepper controlling the front # right tower (at 330 degrees). [stepper_b] # The stepper_c section describes the stepper controlling the rear # tower (at 90 degrees). [stepper_c] # The delta_calibrate section enables a DELTA_CALIBRATE extended # g-code command that can calibrate the tower endstop positions and # angles. [delta_calibrate] radius: # Radius (in mm) of the area that may be probed. This is the radius # of nozzle coordinates to be probed; if using an automatic probe # with an XY offset then choose a radius small enough so that the # probe always fits over the bed. This parameter must be provided. #speed: 50 # The speed (in mm/s) of non-probing moves during the calibration. # The default is 50. #horizontal_move_z: 5 # The height (in mm) that the head should be commanded to move to # just prior to starting a probe operation. The default is 5.
fr: [printer] kinematics: delta max_z_velocity: # Pour les imprimantes delta, cela limite la vitesse maximale (en mm/s) des # mouvements de l'axe z. Ce paramètre peut être utilisé pour réduire la # vitesse maximale des déplacements vers le haut/bas (nécessitent une vitesse # de pas plus élevée que les autres mouvements sur une imprimante delta). La # valeur par défaut est d'utiliser max_velocity pour max_z_velocity. #max_z_accel: # Ceci définit l'accélération maximale (en mm/s^2) du mouvement le long de l'axe z. # Ce paramètre peut être utile si l'imprimante peut atteindre une plus grande # accélération sur les mouvements XY que sur les mouvements Z (par exemple, lors # de l'utilisation de la compensation de résonance). # La valeur par défaut est d'utiliser max_accel pour max_z_accel. #minimum_z_position: 0 # Position Z minimale à laquelle l'utilisateur peut ordonner à la tête de se déplacer. # La valeur par défaut est 0. delta_radius: # Rayon (en mm) du cercle horizontal formé par les trois colonnes d'axe linéaire. # Ce paramètre peut également être calculé comme suit : # delta_radius = smooth_rod_offset - effector_offset - carriage_offset. # Ce paramètre doit être fourni. #print_radius: # Le rayon (en mm) des coordonnées XY valides de la tête d'extrusion. On peut utiliser # ce paramètre pour personnaliser la vérification de la plage des mouvements de la tête. # Si une grande valeur est spécifiée ici, il peut être possible de faire entrer la tête en collision # avec une colonne. La valeur par défaut est d'utiliser delta_radius pour print_radius (ce qui # empêchera normalement une collision avec une colonne). # La section stepper_a décrit le moteur pas à pas contrôlant la colonne avant gauche (à 210 degrés). # Cette section contrôle également les paramètres de la mise à l'origine (homing_speed, # homing_retract_dist) pour toutes les colonnes. [stepper_a] position_endstop: # Distance (en mm) entre la buse et le lit lorsque la buse se trouve au centre de la zone de construction # et que la fin de course se déclenche. Ce paramètre doit être fourni pour le stepper_a ; pour les # stepper_b et stepper_c, ce paramètre prend par défaut la valeur spécifiée pour # stepper_a. arm_length: # Longueur (en mm) de la tige diagonale qui relie cette colonne à la tête d'impression. # Ce paramètre doit être fourni pour stepper_a ; pour stepper_b et stepper_c, ce paramètre # prend par défaut la valeur spécifiée pour stepper_a. #angle: # Cette option spécifie l'angle (en degrés) où se trouve positionnée la colonne. # La valeur par défaut est 210 pour stepper_a, 330 pour stepper_b, et 90 # pour stepper_c. # La section stepper_b décrit le moteur pas à pas contrôlant la colonne avant droite (à 330 degrés). [stepper_b] # La section stepper_c décrit le moteur pas à pas contrôlant la colonne arrière droite (à 90 degrés). [stepper_c] # La section delta_calibrate active une commande G-code étendue DELTA_CALIBRATE # permettant de calibrer les positions et les angles de la fin de la colonne. [delta_calibrate] radius: # Rayon (en mm) de la zone qui peut être sondée. Il s'agit du rayon des coordonnées de # la buse à sonder ; si vous utilisez un palpeur automatique avec un décalage XY, choisissez # un rayon suffisamment petit pour que la sonde s'adapte toujours au lit. # Ce paramètre doit être fourni. #speed: 50 # La vitesse (en mm/s) des mouvements sans palpage pendant l'étalonnage. # La valeur par défaut est 50. #horizontal_move_z: 5 # La hauteur (en mm) à laquelle la tête doit être relevée pour se déplacer # juste avant de lancer une opération de palpage. La valeur par défaut est 5.
zh_hans: [printer] kinematics: delta max_z_velocity: # 对于Delta打印机，这限制了Z轴运动的最大速度（单位：mm/s）。 # 该设置可用于降低上/下移动的最大速度（上下移动需要比Delta # 打印机上的其他移动要高的步进脉冲速率）。 # 默认使用 max_velocity 定义 max_z_velocity。 #max_z_accel: # 这设置了沿Z轴移动的最大加速度（单位：mm/s^2）。 # Z轴的最大加速度。如果打印机在XY轴运动时加速度可以比Z轴运动 # 速度高，可以设置这个参数。（例如，当使用输入整形器时） # 默认使用 max_accel 定义 max_z_accel。 #minimum_z_position:0 # 用户可以命令打印头移动的最小Z位置。 # 默认为0。 delta_radius: # 由三个线性轴塔形成的水平圆的半径（mm）。这个参数通过以下公式计算： # delta_radius = smooth_rod_offset - effector_offset - carriage_offset # 必须提供这个参数。 # print_radius: # 有效打印头XY坐标的半径（mm）。可以使用该1设置来定制打印头 # 移动范围的检查。如果这里指定的值很大，那么命令有可能会使打 # 印头与轴塔发生碰撞。 # 默认使用 delta_radius来代替print_radius（这通常足以避免碰撞）。 # stepper_a 分段描述了控制左前方轴塔的的步进器（210度）。该分段 # 还定义了归位全部轴塔的参数（归位速度，归位缩回距离）。 [stepper_a] position_endstop: # 喷嘴和床身之间的距离（mm），当喷嘴在在打印空间的中心，并且 # 限位被触发。 # 必须在stepper_a中被定义；对于stepper_b和stepper_c，这个参数默 # 认为stepper_a指定的值。 arm_length: # 连接该轴塔和打印头的对角线连杆长度(mm)。此参数必须提供给 # stepper_a；对于stepper_b和stepper_c，该参数的默认值为stepper_a # 指定的值。 #angle: # 这个选项指定了轴塔的角度(度)。stepper_a的默认值是210，stepper_b # 的默认值是330，而stepper_c的默认值是90。 # stepper_b 分段描述了控制前右方轴塔的步进器(330度)。 [stepper_b] # stepper_c 分段描述了控制后方轴塔的步进器(90度)。 [stepper_c] # delta_calibrate部分启用了DELTA_CALIBRATE扩展的 # g-code命令，可以校准塔台的端点位置和角度。 [delta_calibrate] radius: # 可以探测到的区域的半径（mm）。这是要探测的喷嘴坐标的半径； # 如果使用自动探针有一个XY偏移，那么需要选择一个足够小的半径，使 # 探针总是在打印床上探测。 # 必须提供此参数。 #speed: 50 # 校准过程中非探测移动的速度(单位：mm/s)。 # 默认为50。 #horizontal_move_z: 5 # 在开始探测操作之前，探针应被命令移动到的高度（以毫米为单位）。 # 默认值为5。

source: BMP280/BME280/BME680 two wire interface (I2C) environmental sensors. Note that these sensors are not intended for use with extruders and heater beds, but rather for monitoring ambient temperature (C), pressure (hPa), relative humidity and in case of the BME680 gas level. See [sample-macros.cfg](../config/sample-macros.cfg) for a gcode_macro that may be used to report pressure and humidity in addition to temperature.
fr: Capteurs environnementaux BMP280/BME280/BME680 à interface à deux fils (I2C). Notez que ces capteurs ne sont pas destinés à être utilisés avec des extrudeurs et des lits chauffants, mais plutôt pour surveiller la température ambiante (C), la pression (hPa), l'humidité relative et, dans le cas du BME680, le niveau de gaz. Voir [sample-macros.cfg](../config/sample-macros.cfg) pour un gcode_macro pouvant être utilisé pour signaler la pression et l'humidité en plus de la température.
zh_hans: BMP280/BME280/BME680 两线接口 (I2C) 环境传感器。注意，这些传感器不适用于挤出机和加热床。它们可以用于监测环境温度 (C)、压力 (hPa)、相对湿度以及气体水平（仅在BME680上）。请参阅 [sample-macros.cfg](../config/sample-macros.cfg) 以获取可用于报告压力和湿度以及温度的gcode_macro。

source: [tmc2130 stepper_x] cs_pin: # The pin corresponding to the TMC2130 chip select line. This pin # will be set to low at the start of SPI messages and raised to high # after the message completes. This parameter must be provided. #spi_speed: #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # See the "common SPI settings" section for a description of the # above parameters. #chain_position: #chain_length: # These parameters configure an SPI daisy chain. The two parameters # define the stepper position in the chain and the total chain length. # Position 1 corresponds to the stepper that connects to the MOSI signal. # The default is to not use an SPI daisy chain. #interpolate: True # If true, enable step interpolation (the driver will internally # step at a rate of 256 micro-steps). This interpolation does # introduce a small systemic positional deviation - see # TMC_Drivers.md for details. The default is True. run_current: # The amount of current (in amps RMS) to configure the driver to use # during stepper movement. This parameter must be provided. #hold_current: # The amount of current (in amps RMS) to configure the driver to use # when the stepper is not moving. Setting a hold_current is not # recommended (see TMC_Drivers.md for details). The default is to # not reduce the current. #sense_resistor: 0.110 # The resistance (in ohms) of the motor sense resistor. The default # is 0.110 ohms. #stealthchop_threshold: 0 # The velocity (in mm/s) to set the "stealthChop" threshold to. When # set, "stealthChop" mode will be enabled if the stepper motor # velocity is below this value. The default is 0, which disables # "stealthChop" mode. #driver_IHOLDDELAY: 8 #driver_TPOWERDOWN: 0 #driver_TBL: 1 #driver_TOFF: 4 #driver_HEND: 7 #driver_HSTRT: 0 #driver_PWM_AUTOSCALE: True #driver_PWM_FREQ: 1 #driver_PWM_GRAD: 4 #driver_PWM_AMPL: 128 #driver_SGT: 0 # Set the given register during the configuration of the TMC2130 # chip. This may be used to set custom motor parameters. The # defaults for each parameter are next to the parameter name in the # above list. #diag0_pin: #diag1_pin: # The micro-controller pin attached to one of the DIAG lines of the # TMC2130 chip. Only a single diag pin should be specified. The pin # is "active low" and is thus normally prefaced with "^!". Setting # this creates a "tmc2130_stepper_x:virtual_endstop" virtual pin # which may be used as the stepper's endstop_pin. Doing this enables # "sensorless homing". (Be sure to also set driver_SGT to an # appropriate sensitivity value.) The default is to not enable # sensorless homing.
fr: [tmc2130 stepper_x] cs_pin: # La broche correspondant à la ligne de sélection de la puce TMC2130. Cette broche # sera mise à l'état bas au début des messages SPI et remontée à l'état haut # après la fin du message. Ce paramètre doit être fourni. #spi_speed: #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # Voir la section "paramètres SPI communs" pour une description des # paramètres ci-dessus. #chain_position: #chain_length: # Ces paramètres configurent une guirlande SPI. Les deux paramètres # définissent la position du pilote dans la chaîne et la longueur totale de la chaîne. # La position 1 correspond au pilote qui se connecte au signal MOSI. # La valeur par défaut est de ne pas utiliser de guirlande SPI. #interpolate: True # Si true, active l'interpolation des pas (le pilote va faire un pas interne à # un taux de 256 micro-pas). Cette interpolation introduit une petite déviation # systémique de la position - voir TMC_Drivers.md pour plus de détails. # La valeur par défaut est True. run_current: # La quantité de courant (en ampères RMS) à configurer que le pilote utilise # pendant le mouvement pas à pas. Ce paramètre doit être fourni. #hold_current: # La quantité de courant (en ampères RMS) à configurer que le pilote utilise # lorsque le moteur pas à pas n'est pas en mouvement. La définition d'un hold_current n'est pas # recommandé (voir TMC_Drivers.md pour plus de détails). La valeur par défaut est de # ne pas réduire le courant. #sense_resistor: 0.110 # La résistance (en ohms) de la résistance de détection du moteur (Vréf). La valeur par défaut # est de 0.110 ohms. #stealthchop_threshold: 0 # La vitesse (en mm/s) à laquelle le seuil "stealthChop" doit être fixé. Lorsque # défini, le mode "stealthChop" sera activé si la vitesse du moteur pas à pas # est inférieure à cette valeur. La valeur par défaut est 0, ce qui désactive # le mode "stealthChop". #driver_IHOLDDELAY: 8 #driver_TPOWERDOWN: 0 #driver_TBL: 1 #driver_TOFF: 4 #driver_HEND: 7 #driver_HSTRT: 0 #driver_PWM_AUTOSCALE: True #driver_PWM_FREQ: 1 #driver_PWM_GRAD: 4 #driver_PWM_AMPL: 128 #driver_SGT: 0 # Définir le registre donné pendant la configuration de la puce TMC2130. # Ceci peut être utilisé pour définir les paramètres personnalisés du moteur. Les valeurs par défaut de # chaque paramètre sont indiquées à côté du nom du paramètre dans la liste ci-dessus. #diag0_pin: #diag1_pin: # La broche du microcontrôleur reliée à l'une des lignes DIAG de la puce # TMC2130. Une seule broche diag doit être spécifiée. La broche # est "active low" et est donc normalement précédée de "^ !". Ce réglage # crée une broche virtuelle "tmc2130_stepper_x:virtual_endstop". # pouvant être utilisée comme broche de fin de course du moteur. Cela permet d'activer le # "sensorless homing". (Assurez-vous de régler également driver_SGT à une # valeur de sensibilité appropriée). La valeur par défaut est de ne pas activer # la recherche d'origine sans capteur.

source: [tmc2208 stepper_x] uart_pin: # The pin connected to the TMC2208 PDN_UART line. This parameter # must be provided. #tx_pin: # If using separate receive and transmit lines to communicate with # the driver then set uart_pin to the receive pin and tx_pin to the # transmit pin. The default is to use uart_pin for both reading and # writing. #select_pins: # A comma separated list of pins to set prior to accessing the # tmc2208 UART. This may be useful for configuring an analog mux for # UART communication. The default is to not configure any pins. #interpolate: True # If true, enable step interpolation (the driver will internally # step at a rate of 256 micro-steps). This interpolation does # introduce a small systemic positional deviation - see # TMC_Drivers.md for details. The default is True. run_current: # The amount of current (in amps RMS) to configure the driver to use # during stepper movement. This parameter must be provided. #hold_current: # The amount of current (in amps RMS) to configure the driver to use # when the stepper is not moving. Setting a hold_current is not # recommended (see TMC_Drivers.md for details). The default is to # not reduce the current. #sense_resistor: 0.110 # The resistance (in ohms) of the motor sense resistor. The default # is 0.110 ohms. #stealthchop_threshold: 0 # The velocity (in mm/s) to set the "stealthChop" threshold to. When # set, "stealthChop" mode will be enabled if the stepper motor # velocity is below this value. The default is 0, which disables # "stealthChop" mode. #driver_IHOLDDELAY: 8 #driver_TPOWERDOWN: 20 #driver_TBL: 2 #driver_TOFF: 3 #driver_HEND: 0 #driver_HSTRT: 5 #driver_PWM_AUTOGRAD: True #driver_PWM_AUTOSCALE: True #driver_PWM_LIM: 12 #driver_PWM_REG: 8 #driver_PWM_FREQ: 1 #driver_PWM_GRAD: 14 #driver_PWM_OFS: 36 # Set the given register during the configuration of the TMC2208 # chip. This may be used to set custom motor parameters. The # defaults for each parameter are next to the parameter name in the # above list.
fr: [tmc2208 stepper_x] uart_pin: # La broche connectée à la ligne PDN_UART de la TMC2208. Ce paramètre # doit être fourni. #tx_pin: # Si vous utilisez des lignes de réception et de transmission séparées pour communiquer avec # le pilote, réglez uart_pin sur la broche de réception et tx_pin sur la broche d'émission. # La valeur par défaut est d'utiliser uart_pin pour la lecture et l'écriture. #select_pins: # Une liste de broches, séparées par des virgules, à définir avant d'accéder à l'UART du # tmc2208. Ceci peut être utile pour configurer un mux analogique pour la # la communication UART. La valeur par défaut est de ne pas configurer de broches. #interpolate: True # Si true, active l'interpolation de pas (le pilote fera un pas interne à un taux de 256 micro-pas). # Cette interpolation introduit une petite déviation systémique de la position - voir # TMC_Drivers.md pour plus de détails. La valeur par défaut est True. run_current: # La quantité de courant (en ampères RMS) à configurer que le pilote utilise # pendant le mouvement du pas. Ce paramètre doit être fourni. #hold_current: # La quantité de courant (en ampères RMS) à configurer que le pilote utilise # lorsque le moteur pas à pas n'est pas en mouvement. La définition d'un hold_current n'est pas # recommandée (voir TMC_Drivers.md pour plus de détails). La valeur par défaut est de # ne pas réduire le courant. #sense_resistor: 0.110 # La résistance (en ohms) de la résistance de détection du moteur (Vréf). La valeur par défaut # est de 0.110 ohms. #stealthchop_threshold: 0 # La vitesse (en mm/s) à laquelle le seuil "stealthChop" doit être fixé. Lorsque # défini, le mode "stealthChop" sera activé si la vitesse du moteur pas à pas # est inférieure à cette valeur. La valeur par défaut est 0, ce qui désactive # le mode "stealthChop". #driver_IHOLDDELAY: 8 #driver_TPOWERDOWN: 20 #driver_TBL: 2 #driver_TOFF: 3 #driver_HEND: 0 #driver_HSTRT: 5 #driver_PWM_AUTOGRAD: True #driver_PWM_AUTOSCALE: True #driver_PWM_LIM: 12 #driver_PWM_REG: 8 #driver_PWM_FREQ: 1 #driver_PWM_GRAD: 14 #driver_PWM_OFS: 36 # Définissez le registre donné pendant la configuration de la puce TMC2208. # Ceci peut être utilisé pour définir les paramètres personnalisés du moteur. Les valeurs par défaut de # chaque paramètre sont indiquées à côté du nom du paramètre dans la liste ci-dessus.
zh_hans: [tmc2208 stepper_x] uart_pin: # 连接到TMC2208的PDN_UART的脚 # 这个参数必须给定 #tx_pin: # 如果使用分离接收和发送线的方式和驱动器通讯 # 可以设置uart_pin来作为接收脚，tx_pin作为发送脚 # 默认是使用uart_pin来读写 #select_pins: # 一个使用（英文）逗号分隔的引脚的列表。 # 这是访问tmc2208的UART之前要设置的引脚列表。 # 需要配置模拟开关来实现串口通讯时可能很有用 # 默认是不配置任何引脚 #interpolate: True # 如果为True，使能插补（驱动器会在内部使用256微步） # 这个插补会带来一个小的系统位置偏差 # 详见TMC_Drivers.md # 默认值是True run_current: # 配置驱动器在驱动步进电机移动时的电流（以电流的有效值安培为单位） # 这个参数必须给定 #hold_current: # 配置驱动器在步进电机不移动时的电流（以电流的有效值安培为单位） # 不建议设置保持电流（详见TMC_Drivers.md） # 默认是不减少电流 #sense_resistor: 0.110 # 电机采样电阻阻值（以欧姆为单位） # 默认是0.110欧姆 #stealthchop_threshold: 0 # 设置stealthChop模式的门槛速度（以毫米每秒为单位） # 当设置了这个量，步进电机速度低于这个值时会启用stealthChop模式 # 默认是0，意味着失能了stealthChop模式 #driver_IHOLDDELAY: 8 #driver_TPOWERDOWN: 20 #driver_TBL: 2 #driver_TOFF: 3 #driver_HEND: 0 #driver_HSTRT: 5 #driver_PWM_AUTOGRAD: True #driver_PWM_AUTOSCALE: True #driver_PWM_LIM: 12 #driver_PWM_REG: 8 #driver_PWM_FREQ: 1 #driver_PWM_GRAD: 14 #driver_PWM_OFS: 36 # 配置TMC2208时设置给定的寄存器值 # 设置定制的电机参数时使用 # 默认值如上
