Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Config_checks.po
Languages: bg, de, es, fr, hu, ko, pl, pt, pt_br, sk, tr, zh_hans, zh_hant

source: This document provides a list of steps to help confirm the pin settings in the Klipper printer.cfg file. It is a good idea to run through these steps after following the steps in the [installation document](Installation.md).
bg: Този документ съдържа списък със стъпки, които помагат да се потвърдят настройките на щифтовете във файла Klipper printer.cfg. Добре е да преминете през тези стъпки, след като сте изпълнили стъпките в [документа за инсталиране](Installation.md).
de: Dieses Dokument enthält eine Liste von Schritten, die bei der Bestätigung der Pin-Einstellungen in der Datei "Klipper printer.cfg" helfen. Es ist eine gute Idee, diese Schritte durchzugehen, nachdem Sie die Schritte im [Installationsdokument](Installation.md) ausgeführt haben.
es: Este documento contiene una lista con los pasos para configurar el pin del archivo Klipper printer.cfg. Se recomienda ejecutarlos una vez que se hayan terminado los pasos en [instalación documentos](installation.md).
fr: Ce document fournit une liste d'étapes permettant de confirmer les paramètres des broches dans le fichier printer.cfg de Klipper. Il est conseillé d'exécuter ces étapes après avoir suivi les étapes du [document d'installation](Installation.md).
hu: Ez a dokumentum a Klipper printer.cfg fájl tű beállításainak megerősítéséhez szükséges lépések listáját tartalmazza. Célszerű ezeket a lépéseket a [telepítési dokumentum](Installation.md) lépéseinek követésével végrehajtani.
ko: 이 문서는 Klipper printer.cfg 파일에서 핀 설정을 확인하는 데 도움이 되는 단계 목록을 제공합니다. [installation document](Installation.md)의 단계를 수행한 후 이 단계를 실행하는 것이 좋습니다.
pl: Ten dokument zawiera listę kroków, które pomogą potwierdzić ustawienia pinów w pliku konfiguracyjnym klipper printer.cfg. Dobrym pomysłem jest wykonanie tych kroków po wykonaniu czynności opisanych w [installation document](Installation.md).
pt: Esse documento fornece uma lista de passos para ajudar a confirmar as configurações de pinos no ficheiro printer.cfg do Klipper. É uma boa ideia executar esses passos após seguir o passo a passo de instalação conforme o [documento de instalação](Installation.md).
pt_br: Este documento fornece uma lista de etapas que ajudam a confirmar as configurações de pinos no arquivo printer.cfg do Klipper. É uma boa idéia executar essas etapas logo após seguir o passos do [documento de instalação](Installation.md).
sk: Tento dokument obsahuje zoznam krokov, ktoré vám pomôžu potvrdiť nastavenia pinov v súbore Klipper printer.cfg. Po vykonaní krokov v [installation document](Installation.md) je dobré prejsť si tieto kroky.
tr: Bu doküman Klipper printer.cfg dosyasında bulunan pin ayarları için bir dizi adım içermektedir. Bu adımların [yükleme dokümanı](Installation.md) içinde yer alan adımları takip ettikten sonra izlenmesi tavsiye edilir.
zh_hans: 本文档提供了帮助验证 Klipper printer.cfg 文件中的引脚设置的步骤列表。推荐在完成[安装文档](Installation.md) 中的步骤后执行本文档中的步骤。
zh_hant: 本文件提供了一系列幫助驗證 Klipper printer.cfg 檔案中的引腳設定的步驟。推薦在完成[安裝文件](Installation.md) 中的步驟后執行本文件中的步驟。

source: During this guide, it may be necessary to make changes to the Klipper config file. Be sure to issue a RESTART command after every change to the config file to ensure that the change takes effect (type "restart" in the Octoprint terminal tab and then click "Send"). It's also a good idea to issue a STATUS command after every RESTART to verify that the config file is successfully loaded.
bg: По време на това ръководство може да се наложи да се направят промени в конфигурационния файл на Klipper. Не забравяйте да издавате команда RESTART (рестартиране) след всяка промяна в конфигурационния файл, за да се уверите, че промяната влиза в сила (въведете "restart" (рестартиране) в терминалния раздел на Octoprint и след това щракнете върху "Send" (изпрати)). Добре е също така да издавате команда STATUS след всеки RESTART, за да проверите дали конфигурационният файл е зареден успешно.
de: Während dieser Anleitung kann es notwendig sein, Änderungen an der Klipper-Konfigurationsdatei vorzunehmen. Stellen Sie sicher, dass Sie nach jeder Änderung an der Konfigurationsdatei einen RESTART-Befehl erteilen, um sicherzustellen, dass die Änderung wirksam wird (geben Sie "restart" in der Octoprint-Terminal-Registerkarte ein und klicken Sie dann auf "Senden"). Es ist auch eine gute Idee, nach jedem RESTART einen STATUS-Befehl zu geben, um zu überprüfen, ob die Konfigurationsdatei erfolgreich geladen wurde.
es: A lo largo de esta guía puede ser necesario hacer cambios en el archivo config Klipper. Es importante ejecutar el comando RESTART después de cada cambio en el susodicho archivo para asegurar que los cambios han tenido efecto (escriba "restart" en la pestaña del terminal Octoprint y pulse "Send"). Se recomienda también usar el comando STATUS después de cada RESTART para verificar que este archivo se ha cargado correctamente.
fr: Pendant ce guide, il peut être nécessaire d'apporter des modifications au fichier de configuration de Klipper. Veillez à émettre une commande RESTART après chaque modification du fichier de configuration pour vous assurer que la modification prend effet (tapez "restart" dans l'onglet du terminal Octoprint et cliquez ensuite sur "Send"). C'est aussi une bonne idée d'envoyer une commande STATUS après chaque RESTART pour vérifier que le fichier de configuration a été chargé avec succès.
hu: Az útmutató során szükség lehet a Klipper konfigurációs fájljának módosítására. Ügyelj arra, hogy a konfigurációs fájl minden módosítása után adj ki egy RESTART parancsot, hogy megbizonyosodj arról, hogy a változtatás érvénybe lép (írd be a "restart" kifejezést az Octoprint terminál lapjára, majd kattints a "Küldés" gombra). Az is jó ötlet, hogy minden RESTART után kiadsz egy STATUS parancsot a konfigurációs fájl sikeres betöltésének ellenőrzésére.
ko: 이 가이드를 진행하는 동안 Klipper 구성 파일을 변경해야 할 수도 있습니다. 구성 파일을 변경할 때마다 RESTART 명령을 실행하여 변경 사항이 적용되도록 하십시오(Octoprint 터미널 탭에 "restart"를 입력한 다음 "보내기"를 클릭하십시오). 구성 파일이 성공적으로 로드되었는지 확인하기 위해 모든 RESTART 후에 STATUS 명령을 실행하는 것도 좋은 방법입니다.
pl: Podczas tego przewodnika może być konieczne wprowadzenie zmian w pliku konfiguracyjnym Klippera. Pamiętaj, aby wydać polecenie RESTART po każdej zmianie w pliku konfiguracyjnym, aby mieć pewność, że zmiana zacznie obowiązywać (wpisz „restart” w zakładce terminala Octoprint, a następnie kliknij „Wyślij”). Dobrym pomysłem jest również wydanie polecenia STATUS po każdym RESTARTU, aby sprawdzić, czy plik konfiguracyjny został pomyślnie załadowany.
pt: Durante este guia, talvez seja necessário fazer mudanças no ficheiro de configurações do Klipper. Certifique-se de emitir um comando de RESTART após cada mudança no ficheiro de configuração, garantindo que as mudanças tenham efeito (digite "restart" na aba do terminal do Octoprint e clique em "Send"). Também é uma boa ideia de emitir um comando STATUS depois de todas as reinicializações, para verificar se o ficheiro de configurações foi carregado corretamente.
pt_br: Durante este guia, pode ser necessário fazer alterações no arquivo de configuração do Klipper. Certifique-se de enviar um comando RESTART após cada alteração no arquivo de configuração, para garantir que a alteração tenha efeito (digite "restart" na aba terminal do Octoprint e clique em "Enviar" ou "Send"). Também é uma boa ideia enviar um comando STATUS após cada RESTART para verificar se o arquivo de configuração foi carregado corretamente.
sk: Počas tejto príručky môže byť potrebné vykonať zmeny v konfiguračnom súbore Klipper. Uistite sa, že po každej zmene konfiguračného súboru vydáte príkaz RESTART, aby ste sa uistili, že sa zmena prejaví (na karte Octoprint terminal napíšte „restart“ a potom kliknite na „Odoslať“). Je tiež dobré po každom REŠTARTE vydať príkaz STATUS, aby ste si overili, či sa konfiguračný súbor úspešne načítal.
tr: Bu klavuz sırasında Klipper konfigürasyon dosyasında değişiklik yapılması gerekebilir. Konfigürasyon dosyasında yapılan her değişiklikten sonra RESTART komutunu vererek değişikliklerin etkin olduğundan emin olun (Octoprint terminal sekmesinde "restart" yazıp "Send" butonuna tıklayın). Her RESTART sonrasında STATUS komutunu çalıştırıp konfigürasyon dosyasının başarıyla okunduğunu doğrulamak iyi bir fikir olacaktır.
zh_hans: 在执行指南的过程中，可能需要修改 Klipper 的配置文件。请务必在每次修改配置文件后发送 RESTART 命令，以确保修改成功生效（在 Octoprint 终端标签中输入 "RESTART"（重启），然后点击 "发送"）。在每次 RESTART 之后最好再发出一次 STATUS （状态）命令，以验证配置文件是否成功加载。
zh_hant: 在執行此指南的過程中，可能需要修改 Klipper 的配置檔案。請務必在每次修改配置檔案后發送 RESTART 命令，以確保修改成功生效（在 Octoprint 終端標籤中輸入 "RESTART"（重啟），然後點選 "Send"（發送））。在每次重啟之後最好再發出一次 STATUS （狀態）命令，以驗證配置檔案是否成功載入。

source: Verify temperature
bg: Проверка на температурата
de: Prüfen der Temperatur
es: Verifique la temperatura
fr: Vérifier la température
hu: Ellenőrizd a hőmérsékletet
ko: 온도 확인
pl: Sprawdź temperaturę
pt: Verificar temperatura
pt_br: Verifique a temperatura
sk: Overte teplotu
tr: Sıcaklığı doğrula
zh_hans: 验证温度
zh_hant: 驗證溫度

source: Start by verifying that temperatures are being properly reported. Navigate to the Octoprint temperature tab.
de: Beginnen Sie mit der Überprüfung, ob die Temperaturen korrekt gemeldet werden. Navigieren Sie zur Registerkarte "Octoprint-Temperatur".
fr: Commencez par vérifier que les températures sont correctement rapportées. Naviguez vers l'onglet température d'Octoprint.
ko: 온도가 제대로 보고되고 있는지 확인하세요. Octoprint 온도 탭으로 이동합니다.
pl: Zacznij od sprawdzenia, czy temperatury są prawidłowo raportowane. Przejdź do zakładki Temperatura Octoprint.
pt_br: Comece verificando se as temperaturas estão sendo relatadas corretamente. Navegue até a aba temperatura do Octoprint.
zh_hans: 首先验证温度是否被正确的报告。导航到 Octoprint 温度选项卡。
zh_hant: 首先驗證溫度是否被正確的報告。導航到 Octoprint 溫度選項卡。

source: ![octoprint-temperature](img/octoprint-temperature.png)
fr: ![temperature-octoprint](img/octoprint-temperature.png)
pt_br: ![temperatura-no-octoprint](img/octoprint-temperature.png)
zh_hans: ![octoprint-温度](img/octoprint-temperature.png)
zh_hant: ![octoprint-溫度](img/octoprint-temperature.png)

source: Verify that the temperature of the nozzle and bed (if applicable) are present and not increasing. If it is increasing, remove power from the printer. If the temperatures are not accurate, review the "sensor_type" and "sensor_pin" settings for the nozzle and/or bed.
de: Überprüfen Sie, ob die Temperatur der Düse und des Bettes (falls zutreffend) vorhanden ist und nicht ansteigt. Wenn sie ansteigt, trennen Sie den Drucker von der Stromversorgung. Wenn die Temperaturen nicht genau sind, überprüfen Sie die Einstellungen "sensor_type" und "sensor_pin" für die Düse und/oder das Bett.
fr: Vérifiez que la température de la buse et du plateau chauffant (le cas échéant) est présente et n'augmente pas. Si elle augmente, mettez l'imprimante hors tension. Si les températures ne sont pas précises, vérifiez les paramètres "sensor_type" et "sensor_pin" pour la buse et/ou le plateau chauffant.
ko: 노즐과 베드(해당되는 경우)의 온도가 있고 증가하지 않는지 확인합니다. 증가하는 경우 프린터에서 전원을 제거하십시오. 온도가 정확하지 않으면 노즐 및/또는 베드에 대한 "sensor_type" 및 "sensor_pin" 설정을 검토하십시오.
pl: Sprawdź, czy temperatura dyszy i złoża (jeśli dotyczy) jest obecna i nie wzrasta. Jeśli rośnie, odłącz zasilanie od drukarki. Jeśli temperatury nie rosnie, sprawdź ustawienia „sensor_type” i „sensor_pin” dla dyszy i/lub stołu.
pt_br: Verifique se a temperatura do bico e da base (se aplicável) estão presentes e se não estão aumentando. Se estiver aumentando, desligue a impressora. Se as temperaturas não forem precisas, revise as configurações de "sensor_type" e "sensor_pin" para o bico e/ou base.
zh_hans: 确认喷嘴和热床（如果适用）的温度合理且不在上升。如果正在上升，请断开打印机的电源。如果温度显示不准确，请检查喷嘴和/或热床的 “sensor_type” 和 “sensor_pin” 设置。
zh_hant: 確認噴嘴和熱床（如果適用）的溫度合理且不在上升。如果溫度正在上升，請立即斷開印表機的電源。如果溫度顯示不準確，請檢查熱端和/或熱床的 「sensor_type」 和 「sensor_pin」 設定。

source: Verify M112
bg: Проверка на M112
de: Überprüfen Sie M112
es: Verifica M112
fr: Vérifier M112
hu: Ellenőrzés M112
ko: M112 확인
pl: Sprawdź M112
pt: Verificar M112
pt_br: Verificar o M112
sk: Overte M112
tr: M112 doğrula
zh_hans: 验证 M112
zh_hant: 驗證 M112

source: Navigate to the Octoprint terminal tab and issue an M112 command in the terminal box. This command requests Klipper to go into a "shutdown" state. It will cause Octoprint to disconnect from Klipper - navigate to the Connection area and click on "Connect" to cause Octoprint to reconnect. Then navigate to the Octoprint temperature tab and verify that temperatures continue to update and the temperatures are not increasing. If temperatures are increasing, remove power from the printer.
de: Navigieren Sie zur Registerkarte "Octoprint-Terminal" und geben Sie einen M112-Befehl in der Terminalbox ein. Dieser Befehl fordert Klipper auf, in einen "Shutdown"-Zustand zu gehen. Dies führt dazu, dass Octoprint die Verbindung zu Klipper trennt - navigieren Sie zum Bereich "Verbindung" und klicken Sie auf "Verbinden", damit Octoprint die Verbindung wieder aufnimmt. Navigieren Sie dann zur Registerkarte "Octoprint-Temperatur" und überprüfen Sie, ob die Temperaturen weiterhin aktualisiert werden und nicht ansteigen. Wenn die Temperaturen ansteigen, trennen Sie den Drucker von der Stromversorgung.
fr: Naviguez vers l'onglet du terminal Octoprint et lancez une commande M112 dans la boîte du terminal. Cette commande demande à Klipper de se mettre dans un état "d'arrêt". Octoprint se déconnectera de Klipper - naviguez vers la zone de connexion et cliquez sur "Connecter" pour reconnecter Octoprint. Ensuite, naviguez vers l'onglet température d'Octoprint et vérifiez que les températures continuent à se mettre à jour et qu'elles n'augmentent pas. Si les températures augmentent, coupez l'alimentation de l'imprimante.
ko: Octoprint 터미널 탭으로 이동하여 터미널 상자에서 M112 명령을 실행합니다. 이 명령은 Klipper가 "종료" 상태가 되도록 요청합니다. Octoprint와 Klipper의 연결이 끊어질 것입니다. 연결 영역으로 이동한 다음 "연결"을 클릭하면 Octoprint가 다시 연결됩니다. 그런 다음 Octoprint 온도 탭으로 이동하여 온도가 계속 업데이트되고 온도가 증가하지 않는지 확인합니다. 온도가 올라가면 프린터의 전원을 차단하십시오.
pl: Przejść do karty terminala Octoprint i wyday polecenie M112 w oknie terminala. To polecenie żąda, aby Klipper przeszedł w stan "wyłączenia". Spowoduje odłączenie się ze urządzenia Octoprint od urządzenia Klipper - przejść do obszaru Połączenie i klikni "Połącz", aby spowodować ponowne połączenie się z urządzeniem Octoprint. Następnie przejść do karty Temperatura Octoprint i sprawdzić, czy temperatury są nadal aktualizowane i czy nie wzrastają. Jeśli temperatury wzrastają, odłączyć zasilanie od drukarki.
pt_br: Navegue até a aba terminal do Octoprint e envie o comando M112 na caixa do terminal. Este comando irá solicitar ao Klipper para que entre em estado de "desligamento" e isso fará com que o Octoprint se desconecte do Klipper. Navegue até a área de conexão e clique em "Conectar" para que o Octoprint se reconecte. Em seguida, navegue até a aba temperatura do Octoprint e verifique se as temperaturas continuam sendo atualizadas e se não estão aumentando. Se as temperaturas estiverem aumentando, desligue a impressora.
zh_hans: 找到 Octoprint 终端选项卡并在控制台发送 M112 命令。此命令会使 Klipper 进入关闭状态。这将导致 Octoprint 与 Klipper 断开链接-找到连接板块单击 "Connect"以使 Octoprint 重新连接。然后找到 Octoprint 温度选项卡验证温度是否持续更新并观察温度有没有增加。如果温度升高，请关闭打印机电源。
zh_hant: 導航到 Octoprint 終端選項卡並通過終端發送 M112 命令。該命令會使 Klipper 進入關閉狀態，並導致 Octoprint 與 Klipper 斷開鏈接。找到連線板塊單擊 "Connect"（連線）以重新連線到 Klipper。然後在 Octoprint 溫度選項卡中驗證溫度是否持續更新和升高。如果溫度升高，請立即斷開印表機電源。

source: The M112 command causes Klipper to go into a "shutdown" state. To clear this state, issue a FIRMWARE_RESTART command in the Octoprint terminal tab.
de: Der M112-Befehl veranlasst Klipper, in einen "Shutdown"-Zustand zu gehen. Um diesen Zustand zu löschen, geben Sie einen FIRMWARE_RESTART-Befehl in der Octoprint-Terminal-Registerkarte aus.
fr: La commande M112 fait passer Klipper dans un état "d'arrêt". Pour effacer cet état, lancez la commande FIRMWARE_RESTART dans l'onglet du terminal Octoprint.
ko: M112 명령은 Klipper를 "종료" 상태로 만듭니다. 이 상태를 초기화 하려면 Octoprint 터미널 탭에서 FIRMWARE_RESTART 명령을 실행하십시오.
pl: Komenda M112 powoduje przejście Klippera w stan "shutdown". Opuszczenie tego stanu można wywołać komendą FIRMWARE_RESTART w zakładce terminala Octoprint.
pt_br: O comando M112 faz com que o Klipper entre um estado de "desligamento". Para sair deste estado, execute o comando FIRMWARE_RESTART na aba terminal do Octoprint.
zh_hans: M112 命令会使 Klipper 进入 "shutdown"（关闭）状态。要退出这一状态，请在 Octoprint 终端选项卡中发出 FIRMWARE_RESTART 命令。
zh_hant: M112 命令會使 Klipper 進入 "shutdown"（關閉）狀態。要退出這一狀態，請在 Octoprint 終端選項卡中發出 FIRMWARE_RESTART 命令。

source: Verify heaters
bg: Проверка на нагревателите
de: Prüfen Sie die Heizungen
es: Verifique los calentadores
fr: Vérifier la cartouche chauffante
hu: Ellenőrizd a fűtőtesteket
ko: 히터 확인
pl: Sprawdź grzałki
pt: Verificar aquecedores
pt_br: Verifique os aquecedores
sk: Overenie ohrievačov
tr: Isıtıcıları doğrula
zh_hans: 验证加热器
zh_hant: 驗證加熱器

source: Navigate to the Octoprint temperature tab and type in 50 followed by enter in the "Tool" temperature box. The extruder temperature in the graph should start to increase (within about 30 seconds or so). Then go to the "Tool" temperature drop-down box and select "Off". After several minutes the temperature should start to return to its initial room temperature value. If the temperature does not increase then verify the "heater_pin" setting in the config.
de: Navigieren Sie zur Registerkarte "Octoprint temperature" (Octoprint-Temperatur) und geben Sie im Feld "Tool" (Werkzeug) den Wert 50 gefolgt von der Eingabetaste ein. Die Extrudertemperatur in der Grafik sollte beginnen, sich zu erhöhen (innerhalb von etwa 30 Sekunden oder so). Gehen Sie dann zum Dropdown-Feld "Tool"-Temperatur und wählen Sie "Off". Nach einigen Minuten sollte die Temperatur auf den ursprünglichen Wert der Raumtemperatur zurückkehren. Wenn die Temperatur nicht ansteigt, überprüfen Sie die "heater_pin"-Einstellung in der Konfiguration.
fr: Naviguez jusqu'à l'onglet température d'Octoprint et tapez 50 suivi d'une entrée dans la boîte de température "Tool". La température de l'extrudeuse dans le graphique devrait commencer à augmenter (dans les 30 secondes environ). Ensuite, allez dans la boîte déroulante de la température de l'outil et sélectionnez "Off". Après plusieurs minutes, la température devrait commencer à revenir à sa valeur initiale de température ambiante. Si la température n'augmente pas, vérifiez le paramètre "heater_pin" dans la configuration.
ko: Octoprint 온도 탭으로 이동하여 "Tool"의 온도에 50을 입력합니다. 그래프의 압출기 온도가 증가하기 시작해야 합니다(약 30초 이내). 그런 다음 "Tool"의 온도에 드롭다운 메뉴에서 "끄기"를 선택합니다. 몇 분 후에 온도가 초기 실내 온도 값으로 돌아가기 시작해야 합니다. 온도가 증가하지 않으면 구성에서 "heater_pin" 설정을 확인하십시오.
pl: Przejść do zakładki Octoprint temperature i wpisai 50 w polu temperatury "Tool". Temperatura ekstrudera na wykresie powinna zacząć wzrastać (w ciągu około 30 sekund lub tak). Następnie przechodzimy do rozwijanego pola temperatury "Tool" i wybieramy "Off". Po kilku minutach temperatura powinna zacząć wracać do początkowej wartości temperatury pokojowej. Jeśli temperatura nie wzrasta, należy sprawdzić ustawienie "heater_pin" w konfiguracji.
pt_br: Navegue até a aba temperatura do Octoprint e na caixa de temperatura "Ferramenta", digite 50 e tecle em enter. No gráfico a temperatura da extrusora deverá começar a aumentar (aguarde por volta de 30 segundos ou mais). Em seguida, selecione "Desligar" ao lado da caixa suspensa de temperatura "Ferramenta". Após vários minutos, a temperatura deverá retornar ao seu valor inicial, na temperatura ambiente. Se a temperatura não aumentar, verifique a configuração "heater_pin".
zh_hans: 导航到 Octoprint 温度选项卡并输入 50，然后在“Tool”温度框中输入。 图中的挤出机温度应开始升高（约 30 秒左右）。 然后转到“Tool”温度下拉框并选择“关闭”。 几分钟后，温度应开始恢复到其初始室温值。 如果温度没有升高，则验证配置中的“heater_pin”设置。
zh_hant: 導航到 Octoprint 溫度選項卡中的「Tool」（工具）溫度框，輸入 50 並按下回車。 圖中的擠出頭溫度應開始升高（在約 30 秒左右的時間內）。 然後在工具溫度的下拉框中選擇「off」（關閉）。 幾分鐘后，溫度應開始恢復到其初始室溫值。 如果溫度沒有上升，需要檢查配置中的「heater_pin」設定是否正確。

source: If the printer has a heated bed then perform the above test again with the bed.
bg: Ако принтерът има отопляемо легло, извършете горния тест отново с леглото.
de: Wenn der Drucker über ein beheiztes Bett verfügt, führen Sie den obigen Test erneut mit dem Bett durch.
es: Si la temperatura de la cama es también alta, haga el mismo test para la cama esta vez.
fr: Si l'imprimante est équipée d'un plateau chauffant, effectuez à nouveau le test ci-dessus avec le plateau.
hu: Ha a nyomtató fűtött ággyal rendelkezik, akkor végezd el a fenti vizsgálatot a tárgyasztalnál is.
ko: 프린터에 히팅 베드가 있는 경우 베드를 사용하여 위의 테스트를 다시 수행하십시오.
pl: Jeśli drukarka ma podgrzewane łoże, wykonaj powyższy test ponownie z tym łożem.
pt: Se a impressora tiver uma base aquecida, efetue o procedimento com descrito no teste acima com a base.
pt_br: Se a impressora tiver uma base aquecida, efetue o procedimento com descrito no teste acima com a base.
sk: Ak má tlačiareň vyhrievané lôžko, vykonajte vyššie uvedený test znova s lôžkom.
tr: Yazıcı ısıtılmış bir baskı yatağına sahip ise yukarıdaki testi baskı yatağı ile tekrarlayın.
zh_hans: 如果打印机带有热床，则用热床重复上述测试。
zh_hant: 如果印表機帶有熱床，則用熱床重複上述測試。

source: Verify stepper motor enable pin
bg: Проверка на щифта за разрешаване на стъпковия двигател
de: Schrittmotor-Freigabe-Pin verifizieren
es: Verifique el pin del motor de pasos
fr: Vérifier l'activation du moteur pas à pas
hu: A léptetőmotor engedélyező tű ellenőrzése
ko: 스테퍼 모터 enable pin 확인
pl: Sprawdź pin włączający silnik krokowy
pt: Verifique o pino de ativação do motor de passo
pt_br: Verifique o pino de ativação do motor de passo
sk: Skontrolujte aktivačný pin krokového motora
tr: Step motorun enable pinini doğrulayın
zh_hans: 验证步进电机 enable（启用）引脚
zh_hant: 驗證步進電機 enable（啟用）引腳
