Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Config_Reference.po
Languages: fr, zh_hans

source: [adxl345] cs_pin: # The SPI enable pin for the sensor. This parameter must be provided. #spi_speed: 5000000 # The SPI speed (in hz) to use when communicating with the chip. # The default is 5000000. #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # See the "common SPI settings" section for a description of the # above parameters. #axes_map: x, y, z # The accelerometer axis for each of the printer's X, Y, and Z axes. # This may be useful if the accelerometer is mounted in an # orientation that does not match the printer orientation. For # example, one could set this to "y, x, z" to swap the X and Y axes. # It is also possible to negate an axis if the accelerometer # direction is reversed (eg, "x, z, -y"). The default is "x, y, z". #rate: 3200 # Output data rate for ADXL345. ADXL345 supports the following data # rates: 3200, 1600, 800, 400, 200, 100, 50, and 25. Note that it is # not recommended to change this rate from the default 3200, and # rates below 800 will considerably affect the quality of resonance # measurements.
fr: [adxl345] cs_pin: # La broche d'activation SPI du capteur. Ce paramètre doit être fourni. #spi_speed: 5000000 # La vitesse SPI (en hz) à utiliser lors de la communication avec la puce. # La valeur par défaut est 5000000. #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # Voir la section "paramètres SPI communs" pour une description des # paramètres ci-dessus. #axes_map : x, y, z # L'axe de l'accéléromètre de chacun des axes X, Y et Z de l'imprimante. # Ceci peut être utile si l'accéléromètre est monté dans une orientation # qui ne correspond pas à celle de l'imprimante. Par exemple, on peut # régler cette option sur "y, x, z" pour permuter les axes X et Y. # Il est également possible d'inverser un axe si la direction de l'accéléromètre # est inversée (par exemple, "x, z, -y"). La valeur par défaut est "x, y, z". #Rate: 3200 # Débit de données de sortie pour ADXL345. ADXL345 prend en charge les débits # de données suivants : 3200, 1600, 800, 400, 200, 100, 50, et 25. Notez qu'il n'est # pas recommandé de changer ce débit par rapport au débit par défaut de 3200, # les débits inférieurs à 800 affecteront considérablement la qualité des mesures # de résonance.
zh_hans: [adxl345] cs_pin: # 传感器的 SPI 启用引脚。 # 必须提供此参数。 #spi_speed: 5000000 # 与芯片通信时使用的SPI速度(hz)。 # 默认为5000000。 #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # 参见"常见的SPI设置"章节，以了解对上述参数的描述。 #axes_map: x, y, z # 打印机的X、Y和Z轴的加速度计轴。 # 如果加速度计的安装方向与打印机的方向不一致， # 可能需要修改该设定。 # 例如，可以将其设置为"y, x, z"来交换X和Y轴。 # 如果加速度计方向是相反的，可能需要反转相应轴 # （例如，"x, z, -y"）。 # 默认是"x, y, z"。 #rate: 3200 # ADXL345的输出数据速率。ADXL345支持以下数据速率。 # 3200、1600、800、400、200、100、50和25。请注意，不建议 # 将此速率从默认的3200改为低于800的速率，这将大大影响 # 共振测量的质量。

source: # The "replicape" config section adds "replicape:stepper_x_enable" # virtual stepper enable pins (for steppers X, Y, Z, E, and H) and # "replicape:power_x" PWM output pins (for hotbed, e, h, fan0, fan1, # fan2, and fan3) that may then be used elsewhere in the config file. [replicape] revision: # The replicape hardware revision. Currently only revision "B3" is # supported. This parameter must be provided. #enable_pin: !gpio0_20 # The replicape global enable pin. The default is !gpio0_20 (aka # P9_41). host_mcu: # The name of the mcu config section that communicates with the # Klipper "linux process" mcu instance. This parameter must be # provided. #standstill_power_down: False # This parameter controls the CFG6_ENN line on all stepper # motors. True sets the enable lines to "open". The default is # False. #stepper_x_microstep_mode: #stepper_y_microstep_mode: #stepper_z_microstep_mode: #stepper_e_microstep_mode: #stepper_h_microstep_mode: # This parameter controls the CFG1 and CFG2 pins of the given # stepper motor driver. Available options are: disable, 1, 2, # spread2, 4, 16, spread4, spread16, stealth4, and stealth16. The # default is disable. #stepper_x_current: #stepper_y_current: #stepper_z_current: #stepper_e_current: #stepper_h_current: # The configured maximum current (in Amps) of the stepper motor # driver. This parameter must be provided if the stepper is not in a # disable mode. #stepper_x_chopper_off_time_high: #stepper_y_chopper_off_time_high: #stepper_z_chopper_off_time_high: #stepper_e_chopper_off_time_high: #stepper_h_chopper_off_time_high: # This parameter controls the CFG0 pin of the stepper motor driver # (True sets CFG0 high, False sets it low). The default is False. #stepper_x_chopper_hysteresis_high: #stepper_y_chopper_hysteresis_high: #stepper_z_chopper_hysteresis_high: #stepper_e_chopper_hysteresis_high: #stepper_h_chopper_hysteresis_high: # This parameter controls the CFG4 pin of the stepper motor driver # (True sets CFG4 high, False sets it low). The default is False. #stepper_x_chopper_blank_time_high: #stepper_y_chopper_blank_time_high: #stepper_z_chopper_blank_time_high: #stepper_e_chopper_blank_time_high: #stepper_h_chopper_blank_time_high: # This parameter controls the CFG5 pin of the stepper motor driver # (True sets CFG5 high, False sets it low). The default is True.
fr: # La section de configuration "replicape" ajoute "replicape:stepper_x_enable". # des broches virtuelles d'activation de moteur pas à pas (pour les moteurs X, Y, Z, E et H) et # "replicape:power_x" des broches de sortie PWM (pour les pilotes, e, h, fan0, fan1, # fan2, et fan3) utilisables ailleurs dans le fichier de configuration. [replicape] revision: # La révision du matériel replicape. Actuellement, seule la révision "B3" est # supportée. Ce paramètre doit être fourni. #enable_pin: !gpio0_20 # La broche d'activation globale de la replicape. La valeur par défaut est !gpio0_20 (aka # P9_41). host_mcu : # Le nom de la section de configuration mcu communiquant avec la section de # l'instance mcu du "processus linux" de Klipper. Ce paramètre doit être # fourni. #standstill_power_down: False # Ce paramètre contrôle la ligne CFG6_ENN sur tous les moteurs pas à pas. # True règle les lignes d'activation sur "ouvert". La valeur par défaut est # False. #stepper_x_microstep_mode: #stepper_y_microstep_mode: #stepper_z_microstep_mode: #stepper_e_microstep_mode: #stepper_h_microstep_mode: # Ce paramètre contrôle les broches CFG1 et CFG2 du # pilote de moteur pas à pas donné. # Les options disponibles sont : disable, 1, 2, spread2, 4, 16, spread4, spread16, stealth4, # et stealth16. La valeur par défaut est disable. #stepper_x_current: #stepper_y_current: #stepper_z_current: #stepper_e_current: #stepper_h_current: # Le courant maximum configuré (en Ampères) du moteur pas à pas. # Ce paramètre doit être fourni si le moteur pas à pas n'est pas dans un # mode désactivé. #stepper_x_chopper_off_time_high: #stepper_y_chopper_off_time_high: #stepper_z_chopper_off_time_high: #stepper_e_chopper_off_time_high: #stepper_h_chopper_off_time_high: # Ce paramètre contrôle la broche CFG0 du pilote du moteur pas à pas. # (True place CFG0 en haut, False le place en bas). La valeur par défaut est False. #stepper_x_chopper_hysteresis_high: #stepper_y_chopper_hysteresis_high: #stepper_z_chopper_hysteresis_high: #stepper_e_chopper_hysteresis_high: #stepper_h_chopper_hysteresis_high: # Ce paramètre contrôle la broche CFG4 du pilote du moteur pas à pas. # (True place CFG4 en haut, False le place en bas). La valeur par défaut est False. #stepper_x_chopper_blank_time_high: #stepper_y_chopper_blank_time_high: #stepper_z_chopper_blank_time_high: #stepper_e_chopper_blank_time_high: #stepper_h_chopper_blank_time_high: # Ce paramètre contrôle la broche CFG5 du pilote du moteur pas à pas. # (True place CFG5 en haut, False le place en bas). La valeur par défaut est True.
zh_hans: # "replicape"配置分段添加了"replicape:stepper_x_enable"虚拟步进使能 # 引脚（适用于X、Y、Z、E和H的步进电机）以及"replicape:power_x" # PWM输出引脚（适用于热床、E、H、风扇0、风扇1，风扇2和风扇3） # ，然后可以在配置文件的其他地方使用。 [replicape] revision: # Replicape硬件修订版本。目前只支持"B3"版本。 # 必须提供此参数。 #enable_pin: !gpio0_20 # Replicape全局使能引脚。 # 默认值为!gpio0_20（即P9_41）。 host_mcu: # 与Klipper "linux process" mcu实例通信的mcu配置部分的名称。 # 必须提供此参数。 #standstill_power_down: False # 此参数控制所有步进电机的CFG6_ENN线。True将使能线设置为"打开"。 # 默认值为False。 #stepper_x_microstep_mode: #stepper_y_microstep_mode: #stepper_z_microstep_mode: #stepper_e_microstep_mode: #stepper_h_microstep_mode: # 此参数控制给定步进电机驱动器的CFG1和CFG2引脚。可用选项包括：禁用，1，2， # spread2, 4, 16, spread4, spread16, stealth4和stealth16。 # 默认为禁用。 #stepper_x_current: #stepper_y_current: #stepper_z_current: #stepper_e_current: #stepper_h_current: # 步进电机驱动器的最大电流（以Amp为单位）的配置。 # 如果步进器不处于禁用模式，必须提供此参数。 #stepper_x_chopper_off_time_high: #stepper_y_chopper_off_time_high: #stepper_z_chopper_off_time_high: #stepper_e_chopper_off_time_high: #stepper_h_chopper_off_time_high: # 此参数控制步进电机驱动器的CFG0引脚（True设置CFG0高，False设置它低）。 # 默认为False。 #stepper_x_chopper_hysteresis_high: #stepper_y_chopper_hysteresis_high: #stepper_z_chopper_hysteresis_high: #stepper_e_chopper_hysteresis_high: #stepper_h_chopper_hysteresis_high: # 此参数控制步进电机驱动器的CFG4引脚（True设置CFG4高，False设置它低）。 # 默认为False。 #stepper_x_chopper_blank_time_high: #stepper_y_chopper_blank_time_high: #stepper_z_chopper_blank_time_high: #stepper_e_chopper_blank_time_high: #stepper_h_chopper_blank_time_high: # 此参数控制步进电机驱动器的CFG5引脚（True设置CFG5高，False设置它低）。 # 默认为True。

source: See the [bed mesh guide](Bed_Mesh.md) and [command reference](G-Codes.md#bed_mesh) for additional information.
fr: Consultez le [guide du maillage du lit](Bed_Mesh.md) et la [référence de la commande](G-Codes.md#bed_mesh) pour plus d'informations.
zh_hans: 更多信息请参阅 [网床指南](Bed_Mesh.md)和[命令参考](G-Codes.md#bed_mesh)。

source: See the [command reference](G-Codes.md#bed_tilt) for additional information.
fr: Voir la [référence de la commande](G-Codes.md#bed_tilt) pour plus d'informations.
zh_hans: 更多信息请参阅[命令参考](G-Codes.md#bed_tilt) 。

source: See the [leveling guide](Manual_Level.md#adjusting-bed-leveling-screws) and [command reference](G-Codes.md#bed_screws) for additional information.
fr: Consultez le [guide de nivelage](Manual_Level.md#adjusting-bed-leveling-screws) et la [référence de commande](G-Codes.md#bed_screws) pour plus d'informations.
zh_hans: 有关更多信息，请参阅 [调平指南](Manual_Level.md#adjusting-bed-leveling-screws)和 [命令参考](G-Codes.md#bed_screws)。

source: See the [leveling guide](Manual_Level.md#adjusting-bed-leveling-screws-using-the-bed-probe) and [command reference](G-Codes.md#screws_tilt_adjust) for additional information.
fr: Voir le [guide de nivelage](Manual_Level.md#adjusting-bed-leveling-screws-using-the-bed-probe) et la [référence de commande](G-Codes.md#screws_tilt_adjust) pour des informations supplémentaires.
zh_hans: 请参阅[调平指南](Manual_Level.md#adjusting-bed-leveling-screws-using-the-bed-probe)和[命令参考](G-Code.md#screws_tilt_adjust)了解更多信息。

source: Multiple Z stepper tilt adjustment. This feature enables independent adjustment of multiple z steppers (see the "stepper_z1" section) to adjust for tilt. If this section is present then a Z_TILT_ADJUST extended [G-Code command](G-Codes.md#z_tilt) becomes available.
fr: Réglage de l'inclinaison de plusieurs moteurs pas à pas de l'axe Z. Cette fonction permet d'ajuster de manière indépendante l'inclinaison de plusieurs moteurs Z (voir la section "stepper_z1"). Si cette section est présente, une [commande G-Code étendue Z_TILT_ADJUST](G-Codes.md#z_tilt) devient disponible.
zh_hans: 多个独立Z轴步进电机的倾斜校正。这个功能可以独立调整多个 Z 步进电机（见"stepper_z1"部分），以调整倾斜度。如果该分段存在，那么Z_TILT_ADJUST 扩展[G代码命令](G-Code.md#z_tilt)就可用。

source: Printer Skew Correction. It is possible to use software to correct printer skew across 3 planes, xy, xz, yz. This is done by printing a calibration model along a plane and measuring three lengths. Due to the nature of skew correction these lengths are set via gcode. See [Skew Correction](Skew_Correction.md) and [Command Reference](G-Codes.md#skew_correction) for details.
fr: Correction de l'inclinaison de l'imprimante. Il est possible d'utiliser un logiciel pour corriger l'inclinaison de l'imprimante sur 3 plans, xy, xz, yz. Pour ce faire, on imprime un modèle d'étalonnage le long d'un plan et on mesure trois longueurs. En raison de la nature de la correction d'obliquité, ces longueurs sont définies via le gcode. Voir [Skew Correction](Skew_Correction.md) et [Command Reference](G-Codes.md#skew_correction) pour plus de détails.
zh_hans: 打印机偏斜校正。可以用软件来纠正打印机在xy、xz、yz三个平面上的偏斜。这是通过沿一个平面打印一个校准模型并测量三个长度来完成的。由于偏斜校正的性质，这些长度是通过G代码设置的。详情见[偏斜校正](Skew_Correction.md)和[命令参考](G-Code.md#skew_correction)。

source: See the [endstop phases guide](Endstop_Phase.md) and [command reference](G-Codes.md#endstop_phase) for additional information.
fr: Voir le [guide de détecteurs de fin de course](Endstop_Phase.md) et la [référence des commandes](G-Codes.md#endstop_phase) pour plus d'informations.
zh_hans: 更多信息见[相位限位指南](Endstop_Phase.md)和[命令参考](G-Code.md#endstop_phase)。

source: Execute a gcode on a set delay. See the [command template guide](Command_Templates.md#delayed-gcodes) and [command reference](G-Codes.md#delayed_gcode) for more information.
fr: Exécute un gcode sur un délai défini. Voir le [guide des modèles de commande](Command_Templates.md#delayed-gcodes) et la [référence des commandes](G-Codes.md#delayed_gcode) pour plus d'informations.
zh_hans: 在设定的延迟上执行 gcode。 有关详细信息，请参阅 [命令模板指南](Command_Templates.md#delayed-gcodes) 和 [命令参考](G-Codes.md#delayed_gcode)。

source: Support saving variables to disk so that they are retained across restarts. See [command templates](Command_Templates.md#save-variables-to-disk) and [G-Code reference](G-Codes.md#save_variables) for further information.
fr: Prise en charge de l'enregistrement des variables sur le disque afin qu'elles soient conservées lors des redémarrages. Voir [modèles de commande](Command_Templates.md#save-variables-to-disk) et [référence au code G](G-Codes.md#save_variables) pour plus d'informations.
zh_hans: 支持将变量保存到磁盘，以便在重新启动后保留。有关更多信息，请参阅[命令模板](Command_Templates.md#save-variables-to-disk)和[G-Code参考文档](G-Codes.md#save_variables)。

source: See the [command reference](G-Codes.md#sdcard_loop) for supported commands. See the [sample-macros.cfg](../config/sample-macros.cfg) file for a Marlin compatible M808 G-Code macro.
fr: Voir la [référence de commande](G-Codes.md#sdcard_loop) pour les commandes prises en charge. Voir le fichier [sample-macros.cfg](../config/sample-macros.cfg) pour une macro G-Code M808 compatible avec Marlin.
zh_hans: 有关支持的命令请参阅[命令参考](G-Codes.md#sdcard_loop)。兼容Marlin M808 的G代码宏可以在[sample-macros.cfg](../config/sample-macros.cfg)中找到。

source: Support manually moving stepper motors for diagnostic purposes. Note, using this feature may place the printer in an invalid state - see the [command reference](G-Codes.md#force_move) for important details.
fr: Support des déplacements manuels des moteurs pas à pas à des fins de diagnostic. Remarque : l'utilisation de cette fonction peut placer l'imprimante dans un état invalide - consultez la [référence de la commande](G-Codes.md#force_move) pour obtenir des détails importants.
zh_hans: 支持手动移动步进电机以进行诊断。注意，使用此功能可能会使打印机处于无效状态——有关重要细节，请参阅[命令参考](G-Codes.md#force_move)。

source: Pause/Resume functionality with support of position capture and restore. See the [command reference](G-Codes.md#pause_resume) for more information.
fr: Fonctionnalité Pause/Reprise avec prise en charge de la capture et de la restauration de position. Voir la [référence de la commande](G-Codes.md#pause_resume) pour plus d'informations.
zh_hans: 暂停/恢复功能，支持位置储存和恢复。更多信息见[命令参考](G-Code.md#pause_resume)。

source: Firmware filament retraction. This enables G10 (retract) and G11 (unretract) GCODE commands issued by many slicers. The parameters below provide startup defaults, although the values can be adjusted via the SET_RETRACTION [command](G-Codes.md#firmware_retraction)), allowing per-filament settings and runtime tuning.
fr: Rétraction du filament par le firmware. Cela permet d'activer les commandes GCODE G10 (rétraction) et G11 (dé-rétraction) émises par de nombreux trancheurs. Les paramètres ci-dessous fournissent des valeurs par défaut au démarrage, ces valeurs peuvent être ajustées via la [commande SET_RETRACTION](G-Codes.md#firmware_retraction), ce qui permet des réglages par filament et des ajustements en cours d'impression.
zh_hans: 固件耗材回抽。这个选项启用了许多切片软件发布的G10（回抽）和G11（回抽后恢复挤出）GCODE指令。下面的参数提供了启动默认值，尽管这些值可以通过SET_RETRACTION[command](G-Codes.md#firmware_retraction)来允许每个耗材设置和运行时调整

source: Enable the "M118" and "RESPOND" extended [commands](G-Codes.md#respond).
fr: Active les [commandes étendues "M118" et "RESPOND"](G-Codes.md#respond).
zh_hans: 启用“M118”和“RESPOND”扩展 [commands](G-Codes.md#respond)。

source: Enables [resonance compensation](Resonance_Compensation.md). Also see the [command reference](G-Codes.md#input_shaper).
fr: Active la [compensation de résonance](Resonance_Compensation.md). Voir également la [référence des commandes](G-Codes.md#input_shaper).
zh_hans: 启用 [共振补偿](Resonance_Compensation.md)。 另请参阅 [命令参考](G-Codes.md#input_shaper)。

source: Support for ADXL345 accelerometers. This support allows one to query accelerometer measurements from the sensor. This enables an ACCELEROMETER_MEASURE command (see [G-Codes](G-Codes.md#adxl345) for more information). The default chip name is "default", but one may specify an explicit name (eg, [adxl345 my_chip_name]).
fr: Support des accéléromètres ADXL345. Ce support permet d'interroger les mesures de l'accéléromètre à partir du capteur. Cela active une commande ACCELEROMETER_MEASURE (voir [G-Codes](G-Codes.md#adxl345) pour plus d'informations). Le nom de la puce par défaut est "default", mais on peut spécifier un nom explicite (par exemple, [adxl345 my_chip_name]).
zh_hans: 对 ADXL345 加速度传感器的支持。该支持允许用户从传感器获取加速度测量数据。这启用了一个 ACCELEROMETER_MEASURE 命令（有关更多信息，请参见 [G-Codes](G-Codes.md#adxl345)）。默认的芯片名称为 "default"，但您也可以指定一个明确的名称（例如，[adxl345 芯片名称]）。

source: Support for resonance testing and automatic input shaper calibration. In order to use most of the functionality of this module, additional software dependencies must be installed; refer to [Measuring Resonances](Measuring_Resonances.md) and the [command reference](G-Codes.md#resonance_tester) for more information. See the [Max smoothing](Measuring_Resonances.md#max-smoothing) section of the measuring resonances guide for more information on `max_smoothing` parameter and its use.
fr: Prise en charge du test de résonance et du calibrage automatique du façonneur d'entrée (input shaper). Pour utiliser la plupart des fonctionnalités de ce module, des dépendances logicielles supplémentaires doivent être installées ; reportez-vous à [Measuring Resonances](Measuring_Resonances.md) et à la [référence de commande](G-Codes.md#resonance_tester) pour plus d'informations. Voir la section [Adoucissement Max](Measuring_Resonances.md#max-smoothing) du guide de mesure des résonances pour plus d'informations sur le paramètre `max_smoothing` et son utilisation.
zh_hans: 支持共振测试和自动输入整形器校准。为了使用该模块的大多数功能，必须安装额外的软件依赖项；参考[测量共振](Measuring_Resonances.md)和[命令参考](G-Codes.md#resonance_tester)以获取更多信息。有关 `max_smoothing` 参数及其用途的更多信息，请查阅测量共振指南的 [Max smoothing](Measuring_Resonances.md#max-smoothing) 章节。

source: [extruder1] #step_pin: #dir_pin: #... # See the "extruder" section for available stepper and heater # parameters. #shared_heater: # This option is deprecated and should no longer be specified.
fr: [extruder1] #step_pin: #dir_pin: #... # Voir la section "extruder" pour les paramètres disponibles pour le pilote de moteur # pas à pas et l'élément de chauffe. #shared_heater: # Cette option est obsolète et ne doit plus être utilisée.
zh_hans: [挤出机1] #step_pin： #dir_pin： #... # 有关可用的步进器和加热器，请参阅“挤出机”部分 ＃ 参数。 #shared_heater： # 此选项已弃用，不应再指定。

source: See the [command reference](G-Codes.md#extruder) for more information.
fr: Voir la [référence de la commande](G-Codes.md#extruder) pour plus d'informations.
zh_hans: 更多信息请参阅[命令参考](G-Codes.md#extruder)。

source: Manual steppers (one may define any number of sections with a "manual_stepper" prefix). These are steppers that are controlled by the MANUAL_STEPPER g-code command. For example: "MANUAL_STEPPER STEPPER=my_stepper MOVE=10 SPEED=5". See [G-Codes](G-Codes.md#manual_stepper) file for a description of the MANUAL_STEPPER command. The steppers are not connected to the normal printer kinematics.
fr: Pilotes de moteur manuels (on peut définir un nombre quelconque de sections avec le préfixe "manual_stepper"). Ce sont des pilotes de moteur contrôlés par la commande g-code MANUAL_STEPPER. Par exemple "MANUAL_STEPPER STEPPER=my_stepper MOVE=10 SPEED=5". Voir le fichier [G-Codes](G-Codes.md#manual_stepper) pour une description de la commande MANUAL_STEPPER. Les pilotes de moteur ne sont pas connectés à la cinématique normale de l'imprimante.
zh_hans: 手动步进器（可以通过定义任何数量"manual_stepper"前缀的配置分段）。这些是由 MANUAL_STEPPER G代码命令控制的步进电机。例如："MANUAL_STEPPER STEPPER=my_stepper MOVE=10 SPEED=5"。参见[G-Code](G-Code.md#manual_stepper)文档中关于 MANUAL_STEPPER 命令的描述。手动步进器械不会连接到正常的打印机运动学中。

source: Generic heaters (one may define any number of sections with a "heater_generic" prefix). These heaters behave similarly to standard heaters (extruders, heated beds). Use the SET_HEATER_TEMPERATURE command (see [G-Codes](G-Codes.md#heaters) for details) to set the target temperature.
fr: Éléments de chauffe génériques (on peut définir un nombre quelconque de sections avec le préfixe "heater_generic"). Ces éléments de chauffe se comportent de la même manière que les éléments de chauffe standards (extrudeuses, lits chauffants). Utilisez la commande SET_HEATER_TEMPERATURE (voir [G-Codes](G-Codes.md#heaters) pour plus de détails) pour définir la température cible.
zh_hans: 通用的加热器（任意数量的使用"heater_generic"前缀定义的节）。这些加热器表现得类似于标准加热器（挤出机、热床）。使用SET_HEATER_TEMPERATURE命令（详见[G-Code](G-Code.md#heaters)）来设置目标温度。

source: LM75/LM75A two wire (I2C) connected temperature sensors. These sensors have a range of -55~125 C, so are usable for e.g. chamber temperature monitoring. They can also function as simple fan/heater controllers.
fr: Capteurs de température LM75/LM75A connectés en deux fils (I2C). Ces capteurs ont une gamme de -55~125 °C, et sont donc utilisables par exemple pour la surveillance de la température d'une chambre. Ils peuvent aussi fonctionner comme de simples contrôleurs de ventilateurs/éléments chauffants.
zh_hans: LM75/LM75A两线（I2C）连接的温度传感器。这些传感器的温度范围为-55~125 C，因此可用于例如试验室温度监测。它们还可以作为简单的风扇/加热器控制器使用。

source: See the [command reference](G-Codes.md#temperature_fan) for additional information.
fr: Voir la [référence de la commande](G-Codes.md#temperature_fan) pour plus d'informations.
zh_hans: 更多信息请参阅[command reference](G-Codes.md#temperature_fan)。

source: Manually controlled fan (one may define any number of sections with a "fan_generic" prefix). The speed of a manually controlled fan is set with the SET_FAN_SPEED [gcode command](G-Codes.md#fan_generic).
fr: Ventilateur commandé manuellement (on peut définir un nombre quelconque de sections avec le préfixe "fan_generic"). La vitesse d'un ventilateur commandé manuellement est réglée avec la commande SET_FAN_SPEED [commandes G-Code](G-Codes.md#fan_generic).
zh_hans: 手动控制的风扇（可以用"fan_generic"前缀定义任何数量的手动风扇分）。可以通过 SET_FAN_SPEED[gcode命令](G-Code.md#fan_generic)设置风扇速度。

source: Servos (one may define any number of sections with a "servo" prefix). The servos may be controlled using the SET_SERVO [g-code command](G-Codes.md#servo). For example: SET_SERVO SERVO=my_servo ANGLE=180
fr: Servos (on peut définir un nombre quelconque de sections avec le préfixe "servo"). Les servos peuvent être contrôlés en utilisant la commande SET_SERVO [g-code](G-Codes.md#servo). Par exemple : SET_SERVO SERVO=my_servo ANGLE=180
zh_hans: 伺服电机（可以定义任意数量的带有“servo”前缀的分段）。可以通过SET_SERVO[G代码命令](G-Codes.md#servo)控制伺服电机。例如：SET_SERVO SERVO=my_servo ANGLE=180
