Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Config_Reference.po
Languages: fr, zh_hans

source: [extruder] step_pin: dir_pin: enable_pin: microsteps: rotation_distance: #full_steps_per_rotation: #gear_ratio: # See the "stepper" section for a description of the above # parameters. If none of the above parameters are specified then no # stepper will be associated with the nozzle hotend (though a # SYNC_EXTRUDER_MOTION command may associate one at run-time). nozzle_diameter: # Diameter of the nozzle orifice (in mm). This parameter must be # provided. filament_diameter: # The nominal diameter of the raw filament (in mm) as it enters the # extruder. This parameter must be provided. #max_extrude_cross_section: # Maximum area (in mm^2) of an extrusion cross section (eg, # extrusion width multiplied by layer height). This setting prevents # excessive amounts of extrusion during relatively small XY moves. # If a move requests an extrusion rate that would exceed this value # it will cause an error to be returned. The default is: 4.0 * # nozzle_diameter^2 #instantaneous_corner_velocity: 1.000 # The maximum instantaneous velocity change (in mm/s) of the # extruder during the junction of two moves. The default is 1mm/s. #max_extrude_only_distance: 50.0 # Maximum length (in mm of raw filament) that a retraction or # extrude-only move may have. If a retraction or extrude-only move # requests a distance greater than this value it will cause an error # to be returned. The default is 50mm. #max_extrude_only_velocity: #max_extrude_only_accel: # Maximum velocity (in mm/s) and acceleration (in mm/s^2) of the # extruder motor for retractions and extrude-only moves. These # settings do not have any impact on normal printing moves. If not # specified then they are calculated to match the limit an XY # printing move with a cross section of 4.0*nozzle_diameter^2 would # have. #pressure_advance: 0.0 # The amount of raw filament to push into the extruder during # extruder acceleration. An equal amount of filament is retracted # during deceleration. It is measured in millimeters per # millimeter/second. The default is 0, which disables pressure # advance. #pressure_advance_smooth_time: 0.040 # A time range (in seconds) to use when calculating the average # extruder velocity for pressure advance. A larger value results in # smoother extruder movements. This parameter may not exceed 200ms. # This setting only applies if pressure_advance is non-zero. The # default is 0.040 (40 milliseconds). # # The remaining variables describe the extruder heater. heater_pin: # PWM output pin controlling the heater. This parameter must be # provided. #max_power: 1.0 # The maximum power (expressed as a value from 0.0 to 1.0) that the # heater_pin may be set to. The value 1.0 allows the pin to be set # fully enabled for extended periods, while a value of 0.5 would # allow the pin to be enabled for no more than half the time. This # setting may be used to limit the total power output (over extended # periods) to the heater. The default is 1.0. sensor_type: # Type of sensor - common thermistors are "EPCOS 100K B57560G104F", # "ATC Semitec 104GT-2", "ATC Semitec 104NT-4-R025H42G", "Generic # 3950","Honeywell 100K 135-104LAG-J01", "NTC 100K MGB18-104F39050L32", # "SliceEngineering 450", and "TDK NTCG104LH104JT1". See the # "Temperature sensors" section for other sensors. This parameter # must be provided. sensor_pin: # Analog input pin connected to the sensor. This parameter must be # provided. #pullup_resistor: 4700 # The resistance (in ohms) of the pullup attached to the thermistor. # This parameter is only valid when the sensor is a thermistor. The # default is 4700 ohms. #smooth_time: 1.0 # A time value (in seconds) over which temperature measurements will # be smoothed to reduce the impact of measurement noise. The default # is 1 seconds. control: # Control algorithm (either pid or watermark). This parameter must # be provided. pid_Kp: pid_Ki: pid_Kd: # The proportional (pid_Kp), integral (pid_Ki), and derivative # (pid_Kd) settings for the PID feedback control system. Klipper # evaluates the PID settings with the following general formula: # heater_pwm = (Kp*error + Ki*integral(error) - Kd*derivative(error)) / 255 # Where "error" is "requested_temperature - measured_temperature" # and "heater_pwm" is the requested heating rate with 0.0 being full # off and 1.0 being full on. Consider using the PID_CALIBRATE # command to obtain these parameters. The pid_Kp, pid_Ki, and pid_Kd # parameters must be provided for PID heaters. #max_delta: 2.0 # On 'watermark' controlled heaters this is the number of degrees in # Celsius above the target temperature before disabling the heater # as well as the number of degrees below the target before # re-enabling the heater. The default is 2 degrees Celsius. #pwm_cycle_time: 0.100 # Time in seconds for each software PWM cycle of the heater. It is # not recommended to set this unless there is an electrical # requirement to switch the heater faster than 10 times a second. # The default is 0.100 seconds. #min_extrude_temp: 170 # The minimum temperature (in Celsius) at which extruder move # commands may be issued. The default is 170 Celsius. min_temp: max_temp: # The maximum range of valid temperatures (in Celsius) that the # heater must remain within. This controls a safety feature # implemented in the micro-controller code - should the measured # temperature ever fall outside this range then the micro-controller # will go into a shutdown state. This check can help detect some # heater and sensor hardware failures. Set this range just wide # enough so that reasonable temperatures do not result in an error. # These parameters must be provided.
fr: [extruder] step_pin: dir_pin: enable_pin: microsteps: rotation_distance: #full_steps_per_rotation: #gear_ratio: # Voir la section "stepper" pour une description des paramètres ci-dessus. # Si aucun des paramètres ci-dessus n'est spécifié, alors aucun pilote ne # sera associé à la buse (bien qu'une commande SYNC_EXTRUDER_MOTION # puisse en associer un au moment de l'exécution). nozzle_diameter: # Diamètre de l'orifice de la buse (en mm). Ce paramètre doit être # fourni. filament_diameter: # Diamètre moyen du filament (en mm) lorsqu'il entre dans l'extrudeuse. # Ce paramètre doit être fourni. #max_extrude_cross_section: # Surface maximale (en mm^2) d'une section transversale d'extrusion (ex: # largeur de l'extrusion multipliée par la hauteur de la couche). Ce paramètre # permet d'éviter d'extruder des quantités excessives durant de petits déplacements # XY. Si un déplacement demande une quantité d'extrusion supérieure à cette valeur, # une erreur sera renvoyée. La valeur par défaut est 4.0 *diamètre_buse^2 #instantaneous_corner_velocity: 1.000 # La variation instantanée maximale de la vitesse (en mm/s) de l'extrudeuse # pendant la jonction de deux mouvements. La valeur par défaut est 1mm/s. #max_extrude_only_distance: 50.0 # Longueur maximale (en mm de filament) qu'un mouvement de rétraction ou d'extrusion # peut fournir. Si un mouvement de rétraction ou d'extrusion unique demande une # distance supérieure à cette valeur, une erreur sera renvoyée. # La valeur par défaut est 50mm. #max_extrude_only_velocity: #max_extrude_only_accel: # Vitesse maximale (en mm/s) et accélération (en mm/s^2) du moteur de l'extrudeuse # pour les rétractions et les mouvements d'extrusion seuls. Ces paramètres n'ont aucun # impact sur les mouvements d'impression normaux. S'ils ne sont pas spécifiés, ils sont # calculés pour correspondre à la limite d'un mouvement qu'une impression de # section transversale de 4.0*diamètre_buse^2 aurait. #pressure_advance: 0.0 # La quantité de filament à pousser dans l'extrudeuse durant l'accélération de celle-ci. # Une quantité égale de filament est rétractée durant la décélération. Elle est mesurée # en millimètre/seconde. La valeur par défaut est 0, ce qui désactive la fonctionnalité # d'avance de pression. #pressure_advance_smooth_time: 0.040 # Une durée (en secondes) à utiliser lors du calcul de la vitesse moyenne de l'extrudeuse # pour l'avance de pression. Une valeur plus grande donne lieu à des mouvements # d'extrusion plus lisses. Ce paramètre ne doit pas dépasser 200ms. # Ce paramètre ne s'applique que si pressure_advance est différent de zéro. La valeur # par défaut est 0.040 (40 millisecondes). # # Les variables restantes décrivent la chauffe de l'extrudeuse. heater_pin: # Broche de sortie PWM contrôlant le chauffage. Ce paramètre doit être # fourni. #max_power: 1.0 # La puissance maximale (exprimée sous la forme d'une valeur comprise entre 0,0 et 1,0) # de réglage du heater_pin . La valeur 1.0 permet à la broche d'être réglée comme toujours # activée durant des périodes prolongées, tandis qu'une valeur de 0,5 permet à la broche # de n'être activée durant au plus la moitié du temps. # Ce réglage peut être utilisé pour limiter la puissance totale de sortie (sur de longues # périodes) de l'élément de chauffe. La valeur par défaut est 1.0. sensor_type: # Type de capteur - les thermistances courantes sont "EPCOS 100K B57560G104F", # "ATC Semitec 104GT-2", "ATC Semitec 104NT-4-R025H42G", "Generic # 3950", "Honeywell 100K 135-104LAG-J01", "NTC 100K MGB18-104F39050L32", # "SliceEngineering 450", et "TDK NTCG104LH104JT1". Voir la section "Capteurs de # température" pour d'autres capteurs. # Ce paramètre doit être fourni. sensor_pin: # Broche d'entrée analogique connectée au capteur. Ce paramètre doit être # fourni. #pullup_resistor: 4700 # La résistance (en ohms) du pullup relié à la thermistance. # Ce paramètre n'est valable que si le capteur est une thermistance. La valeur par # défaut est 4700 ohms. #smooth_time: 1.0 # Une durée (en secondes) sur laquelle les mesures de température seront # lissées pour réduire l'impact du bruit de la mesure. La valeur par défaut # est de 1 seconde. control: # Algorithme de contrôle (soit pid, soit filigrane (watermark)). Ce paramètre doit # être fourni. pid_Kp: pid_Ki: pid_Kd: # Les paramètres proportionnels (pid_Kp), intégraux (pid_Ki) et dérivés (pid_Kd) du système de # contrôle de rétroaction PID. Klipper évalue les paramètres PID avec la formule générale suivante : # heater_pwm = (Kp*erreur + Ki*intégrale(erreur) - Kd*dérivée(erreur)) / 255 # Où "erreur" est le résultat de "requested_temperature - measured_temperature" et # "heater_pwm" est le taux de chauffage demandé, 0.0 étant complètement éteint et 1.0 étant # complètement allumé. Pensez à utiliser la commande PID_CALIBRATE pour obtenir ces paramètres. # Les paramètres pid_Kp, pid_Ki, et pid_Kd doivent être fournis pour les éléments de chauffe PID. #max_delta: 2.0 # Sur les éléments de chauffe contrôlés par un filigrane (watermark), il s'agit du nombre de degrés en # Celsius au-dessus de la température cible avant de désactiver le chauffage ainsi que le nombre de # degrés en dessous de la température cible avant la réactivation du chauffage. La valeur par défaut # est de 2 degrés Celsius. #pwm_cycle_time: 0.100 # Durée en secondes de chaque cycle PWM logiciel du chauffage. Il n'est # pas recommandé de définir cette valeur, sauf s'il existe une exigence # électrique pour commuter le chauffage plus rapidement que 10 fois par seconde. # La valeur par défaut est 0,100 seconde. #min_extrude_temp: 170 # La température minimale (en Celsius) au-dessus de laquelle les commandes de déplacement de # l'extrudeuse peuvent être émises. La valeur par défaut est 170 Celsius. min_temp: max_temp: # La plage maximale de températures valides (en Celsius) dans laquelle l'élément de chauffe doit rester. # Ceci contrôle une fonction de sécurité implémentée dans le code du micro-contrôleur - si la température # mesurée sort de cette plage, le microcontrôleur se met en état d'arrêt. # Ce contrôle peut aider à détecter certaines défaillances matérielles de l'élément chauffant et/ou du capteur. # Définissez cette plage suffisamment large pour que des températures raisonnables n'entraînent pas d'erreur. # Ces paramètres doivent être fournis.
zh_hans: [extruder] step_pin: dir_pin: enable_pin: microsteps: rotation_distance: #full_steps_per_rotation: #gear_ratio: # 以上参数详见“stepper”配置分段。 # 如果未指定任意上述参数，则没有步进电机与热端相关联 # （尽管使用SYNC_EXTRUDER_MOTION命令可能可以在运行时关联一个热端） nozzle_diameter: # 喷嘴的孔径（以毫米为单位） # 必须提供这个参数。 filament_diameter: # 进入挤出机的耗材上标的直径（以毫米为单位） # 必须提供这个参数。 #max_extrude_cross_section: # 挤出线条横截面的最大面积（以平方毫米为单位） # （例如：挤出线宽乘层高） # 这个设置能防止在相对较小的XY移动时产生过度的挤出 # 如果一个挤出速率请求超过了这个值，这会导致返回一个错误 # 默认值是：4.0 * 喷嘴直径 ^ 2 #instantaneous_corner_velocity: 1.000 # 两次挤出之间最大的速度变化（以毫米每秒为单位） # 默认值是：1mm/s #max_extrude_only_distance: 50.0 # 一次挤出或回抽的最大长度（以毫米耗材的长度为单位） # 如果一次挤出或回抽超过了这个值，这会导致返回一个错误 # 默认值是：50mm #max_extrude_only_velocity: #max_extrude_only_accel: # 最大的挤出和回抽速度（以毫米每秒为单位） # 和加速度（以毫米每二次方秒为单位） # 这些设置对正常打印的移动没有任何影响 # 如果未指定，则会计算来匹配 XY打印速度和挤出线横截面为4.0 * 喷嘴直径 ^ 2的限制 #pressure_advance: 0.0 # 挤出机加速过程中耗材被挤入的数量 # 同等数量的耗材会在减速过程中收回 # 这个值以毫米每毫米每秒测量 # 关闭压力提前时默认值是0 #pressure_advance_smooth_time: 0.040 # A time range (in seconds) to use when calculating the average # extruder velocity for pressure advance. A larger value results in # smoother extruder movements. This parameter may not exceed 200ms. # This setting only applies if pressure_advance is non-zero. The # default is 0.040 (40 milliseconds). # # The remaining variables describe the extruder heater. heater_pin: # PWM output pin controlling the heater. This parameter must be # provided. #max_power: 1.0 # The maximum power (expressed as a value from 0.0 to 1.0) that the # heater_pin may be set to. The value 1.0 allows the pin to be set # fully enabled for extended periods, while a value of 0.5 would # allow the pin to be enabled for no more than half the time. This # setting may be used to limit the total power output (over extended # periods) to the heater. The default is 1.0. sensor_type: # Type of sensor - common thermistors are "EPCOS 100K B57560G104F", # "ATC Semitec 104GT-2", "ATC Semitec 104NT-4-R025H42G", "Generic # 3950","Honeywell 100K 135-104LAG-J01", "NTC 100K MGB18-104F39050L32", # "SliceEngineering 450", and "TDK NTCG104LH104JT1". See the # "Temperature sensors" section for other sensors. This parameter # must be provided. sensor_pin: # Analog input pin connected to the sensor. This parameter must be # provided. #pullup_resistor: 4700 # The resistance (in ohms) of the pullup attached to the thermistor. # This parameter is only valid when the sensor is a thermistor. The # default is 4700 ohms. #smooth_time: 1.0 # A time value (in seconds) over which temperature measurements will # be smoothed to reduce the impact of measurement noise. The default # is 1 seconds. control: # Control algorithm (either pid or watermark). This parameter must # be provided. pid_Kp: pid_Ki: pid_Kd: # The proportional (pid_Kp), integral (pid_Ki), and derivative # (pid_Kd) settings for the PID feedback control system. Klipper # evaluates the PID settings with the following general formula: # heater_pwm = (Kp*error + Ki*integral(error) - Kd*derivative(error)) / 255 # Where "error" is "requested_temperature - measured_temperature" # and "heater_pwm" is the requested heating rate with 0.0 being full # off and 1.0 being full on. Consider using the PID_CALIBRATE # command to obtain these parameters. The pid_Kp, pid_Ki, and pid_Kd # parameters must be provided for PID heaters. #max_delta: 2.0 # On 'watermark' controlled heaters this is the number of degrees in # Celsius above the target temperature before disabling the heater # as well as the number of degrees below the target before # re-enabling the heater. The default is 2 degrees Celsius. #pwm_cycle_time: 0.100 # Time in seconds for each software PWM cycle of the heater. It is # not recommended to set this unless there is an electrical # requirement to switch the heater faster than 10 times a second. # The default is 0.100 seconds. #min_extrude_temp: 170 # The minimum temperature (in Celsius) at which extruder move # commands may be issued. The default is 170 Celsius. min_temp: max_temp: # The maximum range of valid temperatures (in Celsius) that the # heater must remain within. This controls a safety feature # implemented in the micro-controller code - should the measured # temperature ever fall outside this range then the micro-controller # will go into a shutdown state. This check can help detect some # heater and sensor hardware failures. Set this range just wide # enough so that reasonable temperatures do not result in an error. # These parameters must be provided.

source: Support for LEDs (and LED strips) controlled via micro-controller PWM pins (one may define any number of sections with an "led" prefix). See the [command reference](G-Codes.md#led) for more information.
fr: Prise en charge des LEDs (et des bandes de LED) contrôlées par les broches PWM du microcontrôleur (on peut définir un nombre quelconque de sections avec le préfixe "led"). Voir la [référence de la commande](G-Codes.md#led) pour plus d'informations.
zh_hans: 支持通过微控制器 PWM 引脚控制的 LED（和 LED 条）（可通过“led”前缀定义任意数量的分段）。有关更多信息，请参阅[命令参考](G-Codes.md#led)。

source: [led my_led] #red_pin: #green_pin: #blue_pin: #white_pin: # The pin controlling the given LED color. At least one of the above # parameters must be provided. #cycle_time: 0.010 # The amount of time (in seconds) per PWM cycle. It is recommended # this be 10 milliseconds or greater when using software based PWM. # The default is 0.010 seconds. #hardware_pwm: False # Enable this to use hardware PWM instead of software PWM. When # using hardware PWM the actual cycle time is constrained by the # implementation and may be significantly different than the # requested cycle_time. The default is False. #initial_RED: 0.0 #initial_GREEN: 0.0 #initial_BLUE: 0.0 #initial_WHITE: 0.0 # Sets the initial LED color. Each value should be between 0.0 and # 1.0. The default for each color is 0.
fr: [led my_led] #red_pin: #green_pin: #blue_pin: #white_pin: # La broche contrôlant la couleur de la LED donnée. Au moins un des paramètres ci-dessus # doit être fourni. #cycle_time: 0.010 # Durée (en secondes) par cycle PWM. Il est recommandé # que ce soit 10 millisecondes ou plus lorsque l'on utilise un PWM logiciel. # La valeur par défaut est de 0,010 seconde. #hardware_pwm: False # Activez ceci pour utiliser le PWM matériel au lieu du PWM logiciel. Lors de # l'utilisation du PWM matériel, le temps de cycle réel est contraint par # l'implémentation et peut être significativement différent du # cycle_time demandé. La valeur par défaut est False. #initial_RED: 0.0 #initial_GREEN: 0.0 #initial_BLUE: 0.0 #initial_WHITE: 0.0 # Définit la couleur initiale de la LED. Chaque valeur doit être comprise entre 0.0 et # 1.0. La valeur par défaut pour chaque couleur est 0.
zh_hans: [led my_led] #red_pin: #green_pin: #blue_pin: #white_pin: # 控制给定LED的引脚。 # 至少提供一个上述引脚 #cycle_time: 0.010 # 每个PWM周期的时间（以秒为单位） # 使用软件PWM时建议大于10毫秒 # 默认值为0.010秒 #hardware_pwm: False # 启用硬件PWM代替软件PWM # 当使用硬件PWM时，真正的PWM周期时间受执行的约束， # 可能显著地与请求的周期时间不同。 # 默认为False #initial_RED: 0.0 #initial_GREEN: 0.0 #initial_BLUE: 0.0 #initial_WHITE: 0.0 # 设置初始化时LED颜色 # 每个值应当在0.0与1.0之间 # 每个颜色的默认值都为0

source: Neopixel (aka WS2812) LED support (one may define any number of sections with a "neopixel" prefix). See the [command reference](G-Codes.md#led) for more information.
fr: Prise en charge des LED néopixel (alias WS2812) (on peut définir un nombre quelconque de sections avec le préfixe "neopixel"). Voir la [référence de commande](G-Codes.md#led) pour plus d'informations.
zh_hans: 对于Neopixel（也就是WS2812）LED的支持（可以定义任意数量的带有“neopixel”前缀的部分）见[command reference](G-Codes.md#led)获取更多信息

source: Dotstar (aka APA102) LED support (one may define any number of sections with a "dotstar" prefix). See the [command reference](G-Codes.md#led) for more information.
fr: Prise en charge des LEDs Dotstar (alias APA102) (on peut définir un nombre quelconque de sections avec le préfixe "dotstar"). Voir la [référence de commande](G-Codes.md#led) pour plus d'informations.
zh_hans: Dotstar（又名 APA102）LED 支持（可以使用“dotstar”前缀定义任意数量的部分）。 有关详细信息，请参阅 [命令参考](G-Codes.md#led)。

source: [dotstar my_dotstar] data_pin: # The pin connected to the data line of the dotstar. This parameter # must be provided. clock_pin: # The pin connected to the clock line of the dotstar. This parameter # must be provided. #chain_count: # See the "neopixel" section for information on this parameter. #initial_RED: 0.0 #initial_GREEN: 0.0 #initial_BLUE: 0.0 # See the "led" section for information on these parameters.
fr: [dotstar my_dotstar] data_pin: # La broche connectée à la ligne de données du dotstar. Ce paramètre # doit être fourni. clock_pin: # La broche connectée à la ligne d'horloge du dotstar. Ce paramètre # doit être fourni. #chain_count: # Voir la section "neopixel" pour des informations sur ce paramètre. #initial_RED: 0.0 #initial_GREEN: 0.0 #initial_BLUE: 0.0 # Voir la section "led" pour des informations sur ces paramètres.
zh_hans: [dotstar my_dotstar] 数据引脚： # 接点星数据线的管脚。 这个参数 ＃ 必须提供。 时钟引脚： # 连接到dotstar时钟线的引脚。 这个参数 ＃ 必须提供。 #chain_count： # 有关此参数的信息，请参阅“neopixel”部分。 #initial_RED：0.0 #initial_GREEN：0.0 #initial_BLUE：0.0 # 有关这些参数的信息，请参阅“led”部分。

source: [pca9533 my_pca9533] #i2c_address: 98 # The i2c address that the chip is using on the i2c bus. Use 98 for # the PCA9533/1, 99 for the PCA9533/2. The default is 98. #i2c_mcu: #i2c_bus: #i2c_speed: # See the "common I2C settings" section for a description of the # above parameters. #initial_RED: 0.0 #initial_GREEN: 0.0 #initial_BLUE: 0.0 #initial_WHITE: 0.0 # See the "led" section for information on these parameters.
fr: [pca9533 my_pca9533] #i2c_address : 98 # L'adresse i2c que la puce utilise sur le bus i2c. Utilisez 98 pour # le PCA9533/1, 99 pour le PCA9533/2. La valeur par défaut est 98. #i2c_mcu: #i2c_bus: #i2c_speed: # Voir la section "paramètres I2C communs" pour une description des # paramètres ci-dessus. #initial_RED: 0.0 #initial_GREEN: 0.0 #initial_BLUE: 0.0 #initial_WHITE: 0.0 # Voir la section "led" pour des informations sur ces paramètres.
zh_hans: [pca9533 my_pca9533]。 #i2c_address:98 # 芯片在i2c总线上使用的i2c地址。使用98表示 # PCA9533/1，99表示PCA9533/2。默认为98。 #i2c_mcu: #i2c_bus: #i2c_speed: # 参见 "常用I2C设置 "部分，以了解对上述参数的描述。 #initial_RED:0.0 #initial_GREEN: 0.0 #initial_BLUE: 0.0 #initial_WHITE: 0.0 # 有关这些参数的信息，请参见 "led "分段。
