Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Config_Reference.po
Languages: fr, zh_hans

source: [display] lcd_type: # The type of LCD chip in use. This may be "hd44780", "hd44780_spi", # "st7920", "emulated_st7920", "uc1701", "ssd1306", or "sh1106". # See the display sections below for information on each type and # additional parameters they provide. This parameter must be # provided. #display_group: # The name of the display_data group to show on the display. This # controls the content of the screen (see the "display_data" section # for more information). The default is _default_20x4 for hd44780 # displays and _default_16x4 for other displays. #menu_timeout: # Timeout for menu. Being inactive this amount of seconds will # trigger menu exit or return to root menu when having autorun # enabled. The default is 0 seconds (disabled) #menu_root: # Name of the main menu section to show when clicking the encoder # on the home screen. The defaults is __main, and this shows the # the default menus as defined in klippy/extras/display/menu.cfg #menu_reverse_navigation: # When enabled it will reverse up and down directions for list # navigation. The default is False. This parameter is optional. #encoder_pins: # The pins connected to encoder. 2 pins must be provided when using # encoder. This parameter must be provided when using menu. #encoder_steps_per_detent: # How many steps the encoder emits per detent ("click"). If the # encoder takes two detents to move between entries or moves two # entries from one detent, try changing this. Allowed values are 2 # (half-stepping) or 4 (full-stepping). The default is 4. #click_pin: # The pin connected to 'enter' button or encoder 'click'. This # parameter must be provided when using menu. The presence of an # 'analog_range_click_pin' config parameter turns this parameter # from digital to analog. #back_pin: # The pin connected to 'back' button. This parameter is optional, # menu can be used without it. The presence of an # 'analog_range_back_pin' config parameter turns this parameter from # digital to analog. #up_pin: # The pin connected to 'up' button. This parameter must be provided # when using menu without encoder. The presence of an # 'analog_range_up_pin' config parameter turns this parameter from # digital to analog. #down_pin: # The pin connected to 'down' button. This parameter must be # provided when using menu without encoder. The presence of an # 'analog_range_down_pin' config parameter turns this parameter from # digital to analog. #kill_pin: # The pin connected to 'kill' button. This button will call # emergency stop. The presence of an 'analog_range_kill_pin' config # parameter turns this parameter from digital to analog. #analog_pullup_resistor: 4700 # The resistance (in ohms) of the pullup attached to the analog # button. The default is 4700 ohms. #analog_range_click_pin: # The resistance range for a 'enter' button. Range minimum and # maximum comma-separated values must be provided when using analog # button. #analog_range_back_pin: # The resistance range for a 'back' button. Range minimum and # maximum comma-separated values must be provided when using analog # button. #analog_range_up_pin: # The resistance range for a 'up' button. Range minimum and maximum # comma-separated values must be provided when using analog button. #analog_range_down_pin: # The resistance range for a 'down' button. Range minimum and # maximum comma-separated values must be provided when using analog # button. #analog_range_kill_pin: # The resistance range for a 'kill' button. Range minimum and # maximum comma-separated values must be provided when using analog # button.
fr: [display] lcd_type: # Le type de puce LCD utilisé. Cela peut être "hd44780", "hd44780_spi", "st7920", # "emulated_st7920", "uc1701", "ssd1306", ou "sh1106". # Voir les sections d'affichage ci-dessous pour plus d'informations sur chaque type # et les paramètres supplémentaires qu'ils fournissent. Ce paramètre doit être # fourni. #display_group: # Le nom du groupe de données à afficher sur l'écran. Cela contrôle le contenu de # l'écran (voir la section "display_data" pour plus d'informations). La valeur par # défaut est _default_20x4 pour les écrans hd44780 et _default_16x4 pour les # autres affichages. #menu_timeout: # Délai d'attente pour le menu. Le fait d'être inactif pendant ce nombre de secondes # déclenchera la sortie du menu ou le retour au menu racine si l'autorun est activé. # La valeur par défaut est 0 seconde (désactivé) #menu_root: # Nom de la section du menu principal à afficher lorsque vous cliquez sur l'encodeur # de l'écran d'accueil. La valeur par défaut est __main, et cela affiche les menus par # défaut tels que définis dans klippy/extras/display/menu.cfg #menu_reverse_navigation: # Lorsque activé, inverse les directions vers le haut et vers le bas de la liste. # La valeur par défaut est False. Ce paramètre est optionnel. #encoder_pins: # Les broches connectées à l'encodeur. 2 broches doivent être fournies lorsque vous # utilisez l'encodeur. Ce paramètre doit être fourni lors de l'utilisation du menu. #encoder_steps_per_detent: # Combien de pas l'encodeur émet par cran ("clic"). Si l'encodeur prend deux crans pour # se déplacer entre les entrées ou déplace deux entrées à partir d'un seul cran, essayez de # modifier cette valeur. Les valeurs autorisées sont 2 (demi-step) ou 4 (full-step). # La valeur par défaut est 4. #click_pin: # La broche connectée au bouton 'entrée' ou au 'clic' de l'encodeur. Ce paramètre doit # être fourni lors de l'utilisation du menu. La présence d'un paramètre de configuration # 'analog_range_click_pin' fait passer ce paramètre de numérique à analogique. #back_pin: # La broche connectée au bouton 'retour'. Ce paramètre est facultatif, le menu peut être utilisé # sans lui. La présence d'un paramètre de configuration 'analog_range_back_pin' transforme # ce paramètre de numérique à analogique. #up_pin: # La broche connectée au bouton 'haut'. Ce paramètre doit être fourni lorsque vous utilisez un # menu sans encodeur. La présence d'un paramètre de configuration 'analog_range_up_pin' # transforme ce paramètre de numérique à analogique. #down_pin: # La broche connectée au bouton 'bas'. Ce paramètre doit être fourni lorsque vous utilisez un # menu sans encodeur. La présence d'un paramètre de configuration 'analog_range_down_pin' # transforme ce paramètre de numérique à analogique. #kill_pin: # La broche connectée au bouton 'kill'. Ce bouton appellera l'arrêt d'urgence. La présence d'un # paramètre 'analog_range_kill_pin' fait passer ce paramètre de numérique à analogique. #analog_pullup_resistor: 4700 # La résistance (en ohms) du pullup attaché au bouton analogique. # La valeur par défaut est de 4700 ohms. #analog_range_click_pin: # La plage de résistances du bouton 'entrée'. Les valeurs minimale et maximale de la plage # séparées par des virgules doivent être fournies lors de l'utilisation du bouton analogique. #analog_range_back_pin: # La plage de résistances du bouton 'retour'. Les valeurs minimale et maximale de la plage # séparées par des virgules doivent être fournies lors de l'utilisation du bouton analogique. #analog_range_up_pin: # La plage de résistances du bouton 'haut'. Les valeurs minimale et maximale de la plage # séparées par des virgules doivent être fournies lors de l'utilisation du bouton analogique. #analog_range_down_pin: # La plage de résistances du bouton 'bas'. Les valeurs minimale et maximale de la plage # séparées par des virgules doivent être fournies lors de l'utilisation du bouton analogique. #analog_range_kill_pin: # La plage de résistances du bouton 'kill'. Les valeurs minimale et maximale de la plage # séparées par des virgules doivent être fournies lors de l'utilisation du bouton analogique.
zh_hans: [display] lcd_type: # 使用的 LCD 芯片类型。这可以是“hd44780”、“hd44780_spi”、 # “st7920”、“emulated_st7920”、“uc1701”、“ssd1306”、或“sh1106”。 # 有关不同的LCD芯片类型和它们特有的参数，请查看下面的显示屏分段。 # 必须提供此参数。 #display_group: # 显示在这个显示屏上的 display_data 组。它决定了这个屏幕显示 # 的内容（详见“display_data”分段）。 # hd44780 默认使用 _default_20x4，其他显示屏则默认使用 _default_16x4。 #menu_timeout: # 菜单超时时间。在不活跃给定时间后将会退出菜单或在 autorun 启用时 # 回到根菜单。 # 默认为 0 秒（禁用）。 #menu_root: # 在主屏幕按下编码器时显示的主菜单段名称。 # 默认为 __main，这会显示在 klippy/extras/display/menu.cfg中定义的主菜单。 #menu_reverse_navigation: # 启用时反转上滚动和下滚动。 # 默认为False。这是一个可选参数。 #encoder_pins: # 连接到编码器的引脚。使用编码器时必须提供两个引脚。 # 使用菜单时必须提供此参数。 #encoder_steps_per_detent: # 编码器在每一个凹陷处（"click"）发出多少步。如果编码器需要转过两个凹 # 陷才能在条目之间移动，或者转过一个凹痕会在两个词条之间移动/跳过 # 一个词条，可以尝试改变这个值。 # 允许的值是2 （半步）或 4（全步）。 # 默认为 4。 #click_pin: # 连接到 "enter" 按钮或编码器按压的引脚。 # 使用菜单时必须提供此参数。 # 如果定义了 “analog_range_click_pin”配置参数，则这个参数的引脚需要 # 是模拟引脚。 #back_pin: # 连接到“back”按钮的引脚。这是一个可选参数，菜单不需要这个按钮。 # 如果定义了 “analog_range_back_pin”配置参数，则这个参数的引脚需要 # 是模拟引脚。 #up_pin: # 连接到“up”按钮的引脚。在不使用编码器时使用菜单必须提供这个参数。 # 如果定义了 “analog_range_up_pin”配置参数，则这个参数的引脚需要 # 是模拟引脚。 #down_pin: # 连接到“down”按钮的引脚。 在不使用编码器时使用菜单必须提供这个参数。 # 如果定义了 “analog_range_down_pin”配置参数，则这个参数的引脚需要 # 是模拟引脚。 #kill_pin: # 连接到“kill”按钮的引脚。 这个按钮将会触发紧急停止。 # 如果定义了 “analog_range_kill_pin”配置参数，则这个参数的引脚需要 # 是模拟引脚。 #analog_pullup_resistor: 4700 # 连接到模拟按钮的拉高电阻阻值(ohms) # 默认为 4700 ohms。 #analog_range_click_pin: # 'enter'按钮的阻值范围。 # 在使用模拟按钮时必须提供由逗号分隔最小和最大值。 #analog_range_back_pin: # 'back'按钮的阻值范围。 # 在使用模拟按钮时必须提供由逗号分隔最小和最大值。 #analog_range_up_pin: # 'up'按钮的阻值范围。 # 在使用模拟按钮时必须提供由逗号分隔最小和最大值。 #analog_range_down_pin: # 'down'按钮的阻值范围。 # 在使用模拟按钮时必须提供由逗号分隔最小和最大值。 #analog_range_kill_pin: # 'kill'按钮的阻值范围。 # 在使用模拟按钮时必须提供由逗号分隔最小和最大值。

source: sensor_type: # One of "EPCOS 100K B57560G104F", "ATC Semitec 104GT-2", # "ATC Semitec 104NT-4-R025H42G", "Generic 3950", # "Honeywell 100K 135-104LAG-J01", "NTC 100K MGB18-104F39050L32", # "SliceEngineering 450", or "TDK NTCG104LH104JT1" sensor_pin: # Analog input pin connected to the thermistor. This parameter must # be provided. #pullup_resistor: 4700 # The resistance (in ohms) of the pullup attached to the thermistor. # The default is 4700 ohms. #inline_resistor: 0 # The resistance (in ohms) of an extra (not heat varying) resistor # that is placed inline with the thermistor. It is rare to set this. # The default is 0 ohms.
fr: sensor_type: # Un parmi "EPCOS 100K B57560G104F", "ATC Semitec 104GT-2", # "ATC Semitec 104NT-4-R025H42G", "Generic 3950", # "Honeywell 100K 135-104LAG-J01", "NTC 100K MGB18-104F39050L32", # "SliceEngineering 450", ou "TDK NTCG104LH104JT1". sensor_pin: # Broche d'entrée analogique connectée à la thermistance. Ce paramètre doit # être fourni. #pullup_resistor: 4700 # La résistance (en ohms) de tirage (pullup) reliée à la thermistance. # La valeur par défaut est 4700 ohms. #inline_resistor: 0 # La résistance (en ohms) d'une résistance supplémentaire (ne variant pas en fonction de # la chaleur) placée en ligne avec la thermistance. Il est rare de la définir. # La valeur par défaut est 0 ohms.
zh_hans: sensor_type: # "EPCOS 100K B57560G104F", "ATC Semitec 104GT-2", # "ATC Semitec 104NT-4-R025H42G", "Generic 3950", # "Honeywell 100K 135-104LAG-J01", "NTC 100K MGB18-104F39050L32", # "SliceEngineering 450", 或者 "TDK NTCG104LH104JT1" 中的一个 sensor_pin: # 连接到热敏电阻的模拟输入引脚。 # 必须提供此参数。 #pullup_resistor: 4700 # 连接到热敏电阻的上拉电阻（以欧姆为单位）。 # 默认值为4700欧姆。 #inline_resistor: 0 # 与热敏电阻并联的额外电阻（不随热量变化）的电阻（以欧姆为单位）。 # 设置这个参数的情况比较罕见。 # 默认值为0欧姆。

source: sensor_type: LM75 #i2c_address: # Default is 72 (0x48). Normal range is 72-79 (0x48-0x4F) and the 3 # low bits of the address are configured via pins on the chip # (usually with jumpers or hard wired). #i2c_mcu: #i2c_bus: #i2c_speed: # See the "common I2C settings" section for a description of the # above parameters. #lm75_report_time: # Interval in seconds between readings. Default is 0.8, with minimum # 0.5.
fr: sensor_type: LM75 #i2c_address: # La valeur par défaut est 72 (0x48). La plage normale est 72-79 (0x48-0x4F) et les 3 # bits de poids faible de l'adresse sont configurés via des broches sur la puce # (généralement avec des cavaliers ou câblés). #i2c_mcu: #i2c_bus: #i2c_speed: # Voir la section "paramètres I2C communs" pour une description des # paramètres ci-dessus. #lm75_report_time: # Intervalle en secondes entre les lectures. La valeur par défaut est 0.8, avec un minimum de # 0.5.
zh_hans: sensor_type: LM75 #i2c_address: # 默认为 72 （0x48）。正常范围为 72-79（0x48-0x4F），3个地址的低位 # 可以通过芯片上的引脚进行配置。（通常是跳线或硬接线）。 #i2c_mcu: #i2c_bus: #i2c_speed: # 请参阅“常见 I2C 设置”部分，了解 # 以上参数。 #lm75_report_time: # 读数之间的间隔（以秒为单位）。 # 默认值为 0.8，最小值为0.5。

source: Hall filament width sensor (see [Hall Filament Width Sensor](Hall_Filament_Width_Sensor.md)).
fr: Capteur Hall de largeur de filament (voir [Capteur Hall de largeur de filament](Hall_Filament_Width_Sensor.md)).
zh_hans: 霍尔耗材宽度传感器（详见[霍尔耗材宽度传感器](Hall_Filament_Width_Sensor.md)）。

source: Replicape support - see the [beaglebone guide](Beaglebone.md) and the [generic-replicape.cfg](../config/generic-replicape.cfg) file for an example.
fr: Support de Replicape - voir le [guide beaglebone](Beaglebone.md) et le fichier [generic-replicape.cfg](../config/generic-replicape.cfg) pour un exemple.
zh_hans: Replicape支持 - 参考[beaglebone guide](Beaglebone.md)和[generic-replicape.cfg](./config/generic-replicape.cfg)

source: [stepper_x] step_pin: # Step GPIO pin (triggered high). This parameter must be provided. dir_pin: # Direction GPIO pin (high indicates positive direction). This # parameter must be provided. enable_pin: # Enable pin (default is enable high; use ! to indicate enable # low). If this parameter is not provided then the stepper motor # driver must always be enabled. rotation_distance: # Distance (in mm) that the axis travels with one full rotation of # the stepper motor (or final gear if gear_ratio is specified). # This parameter must be provided. microsteps: # The number of microsteps the stepper motor driver uses. This # parameter must be provided. #full_steps_per_rotation: 200 # The number of full steps for one rotation of the stepper motor. # Set this to 200 for a 1.8 degree stepper motor or set to 400 for a # 0.9 degree motor. The default is 200. #gear_ratio: # The gear ratio if the stepper motor is connected to the axis via a # gearbox. For example, one may specify "5:1" if a 5 to 1 gearbox is # in use. If the axis has multiple gearboxes one may specify a comma # separated list of gear ratios (for example, "57:11, 2:1"). If a # gear_ratio is specified then rotation_distance specifies the # distance the axis travels for one full rotation of the final gear. # The default is to not use a gear ratio. #step_pulse_duration: # The minimum time between the step pulse signal edge and the # following "unstep" signal edge. This is also used to set the # minimum time between a step pulse and a direction change signal. # The default is 0.000000100 (100ns) for TMC steppers that are # configured in UART or SPI mode, and the default is 0.000002 (which # is 2us) for all other steppers. endstop_pin: # Endstop switch detection pin. If this endstop pin is on a # different mcu than the stepper motor then it enables "multi-mcu # homing". This parameter must be provided for the X, Y, and Z # steppers on cartesian style printers. #position_min: 0 # Minimum valid distance (in mm) the user may command the stepper to # move to. The default is 0mm. position_endstop: # Location of the endstop (in mm). This parameter must be provided # for the X, Y, and Z steppers on cartesian style printers. position_max: # Maximum valid distance (in mm) the user may command the stepper to # move to. This parameter must be provided for the X, Y, and Z # steppers on cartesian style printers. #homing_speed: 5.0 # Maximum velocity (in mm/s) of the stepper when homing. The default # is 5mm/s. #homing_retract_dist: 5.0 # Distance to backoff (in mm) before homing a second time during # homing. Set this to zero to disable the second home. The default # is 5mm. #homing_retract_speed: # Speed to use on the retract move after homing in case this should # be different from the homing speed, which is the default for this # parameter #second_homing_speed: # Velocity (in mm/s) of the stepper when performing the second home. # The default is homing_speed/2. #homing_positive_dir: # If true, homing will cause the stepper to move in a positive # direction (away from zero); if false, home towards zero. It is # better to use the default than to specify this parameter. The # default is true if position_endstop is near position_max and false # if near position_min.
fr: [stepper_x] step_pin: # Broche GPIO du moteur (déclenchée à l'état haut). Ce paramètre doit être fourni. dir_pin: # Broche GPIO de direction (le niveau haut indique une direction positive). Ce paramètre # doit être fourni. enable_pin: # Broche d'activation (par défaut, enable est haut ; utilisez ! pour indiquer enable # bas). Si ce paramètre n'est pas fourni, le pilote du moteur pas à pas doit toujours # être activé. rotation_distance: # Distance (en mm) parcourue par l'axe lors d'une rotation complète du moteur pas à pas # (ou de l'engrenage final si le rapport de vitesse est spécifié). # Ce paramètre doit être fourni. microsteps: # Le nombre de micropas utilisés par le pilote du moteur pas à pas. Ce paramètre # doit être fourni. #full_steps_per_rotation: 200 # Nombre de pas complets pour une rotation entière du moteur pas à pas. # Réglez ce paramètre sur 200 pour un moteur pas à pas de 1,8 degré ou sur 400 pour # un moteur de 0,9 degré. La valeur par défaut est 200. #gear_ratio: # Le rapport d'engrenage si le moteur pas à pas est relié à l'axe via une # boîte de vitesses. Par exemple, on peut spécifier "5:1" si un réducteur de 5 pour 1 est utilisé. # Si l'axe a plusieurs boîtes de vitesses, on peut spécifier une liste de rapports séparés par # des virgules (par exemple, "57:11, 2:1"). Si un rapport de vitesse est spécifié, alors # rotation_distance spécifie la distance parcourue par l'axe pour une rotation complète # de l'engrenage final. # La valeur par défaut est de ne pas utiliser de rapport de vitesse. #step_pulse_duration: # Le temps minimum entre le front du signal d'impulsion de pas et le front du signal "unstep" suivant. # Ceci est également utilisé pour définir le temps minimum entre une impulsion de pas et un signal # de changement de direction. # La valeur par défaut est 0,000000100 (100ns) pour les pilotes TMC configurés en mode UART ou SPI, # sinon la valeur par défaut est de 0,000002 (2us) pour tous les autres pilotes. endstop_pin: # Broche de détection de l'interrupteur de fin de course. Si cette broche est sur un mcu différent de # celui du moteur pas à pas, cela active le "multi-mcu". Ce paramètre doit être fourni pour les moteurs # pas à pas X, Y, et Z sur les imprimantes de style cartésien. #position_min: 0 # Distance minimale valide (en mm) vers laquelle l'utilisateur peut commander le moteur pas à pas. # La valeur par défaut est 0mm. position_endstop: # Emplacement de la butée (en mm). Ce paramètre doit être fourni pour les moteurs X, Y et Z # des imprimantes de style cartésien. position_max: # Distance maximale valide (en mm) vers laquelle l'utilisateur peut ordonner au moteur pas à pas de se déplacer. # Ce paramètre doit être fourni pour les moteurs X, Y, et Z des imprimantes de type cartésien. #homing_speed: 5.0 # Vitesse maximale (en mm/s) du moteur pas à pas lors de la mise à l'origine. La valeur par défaut # est de 5mm/s. #homing_retract_dist: 5.0 # Distance de recul (en mm) avant le retour au point d'origine une seconde fois. # Réglez cette valeur à zéro pour désactiver le second retour à l'origne. La valeur par défaut # est de 5 mm. #homing_retract_speed: # Vitesse à utiliser pour le mouvement de recul après le retour à l'origine au cas où # elle soit différente de la vitesse de mise à l'origine qui est la valeur par défaut de ce paramètre. #second_homing_speed: # Vitesse (en mm/s) du moteur pas à pas lors du second retour à l'origine. # La valeur par défaut est homing_speed/2. #homing_positive_dir: # Si la valeur est vraie (true), le retour au point d'origine entraînera le déplacement de la commande pas # à pas dans une direction positive (en s'éloignant de zéro) ; si elle est fausse (false), le retour à l'origine # se fera vers zéro. Il est préférable d'utiliser la valeur par défaut que de spécifier ce paramètre. La valeur # par défaut est true si position_endstop est proche de position_max et false si elle est proche de # la position_min.
zh_hans: [stepper_x] step_pin: # 步进 GPIO 引脚（高电平表示触发）。 # 必须提供此参数。 dir_pin: # 方向 GPIO 引脚（高电平表示正方向）。 # 必须提供此参数。 enable_pin: # 使能引脚（默认是高电平启用；使用！表示低电平启用）。 # 如果未提供此参数，步进电机驱动器必须始终被启用。 rotation_distance: # 轴在步进电机（或指定了齿轮比例的最后一个齿轮）进行一 # 次完整旋转时行进的距离（以毫米为单位）。 # 必须提供此参数。 microsteps: # 步进电机驱动器使用的微步数。 # 必须提供此参数。 #full_steps_per_rotation: 200 # 步进电机一次旋转的完整步数。对于1.8度的步进电机，将此 # 值设定为200；对于0.9度的电机，设定为400。 # 默认值是200。 #gear_ratio: # 如果步进电机通过齿轮箱与轴相连，则为齿轮比例。例如，如 # 果使用的是5到1的齿轮箱，可以指定"5:1"。如果轴有多个齿轮 # 箱，可以指定逗号分隔的齿轮比例列表（例如，"57:11, 2:1"）。 # 如果指定了gear_ratio，则rotation_distance指定了最后一个齿轮 # 完整旋转时轴行进的距离。 # 默认情况下不使用齿轮比例。 #step_pulse_duration: # step脉冲信号边缘与后续的"unstep"信号边缘之间的最短时间。 # 这也用于设置step脉冲和方向变化信号之间的最短时间。对于在UART # 或SPI模式下配置的TMC步进器，默认值为0.000000100（100ns）， # 对于所有其他步进器，默认值为0.000002（即2us）。 endstop_pin: # 限位开关检测引脚。如果此限位引脚位于与步进电机不同的mcu上， # 则启用"多mcu归位"。 # 笛卡尔式打印机上的X，Y和Z步进电机必须提供此参数。 #position_min: 0 # 用户可以命令步进器移动到的最小有效距离（以毫米为单位）。 # 默认值是0毫米。 position_endstop: # 限位开关的位置（以毫米为单位）。 # 对于笛卡尔式打印机上的X，Y和Z步进电机，必须提供此参数。 position_max: # 用户可以命令步进器移动到的最大有效距离（以毫米为单位）。 # 对于笛卡尔式打印机上的X，Y和Z步进电机，必须提供此参数。 #homing_speed: 5.0 # 步进器在归位时的最大速度（以毫米/秒为单位）。 # 默认值是5毫米/秒。 #homing_retract_dist: 5.0 # 在归位过程中第二次归位之前的后退距离（以毫米为单位）。 # 将此设置为零以禁用第二次归位。 # 默认值是5毫米。 #homing_retract_speed: # 在归位后进行收缩移动的速度，如果这个速度应该与归位速度不同。 # 归位速度是这个参数的默认值 #second_homing_speed: # 在进行第二次归位时步进器的速度（以毫米/秒为单位）。 # 默认值是homing_speed的一半。 #homing_positive_dir: # 如果为True，归位会使步进器向正方向移动（远离零）；如果为False， # 向零方向归位。 # 最好使用默认值，而不是指定此参数。 # 如果position_endstop靠近position_max，则默认值为True，如果靠近 # position_min，则默认值为False。
