Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Config_Reference.po
Languages: fr, zh_hans

source: [idle_timeout] #gcode: # A list of G-Code commands to execute on an idle timeout. See # docs/Command_Templates.md for G-Code format. The default is to run # "TURN_OFF_HEATERS" and "M84". #timeout: 600 # Idle time (in seconds) to wait before running the above G-Code # commands. The default is 600 seconds.
fr: [idle_timeout] #gcode: # Une liste de commandes G-Code à exécuter lors d'un délai d'inactivité. Voir # docs/Command_Templates.md pour le format G-Code. La valeur par défaut # est d'exécuter "TURN_OFF_HEATERS" et "M84". #timeout: 600 # Durée d'attente (en secondes) avant d'exécuter les commandes G-Code ci-dessus. # La valeur par défaut est de 600 secondes.
zh_hans: [idle_timeout] #gcode: # 在空闲超时时执行的一系列 G-Code 命令。G-Code 格式请见 # docs/Command_Templates.md。 # 默认运行 "TURN_OFF_HEATERS" 和 "M84"。 #timeout: 600 # 在执行以上 G-Code 前等待的空闲时间（以秒为单位） # 默认为 600 秒。

source: [force_move] #enable_force_move: False # Set to true to enable FORCE_MOVE and SET_KINEMATIC_POSITION # extended G-Code commands. The default is false.
fr: [force_move] #enable_force_move: False # Défini à true pour activer les commandes G-Code étendues FORCE_MOVE et # SET_KINEMATIC_POSITION # La valeur par défaut est false.
zh_hans: [force_move] #enable_force_move: False # 设置为true来启用 FORCE_MOVE 和 SET_KINEMATIC_POSITION 扩展 # G代码命令。 # 默认为false。

source: [pause_resume] #recover_velocity: 50. # When capture/restore is enabled, the speed at which to return to # the captured position (in mm/s). Default is 50.0 mm/s.
fr: [pause_resume] #recover_velocity: 50. # Lorsque la capture/restauration est activée, la vitesse à laquelle retourner à # la position capturée (en mm/s). La valeur par défaut est 50,0 mm/s.
zh_hans: [pause_resume] #recover_velocity: 50. # 当捕捉/恢复功能被启用时，返回到捕获的位置的速度(单位：毫米/秒)。 # 默认为50.0 mm/s。

source: [firmware_retraction] #retract_length: 0 # The length of filament (in mm) to retract when G10 is activated, # and to unretract when G11 is activated (but see # unretract_extra_length below). The default is 0 mm. #retract_speed: 20 # The speed of retraction, in mm/s. The default is 20 mm/s. #unretract_extra_length: 0 # The length (in mm) of *additional* filament to add when # unretracting. #unretract_speed: 10 # The speed of unretraction, in mm/s. The default is 10 mm/s.
fr: [firmware_retraction] #retract_length: 0 # La longueur du filament (en mm) à rétracter lorsque G10 est activé, et à fournir # lorsque G11 est activé (voir unretract_extra_length ci-dessous). # La valeur par défaut est 0 mm. #retract_speed: 20 # La vitesse de rétraction, en mm/s. La valeur par défaut est 20 mm/s. #unretract_extra_length: 0 # Longueur (en mm) de filament *supplémentaire* à ajouter lors de la dé-rétraction. #unretract_speed: 10 # La vitesse de dé-rétraction, en mm/s. La valeur par défaut est 10 mm/s.
zh_hans: [firmware_retraction] #retract_length: 0 # 当 G10 被运行时回抽的长度（以毫米(mm)为单位） # 和当 G11 被运行时退回的长度（但同时也包括 # 以下的unretract_extra_length）。 # 默认为0毫米。 #retract_speed: 20 # 回抽速度，以毫米每秒(mm/s)为单位。默认为每秒20毫米。 #unretract_extra_length: 0 # 退回时增加*额外*长度（以毫米(mm)为单位）的耗材。 #unretract_speed: 10 # 退回速度，以毫米(mm)为单位。 # 默认值为10mm/s

source: [gcode_arcs] #resolution: 1.0 # An arc will be split into segments. Each segment's length will # equal the resolution in mm set above. Lower values will produce a # finer arc, but also more work for your machine. Arcs smaller than # the configured value will become straight lines. The default is # 1mm.
fr: [gcode_arcs] #resolution: 1.0 # Un arc sera divisé en segments. La longueur de chaque segment sera égale à # la résolution en mm définie ci-dessus. Des valeurs plus faibles produiront un # arc plus fin, mais également plus de travail de votre machine. Les arcs plus # petits que la valeur configurée deviendront des lignes droites. La valeur par # défaut est 1 mm.
zh_hans: [gcode_arcs] #resolution: 1.0 # 一条弧线将被分割成若干段。每段的长度将 # 等于上面设置的分辨率（mm）。更低的值会产生一个 # 更细腻的弧线，但也会需要机器进行更多运算。小于 # 配置值的曲线会被视为直线。 # 默认为1毫米。

source: [respond] #default_type: echo # Sets the default prefix of the "M118" and "RESPOND" output to one # of the following: # echo: "echo: " (This is the default) # command: "// " # error: "!! " #default_prefix: echo: # Directly sets the default prefix. If present, this value will # override the "default_type".
fr: [respond] #default_type: echo # Définit le préfixe par défaut de la sortie "M118" et "RESPOND" à l'une des # des éléments suivants : # echo: "echo : " (C'est la valeur par défaut) # command: "// " # error: " !! " #default_prefix: echo: # Définit directement le préfixe par défaut. Si elle est présente, cette valeur # remplacera le "default_type".
zh_hans: [respond] #default_type: echo # 将 "M118 "和 "RESPOND "输出的默认前缀设置为以下之一： # echo: "echo: " (这是默认的) # command: "// " # error: "!!" #default_prefix: echo: # 直接设置默认的前缀。如果定义，这个值将覆盖 "default_type"。

source: [input_shaper] #shaper_freq_x: 0 # A frequency (in Hz) of the input shaper for X axis. This is # usually a resonance frequency of X axis that the input shaper # should suppress. For more complex shapers, like 2- and 3-hump EI # input shapers, this parameter can be set from different # considerations. The default value is 0, which disables input # shaping for X axis. #shaper_freq_y: 0 # A frequency (in Hz) of the input shaper for Y axis. This is # usually a resonance frequency of Y axis that the input shaper # should suppress. For more complex shapers, like 2- and 3-hump EI # input shapers, this parameter can be set from different # considerations. The default value is 0, which disables input # shaping for Y axis. #shaper_type: mzv # A type of the input shaper to use for both X and Y axes. Supported # shapers are zv, mzv, zvd, ei, 2hump_ei, and 3hump_ei. The default # is mzv input shaper. #shaper_type_x: #shaper_type_y: # If shaper_type is not set, these two parameters can be used to # configure different input shapers for X and Y axes. The same # values are supported as for shaper_type parameter. #damping_ratio_x: 0.1 #damping_ratio_y: 0.1 # Damping ratios of vibrations of X and Y axes used by input shapers # to improve vibration suppression. Default value is 0.1 which is a # good all-round value for most printers. In most circumstances this # parameter requires no tuning and should not be changed.
fr: [input_shaper] #shaper_freq_x: 0 # Fréquence (en Hz) de la mise en forme de l'entrée pour l'axe X. Il s'agit généralement # d'une fréquence de résonance de l'axe X que la mise en forme de l'entrée doit supprimer. # Pour les mises en forme plus complexes, comme les mises en forme à 2 ou 3 bosses EI # (2hump/3hump), ce paramètre peut être défini à partir de différentes considérations. # La valeur par défaut est 0, ce qui désactive la mise en forme de l'entrée pour l'axe X. #shaper_freq_y: 0 # Fréquence (en Hz) de la mise en forme de l'entrée pour l'axe Y. Il s'agit généralement # d'une fréquence de résonance de l'axe Y que la mise en forme de l'entrée doit supprimer. # Pour les mises en forme plus complexes, comme les mises en forme à 2 ou 3 bosses EI # (2hump/3hump), ce paramètre peut être défini à partir de différentes considérations. # La valeur par défaut est 0, ce qui désactive la mise en forme de l'entrée pour l'axe Y. #shaper_type: mzv # Le type de mise en forme de l'entrée à utiliser pour les axes X et Y. Les types supportés # sont zv, mzv, zvd, ei, 2hump_ei, et 3hump_ei. # La valeur par défaut est la compensation de résonance mzv. #shaper_type_x: #shaper_type_y: # Si shaper_type n'est pas défini, ces deux paramètres peuvent être utilisés pour configurer # des formes d'entrée différentes pour les axes X et Y. Les valeurs supportées sont les # mêmes que celles du paramètre shaper_type. #damping_ratio_x: 0.1 #damping_ratio_y: 0.1 # Taux d'amortissement des vibrations des axes X et Y utilisés par les dispositifs de mise # en forme de l'entrée afin d'améliorer la suppression des vibrations. La valeur par défaut est # 0.1 ce qui est une bonne valeur générale pour la plupart des imprimantes. Dans la plupart # des cas, ce paramètre ne nécessite aucun réglage et ne doit pas être modifié.
zh_hans: [input_shaper] #shaper_freq_x: 0 # 输入整形器的 X 轴频率(Hz)。通常这是希望被输入整形器消除的 # X 轴共振频率。对于更复杂的整形器，例如2- 和 3-hump EI 输入 # 整形器，设置这个参数可能需要考虑其他特性。 # 默认值是0，禁用 X 轴输入整形。 #shaper_freq_y: 0 # 输入整形器的 Y 轴频率(Hz)。通常这是希望被输入整形器消除的 # Y 轴共振频率。对于更复杂的整形器，例如2- 和 3-hump EI 输入 # 整形器，设置这个参数可能需要考虑其他特性。 # 默认值是0，禁用 Y 轴输入整形。 #shaper_type: mzv # 用于 X 和 Y 轴的输入整形器。支持的输入整形器有 zv、mzv、 # zvd、ei、2hump_ei 和 3hump_ei。 # 默认为 mzv 输入整形器。 #shaper_type_x: #shaper_type_y: # 如果没有设置 shaper_type，可以用这两个参数来单独配置 X # 和 Y 轴的 输入整形器。 # 该参数支持全部shaper_type 支持的选项。 #damping_ratio_x: 0.1 #damping_ratio_y: 0.1 # X 和 Y 轴的共振抑制比例，可以用来改善振动抑制效果。 # 默认值是 0.1，适用于大多数打印机。 # 大多数情况下不需要调整这个值。

source: [board_pins my_aliases] mcu: mcu # A comma separated list of micro-controllers that may use the # aliases. The default is to apply the aliases to the main "mcu". aliases: aliases_<name>: # A comma separated list of "name=value" aliases to create for the # given micro-controller. For example, "EXP1_1=PE6" would create an # "EXP1_1" alias for the "PE6" pin. However, if "value" is enclosed # in "<>" then "name" is created as a reserved pin (for example, # "EXP1_9=<GND>" would reserve "EXP1_9"). Any number of options # starting with "aliases_" may be specified.
fr: [board_pins my_aliases] mcu: mcu # Une liste de micro-contrôleurs séparés par des virgules pouvant utiliser les # alias. La valeur par défaut est d'appliquer les alias au "mcu" principal. alias: aliases_<nom>: # Une liste séparée par des virgules d'alias "nom=valeur" à créer pour le micro- # contrôleur donné. Par exemple, "EXP1_1=PE6" créera un alias "EXP1_1" pour la # broche "PE6". Cependant, si la "valeur" est incluse dans "<>", alors "nom" est créé # comme une broche réservée (par exemple, "EXP1_9=<GND>" réserverait "EXP1_9"). # Un nombre quelconque d'options commençant par "alias_" peuvent être spécifiées.
zh_hans: [board_pins my_aliases]。 mcu: mcu # 一个可以使用别名的逗号分隔的微控制器列表。 # 默认将别名应用于主 "mcu"。 aliases: aliases_<name>: # 为给定的微控制器创建的一个以逗号分隔的 "name=value " # 别名列表。例如，"EXP1_1=PE6" 将创建一个用于 "PE6 "引 # 脚的"EXP1_1 "别名。然而，如果 "值 " 被包括在 "<>"中， # 则 "name "将被创建为一个保留针脚（例如，"EXP1_9=<GND>" # 将保留 "EXP1_9"）。可以指定任何数量以 "aliases_"开头的分段。

source: [stepper_z1] #step_pin: #dir_pin: #enable_pin: #microsteps: #rotation_distance: # See the "stepper" section for the definition of the above parameters. #endstop_pin: # If an endstop_pin is defined for the additional stepper then the # stepper will home until the endstop is triggered. Otherwise, the # stepper will home until the endstop on the primary stepper for the # axis is triggered.
fr: [stepper_z1] #step_pin: #dir_pin: #enable_pin: #microsteps: #rotation_distanc : # Voir la section "stepper" pour la définition des paramètres ci-dessus. #endstop_pin: # Si une endstop_pin est définie pour le moteur supplémentaire, alors le moteur # se déplacera à l'origine jusqu'à ce que la fin de course soit déclenchée. Sinon, le # moteur se déplacera jusqu'à ce que la fin de course du moteur principal de l'axe # soit déclenchée.
zh_hans: [stepper_z1] #step_pin: #dir_pin: #enable_pin: #microsteps: #rotation_distance: # 参见"stepper"部分以获取上述参数的定义。 #endstop_pin: # 如果为附加步进电机定义了endstop_pin，则步进电机将进行 # 归位，直到触发终点开关。否则，步进电机将进行归位， # 直到触发主步进电机的轴上的终点开关。

source: [dual_carriage] axis: # The axis this extra carriage is on (either x or y). This parameter # must be provided. #step_pin: #dir_pin: #enable_pin: #microsteps: #rotation_distance: #endstop_pin: #position_endstop: #position_min: #position_max: # See the "stepper" section for the definition of the above parameters.
fr: [dual_carriage] axis: # L'axe sur lequel se trouve ce chariot supplémentaire (soit x, soit y). Ce paramètre # doit être fourni. #step_pin: #dir_pin: #enable_pin: #microsteps: #rotation_distance: #endstop_pin: #position_endstop: #position_min: #position_max: # Voir la section "stepper" pour la définition des paramètres ci-dessus.
zh_hans: [dual_carriage] axis: # 额外滑车所在的轴（x或者y）。 # 必须提供这个参数。 #step_pin: #dir_pin: #enable_pin: #microsteps: #rotation_distance: #endstop_pin: #position_endstop: #position_min: #position_max: # 以上参数的定义请查阅“stepper”分段。

source: [manual_stepper my_stepper] #step_pin: #dir_pin: #enable_pin: #microsteps: #rotation_distance: # See the "stepper" section for a description of these parameters. #velocity: # Set the default velocity (in mm/s) for the stepper. This value # will be used if a MANUAL_STEPPER command does not specify a SPEED # parameter. The default is 5mm/s. #accel: # Set the default acceleration (in mm/s^2) for the stepper. An # acceleration of zero will result in no acceleration. This value # will be used if a MANUAL_STEPPER command does not specify an ACCEL # parameter. The default is zero. #endstop_pin: # Endstop switch detection pin. If specified, then one may perform # "homing moves" by adding a STOP_ON_ENDSTOP parameter to # MANUAL_STEPPER movement commands.
fr: [manual_stepper my_stepper] #step_pin: #dir_pin: #enable_pin: #microsteps: #rotation_distance: # Voir la section "stepper" pour une description de ces paramètres. #velocity: # Définit la vitesse par défaut (en mm/s) pour le pilote moteur. Cette valeur # sera utilisée si une commande MANUAL_STEPPER ne spécifie pas de paramètre SPEED # La valeur par défaut est 5mm/s. #accel # Définit l'accélération par défaut (en mm/s^2) pour le pilote moteur Une # accélération de zéro n'entraînera aucune accélération. Cette valeur # sera utilisée si une commande MANUAL_STEPPER ne spécifie pas de # paramètre ACCEL. La valeur par défaut est zéro. #endstop_pin: # Broche de détection de l'interrupteur de fin de course. Si elle est spécifiée, on peut effectuer # des "mouvements de retour à l'origine" en ajoutant un paramètre STOP_ON_ENDSTOP aux # commandes de mouvement MANUAL_STEPPER.
zh_hans: [manual_stepper my_stepper]。 #step_pin: #dir_pin: #enable_pin: #microsteps: #rotation_distance: # 有关这些参数的描述请见"stepper"分段。 #velocity: # 设置步进电机的默认速度（单位：mm/s）。这个值会在 MANUAL_STEPPER # 命令没有指定一个 SPEED 参数时会被使用。 # 默认为 5 mm/s。 #accel: # 设置步进电机的默认加速度（单位：mm/s^2）。设置加速度为零将导致 # 没有加速度。这个值会在 MANUAL_STEPPER 命令没有指定 ACCEL 参数时 # 会被使用。 # 默认为 0。 #endstop_pin: # 限位开关检测引脚。如果定义了这个参数，可以通过在 MANUAL_STEPPER # 运动命令中添加一个 STOP_ON_ENDSTOP 参数来执行 "归位动作" 。

source: [verify_heater heater_config_name] #max_error: 120 # The maximum "cumulative temperature error" before raising an # error. Smaller values result in stricter checking and larger # values allow for more time before an error is reported. # Specifically, the temperature is inspected once a second and if it # is close to the target temperature then an internal "error # counter" is reset; otherwise, if the temperature is below the # target range then the counter is increased by the amount the # reported temperature differs from that range. Should the counter # exceed this "max_error" then an error is raised. The default is # 120. #check_gain_time: # This controls heater verification during initial heating. Smaller # values result in stricter checking and larger values allow for # more time before an error is reported. Specifically, during # initial heating, as long as the heater increases in temperature # within this time frame (specified in seconds) then the internal # "error counter" is reset. The default is 20 seconds for extruders # and 60 seconds for heater_bed. #hysteresis: 5 # The maximum temperature difference (in Celsius) to a target # temperature that is considered in range of the target. This # controls the max_error range check. It is rare to customize this # value. The default is 5. #heating_gain: 2 # The minimum temperature (in Celsius) that the heater must increase # by during the check_gain_time check. It is rare to customize this # value. The default is 2.
fr: [verify_heater heater_config_name] #max_error: 120 # L'erreur maximale de température cumulée avant de déclencher une erreur. # Des valeurs plus petites entraînent une vérification plus stricte et des valeurs plus grandes # permettent un délai plus long avant qu'une erreur ne soit signalée. # Plus précisément, la température est inspectée une fois par seconde et si elle # est proche de la température cible, un "compteur d'erreurs" interne est remis à zéro; # sinon, si la température est inférieure à la plage cible, le compteur est augmenté # de la quantité de température rapportée diffèrant de cette plage. Si le compteur # dépasse ce "max_error", une erreur est signalée. La valeur par défaut est 120. #check_gain_time: # Ceci contrôle la vérification du chauffage durant la chauffe initiale. Des valeurs plus petites # entraînent une vérification plus stricte et des valeurs plus grandes autorisent un délai # plus grand avant qu'une erreur ne soit signalée. Spécifiquement, pendant la chauffe initiale, # tant que la température de l'élément chauffant augmente durant ce laps de temps (spécifié # en secondes), le "compteur d'erreurs" interne est remis à zéro. # La valeur par défaut est de 20 secondes pour les extrudeuses et 60 secondes pour le lit chauffant. #hysteresis: 5 # La différence de température maximale (en Celsius) par rapport à une température cible # considérée comme située dans la plage de la cible. Ceci contrôle la vérification de la plage # du paramètre max_error. Il est rare de personnaliser cette valeur. # La valeur par défaut est 5. #heating_gain: 2 # La température minimale (en Celsius) pour laquelle le chauffage doit progresser # pendant la période de check_gain_time. Il est rare de personnaliser cette valeur. # La valeur par défaut est 2.
zh_hans: [verify_heater heater_config_name] #max_error: 120 # 报错之前最大的“累计温度偏差” # 更小的值会导致更严格的检查，而更大的值在报错前允许更多的时间 # 具体地说，温度会每秒检查一次。 # 如果温度正在接近目标温度，内部的“错误计数”会重置。 # 否则，如果温度低于目标区间，那么计数器会增加汇报的温度与目标的差 # 当计数值超过“max_error”就会报错 # 默认值是120 #check_gain_time: # 这个量控制着加热器初始化加热时的检查。 # 更小的值会导致更严格的检查，而更大的值在报错前允许更多的时间 # 具体地说，初始化加热时，只要加热器在时间片内（秒）升高温度， # 错误计数会重置 # 默认值对于挤出头是20秒，热床是60秒 #hysteresis: 5 # 被认为是在目标区间内的最大温差（以摄氏度为单位） # 这个量控制着max_error区间检测 # 很少定制这个值 # 默认是5 #heating_gain: 2 # 在check_gain_time检查中最小需要升高的温度（以摄氏度为单位） # 很少定制这个值 # 默认是2

source: [homing_heaters] #steppers: # A comma separated list of steppers that should cause heaters to be # disabled. The default is to disable heaters for any homing/probing # move. # Typical example: stepper_z #heaters: # A comma separated list of heaters to disable during homing/probing # moves. The default is to disable all heaters. # Typical example: extruder, heater_bed
fr: [homing_heaters] #steppers: # Une liste de pilotes moteurs séparés par des virgules qui devraient désactiver les chauffages. # La valeur par défaut est de désactiver les chauffages pour tout déplacement (mise à # l'origine / palpage). # Exemple typique : stepper_z #heaters: # Une liste, séparée par des virgules, d'éléments chauffants à désactiver pendant les déplacements # (mise à l'origine / palpage). La valeur par défaut est de désactiver tous les éléments chauffants. # Exemple typique : extruder, heater_bed
zh_hans: [homing_heaters] #steppers: # 会使加热器被禁用的步进电机逗号分隔列表。 # 默认在归零和探测时禁用全部加热器。 # 例如：stepper_z #heaters: # 归零和探测时会被禁用的加热器的逗号分隔列表。 # 默认禁用全部加热器。 # 例如：extruder, heater_bed

source: [thermistor my_thermistor] #temperature1: #resistance1: #temperature2: #resistance2: #temperature3: #resistance3: # Three resistance measurements (in Ohms) at the given temperatures # (in Celsius). The three measurements will be used to calculate the # Steinhart-Hart coefficients for the thermistor. These parameters # must be provided when using Steinhart-Hart to define the # thermistor. #beta: # Alternatively, one may define temperature1, resistance1, and beta # to define the thermistor parameters. This parameter must be # provided when using "beta" to define the thermistor.
fr: [thermistor mon_thermistor] #temperature1: #resistance1: #temperature2: #resistance2: #temperature3: #resistance3: # Trois mesures de résistance (en Ohms) aux températures données # (en Celsius). Ces trois mesures seront utilisées pour calculer les # coefficients de Steinhart-Hart pour la thermistance. Ces paramètres # doivent être fournis lors de l'utilisation de Steinhart-Hart pour définir la # thermistance. #beta: # Alternativement, on peut définir température1, résistance1, et beta # pour définir les paramètres de la thermistance. Ce paramètre doit être # fourni lorsque l'on utilise "beta" pour définir la thermistance.
zh_hans: [thermistor my_thermistor] #temperature1: #resistance1: #temperature2: #resistance2: #temperature3: #resistance3: # 三个在给定温度（以摄氏度为单位）下的阻值（以欧姆为单位） # 这三个测量值将会被用于计算热敏电阻的Steinhart-Hart系数 # 当使用Steinhart-Hart来定义热敏电阻时这三个参数必须给定 #beta: # 或者，可以使用temperature1 resistance1和beta来定义热敏电阻参数 # 当使用beta来定义热敏电阻时这个参数必须给定

source: [adc_temperature my_sensor] #temperature1: #voltage1: #temperature2: #voltage2: #... # A set of temperatures (in Celsius) and voltages (in Volts) to use # as reference when converting a temperature. A heater section using # this sensor may also specify adc_voltage and voltage_offset # parameters to define the ADC voltage (see "Common temperature # amplifiers" section for details). At least two measurements must # be provided. #temperature1: #resistance1: #temperature2: #resistance2: #... # Alternatively one may specify a set of temperatures (in Celsius) # and resistance (in Ohms) to use as reference when converting a # temperature. A heater section using this sensor may also specify a # pullup_resistor parameter (see "extruder" section for details). At # least two measurements must be provided.
fr: [adc_temperature mon_capteur] #temperature1: #voltage1: #temperature2: #voltage2: #... # Un ensemble de températures (en Celsius) et de tensions (en Volts) à utiliser comme # référence lors de la conversion d'une température. Une section de chauffage utilisant # ce capteur peut également spécifier les paramètres adc_voltage et voltage_offset # pour définir la tension ADC (voir la section "Amplificateurs communs de température" # pour plus de détails). Au moins deux mesures doivent être fournies. #temperature1: #resistance1: #temperature2: #resistance2: #... # Alternativement, on peut indiquer un ensemble de températures (en Celsius) # et de résistance (en Ohms) à utiliser comme référence lors de la conversion d'une # température. Une section de chauffage utilisant ce capteur peut également spécifier un # paramètre pullup_resistor (voir la section "extrudeuse" pour plus de détails). Au # moins deux mesures doivent être fournies.
zh_hans: [adc_temperature my_sensor] #temperature1: #voltage1: #temperature2: #voltage2: #... # 一组用作温度转换的参考温度（以摄氏度为单位）和电压（以 # 伏特为单位）。使用这个传感器的加热器分段也可以指定 # adc_voltage 和 voltage_offset 参数来定义 ADC 电压（详见“常用温度 # 放大器”章节）。至少要提供两个测量点。 #temperature1: #resistance1: #temperature2: #resistance2: #... # 作为替代，也可以指定一组用作温度转换的参考温度（以摄氏度为 # 单位）和阻值（以欧姆为单位）。使用这个传感器的加热器分段也 # 可以指定一个 pullup_resistor 参数（详见“挤出机”章节）。至少要 # 提供两个测量点。

source: [heater_generic my_generic_heater] #gcode_id: # The id to use when reporting the temperature in the M105 command. # This parameter must be provided. #heater_pin: #max_power: #sensor_type: #sensor_pin: #smooth_time: #control: #pid_Kp: #pid_Ki: #pid_Kd: #pwm_cycle_time: #min_temp: #max_temp: # See the "extruder" section for the definition of the above # parameters.
fr: [heater_generic my_generic_heater] #gcode_id: # L'identifiant à utiliser pour signaler la température dans la commande M105. # Ce paramètre doit être fourni. #heater_pin: #max_power: #sensor_type: #sensor_pin: #smooth_time: #control: #pid_Kp: #pid_Ki: #pid_Kd: #pwm_cycle_time: #min_temp: #max_temp: # Voir la section "extruder" pour la définition des paramètres # ci-dessus.
zh_hans: [heater_generic my_generic_heater] #gcode_id: # 使用M105查询温度时使用的ID。 # 必须提供此参数。 #heater_pin: #max_power: #sensor_type: #sensor_pin: #smooth_time: #control: #pid_Kp: #pid_Ki: #pid_Kd: #pwm_cycle_time: #min_temp: #max_temp: # 以上参数详见“extruder”分段。
