Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Config_Reference.po
Languages: fr, zh_hans

source: [pca9632 my_pca9632] #i2c_address: 98 # The i2c address that the chip is using on the i2c bus. This may be # 96, 97, 98, or 99. The default is 98. #i2c_mcu: #i2c_bus: #i2c_speed: # See the "common I2C settings" section for a description of the # above parameters. #scl_pin: #sda_pin: # Alternatively, if the pca9632 is not connected to a hardware I2C # bus, then one may specify the "clock" (scl_pin) and "data" # (sda_pin) pins. The default is to use hardware I2C. #color_order: RGBW # Set the pixel order of the LED (using a string containing the # letters R, G, B, W). The default is RGBW. #initial_RED: 0.0 #initial_GREEN: 0.0 #initial_BLUE: 0.0 #initial_WHITE: 0.0 # See the "led" section for information on these parameters.
fr: [pca9632 my_pca9632] #i2c_address 98 # L'adresse i2c que la puce utilise sur le bus i2c. Cela peut être # 96, 97, 98, ou 99. La valeur par défaut est 98. #i2c_mcu: #i2c_bus: #i2c_speed: # Voir la section "paramètres I2C communs" pour une description des # paramètres ci-dessus. #scl_pin: #sda_pin: # Alternativement, si le pca9632 n'est pas connecté à un bus matériel I2C # il est possible de spécifier les broches "clock" (scl_pin) et "data" (sda_pin). # Le défaut est d'utiliser l'I2C matériel. #color_order : RGBW # Définit l'ordre des pixels de la LED (en utilisant une chaîne contenant les lettres # R, G, B, W). La valeur par défaut est RGBW. #initial_RED: 0.0 #initial_GREEN: 0.0 #initial_BLUE: 0.0 #initial_WHITE: 0.0 # Voir la section "led" pour des informations sur ces paramètres.
zh_hans: [pca9632 my_pca9632]。 #i2c_address:98 # 芯片在i2c总线上使用的i2c地址。可以是96, 97, 98, 或 99。 # 默认为98。 #i2c_mcu: #i2c_bus: #i2c_speed: # 参见 "常见的I2C设置 "一节，以了解对上述参数的描述。 #scl_pin: #sda_pin: # 如果pca9632没有连接到硬件I2C总线，那么可以指定 # "时钟"(scl_pin)和 "数据"(sda_pin)引脚。 # 默认使用硬件I2C。 #color_order:RGBW # 设置LED的像素顺序(使用一个包含R、G、B、W的字符串)。 # 默认是RGBW。 #initial_RED:0.0 #initial_GREEN: 0.0 #initial_BLUE: 0.0 #initial_WHITE: 0.0 # 有关这些参数的信息，请参见 "led "分段。

source: Additional servos, buttons, and other pins
fr: Servos supplémentaires, boutons et autres broches
zh_hans: 额外的舵机、按钮和其他引脚

source: Display data text "macros" (one may define any number of sections with a display_template prefix). See the [command templates](Command_Templates.md) document for information on template evaluation.
fr: Les "macros" de texte des données d'affichage (on peut définir un nombre quelconque de sections avec un préfixe display_template). Voir le document [modèles de commande](Command_Templates.md) pour des informations sur l'évaluation des modèles.
zh_hans: 显示数据文本"macros"（可以定义任意数量的带有display_template前缀的部分）。有关模板评估的信息，请参阅[命令模板](Command_Templates.md)文件。

source: This feature allows one to reduce repetitive definitions in display_data sections. One may use the builtin `render()` function in display_data sections to evaluate a template. For example, if one were to define `[display_template my_template]` then one could use `{ render('my_template') }` in a display_data section.
fr: Cette fonctionnalité permet de réduire les définitions répétitives dans les sections display_data. On peut utiliser la fonction intégrée `render()` dans les sections display_data pour évaluer un modèle. Par exemple, si l'on définit "[display_template my_template]`", on peut utiliser "{ render('my_template') }` dans une section display_data.
zh_hans: 这个功能允许在display_data 分段减少重复的定义。可以在 display_data 分段使用内置的`render()` 函数来评估一个模板。例如，如果我们定义了`[display_template my_template]` ，那么我们可以在display_data 分段使用`{ render('my_template') }` 。

source: This feature can also be used for continuous LED updates using the [SET_LED_TEMPLATE](G-Codes.md#set_led_template) command.
fr: Cette fonctionnalité peut également être utilisée pour des mises à jour continues des LEDs à l'aide de la commande [SET_LED_TEMPLATE](G-Codes.md#set_led_template).
zh_hans: 这个功能也可以使用[SET_LED_TEMPLATE](G-Code.md#set_led_template)命令来连续更新LED。

source: [display_template my_template_name] #param_<name>: # One may specify any number of options with a "param_" prefix. The # given name will be assigned the given value (parsed as a Python # literal) and will be available during macro expansion. If the # parameter is passed in the call to render() then that value will # be used during macro expansion. For example, a config with # "param_speed = 75" might have a caller with # "render('my_template_name', param_speed=80)". Parameter names may # not use upper case characters. text: # The text to return when the this template is rendered. This field # is evaluated using command templates (see # docs/Command_Templates.md). This parameter must be provided.
fr: [display_template my_template_name] #param_<name>: # On peut spécifier un nombre quelconque d'options avec le préfixe "param_". Le nom # donné se verra attribuer la valeur donnée (analysée comme un littéral Python) et # sera disponible pendant l'expansion de la macro. Si le paramètre est passé dans # l'appel à render(), alors cette valeur sera utilisée pendant l'expansion de la macro. # Par exemple, une configuration avec "param_speed = 75" pourrait avoir un appelant # avec "render('my_template_name', param_speed=80)". Les noms de paramètres # peuvent ne pas utiliser de caractères majuscules. text: # Le texte à renvoyer lors du rendu de ce modèle. Ce champ est évalué à l'aide de # modèles de commande (voir docs/Command_Templates.md). # Ce paramètre doit être fourni.
zh_hans: [显示模板我的模板名称] #param_<名称>： # 可以指定任意数量的带有“param_”前缀的选项。 这 # 给定的名称将被赋予给定的值（解析为 Python # 字面量）并且在宏扩展期间可用。 如果 # 参数在调用 render() 时传递，然后该值将 # 在宏扩展时使用。 例如，一个配置 # "param_speed = 75" 可能有一个调用者 # "render('my_template_name', param_speed=80)". 参数名称可以 # 不使用大写字符。 文本： # 渲染此模板时要返回的文本。 这个领域 # 使用命令模板进行评估（参见 # docs/Command_Templates.md）。 必须提供此参数。

source: Magnetic hall angle sensor support for reading stepper motor angle shaft measurements using a1333, as5047d, or tle5012b SPI chips. The measurements are available via the [API Server](API_Server.md) and [motion analysis tool](Debugging.md#motion-analysis-and-data-logging). See the [G-Code reference](G-Codes.md#angle) for available commands.
fr: Prise en charge du capteur d'angle Hall magnétique pour la lecture des mesures de l'angle de l'arbre du moteur pas à pas à l'aide des puces SPI a1333, as5047d ou tle5012b. Les mesures sont disponibles via le [serveur API](API_Server.md) et l'[outil d'analyse de mouvement](Debugging.md#motion-analysis-and-data-logging). Voir la [référence G-Code](G-Codes.md#angle) pour les commandes disponibles.
zh_hans: 支持使用a1333、as5047d或tle5012b SPI芯片的磁性霍尔角度传感器测量并读取步进电机的角度。测量结果可以通过[API服务器](API_Server.md)和[运动分析工具](Debugging.md#motion-analysis-and-data-logging)获取。可用的命令请见[G代码参考](G-Codes.md#angle)。

source: [angle my_angle_sensor] sensor_type: # The type of the magnetic hall sensor chip. Available choices are # "a1333", "as5047d", and "tle5012b". This parameter must be # specified. #sample_period: 0.000400 # The query period (in seconds) to use during measurements. The # default is 0.000400 (which is 2500 samples per second). #stepper: # The name of the stepper that the angle sensor is attached to (eg, # "stepper_x"). Setting this value enables an angle calibration # tool. To use this feature, the Python "numpy" package must be # installed. The default is to not enable angle calibration for the # angle sensor. cs_pin: # The SPI enable pin for the sensor. This parameter must be provided. #spi_speed: #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # See the "common SPI settings" section for a description of the # above parameters.
fr: [angle my_angle_sensor] sensor_type: # Le type de la puce du capteur magnétique à effet Hall. Les choix disponibles # sont "a1333", "as5047d" et "tle5012b". Ce paramètre doit être spécifié. #sample_period: 0.000400 # La période de requête (en secondes) à utiliser lors des mesures. La valeur par # défaut est de 0.000400 (ce qui correspond à 2500 échantillons par seconde). #stepper: # Le nom du pilote moteur pas à pas auquel le capteur d'angle est attaché (ex, # "stepper_x"). La définition de cette valeur active un étalonnage d'angle. # Pour utiliser cette fonction, le paquet Python "numpy" doit être installé. # Par défaut, l'étalonnage d'angle n'est pas activé pour un capteur d'angle. cs_pin: # La broche d'activation SPI du capteur. Ce paramètre doit être fourni. #spi_speed: #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # Voir la section "paramètres SPI communs" pour une description des # paramètres ci-dessus.
zh_hans: [angle my_angle_sensor] sensor_type: # 磁性霍尔传感器芯片的类型。 # 可用的选择是 "a1333" "as5047d "和 "tle5012b"。 # 这个参数必须被指定。 #sample_period: 0.000400 # 测量时使用的查询周期（以秒为单位）。 # 默认值是 0.000400 （每秒钟2500个样本） #stepper: # 角度传感器连接的步进电机名称（例如，"stepper_x"）。 # 设置这个值可以启用一个角度校准工具 # 要使用这个功能需要安装Python "numpy "包。 # 默认是不启用角度传感器的角度校准。 cs_pin: # 传感器的SPI引脚。必须提供此参数。 #spi_speed: #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # 有关上述参数的描述，参考 "common SPI settings "

source: [screws_tilt_adjust] #screw1: # The (X, Y) coordinate of the first bed leveling screw. This is a # position to command the nozzle to so that the probe is directly # above the bed screw (or as close as possible while still being # above the bed). This is the base screw used in calculations. This # parameter must be provided. #screw1_name: # An arbitrary name for the given screw. This name is displayed when # the helper script runs. The default is to use a name based upon # the screw XY location. #screw2: #screw2_name: #... # Additional bed leveling screws. At least two screws must be # defined. #speed: 50 # The speed (in mm/s) of non-probing moves during the calibration. # The default is 50. #horizontal_move_z: 5 # The height (in mm) that the head should be commanded to move to # just prior to starting a probe operation. The default is 5. #screw_thread: CW-M3 # The type of screw used for bed level, M3, M4 or M5 and the # direction of the knob used to level the bed, clockwise decrease # counter-clockwise decrease. # Accepted values: CW-M3, CCW-M3, CW-M4, CCW-M4, CW-M5, CCW-M5. # Default value is CW-M3, most printers use an M3 screw and # turning the knob clockwise decrease distance.
fr: [screws_tilt_adjust] #screw1: # Les coordonnées (X, Y) de la première vis de mise à niveau du lit. Il s'agit d'une # position à laquelle déplacer la buse de manière à ce que la sonde soit directement # au-dessus de la vis de mise à niveau du lit (ou aussi près que possible tout en étant encore # au-dessus du lit). Il s'agit de la vis de base utilisée dans les calculs. Ce paramètre # doit être fourni. #screw1_name: # Un nom arbitraire pour la vis donnée. Ce nom est affiché lorsque # le script d'aide s'exécute. Par défaut, le nom utilisé est basé sur # la position XY de la vis. #screw2: #screw2_name: #... # Vis supplémentaires de mise à niveau du lit. Au moins deux vis doivent être # définies. #speed: 50 # La vitesse (en mm/s) des déplacements sans palpage pendant l'étalonnage. # La valeur par défaut est 50. #horizontal_move_z: 5 # La hauteur (en mm) à laquelle la tête doit être relevée pour se déplacer # juste avant de lancer une opération de palpage. La valeur par défaut est 5. #screw_thread: CW-M3 # Le type de vis utilisé pour le niveau du lit, M3, M4 ou M5 et la direction de la molette utilisée pour # le niveau du lit, diminution dans le sens des aiguilles d'une montre, augmentation dans le sens # inverse des aiguilles d'une montre. # Valeurs acceptées : CW-M3, CCW-M3, CW-M4, CCW-M4, CW-M5, CCW-M5. # La valeur par défaut est CW-M3, de nombreuses imprimantes utilisent une vis M3. # En tournant la molette dans le sens des aiguilles d'une montre, la distance diminue.

source: [resonance_tester] #probe_points: # A list of X, Y, Z coordinates of points (one point per line) to test # resonances at. At least one point is required. Make sure that all # points with some safety margin in XY plane (~a few centimeters) # are reachable by the toolhead. #accel_chip: # A name of the accelerometer chip to use for measurements. If # adxl345 chip was defined without an explicit name, this parameter # can simply reference it as "accel_chip: adxl345", otherwise an # explicit name must be supplied as well, e.g. "accel_chip: adxl345 # my_chip_name". Either this, or the next two parameters must be # set. #accel_chip_x: #accel_chip_y: # Names of the accelerometer chips to use for measurements for each # of the axis. Can be useful, for instance, on bed slinger printer, # if two separate accelerometers are mounted on the bed (for Y axis) # and on the toolhead (for X axis). These parameters have the same # format as 'accel_chip' parameter. Only 'accel_chip' or these two # parameters must be provided. #max_smoothing: # Maximum input shaper smoothing to allow for each axis during shaper # auto-calibration (with 'SHAPER_CALIBRATE' command). By default no # maximum smoothing is specified. Refer to Measuring_Resonances guide # for more details on using this feature. #min_freq: 5 # Minimum frequency to test for resonances. The default is 5 Hz. #max_freq: 133.33 # Maximum frequency to test for resonances. The default is 133.33 Hz. #accel_per_hz: 75 # This parameter is used to determine which acceleration to use to # test a specific frequency: accel = accel_per_hz * freq. Higher the # value, the higher is the energy of the oscillations. Can be set to # a lower than the default value if the resonances get too strong on # the printer. However, lower values make measurements of # high-frequency resonances less precise. The default value is 75 # (mm/sec). #hz_per_sec: 1 # Determines the speed of the test. When testing all frequencies in # range [min_freq, max_freq], each second the frequency increases by # hz_per_sec. Small values make the test slow, and the large values # will decrease the precision of the test. The default value is 1.0 # (Hz/sec == sec^-2).
fr: [resonance_tester] #probe_points: # Une liste de coordonnées X, Y, Z de points (un point par ligne) à tester. # Au moins un point est requis. Assurez-vous que tous les points avec une certaine marge # de sécurité dans le plan XY (~ quelques centimètres) sont accessibles par la tête de l'outil. #accel_chip: # Nom de la puce d'accéléromètre à utiliser pour les mesures. Si la puce adxl345 a été définie # sans un nom explicite, ce paramètre peut simplement la référencer en tant que # "accel_chip : adxl345", sinon un nom explicite doit être fourni, par exemple # "accel_chip : adxl345 my_chip_name". Soit ce paramètre seul, soit les deux paramètres # suivants doivent être définis. #accel_chip_x: #accel_chip_y: # Noms des puces d'accéléromètre à utiliser pour les mesures de chaque axe. # Peut être utile, par exemple, sur une imprimante de type "bed slinger", # si deux accéléromètres séparés sont montés, un sur le lit (pour l'axe Y) # et l'autre sur la tête de l'outil (pour l'axe X). Ces paramètres ont le même # format que le paramètre 'accel_chip'. Seul le paramètre 'accel_chip' ou ces deux # paramètres doivent être fournis. #max_smoothing: # Lissage maximal du façonneur (shaper) d'entrée à autoriser pour chaque axe pendant # l'auto-calibration (avec la commande 'SHAPER_CALIBRATE'). Par défaut, aucun # lissage maximal n'est spécifié. Reportez-vous au guide Measuring_Resonances # pour plus de détails sur l'utilisation de cette fonction. #min_freq: 5 # Fréquence minimale de test des résonances. La valeur par défaut est 5 Hz. #max_freq: 133.33 # Fréquence maximale de test des résonances. La valeur par défaut est 133,33 Hz. #accel_per_hz: 75 # Ce paramètre permet de déterminer l'accélération à utiliser pour tester une fréquence # spécifique: accel = accel_per_hz * freq. Plus haute est cette valeur, plus l'énergie des # oscillations est élevée. Peut être fixé à une valeur inférieure à celle par défaut si les # résonances deviennent trop fortes sur l'imprimante. Cependant, des valeurs plus faibles # rendent les mesures des résonances à haute fréquence moins précises. La valeur # par défaut est de 75 (mm/sec). #hz_per_sec: 1 # Détermine la vitesse de l'essai. Lors du test de toutes les fréquences dans # la plage [min_freq, max_freq], chaque seconde, la fréquence augmente de hz_per_sec. # De faibles valeurs rendent le test lent, et de grandes valeurs diminueront la précision du test. # La valeur par défaut est 1.0 (Hz/sec == sec^-2).
zh_hans: [resonance_tester] #probe_points: # 共振测试点的列表（每行一个X,Y,Z坐标点），至少指定一个点。请确保 # 所有点在XY平面上都有足够容许打印头移动头移动的安全余量（约几厘米）。 #accel_chip: # 一个用于测量的加速度计芯片的名称。如果adxl345芯片定义时没有明确指定 # 名称，这个参数可以直接引用 "accel_chip: adxl345"，否则必须提供一个明确 # 的名称，例如 "accel_chip: adxl345 my_chip_name"。 # 必须被提供这个参数或下面的两个参数。 #accel_chip_x: #accel_chip_y: # 用于测量每个轴的加速计芯片的名称。在平移热床的打印机上可能很有用， # 如果两个单独的加速度计分别被安装在打印床（用于Y轴）和工具头（X轴）上。 # 这些参数的格式与 “accel_chip” 参数相同。 # 必须提供“accel_chip”或这两个参数。 #max_smoothing: # 在自动校准整形(使用'SHAPER_CALIBRATE' 命令)的过程中允许每个轴的最大输 # 入整形器平滑度。 # 默认不指定最大的平滑度。 # 请参考共振校准指南以了解有关使用此功能的更多细节。 #min_freq: 5 # 测试谐振的最小频率。默认为5Hz。 #max_freq: 133.33 # 测试谐振的最大频率。默认为133.33 Hz。 #accel_per_hz: 75 # 这个参数用于决定测试一个特定的频率的加速度： accel = accel_per_hz * freq。 # 数值越大加速度越高，振荡的能量就越大。如果打印机上的共振太强，可以 # 设置为比默认值更低的值。然而，较低的值会使高频共振的测量不那么精确。 # 默认为75mm/s。 #hz_per_sec: 1 # 决定测试的速度。当测试所有频率在范围[min_freq, max_freq]内时，每秒钟 # 频率都会增加 hz_per_sec。更小的数值会使测试变慢，更大的数值会降低测 # 试的精度。 # 默认值是1.0（Hz/sec == sec^-2）。

source: The "Smart Effector" from Duet3d implements a Z probe using a force sensor. One may define this section instead of `[probe]` to enable the Smart Effector specific features. This also enables [runtime commands](G-Codes.md#smart_effector) to adjust the parameters of the Smart Effector at run time.
fr: Le "Smart Effector" de Duet3d implémente une sonde Z utilisant un capteur de force. On peut définir cette section à la place de `[probe]` pour activer les fonctionnalités spécifiques du Smart Effector. Cela permet également d'activer les [commandes d'exécution](G-Codes.md#smart_effector) afin d'ajuster les paramètres du Smart Effector au moment de l'exécution.
zh_hans: Duet3d的 "Smart Effector"使用一个力传感器实现了一个Z探针。可以定义这个分段，而不是`[probe]` ，以启用智能效应器的具体功能。这也使[运行时命令](G-Code.md#smart_effector)能够在运行时调整Smart Effector 的参数。

source: [smart_effector] pin: # Pin connected to the Smart Effector Z Probe output pin (pin 5). Note that # pullup resistor on the board is generally not required. However, if the # output pin is connected to the board pin with a pullup resistor, that # resistor must be high value (e.g. 10K Ohm or more). Some boards have a low # value pullup resistor on the Z probe input, which will likely result in an # always-triggered probe state. In this case, connect the Smart Effector to # a different pin on the board. This parameter is required. #control_pin: # Pin connected to the Smart Effector control input pin (pin 7). If provided, # Smart Effector sensitivity programming commands become available. #probe_accel: # If set, limits the acceleration of the probing moves (in mm/sec^2). # A sudden large acceleration at the beginning of the probing move may # cause spurious probe triggering, especially if the hotend is heavy. # To prevent that, it may be necessary to reduce the acceleration of # the probing moves via this parameter. #recovery_time: 0.4 # A delay between the travel moves and the probing moves in seconds. A fast # travel move prior to probing may result in a spurious probe triggering. # This may cause 'Probe triggered prior to movement' errors if no delay # is set. Value 0 disables the recovery delay. # Default value is 0.4. #x_offset: #y_offset: # Should be left unset (or set to 0). z_offset: # Trigger height of the probe. Start with -0.1 (mm), and adjust later using # `PROBE_CALIBRATE` command. This parameter must be provided. #speed: # Speed (in mm/s) of the Z axis when probing. It is recommended to start # with the probing speed of 20 mm/s and adjust it as necessary to improve # the accuracy and repeatability of the probe triggering. #samples: #sample_retract_dist: #samples_result: #samples_tolerance: #samples_tolerance_retries: #activate_gcode: #deactivate_gcode: #deactivate_on_each_sample: # See the "probe" section for more information on the parameters above.
fr: [smart_effector] pin: # Broche connectée à la broche de sortie de la sonde Z de Smart Effector (broche 5). Notez qu' # une résistance de tirage (pullup) sur la carte n'est généralement pas nécessaire. Cependant, si la broche de sortie # est connectée à la broche de la carte à l'aide d'une résistance de tirage, cette résistance doit être de valeur élevée (par ex. # 10K Ohm ou plus). Certaines cartes ont une résistance de tirage de faible valeur sur l'entrée de la sonde Z, ce qui # entraînera probablement un état de sonde toujours déclenché. Dans ce cas, connectez le Smart Effector à # une autre broche sur la carte. Ce paramètre est nécessaire. #control_pin: # Broche connectée à la broche d'entrée de contrôle du Smart Effector (broche 7). Si elle est fournie, # les commandes de programmation de la sensibilité du Smart Effector deviennent disponibles. #probe_accel: # Si elle est définie, limite l'accélération des mouvements de palpage (en mm/sec^2). # Une grande accélération soudaine au début du mouvement de palpage peut # provoquer des déclenchements intempestifs de la sonde, surtout si la tête de l'outil est lourde. # Pour éviter cela, il peut être nécessaire de réduire l'accélération des mouvements de palpage # via ce paramètre. #recovery_time: 0.4 # Délai entre les mouvements de déplacement et les mouvements de palpage en secondes. Un # déplacement rapide avant le palpage peut entraîner un déclenchement intempestif de celui-ci. # Cela peut provoquer des erreurs 'Probe triggered prior to movement' si aucun délai n'est défini. # La valeur 0 désactive le délai de récupération. # La valeur par défaut est 0,4. #x_offset: #y_offset: # Doit être laissé non défini (ou défini à 0). z_offset: # Hauteur de déclenchement de la sonde. Commencez avec -0,1 (mm), et ajustez plus tard en utilisant # la commande `PROBE_CALIBRATE`. Ce paramètre doit être fourni. #speed: # Vitesse (en mm/s) de l'axe Z lors du palpage. Il est recommandé de commencer # avec une vitesse de palpage de 20 mm/s et de l'ajuster si nécessaire pour améliorer la précision # et la répétabilité du déclenchement du palpeur. #samples: #sample_retract_dist: #samples_result: #samples_tolerance: #samples_tolerance_retries: #activate_gcode: #deactivate_gcode: #deactivate_on_each_sample: # Voir la section "sonde" (probe) pour plus d'informations sur les paramètres ci-dessus.
zh_hans: [smart_effector] pin: # 连接到Smart Effector Z探针输出引脚（引脚5）的引脚。注意，板上通 # 常不需要拉升电阻。然而，如果输出引脚连接到带有拉升电阻的板引脚，那么 # 电阻必须是高值（例如，10K欧姆或更多）。有些板上有低值拉升电阻在Z探 # 针输入上，这可能导致始终触发的探针状态。在这种情况下，将Smart Effector # 连接到板上的不同引脚。 # 必须提供此参数。 #control_pin: # 连接到Smart Effector控制输入引脚（引脚7）的引脚。如果提供，Smart Effector # 敏感度的编程命令将会变得可用。 #probe_accel: # 如果设置，限制探针移动的加速度（以毫米/秒^2为单位）。探针移动开始时 # 的突然大加速度可能会导致探针错误触发，特别是如果热端很重。为了防止这 # 种情况，可能需要通过此参数降低探针移动的加速度。 #recovery_time: 0.4 # 旅行移动与探测移动之间的延迟，以秒为单位。快速探测前的移动可能导致探 # 针错误触发。 如果没有设置延迟，这可能会导致“探针在移动前触发”的错误。 # 默认值是0.4。 #x_offset: #y_offset: # 应保持未设置（或设置为0）。 z_offset: # 探针的触发高度。从-0.1（毫米）开始，然后使用`PROBE_CALIBRATE`命令进 # 行调整。 # 必须提供此参数。 #speed: # 探针时Z轴的速度（以毫米/秒为单位）。建议从20毫米/秒的探针速度开始， # 并根据需要调整以提高探针触发的准确性和重复性。 #samples: #sample_retract_dist: #samples_result: #samples_tolerance: #samples_tolerance_retries: #activate_gcode: #deactivate_gcode: #deactivate_on_each_sample: # 有关以上参数的更多信息，请参阅"probe"分段。
