Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Config_Reference.po
Languages: fr, zh_hans

source: [fan] pin: # Output pin controlling the fan. This parameter must be provided. #max_power: 1.0 # The maximum power (expressed as a value from 0.0 to 1.0) that the # pin may be set to. The value 1.0 allows the pin to be set fully # enabled for extended periods, while a value of 0.5 would allow the # pin to be enabled for no more than half the time. This setting may # be used to limit the total power output (over extended periods) to # the fan. If this value is less than 1.0 then fan speed requests # will be scaled between zero and max_power (for example, if # max_power is .9 and a fan speed of 80% is requested then the fan # power will be set to 72%). The default is 1.0. #shutdown_speed: 0 # The desired fan speed (expressed as a value from 0.0 to 1.0) if # the micro-controller software enters an error state. The default # is 0. #cycle_time: 0.010 # The amount of time (in seconds) for each PWM power cycle to the # fan. It is recommended this be 10 milliseconds or greater when # using software based PWM. The default is 0.010 seconds. #hardware_pwm: False # Enable this to use hardware PWM instead of software PWM. Most fans # do not work well with hardware PWM, so it is not recommended to # enable this unless there is an electrical requirement to switch at # very high speeds. When using hardware PWM the actual cycle time is # constrained by the implementation and may be significantly # different than the requested cycle_time. The default is False. #kick_start_time: 0.100 # Time (in seconds) to run the fan at full speed when either first # enabling or increasing it by more than 50% (helps get the fan # spinning). The default is 0.100 seconds. #off_below: 0.0 # The minimum input speed which will power the fan (expressed as a # value from 0.0 to 1.0). When a speed lower than off_below is # requested the fan will instead be turned off. This setting may be # used to prevent fan stalls and to ensure kick starts are # effective. The default is 0.0. # # This setting should be recalibrated whenever max_power is adjusted. # To calibrate this setting, start with off_below set to 0.0 and the # fan spinning. Gradually lower the fan speed to determine the lowest # input speed which reliably drives the fan without stalls. Set # off_below to the duty cycle corresponding to this value (for # example, 12% -> 0.12) or slightly higher. #tachometer_pin: # Tachometer input pin for monitoring fan speed. A pullup is generally # required. This parameter is optional. #tachometer_ppr: 2 # When tachometer_pin is specified, this is the number of pulses per # revolution of the tachometer signal. For a BLDC fan this is # normally half the number of poles. The default is 2. #tachometer_poll_interval: 0.0015 # When tachometer_pin is specified, this is the polling period of the # tachometer pin, in seconds. The default is 0.0015, which is fast # enough for fans below 10000 RPM at 2 PPR. This must be smaller than # 30/(tachometer_ppr*rpm), with some margin, where rpm is the # maximum speed (in RPM) of the fan. #enable_pin: # Optional pin to enable power to the fan. This can be useful for fans # with dedicated PWM inputs. Some of these fans stay on even at 0% PWM # input. In such a case, the PWM pin can be used normally, and e.g. a # ground-switched FET(standard fan pin) can be used to control power to # the fan.
fr: [fan] pin: # Broche de sortie contrôlant le ventilateur. Ce paramètre doit être fourni. #max_power: 1.0 # La puissance maximale (exprimée en tant que valeur comprise entre 0,0 et 1,0) à laquelle # régler la broche. La valeur 1.0 permet de régler la broche entièrement activée pendant de # longues périodes, tandis qu'une valeur de 0,5 permet à la broche de n'être activée que # durant la moitié du temps au maximum. Ce paramètre peut être utilisé pour limiter la # puissance totale de sortie (sur des périodes prolongées) du ventilateur. # Si cette valeur est inférieure à 1,0, les demandes de vitesse du ventilateur seront mises à # l'échelle entre zéro et max_power (par exemple, si la puissance maximale est de 0,9 et # qu'une vitesse de 80 % est demandée, la puissance du ventilateur sera réglée à 72 %. # La valeur par défaut est 1.0. #shutdown_speed: 0 # La vitesse souhaitée du ventilateur (exprimée comme une valeur de 0,0 à 1,0) si # le logiciel du microcontrôleur passe dans un état d'erreur. La valeur par défaut # est 0. #cycle_time: 0.010 # La durée (en secondes) de chaque cycle d'alimentation PWM du ventilateur. Il est # recommandé que cette durée soit de 10 millisecondes ou plus si vous utilisez un PWM logiciel. # La valeur par défaut est de 0,010 seconde. #hardware_pwm: False # Activez ceci pour utiliser le PWM matériel au lieu du PWM logiciel. La plupart des ventilateurs # ne fonctionnent pas correctement avec le PWM matériel, il n'est donc pas recommandé # d'activer cette option à moins qu'il n'y ait une exigence électrique pour obtenir une très haute # vitesse. Lorsque vous utilisez le PWM matériel, le temps de cycle réel est contraint par la mise # en œuvre et peut être significativement différent du temps de cycle demandé. # La valeur par défaut est False. #kick_start_time: 0.100 # Durée (en secondes) de fonctionnement du ventilateur à pleine vitesse, soit lors de sa première # activation soit lors d'une augmentation de plus de 50% (pour faire tourner le ventilateur). # La valeur par défaut est de 0,100 seconde. #off_below: 0.0 # La vitesse d'entrée minimale qui alimentera le ventilateur (exprimée comme une valeur # comprise entre 0,0 et 1,0). Quand une vitesse inférieure à off_below est demandée le ventilateur # sera désactivé. Ce réglage peut être utilisé pour éviter que le ventilateur ne cale et pour # garantir que les démarrages sont efficaces. # La valeur par défaut est 0.0. # # Ce paramètre doit être recalibré chaque fois que max_power est ajusté. # Pour calibrer ce paramètre, commencez avec off_below réglé sur 0.0 et ventilateur tournant. Diminuez # progressivement la vitesse du ventilateur afin de déterminer la vitesse d'entrée la plus faible entraînant # le ventilateur de manière fiable sans décrochage. Réglez off_below au rapport cyclique correspondant # à cette valeur (par exemple, 12% -> 0,12) ou légèrement plus. #tachometer_pin: # Broche d'entrée tachymétrique de surveillance de la vitesse du ventilateur. Un pullup est généralement # nécessaire. Ce paramètre est facultatif. #tachometer_ppr: 2 # Lorsque tachometer_pin est spécifié, il s'agit du nombre d'impulsions par révolution du signal # tachymétrique. Pour un ventilateur BLDC, c'est normalement la moitié du nombre de pôles. # La valeur par défaut est 2. #tachometer_poll_interval: 0.0015 # Lorsque tachometer_pin est spécifié, il s'agit de la période d'interrogation de la broche tachymétrique, # en secondes. La valeur par défaut est 0.0015, ce qui est suffisamment rapide pour des ventilateurs de # moins de 10000 RPM à 2 PPR. Cette valeur doit être inférieure à 30/(tachometer_ppr*rpm), avec une # certaine marge, où rpm est la vitesse maximale (en RPM) du ventilateur. #enable_pin: # Broche optionnelle pour d'activation de l'alimentation du ventilateur. Cela peut être utile pour les # ventilateurs avec des entrées PWM dédiées. Certains de ces ventilateurs restent allumés même à 0 % # de PWM. Dans ce cas, la broche PWM peut être utilisée normalement et, par exemple, un FET commuté # à la masse (broche de ventilateur standard) peut être utilisé pour contrôler l'alimentation du ventilateur.
zh_hans: [fan] pin: # 控制风扇的输出引脚。必须提供此参数。 #max_power: 1.0 # 引脚可以设置的最大功率（以0.0到1.0的值表示）。1.0的值允许引脚完全 # 启用，而0.5的值则最多只能启用一半的时间。此设置可用于限制风扇的总 # 功率输出（在延长时间内）。如果此值小于1.0，则风扇速度请求将在零和 # 最大功率之间进行缩放（例如，如果最大功率为.9且请求的风扇速度为80%， # 则风扇功率将被设置为72%）。 # 默认值为1.0。 #shutdown_speed: 0 # 微控制器软件进入错误状态时的风扇速度（以0.0到1.0的值表示）。 # 默认值为0。 #cycle_time: 0.010 # 每个PWM电源周期到风扇的时间（以秒为单位）。当使用基于软件 # 的PWM时，建议此值为10毫秒或更大。 # 默认值为0.010秒。 #hardware_pwm: False # 启用此选项以使用硬件PWM而非软件PWM。大多数风扇不适合使用 # 硬件PWM，因此除非有电气需求以非常高的速度切换，否则不建议 # 启用此功能。当使用硬件PWM时，实际的周期时间受到实现的限制， # 可能与请求的周期时间有很大的不同。 # 默认值为False。 #kick_start_time: 0.100 # 风扇全速运行的时间（以秒为单位），当首次启用或增加超过50%时 # （有助于使风扇开始旋转）。 # 默认值为0.100秒。 #off_below: 0.0 # 将供电给风扇的最小输入速度（以0.0到1.0的值表示）。当请求低于 # off_below的速度时，风扇将被关闭。此设置可以用于防止风扇停滞， # 并确保起动开始有效。 # 默认值为0.0。 # # 每次调整max_power时，都应重新校准此设置。为校准此设置，以 # off_below设置为0.0和风扇旋转开始。逐渐降低风扇速度，确定 # 可可靠驱动风扇且不停滞的最低输入速度。将off_below设置为对应 # 于此值的占空比（例如，12% -> 0.12）或稍高。 #tachometer_pin: # 用于监控风扇速度的转速计输入引脚。通常需要上拉。此参数是可 # 选的。 #tachometer_ppr: 2 # 当指定了转速计引脚时，这是转速计信号每转一圈的脉冲数。对于 # BLDC风扇，这通常是极数的一半。 # 默认值是2。 #tachometer_poll_interval: 0.0015 # 当指定了转速计引脚时，这是转速计引脚的轮询周期，以秒为单位。 # 默认值是0.0015，对于2PPR以下的10000转/分钟的风扇来说已经足够 # 快了。这个值必须小于30/(转速计_ppr*rpm)，并且有一些余量，其中 # rpm是风扇的最大速度（以RPM为单位）。 #enable_pin: # 可选引脚，用于使风扇供电。对于具有专用PWM输入的风扇，这可以 # 很有用。这些风扇即使在0% PWM输入下也会保持开启。在这种情况下， # PWM引脚可以使用，例如，可以使用接地开关的FET（标准风扇引脚） # 来控制风扇的电源。

source: [heater_fan my_nozzle_fan] #pin: #max_power: #shutdown_speed: #cycle_time: #hardware_pwm: #kick_start_time: #off_below: #tachometer_pin: #tachometer_ppr: #tachometer_poll_interval: #enable_pin: # See the "fan" section for a description of the above parameters. #heater: extruder # Name of the config section defining the heater that this fan is # associated with. If a comma separated list of heater names is # provided here, then the fan will be enabled when any of the given # heaters are enabled. The default is "extruder". #heater_temp: 50.0 # A temperature (in Celsius) that the heater must drop below before # the fan is disabled. The default is 50 Celsius. #fan_speed: 1.0 # The fan speed (expressed as a value from 0.0 to 1.0) that the fan # will be set to when its associated heater is enabled. The default # is 1.0
fr: [heater_fan my_nozzle_fan] #pin: #max_power: #shutdown_speed: #cycle_time: #hardware_pwm: #kick_start_time: #off_below: #tachometer_pin: #tachometer_ppr: #tachometer_poll_interval: #enable_pin: # Voir la section "fan" pour une description des paramètres ci-dessus. #heater: extruder # Nom de la section de configuration définissant le chauffage auquel ce ventilateur est associé. # Si une liste de noms d'éléments chauffants séparés par des virgules est fournie ici, le # ventilateur sera activé lorsque l'un des chauffages donnés est activé. # La valeur par défaut est "extruder". #heater_temp: 50.0 # Température (en Celsius) en dessous de laquelle l'élément chauffant doit descendre pour que # le ventilateur soit désactivé. La valeur par défaut est 50 °C. #fan_speed: 1.0 # La vitesse du ventilateur (exprimée sous la forme d'une valeur comprise entre 0,0 et 1,0) à # laquelle le ventilateur sera réglé lorsque l'élément chauffant qui lui est associé est activé. # La valeur par défaut est 1.0
zh_hans: [heater_fan my_nozzle_fan] #pin: #max_power: #shutdown_speed: #cycle_time: #hardware_pwm: #kick_start_time: #off_below: #tachometer_pin: #tachometer_ppr: #tachometer_poll_interval: #enable_pin: # 请参阅“fan”分段，了解上述参数的描述。 #heater: extruder # 此风扇所关联的加热器的配置部分的名称。如果在此处提供了加热器名称的逗号分隔列表， # 则在给定的任何加热器启用时，风扇将被启用。默认为“extruder”。 #heater_temp: 50.0 # 加热器必须降至此温度（摄氏度）以下，风扇才会被禁用。默认为 50 摄氏度。 #fan_speed: 1.0 # 当关联的加热器启用时，风扇将设置的风扇速度（表示为从 0.0 到 1.0 的值）。 # 默认值为 1.0

source: [controller_fan my_controller_fan] #pin: #max_power: #shutdown_speed: #cycle_time: #hardware_pwm: #kick_start_time: #off_below: #tachometer_pin: #tachometer_ppr: #tachometer_poll_interval: #enable_pin: # See the "fan" section for a description of the above parameters. #fan_speed: 1.0 # The fan speed (expressed as a value from 0.0 to 1.0) that the fan # will be set to when a heater or stepper driver is active. # The default is 1.0 #idle_timeout: # The amount of time (in seconds) after a stepper driver or heater # was active and the fan should be kept running. The default # is 30 seconds. #idle_speed: # The fan speed (expressed as a value from 0.0 to 1.0) that the fan # will be set to when a heater or stepper driver was active and # before the idle_timeout is reached. The default is fan_speed. #heater: #stepper: # Name of the config section defining the heater/stepper that this fan # is associated with. If a comma separated list of heater/stepper names # is provided here, then the fan will be enabled when any of the given # heaters/steppers are enabled. The default heater is "extruder", the # default stepper is all of them.
fr: [controller_fan my_controller_fan] #pin: #max_power: #shutdown_speed: #cycle_time: #hardware_pwm: #kick_start_time: #off_below: #tachometer_pin: #tachometer_ppr: #tachometer_poll_interval: #enable_pin: # Voir la section "fan" pour une description des paramètres ci-dessus. #fan_speed: 1.0 # Vitesse du ventilateur (exprimée comme une valeur de 0,0 à 1,0) à laquelle celui-ci # sera réglé lorsqu'un chauffage ou un pilote pas à pas est actif. # La valeur par défaut est 1.0 #idle_timeout: # Durée (en secondes) après activité d'un pilote pas à pas ou d'un élément chauffant # pour laquelle le ventilateur doit continuer de fonctionner. La valeur par défaut # est de 30 secondes. #idle_speed: # Vitesse du ventilateur (exprimée comme une valeur de 0,0 et 1,0) à laquelle le régler # lors de l'activité d'une chauffe ou d'un pilote pas à pas avant que le délai d'attente # idle_timeout ne soit atteint. La valeur par défaut est fan_speed. #heater: #stepper : # Nom de la section de configuration définissant l'élément chauffant/pilote auquel ce ventilateur # est associé. Si une liste séparée par des virgules de noms d'éléments chauffants/pilotes est # fournie ici, le ventilateur s'activera lorsque l'un des éléments chauffants/pilotes donnés est activé. # Le chauffage par défaut est "extruder", le pilote par défaut est tous.
zh_hans: [controller_fan my_controller_fan] #pin: #max_power: #shutdown_speed: #cycle_time: #hardware_pwm: #kick_start_time: #off_below: #tachometer_pin: #tachometer_ppr: #tachometer_poll_interval: #enable_pin: # 请参阅“fan”分段，了解上述参数的描述。 #fan_speed: 1.0 # 当加热器或步进驱动器活跃时，将设置风扇速度（表示为从 0.0 到 1.0 的值）。 # 默认值为 1.0。 #idle_timeout: # 在步进驱动器或加热器不再活跃后风扇应保持运行的时间（以秒为单位）。 # 默认值为 30 秒。 #idle_speed: # 当步进驱动器或加热器不再活跃后并且达到 idle_timeout 之前，将设置风扇速度 # （表示为从 0.0 到 1.0 的值）。 # 默认值为 fan_speed。 #heater: #stepper: # 定义与此风扇相关联的加热器/步进器的配置分段的名称。如果在此处提供了逗号分隔的 # 加热器/步进器名称列表，则当任何给定的加热器/步进器启用时，将启用该风扇。 # 默认加热器为 "extruder"，默认步进器为所有步进器。

source: [temperature_fan my_temp_fan] #pin: #max_power: #shutdown_speed: #cycle_time: #hardware_pwm: #kick_start_time: #off_below: #tachometer_pin: #tachometer_ppr: #tachometer_poll_interval: #enable_pin: # See the "fan" section for a description of the above parameters. #sensor_type: #sensor_pin: #control: #max_delta: #min_temp: #max_temp: # See the "extruder" section for a description of the above parameters. #pid_Kp: #pid_Ki: #pid_Kd: # The proportional (pid_Kp), integral (pid_Ki), and derivative # (pid_Kd) settings for the PID feedback control system. Klipper # evaluates the PID settings with the following general formula: # fan_pwm = max_power - (Kp*e + Ki*integral(e) - Kd*derivative(e)) / 255 # Where "e" is "target_temperature - measured_temperature" and # "fan_pwm" is the requested fan rate with 0.0 being full off and # 1.0 being full on. The pid_Kp, pid_Ki, and pid_Kd parameters must # be provided when the PID control algorithm is enabled. #pid_deriv_time: 2.0 # A time value (in seconds) over which temperature measurements will # be smoothed when using the PID control algorithm. This may reduce # the impact of measurement noise. The default is 2 seconds. #target_temp: 40.0 # A temperature (in Celsius) that will be the target temperature. # The default is 40 degrees. #max_speed: 1.0 # The fan speed (expressed as a value from 0.0 to 1.0) that the fan # will be set to when the sensor temperature exceeds the set value. # The default is 1.0. #min_speed: 0.3 # The minimum fan speed (expressed as a value from 0.0 to 1.0) that # the fan will be set to for PID temperature fans. # The default is 0.3. #gcode_id: # If set, the temperature will be reported in M105 queries using the # given id. The default is to not report the temperature via M105.
fr: [temperature_fan my_temp_fan] #pin: #max_power: #shutdown_speed: #cycle_time: #hardware_pwm: #kick_start_time: #off_below: #tachometer_pin: #tachometer_ppr: #tachometer_poll_interval: #enable_pin: # Voir la section "ventilateur" pour une description des paramètres ci-dessus. #sensor_type: #sensor_pin: #control: #max_delta: #min_temp: #max_temp: # Voir la section "extrudeuse" pour une description des paramètres ci-dessus. #pid_Kp: #pid_Ki: #pid_Kd: # Les paramètres proportionnels (pid_Kp), intégraux (pid_Ki), et dérivés (pid_Ki) # pour le système de contrôle par rétroaction PID. Klipper évalue les paramètres PID # avec la formule générale suivante : # fan_pwm = max_power - (Kp*e + Ki*integral(e) - Kd*derivative(e)) / 255 # Où "e" est "température_cible - température_mesurée" et # "fan_pwm" est le débit du ventilateur demandé, 0,0 correspondant à un arrêt complet et # 1,0 correspond à un fonctionnement à plein régime. Les paramètres pid_Kp, pid_Ki, et pid_Kd # doivent être fournis lorsque l'algorithme de contrôle PID est activé. #pid_deriv_time: 2.0 # Une durée (en secondes) sur laquelle les mesures de température seront lissées lors de # l'utilisation de l'algorithme de contrôle PID. Cela peut réduire l'impact du bruit de mesure. # La valeur par défaut est de 2 secondes. #target_temp: 40.0 # Une température (en Celsius) qui sera la température cible. # La valeur par défaut est 40 degrés. #max_speed: 1.0 # La vitesse du ventilateur (exprimée comme une valeur de 0,0 à 1,0) à laquelle le ventilateur # sera réglé lorsque la température du capteur dépassera la valeur définie. # La valeur par défaut est 1.0. #min_speed: 0.3 # Vitesse minimale du ventilateur (exprimée sous la forme d'une valeur comprise entre 0,0 et 1,0) # à laquelle le ventilateur sera réglé pour les ventilateurs à température PID. # La valeur par défaut est 0,3. #gcode_id: # S'il est défini, la température sera signalée dans les requêtes M105 en utilisant l'identifiant # id donné. La valeur par défaut est de ne pas rapporter la température via M105.

source: [fan_generic extruder_partfan] #pin: #max_power: #shutdown_speed: #cycle_time: #hardware_pwm: #kick_start_time: #off_below: #tachometer_pin: #tachometer_ppr: #tachometer_poll_interval: #enable_pin: # See the "fan" section for a description of the above parameters.
fr: [fan_generic extruder_partfan] #pin: #max_power: #shutdown_speed: #cycle_time: #hardware_pwm: #kick_start_time: #off_below: #tachometer_pin: #tachometer_ppr: #tachometer_poll_interval: #enable_pin: # Voir la section "ventilateur" pour une description des paramètres ci-dessus.
zh_hans: [fan_generic extruder_partfan] #pin: #max_power: #shutdown_speed: #cycle_time: #hardware_pwm: #kick_start_time: #off_below: #tachometer_pin: #tachometer_ppr: #tachometer_poll_interval: #enable_pin: # 请参阅“fan"分段，了解上述参数的描述。

source: Temperature-dependant toolhead Z position adjustment. Compensate for vertical toolhead movement caused by thermal expansion of the printer's frame in real-time using a temperature sensor (typically coupled to a vertical section of frame).
fr: Réglage de la position Z de la tête d'impression en fonction de la température. Compenser le mouvement vertical de la tête d'impression causé par la dilatation thermique du châssis de l'imprimante en temps réel à l'aide d'un capteur de température (généralement couplé à une section verticale du châssis).
zh_hans: 基于温度的工具头Z位置调整。使用温度传感器（通常连接到框架的垂直部分）实时补偿由于打印机框架的热膨胀引起的垂直方向工具头移动。

source: See also: [extended g-code commands](G-Codes.md#z_thermal_adjust).
fr: Voir aussi : [commandes de code G étendues](G-Codes.md#z_thermal_adjust).
zh_hans: 另请参阅：[扩展G代码命令](G-Codes.md#z_thermal_adjust)。

source: [z_thermal_adjust] #temp_coeff: # The temperature coefficient of expansion, in mm/degC. For example, a # temp_coeff of 0.01 mm/degC will move the Z axis downwards by 0.01 mm for # every degree Celsius that the temperature sensor increases. Defaults to # 0.0 mm/degC, which applies no adjustment. #smooth_time: # Smoothing window applied to the temperature sensor, in seconds. Can reduce # motor noise from excessive small corrections in response to sensor noise. # The default is 2.0 seconds. #z_adjust_off_above: # Disables adjustments above this Z height [mm]. The last computed correction # will remain applied until the toolhead moves below the specified Z height # again. The default is 99999999.0 mm (always on). #max_z_adjustment: # Maximum absolute adjustment that can be applied to the Z axis [mm]. The # default is 99999999.0 mm (unlimited). #sensor_type: #sensor_pin: #min_temp: #max_temp: # Temperature sensor configuration. # See the "extruder" section for the definition of the above # parameters. #gcode_id: # See the "heater_generic" section for the definition of this # parameter.
fr: [z_thermal_adjust] #temp_coeff: # Le coefficient de dilatation thermique, en mm/degC. Par exemple, un # temp_coeff de 0,01 mm/degC déplacera l'axe Z vers le bas de 0,01 mm à # chaque degré Celsius d'augmentation du capteur de température. La valeur # par défaut, 0,0 mm/degC, n'applique aucun ajustement. #smooth_time: # Fenêtre de lissage appliquée au capteur de température, en secondes. Peut réduire # le bruit du moteur dû à de petites corrections excessives en réponse au bruit du capteur. # La valeur par défaut est de 2,0 secondes. #z_adjust_off_above: # Désactive les ajustements au-dessus de cette hauteur Z [mm]. La dernière correction calculée # restera appliquée jusqu'à ce que la tête de l'outil passe à nouveau en dessous de la hauteur Z spécifiée. # La valeur par défaut est 99999999.0 mm (toujours actif). #max_z_adjustment: # Ajustement absolu maximal pouvant être appliqué à l'axe Z [mm]. # La valeur par défaut est 99999999.0 mm (illimité). #sensor_type: #sensor_pin: #min_temp: #max_temp: # Configuration du capteur de température. # Voir la section "extrudeuse" pour la définition des paramètres ci-dessus. #gcode_id: # Voir la section "heater_generic" pour la définition de ce # paramètre.

source: [mpu9250 my_accelerometer] #i2c_address: # Default is 104 (0x68). If AD0 is high, it would be 0x69 instead. #i2c_mcu: #i2c_bus: #i2c_speed: 400000 # See the "common I2C settings" section for a description of the # above parameters. The default "i2c_speed" is 400000. #axes_map: x, y, z # See the "adxl345" section for information on this parameter.
zh_hans: [mpu9250 my_accelerometer] #i2c_address: # 默认为104（0x68）。如果AD0为高，那么它将是0x69。 #i2c_mcu: #i2c_bus: #i2c_speed: 400000 # 有关上述参数的描述，请参见“常见I2C设置”部分。 # 默认的"i2c_speed"是400000。 #axes_map: x, y, z # 有关此参数的信息，请参阅"adxl345"部分。

source: Support for MPU-9250, MPU-9255, MPU-6515, MPU-6050, and MPU-6500 accelerometers (one may define any number of sections with an "mpu9250" prefix).
zh_hans: 支持 MPU-9250、MPU-9255、MPU-6515、MPU-6050 和 MPU-6500 加速度计（可通过“mpu9250”前缀定义任意数量的分段）。
