Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Config_Reference.po
Languages: fr, zh_hans

source: Statically configured MCP4728 digital-to-analog converter connected via I2C bus (one may define any number of sections with an "mcp4728" prefix).
fr: Convertisseur numérique-analogique MCP4728 configuré statiquement et connecté via le bus I2C (on peut définir un nombre quelconque de sections avec un préfixe "mcp4728").
zh_hans: 通过I2C总线连接的静态配置的MCP4728数模转换器（可以定义任何数量带有 "mcp4728 "前缀的分段）。

source: Statically configured MCP4018 digipot connected via two gpio "bit banging" pins (one may define any number of sections with an "mcp4018" prefix).
fr: Digipot MCP4018 configuré statiquement et connecté via deux broches gpio "bit banging" (on peut définir un nombre quelconque de sections avec un préfixe "mcp4018").
zh_hans: 静态配置的MCP4018 digipot 通过两个GPIO "bit banging"引脚连接（可以定义任意数量的带有 "mcp4018 "前缀的分段）。

source: Display support
fr: Prise en charge de l'affichage
zh_hans: 显示屏支持

source: Support for a display attached to the micro-controller.
fr: Prise en charge d'un écran relié au microcontrôleur.
zh_hans: 支持一个连接到微控制器的屏幕

source: hd44780 display
fr: écran hd44780
zh_hans: hd44780显示器

source: Information on configuring hd44780 displays (which is used in "RepRapDiscount 2004 Smart Controller" type displays).
fr: Informations de configuration des écrans hd44780 (utilisés dans les écrans de type "RepRapDiscount 2004 Smart Controller").
zh_hans: 有关配置 hd44780 显示器（在"RepRapDiscount 2004 Smart Controller"类型显示屏中可以找到）的信息。

source: hd44780_spi display
fr: écran hd44780_spi
zh_hans: hd44780_spi显示器

source: Information on configuring an hd44780_spi display - a 20x04 display controlled via a hardware "shift register" (which is used in mightyboard based printers).
fr: Informations de configuration d'un écran hd44780_spi - un écran 20x04 contrôlé par un "registre à décalage (shift register)" matériel (utilisé dans les imprimantes basées sur mightyboard).
zh_hans: 有关配置 hd44780_spi 显示屏的信息 - 通过硬件"移位寄存器"（用于基于 mightyboard 的打印机）控制的20x04显示器。

source: st7920 display
fr: écran st7920
zh_hans: st7920屏幕

source: Information on configuring st7920 displays (which is used in "RepRapDiscount 12864 Full Graphic Smart Controller" type displays).
fr: Informations de configuration des écrans st7920 (utilisés dans les écrans de type "RepRapDiscount 12864 Full Graphic Smart Controller").
zh_hans: 有关配置 st7920 类显示屏的信息（可用于 "RepRapDiscount 12864 Full Graphic Smart Controller" 类型的显示器）。

source: emulated_st7920 display
fr: écran emulated_st7920
zh_hans: emulated_st7920（模拟ST7920）显示屏

source: Information on configuring an emulated st7920 display - found in some "2.4 inch touchscreen devices" and similar.
fr: Informations de configuration d'un écran st7920 émulé - que l'on trouve dans certains "écrans tactiles de 2,4 pouces" et similaires.
zh_hans: 有关配置模拟 st7920 显示屏的信息 —它可以在一些"2.4 寸触摸屏"和其他类似设备中找到。

source: uc1701 display
fr: écran uc1701

source: Information on configuring uc1701 displays (which is used in "MKS Mini 12864" type displays).
fr: Informations de configuration des écrans uc1701 (utilisés dans les écrans de type "MKS Mini 12864").
zh_hans: 有关配置 uc1701 显示屏的信息（用于“MKS Mini 12864”型显示屏）。

source: ssd1306 and sh1106 displays
fr: écrans ssd1306 et sh1106
zh_hans: ssd1306和sh1106屏幕

source: Information on configuring ssd1306 and sh1106 displays.
fr: Les informations de configuration des écrans ssd1306 et sh1106.
zh_hans: ssd1306 和 sh1106 显示屏的配置信息。

source: Support for displaying custom data on an lcd screen. One may create any number of display groups and any number of data items under those groups. The display will show all the data items for a given group if the display_group option in the [display] section is set to the given group name.
fr: Support pour l'affichage de données personnalisées sur un écran lcd. On peut créer un nombre quelconque de groupes d'affichage et un nombre quelconque d'éléments de données sous ces groupes. L'écran affichera tous les éléments de données d'un groupe donné si l'option display_group de la section [display] est définie sur le nom du groupe en question.
zh_hans: 支持在LCD屏幕上显示自定义数据。您可以创建任意数量的显示组和该组下的任意数量的数据项。如果[display]分段中的display_group参数设置为给定的组名，则显示屏将显示该组下的所有数据项。

source: A [default set of display groups](../klippy/extras/display/display.cfg) are automatically created. One can replace or extend these display_data items by overriding the defaults in the main printer.cfg config file.
fr: Un [ensemble par défaut de groupes d'affichage](../klippy/extras/display/display.cfg) est automatiquement créé. On peut remplacer ou étendre ces éléments display_data en remplaçant les valeurs par défaut dans le fichier de configuration principal printer.cfg.
zh_hans: 一套[默认显示组](../klippy/extras/display/display.cfg)将被自动创建。通过覆盖打印机的 printer.cfg 主配置文件中的默认值可以替换或扩展这些 display_data 项。

source: Display a custom glyph on displays that support it. The given name will be assigned the given display data which can then be referenced in the display templates by their name surrounded by two "tilde" symbols i.e. `~my_display_glyph~`
fr: Affiche un glyphe personnalisé sur les écrans le supportant. Le nom donné se verra attribué les données d'affichage, données qui pourront ensuite être référencées dans les modèles d'affichage par leur nom entouré de deux symboles "tilde", par exemple `~my_display_glyph~`
zh_hans: 在支持自定义字形的显示器上显示一个自定义字形。给定的名称将被分配给给定的显示数据，然后可以在显示模板中通过用“波浪形（～）”符号包围的名称来引用，即 `~my_display_glyph~` 。

source: See [sample-glyphs.cfg](../config/sample-glyphs.cfg) for some examples.
fr: Voir [sample-glyphs.cfg](../config/sample-glyphs.cfg) pour quelques exemples.
zh_hans: 更多示例 [sample-glyphs.cfg](../config/sample-glyphs.cfg)

source: If a primary [display] section has been defined in printer.cfg as shown above it is possible to define multiple auxiliary displays. Note that auxiliary displays do not currently support menu functionality, thus they do not support the "menu" options or button configuration.
fr: Si une section principale [display] a été définie dans printer.cfg comme indiqué ci-dessus, il est possible de définir plusieurs affichages auxiliaires. Notez que les affichages auxiliaires ne supportent pas actuellement la fonctionnalité de menus, ils ne supportent donc pas les options "menu" ou la configuration de boutons.
zh_hans: 如果如上所示在 printer.cfg 中定义了主要的 [display] 分段，还可以定义多个辅助显示器。注意，辅助显示器当前不支持菜单功能，因此它们不支持“menu”选项或按钮配置。

source: Customizable lcd display menus.
fr: Menus de l'écran LCD personnalisables.
zh_hans: 可自定义液晶显示屏菜单。

source: A [default set of menus](../klippy/extras/display/menu.cfg) are automatically created. One can replace or extend the menu by overriding the defaults in the main printer.cfg config file.
fr: Un [ensemble de menus par défaut](../klippy/extras/display/menu.cfg) est automatiquement créé. On peut remplacer ou étendre le menu en remplaçant les valeurs par défaut dans le fichier de configuration principal printer.cfg.
zh_hans: 一套[默认菜单](../klippy/extras/display/menu.cfg)将被自动创建。通过覆盖 printer.cfg 主配置文件中的默认值可以替换或扩展该菜单。

source: See the [command template document](Command_Templates.md#menu-templates) for information on menu attributes available during template rendering.
fr: Consultez le [document sur les modèles de commande](Command_Templates.md#menu-templates) pour obtenir des informations sur les attributs de menu disponibles lors du rendu du modèle.
zh_hans: 参见[命令模板文档](Command_Templates.md#menu-templates)，了解模板渲染过程中可用的菜单属性。

source: Filament sensors
fr: Capteurs de filaments
zh_hans: 耗材传感器

source: Filament Switch Sensor. Support for filament insert and runout detection using a switch sensor, such as an endstop switch.
fr: Capteur de commutation de filament. Prise en charge de la détection de l'insertion et du déplacement du filament à l'aide d'un capteur de commutation, tel qu'un interrupteur de fin de course.
zh_hans: 耗材开关传感器。支持使用开关传感器（如限位开关）进行耗材插入和耗尽检测。

source: Filament Motion Sensor. Support for filament insert and runout detection using an encoder that toggles the output pin during filament movement through the sensor.
fr: Capteur de mouvement de filament. Prise en charge de la détection de présence et déplacement du filament à l'aide d'un encodeur basculant la broche de sortie pendant le mouvement du filament dans le capteur.
zh_hans: 耗材移动传感器。使用一个在耗材通过传感器时输出引脚状态会发生变化来检测耗材插入和耗尽。

source: TSLl401CL Based Filament Width Sensor. See the [guide](TSL1401CL_Filament_Width_Sensor.md) for more information.
fr: Capteur de largeur de filament basé sur le TSLl401CL. Voir le [guide](TSL1401CL_Filament_Width_Sensor.md) pour plus d'informations.

source: Board specific hardware support
fr: Support matériel spécifique à une carte
zh_hans: 控制板特定硬件支持

source: Configure an SX1509 I2C to GPIO expander. Due to the delay incurred by I2C communication you should NOT use SX1509 pins as stepper enable, step or dir pins or any other pin that requires fast bit-banging. They are best used as static or gcode controlled digital outputs or hardware-pwm pins for e.g. fans. One may define any number of sections with an "sx1509" prefix. Each expander provides a set of 16 pins (sx1509_my_sx1509:PIN_0 to sx1509_my_sx1509:PIN_15) which can be used in the printer configuration.
fr: Configuration d'un expandeur SX1509 I2C vers GPIO. En raison du délai encouru par la communication I2C, vous ne devez PAS utiliser les broches du SX1509 comme activation du moteur pas à pas, pas ou direction ou toute autre broche nécessitant un changement de bit rapide. Il est préférable de les utiliser comme sorties numériques statiques ou contrôlées par gcode ou comme broches hardware-pwm pour des ventilateurs par exemple. On peut définir un nombre quelconque de sections avec un préfixe "sx1509". Chaque expandeur fournit un ensemble de 16 broches (sx1509_my_sx1509:PIN_0 à sx1509_my_sx1509:PIN_15) pouvant être utilisées dans la configuration de l'imprimante.
zh_hans: 将一个 SX1509 I2C 配置为 GPIO 扩展器。由于 I2C 通信本身的延迟，不应将 SX1509 引脚用作步进电机的 enable （启用)、step（步进）或 dir （方向）引脚或任何其他需要快速 bit-banging（位拆裂）的引脚。它们最适合用作静态或G代码控制的数字输出或硬件 pwm 引脚，例如风扇。可以使用“sx1509”前缀定义任意数量的分段。每个扩展器提供可用于打印机配置的一组 16 个引脚（sx1509_my_sx1509:PIN_0 到 sx1509_my_sx1509:PIN_15）。

source: See the [generic-duet2-duex.cfg](../config/generic-duet2-duex.cfg) file for an example.
fr: Voir le fichier [generic-duet2-duex.cfg](../config/generic-duet2-duex.cfg) pour un exemple.
zh_hans: 请见范例配置文件[generic-duet2-duex.cfg](../config/generic-duet2-duex.cfg)。

source: Duet2 Maestro analog scaling by vref and vssa readings. Defining an adc_scaled section enables virtual adc pins (such as "my_name:PB0") that are automatically adjusted by the board's vref and vssa monitoring pins. Be sure to define this config section above any config sections that use one these virtual pins.
fr: Mise à l'échelle analogique du Duet2 Maestro par lectures vref et vssa. Définir une section adc_scaled permet d'activer des broches adc virtuelles (telles que "my_name:PB0") qui seront automatiquement ajustées par les broches de surveillance vref et vssa de la carte. Assurez-vous de définir cette section de configuration au-dessus de toute section de configuration utilisant l'une de ces broches virtuelles.
zh_hans: Duet 2 Maestro 通过vref和vssa读数进行模拟缩放。定义一个adc_scaled分段来启用根据板载vref和vssa监视引脚调节的虚拟adc引脚（例如“my_name:PB0"）。虚拟引脚必须先被Duet 2 Maestro 通过vref和vssa读数进行模拟缩放。定义一个adc_scaled分段来启用根据板载vref和vssa监视引脚调节的虚拟adc引脚（例如“my_name:PB0"）。虚拟引脚必须先被定义才能用在其他配置分段中。

source: See the [generic-duet2-maestro.cfg](../config/generic-duet2-maestro.cfg) file for an example.
fr: Voir le fichier [generic-duet2-maestro.cfg](../config/generic-duet2-maestro.cfg) pour un exemple.
zh_hans: 请见范例配置文件[generic-duet2-maestro.cfg](../config/generic-duet2-maestro.cfg)。

source: Other Custom Modules
fr: Autres modules spécifiques
zh_hans: 其他自定义模块

source: Palette 2 multimaterial support - provides a tighter integration supporting Palette 2 devices in connected mode.
fr: Prise en charge des multimatériaux de la Palette 2 - assure une intégration plus étroite de la prise en charge des périphériques de la Palette 2 en mode connecté.
zh_hans: Palette 2 多材料支持 - 提供更紧密的集成，支持处于连接模式的 Palette 2 设备。

source: This modules also requires `[virtual_sdcard]` and `[pause_resume]` for full functionality.
fr: Ce module nécessite également `[virtual_sdcard]` et `[pause_resume]` pour une fonctionnalité complète.
zh_hans: 该模块的全部功能需要`[virtual_sdcard]`和`[pause_resume]`。

source: If you use this module, do not use the Palette 2 plugin for Octoprint as they will conflict, and 1 will fail to initialize properly likely aborting your print.
fr: Si vous utilisez ce module, n'utilisez pas le plugin Palette 2 pour Octoprint car ils entreront en conflit, et le module ne pourra pas s'initialiser correctement, ce qui fera échouer votre impression.
zh_hans: 不要和 Octoprint 的 Palette 2插件一起使用这个模块，因为它们会发生冲突，造成初始化和打印失败。

source: If you use Octoprint and stream gcode over the serial port instead of printing from virtual_sd, then remo **M1** and **M0** from *Pausing commands* in *Settings > Serial Connection > Firmware & protocol* will prevent the need to start print on the Palette 2 and unpausing in Octoprint for your print to begin.
fr: Si vous utilisez Octoprint et que vous diffusez du gcode sur le port série au lieu d'imprimer à partir de virtual_sd, alors supprimez **M1** et **M0** de *Commandes de pause* dans *Paramètres > Connexion série > Firmware & protocole* évitera d'avoir à lancer l'impression sur la Palette 2 et de devoir lever la pause dans Octoprint pour que l'impression commence.
zh_hans: 如果使用 OctoPrint 并通过串行端口流式传输 G-Code，而不通过 virtual_sd 打印，将 * 设置>串行连接>固件和协议 * 中的“暂停命令” 设置为**M1** 和 **M0** 可以避免在开始打印时需要在Palette 2 上选择开始打印并在 OctoPrint 中取消暂停。

source: Common bus parameters
fr: Paramètres communs aux bus
zh_hans: 常见的总线参数

source: Common SPI settings
fr: Paramètres SPI communs
zh_hans: 常见 SPI 设置

source: The following parameters are generally available for devices using an SPI bus.
fr: Les paramètres suivants sont généralement disponibles pour les dispositifs utilisant un bus SPI.
zh_hans: 以下参数适用于多数使用SPI总线的设备。

source: Common I2C settings
fr: Paramètres I2C communs
zh_hans: 常见的I2C设置

source: The following parameters are generally available for devices using an I2C bus.
fr: Les paramètres suivants sont généralement disponibles pour les dispositifs utilisant un bus I2C.
zh_hans: 以下参数一般适用于使用I2C总线的设备。

source: [mcu] serial: # The serial port to connect to the MCU. If unsure (or if it # changes) see the "Where's my serial port?" section of the FAQ. # This parameter must be provided when using a serial port. #baud: 250000 # The baud rate to use. The default is 250000. #canbus_uuid: # If using a device connected to a CAN bus then this sets the unique # chip identifier to connect to. This value must be provided when using # CAN bus for communication. #canbus_interface: # If using a device connected to a CAN bus then this sets the CAN # network interface to use. The default is 'can0'. #restart_method: # This controls the mechanism the host will use to reset the # micro-controller. The choices are 'arduino', 'cheetah', 'rpi_usb', # and 'command'. The 'arduino' method (toggle DTR) is common on # Arduino boards and clones. The 'cheetah' method is a special # method needed for some Fysetc Cheetah boards. The 'rpi_usb' method # is useful on Raspberry Pi boards with micro-controllers powered # over USB - it briefly disables power to all USB ports to # accomplish a micro-controller reset. The 'command' method involves # sending a Klipper command to the micro-controller so that it can # reset itself. The default is 'arduino' if the micro-controller # communicates over a serial port, 'command' otherwise.
fr: [mcu] serial: # Le port série à connecter à l'unité MCU. Si vous n'êtes pas sûr (ou s'il # change) consultez la section "Où est mon port série ?" de la FAQ. # Ce paramètre doit être fourni lors de l'utilisation d'un port série. #baud: 250000 # Le débit en bauds à utiliser. La valeur par défaut est 250000. #canbus_uuid: # Si vous utilisez un dispositif connecté à un bus CAN, ceci définit l'identifiant # unique de la puce à laquelle se connecter. Cette valeur doit être fournie lorsque l'on utilise # le bus CAN pour la communication. #canbus_interface: # Si vous utilisez un dispositif connecté à un bus CAN, ceci définit l'interface réseau CAN # à utiliser. La valeur par défaut est 'can0'. #restart_method: # Ceci contrôle le mécanisme que l'hôte utilisera pour réinitialiser le microcontrôleur. # Les choix sont 'arduino', 'cheetah', 'rpi_usb', et 'command'. La méthode 'arduino' # (basculer DTR) est courante sur les cartes et clones Arduino. # La méthode 'cheetah' est une méthode particulière nécessaire pour certaines cartes # Fysetc Cheetah. La méthode 'rpi_usb' est utile sur les cartes Raspberry Pi avec des # micro-contrôleurs alimentés par USB - elle désactive brièvement l'alimentation de tous # les ports USB pour effectuer une réinitialisation du microcontrôleur. # La méthode 'command' implique l'envoi d'une commande Klipper au microcontrôleur # afin qu'il puisse # se réinitialiser. # La valeur par défaut est 'arduino' si le micro-contrôleur communique via un port série, # 'command' sinon.
zh_hans: [mcu] serial: # 连接到单片机的串行通讯接口 # 如果你不确定的话（或可能它变更拉了），可以查看FAQ中的 # “Where's my serial port?”章节。 # 当使用串口时，这个参数必须给定 #baud: 250000 # 使用的波特率。默认是250000 #canbus_uuid: # 如果使用一个连接到CAN总线的设备，这个参数需要被设置为 # 要连接的芯片的唯一ID。 # 当使用CAN总线时，这个参数必须给定 #canbus_interface: # 当使用的设备连接到CAN总线时，这个参数需要被设置为 # 使用的网络接口 # 默认值是can0 #restart_method: # 这个参数控制着重置单片机的方式 # 可选项是'arduino'、'cheetah'、'rpi_usb'和'command' # 'arduino'方法（翻转DTR）通常适用于Arduino板或其克隆板 # 'cheetah'方法是一个特殊的方法，通常适用于一些富源盛的Cheetah板 # 'rpi_usb'方法对于使用树莓派的USB供电的单片机十分有效 # 它简单地关闭所有USB端口的电源来完成单片机的重置 # 'command'方法调用向单片机发送klipper命令来重置它们自己 # 当单片机连接到串口时默认是'arduino'，否则默认是'command'

source: [mcu my_extra_mcu] # See the "mcu" section for configuration parameters.
fr: [mcu my_extra_mcu] # Voir la section "mcu" pour les paramètres de configuration.
zh_hans: [mcu my_extra_mcu] # 请参阅"mcu"分段的配置参数。

source: [printer] kinematics: cartesian max_z_velocity: # This sets the maximum velocity (in mm/s) of movement along the z # axis. This setting can be used to restrict the maximum speed of # the z stepper motor. The default is to use max_velocity for # max_z_velocity. max_z_accel: # This sets the maximum acceleration (in mm/s^2) of movement along # the z axis. It limits the acceleration of the z stepper motor. The # default is to use max_accel for max_z_accel. # The stepper_x section is used to describe the stepper controlling # the X axis in a cartesian robot. [stepper_x] # The stepper_y section is used to describe the stepper controlling # the Y axis in a cartesian robot. [stepper_y] # The stepper_z section is used to describe the stepper controlling # the Z axis in a cartesian robot. [stepper_z]
fr: [printer] kinematics: cartesian max_z_velocity: # Ceci définit la vitesse maximale (en mm/s) du mouvement le long de l'axe z # Ce paramètre peut être utilisé pour limiter la vitesse maximale du moteur pas à pas z. # le moteur pas à pas z. La valeur par défaut est l'utilisation de max_velocity pour # max_z_velocity. max_z_accel: # Ce paramètre définit l'accélération maximale (en mm/s^2) du mouvement sur l'axe z. # Cela limite l'accélération du moteur pas à pas z. La valeur par défaut est # d'utiliser max_accel pour max_z_accel. # La section stepper_x est utilisée pour décrire le moteur pas à pas contrôlant # l'axe X dans un robot cartésien. [stepper_x] # La section stepper_y est utilisée pour décrire le moteur pas à pas contrôlant # l'axe Y d'un robot cartésien. [stepper_y] # La section stepper_z est utilisée pour décrire le moteur pas à pas contrôlant # l'axe Z d'un robot cartésien. [stepper_z]
zh_hans: [printer] kinematics: cartesian max_z_velocity: # 定义沿z轴运动的最大速度（单位：mm/s）。它限制了Z轴步进 # 电机的最大速度。 # 默认使用max_velocity为 max_z_velocity。 max_z_accel: # 定义沿Z轴运动的最大加速度（单位：mm/s^2）。 # 它限制了z步进电机的加速度。 # 默认使用使用max_accel为max_z_accel。 # stepper_x 分段描述了控制了笛卡尔结构中X轴的 # 步进器。 [stepper_x] # stepper_y 分段描述了控制了笛卡尔结构中Y轴的 # 步进器。 [stepper_y] # stepper_z 分段描述了控制了笛卡尔结构中Z轴的 # 步进器。 [stepper_z]

source: [printer] kinematics: corexy max_z_velocity: # This sets the maximum velocity (in mm/s) of movement along the z # axis. This setting can be used to restrict the maximum speed of # the z stepper motor. The default is to use max_velocity for # max_z_velocity. max_z_accel: # This sets the maximum acceleration (in mm/s^2) of movement along # the z axis. It limits the acceleration of the z stepper motor. The # default is to use max_accel for max_z_accel. # The stepper_x section is used to describe the X axis as well as the # stepper controlling the X+Y movement. [stepper_x] # The stepper_y section is used to describe the Y axis as well as the # stepper controlling the X-Y movement. [stepper_y] # The stepper_z section is used to describe the stepper controlling # the Z axis. [stepper_z]
fr: [printer] kinematics: corexy max_z_velocity: # Ceci définit la vitesse maximale (en mm/s) du mouvement le long de l'axe z # Ce paramètre peut être utilisé pour limiter la vitesse maximale du moteur pas à pas z. # La valeur par défaut est l'utilisation de max_velocity pour max_z_velocity. max_z_accel: # Ce paramètre définit l'accélération maximale (en mm/s^2) du mouvement sur l'axe z. # Cela limite l'accélération du moteur pas à pas z. La valeur par défaut est # d'utiliser max_accel pour max_z_accel. # La section stepper_x est utilisée pour décrire l'axe X ainsi que le moteur pas à pas # contrôlant le mouvement X+Y. [stepper_x] # La section stepper_y est utilisée pour décrire l'axe Y ainsi que le moteur pas à pas # contrôlant le mouvement X-Y. [stepper_y] # La section stepper_z est utilisée pour décrire le moteur pas à pas contrôlant l'axe Z. [stepper_z]
zh_hans: [printer] kinematics: corexy max_z_velocity: # 定义了沿z轴运动的最大速度（单位：mm/s）。这个设置可以 # 限制z步进电机的最大速度。 # 默认使用max_velocity 定义 max_z_velocity。 max_z_accel: # 定义了沿Z轴运动的最大加速度（单位：mm/s^2）。该设置可 # 以限制z步进电机的加速度。 # 默认使用max_accel 定义 max_z_accel。 # stepper_x分段描述了X轴，以及控制X+Y运动的步进器。 [stepper_x] # stepper_y分段描述了Y轴，以及控制X-Y运动的步进器。 [stepper_y] # stepper_z 分段用于描述控制Z轴的步进器。 [stepper_z]

source: [printer] kinematics: corexz max_z_velocity: # This sets the maximum velocity (in mm/s) of movement along the z # axis. The default is to use max_velocity for max_z_velocity. max_z_accel: # This sets the maximum acceleration (in mm/s^2) of movement along # the z axis. The default is to use max_accel for max_z_accel. # The stepper_x section is used to describe the X axis as well as the # stepper controlling the X+Z movement. [stepper_x] # The stepper_y section is used to describe the stepper controlling # the Y axis. [stepper_y] # The stepper_z section is used to describe the Z axis as well as the # stepper controlling the X-Z movement. [stepper_z]
fr: [printer] kinematics: corexz max_z_velocity: # Ceci définit la vitesse maximale (en mm/s) du mouvement le long de l'axe z. # La valeur par défaut est d'utiliser max_velocity pour max_z_velocity. max_z_accel: # Ceci définit l'accélération maximale (en mm/s^2) du mouvement le long de l'axe z. # La valeur par défaut est d'utiliser max_accel pour max_z_accel. # La section stepper_x est utilisée pour décrire l'axe X ainsi que le moteur pas à pas # contrôlant le mouvement X+Z. [stepper_x] # La section stepper_y est utilisée pour décrire le moteur pas à pas contrôlant l'axe Y. [stepper_y] # La section stepper_z est utilisée pour décrire l'axe Z ainsi que le moteur pas à pas # contrôlant le mouvement X-Z. [stepper_z]
zh_hans: [printer] kinematics: corexz max_z_velocity: # 定义沿z轴运动的最大速度（单位：mm/s）。 # 默认使用max_velocity 定义 max_z_velocity。 max_z_accel: # 这设置了沿Z轴运动的最大加速度(以mm/s^2为单位)。 # Z轴的最大加速度。默认使用max_accel 定义 max_z_accel。 # stepper_x 分段定义了X轴以及控制X+Z的步进器。 [stepper_x] # stepper_y 分段定义了y轴以及控制Y轴的步进器。 [stepper_y] # stepper_z 分段定义了X轴以及控制X-Z的步进器。 [stepper_z]
