Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Config_checks.po
Languages: bg, de, es, fr, hu, ko, pl, pt, pt_br, sk, tr, zh_hans, zh_hant

source: Navigate to the temperature graph section and type in 50 followed by enter in the extruder/tool temperature box. The extruder temperature in the graph should start to increase (within about 30 seconds or so). Then go to the extruder temperature drop-down box and select "Off". After several minutes the temperature should start to return to its initial room temperature value. If the temperature does not increase then verify the "heater_pin" setting in the config.
es: Navega hasta la sección del gráfico de temperatura y teclea 50 seguido de intro en la casilla de temperatura del extrusor/herramienta. La temperatura del extrusor en el gráfico debería empezar a aumentar (en unos 30 segundos más o menos). A continuación, ve al menú desplegable de temperatura del extrusor y selecciona "Apagar". Tras varios minutos, la temperatura debería volver a su valor inicial de temperatura ambiente. Si la temperatura no aumenta, verifique el ajuste "heater_pin" en la configuración.
hu: Navigálj a hőmérsékleti grafikon részhez, és írd be az 50-et, majd az enter-t az extruder/szerszám hőmérséklet mezőbe. Az extruder hőmérsékletének a grafikonon növekednie kell (kb. 30 másodpercen belül). Ezután lépj az extruder hőmérséklet legördülő menübe, és válaszd az "Off" (Ki) lehetőséget. Néhány perc múlva a hőmérsékletnek el kell kezdenie csökkenni a kezdeti szobahőmérsékleti értékre. Ha a hőmérséklet nem emelkedik, akkor ellenőrizd a "heater_pin" beállítást a konfigurációban.
pt: Navegue até à secção do gráfico de temperatura e escreva 50 seguido de enter na caixa de temperatura da extrusora/ferramenta. A temperatura da extrusora no gráfico deve começar a aumentar (em cerca de 30 segundos). Em seguida, vá para a caixa pendente da temperatura da extrusora e seleccione "Off". Após alguns minutos, a temperatura deve começar a regressar ao seu valor inicial de temperatura ambiente. Se a temperatura não aumentar, verifique a definição "heater_pin" na configuração.
sk: Prejdite do časti grafu teploty a zadajte 50 a potom zadajte do poľa teploty extrudéra/náradia. Teplota extrudéra v grafe by sa mala začať zvyšovať (asi do 30 sekúnd). Potom prejdite do rozbaľovacieho poľa teploty extrudéra a vyberte možnosť „Vypnuté“. Po niekoľkých minútach by sa teplota mala začať vracať na pôvodnú hodnotu izbovej teploty. Ak sa teplota nezvýši, overte nastavenie "heater_pin" v konfigurácii.

source: Verify that all of the printer axes can manually move freely (the stepper motors are disabled). If not, issue an M84 command to disable the motors. If any of the axes still can not move freely, then verify the stepper "enable_pin" configuration for the given axis. On most commodity stepper motor drivers, the motor enable pin is "active low" and therefore the enable pin should have a "!" before the pin (for example, "enable_pin: !PA1").
es: Compruebe que todos los ejes de la impresora pueden moverse manualmente con libertad (los motores paso a paso están desactivados). Si no es así, emita un comando M84 para desactivar los motores. Si alguno de los ejes sigue sin poder moverse libremente, verifique la configuración del "enable_pin" del motor paso a paso para el eje en cuestión. En la mayoría de los controladores de motores paso a paso, el pin de habilitación del motor es "activo bajo" y por lo tanto el pin de habilitación debe tener un "!" antes del pin (por ejemplo, "enable_pin: !PA1").
hu: Ellenőrizd, hogy a nyomtató minden tengelye manuálisan szabadon mozog-e (a léptetőmotorok ki vannak kapcsolva). Ha nem, adj ki egy M84 parancsot a motorok letiltására. Ha valamelyik tengely még mindig nem tud szabadon mozogni, akkor ellenőrizd a léptetőmotor "enable_pin" konfigurációját az adott tengelyhez. A legtöbb hagyományos léptetőmotor-meghajtónál a motor engedélyező pin "aktív alacsony", ezért az engedélyező pin előtt egy "!"-nek kell lennie (például "enable_pin: !PA1").
pt: Verificar se todos os eixos da impressora podem mover-se livremente (os motores de passo estão desativados). Caso contrário, emitir um comando M84 para desativar os motores. Se algum dos eixos continuar a não se poder mover livremente, verifique a configuração do "pino de ativação" do passo para o eixo em causa. Na maioria dos controladores de motores passo a passo, o pino de ativação do motor é "ativo baixo", pelo que o pino de ativação deve ter um "!" antes do pino (por exemplo, "enable_pin: !PA1").
sk: Skontrolujte, či sa všetky osi tlačiarne môžu ručne voľne pohybovať (krokové motory sú vypnuté). Ak nie, zadajte príkaz M84 na deaktiváciu motorov. Ak sa niektorá z osí stále nemôže voľne pohybovať, skontrolujte konfiguráciu krokového ovládača „enable_pin“ pre danú os. Na väčšine komoditných ovládačov krokových motorov je kolík aktivácie motora "aktívny nízko" a preto by mal mať kolík aktivácie "!" pred pin (napríklad „enable_pin: !PA1“).

source: Manually move all the printer axes so that none of them are in contact with an endstop. Send a QUERY_ENDSTOPS command via the command console. It should respond with the current state of all of the configured endstops and they should all report a state of "open". For each of the endstops, rerun the QUERY_ENDSTOPS command while manually triggering the endstop. The QUERY_ENDSTOPS command should report the endstop as "TRIGGERED".
es: Mueva manualmente todos los ejes de la impresora para que ninguno de ellos esté en contacto con un endstop. Envíe un comando QUERY_ENDSTOPS a través de la consola de comandos. Deberá responder con el estado actual de todos los endstops configurados y todos deberán reportar un estado de "abierto". Para cada una de las paradas finales, vuelva a ejecutar el comando QUERY_ENDSTOPS mientras activa manualmente la parada final. El comando QUERY_ENDSTOPS debe reportar el endstop como "TRIGGERED".
hu: Kézzel mozgasd az összes nyomtatótengelyt úgy, hogy egyikük se érintkezzen végállással. Küldj QUERY_ENDSTOPS parancsot a parancskonzolon keresztül. Válaszul meg kell kapnod az összes konfigurált végállás aktuális állapotát, és mindegyiknek "nyitott" állapotot kell jeleznie. Minden egyes végállás esetében futtasd újra a QUERY_ENDSTOPS parancsot, miközben kézzel kezdeményezed a végállást. A QUERY_ENDSTOPS parancsnak a végállást "TRIGGERED"-ként kell jeleznie.
pt: Deslocar manualmente todos os eixos da impressora de modo a que nenhum deles esteja em contacto com um fim de curso. Enviar um comando QUERY_ENDSTOPS através da consola de comando. Deve responder com o estado atual de todos os fins de curso configurados e todos eles devem reportar um estado de "aberto". Para cada uma das paragens finais, execute novamente o comando QUERY_ENDSTOPS enquanto acciona manualmente a paragem final. O comando QUERY_ENDSTOPS deve reportar o fim de curso como "TRIGGERED".
sk: Ručne posuňte všetky osi tlačiarne tak, aby žiadna z nich nebola v kontakte s koncovým dorazom. Odošlite príkaz QUERY_ENDSTOPS cez príkazovú konzolu. Mal by reagovať s aktuálnym stavom všetkých nakonfigurovaných koncových zarážok a všetky by mali hlásiť stav „otvorené“. Pre každú z koncových zarážok znova spustite príkaz QUERY_ENDSTOPS, pričom koncovú zarážku spúšťajte manuálne. Príkaz QUERY_ENDSTOPS by mal hlásiť koncovú zarážku ako „TRIGGERED“.

source: If the endstop appears inverted (it reports "open" when triggered and vice-versa) then add a "!" to the pin definition (for example, "endstop_pin: ^PA2"), or remove the "!" if there is already one present.
es: Si el endstop aparece invertido (indica "abierto" cuando se dispara y viceversa), añada un "!" a la definición del pin (por ejemplo, "endstop_pin: ^PA2"), o elimine el "!" si ya hay uno presente.
hu: Ha a végállás invertáltnak tűnik ("nyitott" jelzést ad, amikor kivált, és fordítva), akkor adjunk hozzá egy "!"-t a pin-definícióhoz (például "endstop_pin: ^PA2"), vagy távolítsuk el a "!"-t, ha már van benne egy.
pt: Se o fim de curso aparecer invertido (reporta "aberto" quando acionado e vice-versa), adicione um "!" à definição do pino (por exemplo, "endstop_pin: ^PA2"), ou remova o "!" se já existir um.
sk: Ak sa koncový doraz javí ako invertovaný (pri spustení hlási "otvorený" a naopak), pridajte "!" na definíciu pinu (napríklad "endstop_pin: ^PA2") alebo odstráňte znak "!" ak je už jeden prítomný.

source: Use the STEPPER_BUZZ command to verify the connectivity of each stepper motor. Start by manually positioning the given axis to a midway point and then run `STEPPER_BUZZ STEPPER=stepper_x` in the command console. The STEPPER_BUZZ command will cause the given stepper to move one millimeter in a positive direction and then it will return to its starting position. (If the endstop is defined at position_endstop=0 then at the start of each movement the stepper will move away from the endstop.) It will perform this oscillation ten times.
es: Utilice el comando STEPPER_BUZZ para verificar la conectividad de cada motor paso a paso. Comienza posicionando manualmente el eje dado en un punto intermedio y luego ejecuta `STEPPER_BUZZ STEPPER=stepper_x` en la consola de comandos. El comando STEPPER_BUZZ hará que el motor paso a paso dado se mueva un milímetro en dirección positiva y luego volverá a su posición inicial. (Si el endstop se define en position_endstop=0 entonces al inicio de cada movimiento el stepper se alejará del endstop). Realizará esta oscilación diez veces.
hu: A STEPPER_BUZZ parancs segítségével ellenőrizd az egyes léptetőmotorok csatlakoztathatóságát. Kezd az adott tengely kézi pozicionálásával egy középső pontra, majd futtasd a `STEPPER_BUZZ STEPPER=stepper_x` parancsot a parancskonzolon. A STEPPER_BUZZ parancs hatására az adott léptető egy millimétert mozog pozitív irányba, majd visszatér a kiindulási helyzetébe. (Ha a végállást a position_endstop=0 értéken definiáljuk, akkor minden egyes mozgás kezdetén a léptető a végállástól távolodik). Ezt az oszcillációt tízszer fogja végrehajtani.
pt: Utilize o comando STEPPER_BUZZ para verificar a conetividade de cada motor de passo. Comece por posicionar manualmente o eixo dado num ponto intermédio e depois execute `STEPPER_BUZZ STEPPER=stepper_x` na consola de comandos. O comando STEPPER_BUZZ fará com que o motor passo a passo dado se mova um milímetro numa direção positiva e depois voltará à sua posição inicial. (Se a paragem final for definida em posição_paragem_final=0, então no início de cada movimento o motor de passo irá afastar-se da paragem final). Esta oscilação será efetuada dez vezes.
sk: Na overenie pripojenia každého krokového motora použite príkaz STEPPER_BUZZ. Začnite manuálnym umiestnením danej osi do stredu a potom spustite `STEPPER_BUZZ STEPPER=stepper_x` v príkazovej konzole. Príkaz STEPPER_BUZZ spôsobí, že daný stepper sa posunie o jeden milimeter kladným smerom a následne sa vráti do východiskovej polohy. (Ak je koncová zarážka definovaná na position_endstop=0, potom sa na začiatku každého pohybu krokovač vzdiali od koncovej zarážky.) Túto osciláciu vykoná desaťkrát.

source: To test the extruder motor it will be necessary to heat the extruder to a printing temperature. Navigate to the temperature graph section and select a target temperature from the temperature drop-down box (or manually enter an appropriate temperature). Wait for the printer to reach the desired temperature. Then navigate to the command console and click the "Extrude" button. Verify that the extruder motor turns in the correct direction. If it does not, see the troubleshooting tips in the previous section to confirm the "enable_pin", "step_pin", and "dir_pin" settings for the extruder.
es: Para probar el motor del extrusor será necesario calentarlo a una temperatura de impresión. Navegue hasta la sección del gráfico de temperatura y seleccione una temperatura objetivo en el cuadro desplegable de temperatura (o introduzca manualmente una temperatura adecuada). Espera a que la impresora alcance la temperatura deseada. A continuación, vaya a la consola de comandos y haga clic en el botón "Extrusión". Comprueba que el motor del extrusor gira en la dirección correcta. Si no lo hace, consulta los consejos de solución de problemas de la sección anterior para confirmar los ajustes "enable_pin", "step_pin" y "dir_pin" del extrusor.
hu: Az extrudermotor teszteléséhez az extrudert nyomtatási hőmérsékletre kell melegíteni. Navigálj a hőmérsékletgrafikon szakaszra, és válassz ki egy célhőmérsékletet a hőmérséklet legördülő menüből (vagy add meg manuálisan a megfelelő hőmérsékletet). Várd meg, amíg a nyomtató eléri a kívánt hőmérsékletet. Ezután navigálj a parancskonzolra, és kattints az "Extrudálás" gombra. Ellenőrizd, hogy az extruder motorja a megfelelő irányba forog-e. Ha nem, akkor az előző szakaszban található hibaelhárítási tippek alapján ellenőrizd az extruder "enable_pin", "step_pin" és "dir_pin" beállításait.
pt: Para testar o motor da extrusora, será necessário aquecer a extrusora a uma temperatura de impressão. Navegue até à secção do gráfico de temperatura e selecione uma temperatura alvo na caixa pendente de temperatura (ou introduza manualmente uma temperatura adequada). Aguarde que a impressora atinja a temperatura pretendida. Em seguida, navegue até à consola de comandos e clique no botão "Extrude". Verifique se o motor da extrusora roda na direção correcta. Se isso não acontecer, consulte as sugestões de resolução de problemas na secção anterior para confirmar as definições "enable_pin", "step_pin" e "dir_pin" para a extrusora.
sk: Na testovanie motora extrudéra bude potrebné zohriať extrudér na teplotu tlače. Prejdite do časti grafu teploty a vyberte cieľovú teplotu z rozbaľovacieho poľa teploty (alebo manuálne zadajte vhodnú teplotu). Počkajte, kým tlačiareň nedosiahne požadovanú teplotu. Potom prejdite do príkazovej konzoly a kliknite na tlačidlo "Extrude". Skontrolujte, či sa motor extrudéra otáča správnym smerom. Ak nie, pozrite si tipy na riešenie problémov v predchádzajúcej časti a potvrďte nastavenia „enable_pin“, „step_pin“ a „dir_pin“ pre extrudér.

source: To calibrate the extruder, navigate to the command console and run the PID_CALIBRATE command. For example: `PID_CALIBRATE HEATER=extruder TARGET=170`
es: Para calibrar el extrusor, navega a la consola de comandos y ejecuta el comando PID_CALIBRATE. Por ejemplo: `PID_CALIBRATE HEATER=extruder TARGET=170`
hu: Az extruder kalibrálásához navigálj a parancskonzolra, és futtasd a PID_CALIBRATE parancsot. Például: `PID_CALIBRATE HEATER=extruder TARGET=170`
pt: Para calibrar a extrusora, navegar para a consola de comandos e executar o comando PID_CALIBRATE. Por exemplo: `PID_CALIBRATE HEATER=extruder TARGET=170`
sk: Ak chcete kalibrovať extrudér, prejdite do príkazovej konzoly a spustite príkaz PID_CALIBRATE. Napríklad: `PID_CALIBRATE HEATER=extruder TARGET=170`
