Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Config_Changes.po
Languages: fr, hu, it, zh_hans

source: 20200809: The menu system has been rewritten. If the menu has been customized then it will be necessary to update to the new configuration. See config/example-menu.cfg for configuration details and see klippy/extras/display/menu.cfg for examples.
fr: 20200809 : Le système de menu a été réécrit. Si le menu a été personnalisé, il sera nécessaire de le mettre à jour avec la nouvelle configuration. Voir config/example-menu.cfg pour les détails de la configuration et voir klippy/extras/display/menu.cfg pour les exemples.
hu: 20200809: A menürendszer átírásra került. Ha a menüt testre szabták, akkor frissíteni kell az új konfigurációra. A konfiguráció részleteiért lásd a config/example-menu.cfg fájlt, a példákért pedig a klippy/extras/display/menu.cfg fájlt.
it: 20200809: Il sistema di menu è stato riscritto. Se il menu è stato personalizzato sarà necessario aggiornare alla nuova configurazione. Vedere config/example-menu.cfg per i dettagli di configurazione e vedere klippy/extras/display/menu.cfg per esempi.
zh_hans: 20200809: 菜单系统已被重写。如果是定制菜单，那需要更新配置。配置细节见config/example-menu.cfg，例子见klippy/extras/display/menu.cfg。

source: 20200731: The behavior of the `progress` attribute reported by the `virtual_sdcard` printer object has changed. Progress is no longer reset to 0 when a print is paused. It will now always report progress based on the internal file position, or 0 if no file is currently loaded.
fr: 20200731 : Le comportement de l'attribut `progress` rapporté par l'objet imprimante `virtual_sdcard` a changé. La progression n'est plus remise à 0 lorsqu'une impression est mise en pause. La progression est maintenant toujours basée sur la position interne du fichier, ou 0 si aucun fichier n'est chargé.
hu: 20200731: A `progress` attribútum viselkedése megváltozott, amelyet a `virtual_sdcard` nyomtatóobjektum jelentett. A nyomtatás szüneteltetésekor a Progress már nem áll vissza 0-ra. Mostantól mindig a belső fájl pozíciója alapján jelenti a haladást. Vagy 0, ha nincs betöltve fájl.
it: 20200731: Il comportamento dell'attributo `progress` riportato dall'oggetto stampante `virtual_sdcard` è cambiato. L'avanzamento non viene più reimpostato su 0 quando una stampa viene sospesa. Ora riporterà sempre lo stato di avanzamento in base alla posizione interna del file o 0 se nessun file è attualmente caricato.
zh_hans: 20200731: `virtual_sdcard`打印机对象报告的`progress`属性的行为已经改变。当打印暂停时，进度不再被重置为0。现在它会始终根据已加载文件的读取位置来报告进度，如果当前没有加载文件，则报告0。

source: 20200725: The servo `enable` config parameter and the SET_SERVO `ENABLE` parameter have been removed. Update any macros to use `SET_SERVO SERVO=my_servo WIDTH=0` to disable a servo.
fr: 20200725 : Le paramètre de configuration `enable` du servo et le paramètre SET_SERVO `ENABLE` ont été supprimés. Mettez à jour toutes les macros pour utiliser `SET_SERVO SERVO=my_servo WIDTH=0` pour désactiver un servo.
hu: 20200725: A szervo `enable` konfigurációs paraméter és a SET_SERVO `ENABLE` paraméter eltávolításra került. Frissítsen minden makrót, hogy a `SET_SERVO SERVO=my_servo WIDTH=0` paramétert használja a szervó letiltásához.
it: 20200725: Il parametro di configurazione servo `enable` e il parametro SET_SERVO `ENABLE` sono stati rimossi. Aggiorna qualsiasi macro per usare `SET_SERVO SERVO=my_servo WIDTH=0` per disabilitare un servo.
zh_hans: 20200725: 移除了舵机`enable`配置参数和SET_SERVO`ENABLE`参数。请更新所有宏，用`SET_SERVO SERVO=my_servo WIDTH=0`来禁用舵机。

source: 20200608: The LCD display support has changed the name of some internal "glyphs". If a custom display layout was implemented it may be necessary to update to the latest glyph names (see klippy/extras/display/display.cfg for a list of available glyphs).
fr: 20200608 : Le support de l'affichage LCD a changé le nom de certains "glyphes" internes. Si une disposition d'affichage personnalisée a été implémentée, il peut être nécessaire d'actualiser avec les noms actuels de glyphes (voir klippy/extras/display/display.cfg pour une liste des glyphes disponibles).
hu: 20200608: Az LCD-kijelző támogatása megváltoztatta néhány belső "írásjel" nevét. Ha egyéni kijelző elrendezés került implementálásra, akkor szükséges lehet frissíteni a legújabb gliph nevekre (lásd klippy/extras/display/display.cfg az elérhető gliph-ek listáját).
it: 20200608: Il supporto del display LCD ha cambiato il nome di alcuni "glifi" interni. Se è stato implementato un layout di visualizzazione personalizzato, potrebbe essere necessario aggiornare ai nomi dei glifi più recenti (consultare klippy/extras/display/display.cfg per un elenco dei glifi disponibili).
zh_hans: 20200608: LCD显示支持部分改变了一些内部 "字形 "的名称。如果自定义了显示布局，可能需要更新到最新的字形名称（见klippy/extras/display/display.cfg中的可用字形列表）。

source: 20200606: The pin names on linux mcu have changed. Pins now have names of the form `gpiochip<chipid>/gpio<gpio>`. For gpiochip0 you can also use a short `gpio<gpio>`. For example, what was previously referred to as `P20` now becomes `gpio20` or `gpiochip0/gpio20`.
fr: 20200606 : Les noms des broches sur linux mcu ont changé. Les broches ont maintenant des noms de la forme `gpiochip<chipid>/gpio<gpio>`. Pour gpiochip0 vous pouvez aussi utiliser un court `gpio<gpio>`. Par exemple, ce qui était précédemment appelé `P20` devient maintenant `gpio20` ou `gpiochip0/gpio20``.
hu: 20200606: A linux MCU pin nevei megváltoztak. A pin nevek mostantól a `gpiochip<chipid>/gpio<gpio>` formájúak. A gpiochip0 esetében egy rövid `gpio<gpio>` is használható. Például, amire korábban `P20` néven hivatkoztunk, az most `gpio20` vagy `gpiochip0/gpio20` lesz.
it: 20200606: i nomi dei pin su Linux Mcu sono cambiati. I pin ora hanno nomi nella forma `gpiochip<chipid>/gpio<gpio>`. Per gpiochip0 puoi anche usare un breve `gpio<gpio>`. Ad esempio, ciò che prima veniva chiamato `P20` ora diventa `gpio20` o `gpiochip0/gpio20`.
zh_hans: 20200606: 改变了linux mcu上的引脚名称。现在引脚的名称格式是`gpiochip<chipid>/gpio<gpio>`。对于gpiochip0，你也可以使用`gpio<gpio>`的缩写。例如，以前名字为`P20'，现在变成`gpio20'或`gpiochip0/gpio20'。

source: 20200603: The default 16x4 LCD layout will no longer show the estimated time remaining in a print. (Only the elapsed time will be shown.) If the old behavior is desired one can customize the menu display with that information (see the description of display_data in config/example-extras.cfg for details).
fr: 20200603 : La disposition par défaut de l'écran LCD 16x4 n'affiche plus le temps estimé restant pour une impression. (Seul le temps écoulé sera affiché.) Si l'on souhaite conserver l'ancien comportement, on peut personnaliser l'affichage du menu avec cette information (voir la description de display_data dans config/example-extras.cfg pour plus de détails).
hu: 20200603: Az alapértelmezett 16x4-es LCD kijelzőn már nem jelenik meg a nyomtatásból hátralévő becsült idő. (Csak az eltelt idő jelenik meg.) Ha a régi működést szeretnénk, akkor a menü kijelzőjét testre lehet szabni ezzel az információval (a részletekért lásd a config/example-extras.cfg fájlban a display_data leírását).
it: 20200603: il layout LCD 16x4 predefinito non mostrerà più il tempo rimanente stimato in una stampa. (Verrà mostrato solo il tempo trascorso.) Se si desidera il vecchio comportamento, è possibile personalizzare la visualizzazione del menu con tali informazioni (vedere la descrizione di display_data in config/example-extras.cfg per i dettagli).
zh_hans: 20200603：默认的16x4 LCD布局将不再显示打印的预计剩余时间。(只显示已用时间。)如果需要旧的布局，可以用定制菜单显示该信息(详情见config/example-extras.cfg中display_data的描述)。

source: 20200531: The default USB vendor/product id is now 0x1d50/0x614e. These new ids are reserved for Klipper (thanks to the openmoko project). This change should not require any config changes, but the new ids may appear in system logs.
fr: 20200531 : L'id par défaut du vendeur/produit USB est maintenant 0x1d50/0x614e. Ces nouveaux identifiants sont réservés à Klipper (grâce au projet openmoko). Ce changement ne devrait pas nécessiter de modification de la configuration, mais les nouveaux identifiants peuvent apparaître dans les journaux système.
hu: 20200531: Az alapértelmezett USB gyártó/termék azonosító mostantól 0x1d50/0x614e. Ezek az új azonosítók a Klipper számára vannak fenntartva (köszönet az openmoko projektnek). Ez a változás nem igényel semmilyen konfigurációs módosítást, de az új azonosítók megjelenhetnek a rendszer naplóiban.
it: 20200531: l'ID prodotto/fornitore USB predefinito è ora 0x1d50/0x614e. Questi nuovi ID sono riservati a Klipper (grazie al progetto openmoko). Questa modifica non dovrebbe richiedere alcuna modifica alla configurazione, ma i nuovi ID potrebbero essere visualizzati nei registri di sistema.
zh_hans: 20200531: 默认的USB厂商/产品ID现在是0x1d50/0x614e。这个新ID是为Klipper保留的（感谢openmoko项目）。这个变化不需要改变任何配置，但新的ID可能会出现在系统日志中。

source: 20200524: The default value for the tmc5160 pwm_freq field is now zero (instead of one).
fr: 20200524 : La valeur par défaut du champ pwm_freq du tmc5160 est maintenant zéro (au lieu de un).
hu: 20200524: A TMC5160 pwm_freq mező alapértelmezett értéke mostantól nulla (egy helyett).
it: 20200524: Il valore predefinito per il campo tmc5160 pwm_freq è ora zero (anziché uno).
zh_hans: 20200524：现在tmc5160的pwm_freq字段，默认值是0（而不是1）。

source: 20200425: The gcode_macro command template variable `printer.heater` was renamed to `printer.heaters`.
fr: 20200425 : La variable du modèle de commande gcode_macro `printer.heater` a été renommée en `printer.heaters`.
hu: 20200425: A gcode_macro parancs sablonváltozója `printer.heater` át lett nevezve `printer.heaters`-re.
it: 20200425: La variabile del modello di comando gcode_macro `printer.heater` è stata rinominata `printer.heaters`.
zh_hans: 20200425: gcode_macro命令模板变量`printer.heater`改命名为`printer.heaters`。

source: 20200313: The default lcd layout for multi-extruder printers with a 16x4 screen has changed. The single extruder screen layout is now the default and it will show the currently active extruder. To use the previous display layout set "display_group: _multiextruder_16x4" in the [display] section of the printer.cfg file.
fr: 20200313 : La disposition par défaut de l'écran pour les imprimantes multi-extrudeurs avec un écran 16x4 a changé. La disposition de l'écran pour un seul extrudeur est maintenant la disposition par défaut et elle montrera l'extrudeur actuellement actif. Pour utiliser la disposition d'écran précédente, définissez "display_group : _multiextruder_16x4" dans la section [display] du fichier printer.cfg.
hu: 20200313: A 16x4-es képernyővel és a több extruderrel rendelkező nyomtatók alapértelmezett LCD-kiosztása megváltozott. Mostantól az egy extruderrel rendelkező képernyő elrendezése az alapértelmezett, és az aktuálisan aktív extrudert mutatja. A korábbi kijelző elrendezés használatához állítsa be a "display_group: _multiextruder_16x4" a printer.cfg fájl [display] szakaszában.
it: 20200313: Il layout lcd predefinito per le stampanti multiestrusore con schermo 16x4 è cambiato. Il layout dello schermo del singolo estrusore è ora quello predefinito e mostrerà l'estrusore attualmente attivo. Per utilizzare il layout di visualizzazione precedente, impostare "display_group: _multiextruder_16x4" nella sezione [display] del file printer.cfg.
zh_hans: 20200313: 改变多挤出机打印机16x4屏幕的默认液晶屏布局。现在默认是单个挤出机屏幕布局，用于显示当前活动的挤出机。要使用以前的显示布局，请设置printer.cfg文件中[display]部分的 "display_group: _multiextruder_16x4"。

source: 20200308: The default `__test` menu item was removed. If the config file has a custom menu then be sure to remove all references to this `__test` menu item.
fr: 20200308 : L'élément de menu par défaut `__test` a été supprimé. Si le fichier de configuration a un menu personnalisé, assurez-vous de supprimer toutes les références à cet élément de menu `__test`.
hu: 20200308: Az alapértelmezett `__test` menüpont eltávolításra került. Ha a konfigurációs fájlban egyéni menü van, akkor mindenképpen távolítson el minden hivatkozást erre a `__test` menüpontra.
it: 20200308: La voce di menu predefinita `__test` è stata rimossa. Se il file di configurazione ha un menu personalizzato, assicurati di rimuovere tutti i riferimenti a questa voce di menu `__test`.
zh_hans: 20200308：移除了默认的`__test`菜单项。如果配置文件中有自定义的菜单，那么请确保删除所有对这个`__test`菜单项的引用。

source: 20200308: The menu "deck" and "card" options were removed. To customize the layout of an lcd screen use the new display_data config sections (see config/example-extras.cfg for the details).
fr: 20200308 : Les options "deck" et "card" du menu ont été supprimées. Pour personnaliser la disposition d'un écran lcd, utilisez les nouvelles sections de configuration display_data (voir config/example-extras.cfg pour les détails).
hu: 20200308: A "pakli" és "kártya" menüpontok eltávolításra kerültek. Az LCD képernyő elrendezésének testreszabásához használd az új display_data config szakaszokat (a részletekért lásd a config/example-extras.cfg fájlt).
it: 20200308: le opzioni del menu "deck" e "card" sono state rimosse. Per personalizzare il layout di uno schermo lcd utilizzare le nuove sezioni display_data config (vedi config/example-extras.cfg per i dettagli).
zh_hans: 20200308: 移除了菜单中的 "desk "和 "card "选项。要定制lcd屏幕的布局，请使用新的display_data配置部分（详见config/example-extras.cfg）。

source: 20200109: The bed_mesh module now references the probe's location in for the mesh configuration. As such, some configuration options have been renamed to more accurately reflect their intended functionality. For rectangular beds, `min_point` and `max_point` have been renamed to `mesh_min` and `mesh_max` respectively. For round beds, `bed_radius` has been renamed to `mesh_radius`. A new `mesh_origin` option has also been added for round beds. Note that these changes are also incompatible with previously saved mesh profiles. If an incompatible profile is detected it will be ignored and scheduled for removal. The removal process can be completed by issuing the SAVE_CONFIG command. The user will need to re-calibrate each profile.
fr: 20200109 : Le module bed_mesh fait désormais référence à l'emplacement de la sonde pour la configuration du maillage. Ainsi, certaines options de configuration ont été renommées pour mieux refléter leur fonctionnalité. Pour les lits rectangulaires, `min_point` et `max_point` ont été renommés en `mesh_min` et `mesh_max` respectivement. Pour les lits ronds, `bed_radius` a été renommé en `mesh_radius`. Une nouvelle option `mesh_origin` a également été ajoutée pour les lits ronds. Notez que ces changements sont également incompatibles avec les profils de maillage précédemment enregistrés. Si un profil incompatible est détecté, il sera ignoré et sa suppression sera programmée. Le processus de suppression peut être achevé en lançant la commande SAVE_CONFIG. L'utilisateur devra recalibrer chaque profil.
hu: 20200109: A bed_mesh modul most már hivatkozik a szonda helyére a hálókonfigurációban. Ennek megfelelően néhány konfigurációs opciót átneveztek, hogy pontosabban tükrözze a tervezett funkciójukat. Téglalap alakú ágyak esetében a `min_point` és `max_point` átnevezésre került `mesh_min` és `mesh_max`-ra. A kerek ágyak esetében a `bed_radius` át lett nevezve `mesh_radius`-ra. A kerek ágyakhoz egy új `mesh_origin` opció is hozzá lett adva. Vegye figyelembe, hogy ezek a változások a korábban elmentett hálóprofilokkal is inkompatibilisek. Ha egy inkompatibilis profilt észlelünk, azt figyelmen kívül hagyjuk és eltávolításra ütemezzük. Az eltávolítási folyamat a SAVE_CONFIG parancs kiadásával fejezhető be. A felhasználónak minden egyes profilt újra kell kalibrálnia.
it: 20200109: Il modulo bed_mesh ora fa riferimento alla posizione della sonda per la configurazione della mesh. Pertanto, alcune opzioni di configurazione sono state rinominate per riflettere in modo più accurato la funzionalità prevista. Per i piatti rettangolari, `min_point` e `max_point` sono stati rinominati rispettivamente in `mesh_min` e `mesh_max`. Per i piatti rotondi, `bed_radius` è stato rinominato in `mesh_radius`. È stata aggiunta anche una nuova opzione `mesh_origin` per i piatti rotondi. Si noti che queste modifiche sono anche incompatibili con i profili mesh salvati in precedenza. Se viene rilevato un profilo incompatibile, verrà ignorato e pianificato per la rimozione. Il processo di rimozione può essere completato emettendo il comando SAVE_CONFIG. L'utente dovrà ricalibrare ogni profilo.
zh_hans: 20200109: bed_mesh 模块现在引用探针的位置来进行网格配置。因此，一些配置选项已被重新命名以更准确地反映其功能。对于矩形床，`min_point'和`max_point`分别重新命名为`mesh_min`和`mesh_max`。对于圆形床，`bed_radius`重新命名为`mesh_radius`。对于圆形床，还增加了一个新的`mesh_origin`选项。请注意，这些变更与之前保存的网格配置文件不兼容。如果检测到一个不兼容的配置文件，此文件会被忽略并被删除。删除过程可以通过发出 SAVE_CONFIG 命令来完成。用户将需要重新校准每个床的网床配置。

source: 20191218: The display config section no longer supports "lcd_type: st7567". Use the "uc1701" display type instead - set "lcd_type: uc1701" and change the "rs_pin: some_pin" to "rst_pin: some_pin". It may also be necessary to add a "contrast: 60" config setting.
fr: 20191218 : La section de configuration de l'affichage ne prend plus en charge "lcd_type : st7567". Utilisez le type d'affichage "uc1701" à la place - définissez "lcd_type : uc1701" et changez "rs_pin : some_pin" en "rst_pin : some_pin". Il peut également être nécessaire d'ajouter un paramètre de configuration "contrast : 60".
hu: 20191218: A display config szakasz már nem támogatja az "lcd_type: st7567". Használja helyette az "uc1701" kijelzőtípust. Állítsa be az "lcd_type: uc1701" értéket, és módosítsa az "rs_pin: some_pin" értéket "rst_pin: some_pin" értékre. Szükség lehet még egy "contrast: 60" konfigurációs beállítás hozzáadására.
it: 20191218: la sezione di configurazione del display non supporta più "lcd_type: st7567". Usa invece il tipo di visualizzazione "uc1701" - imposta "lcd_type: uc1701" e cambia "rs_pin: some_pin" in "rst_pin: some_pin". Potrebbe anche essere necessario aggiungere un'impostazione di configurazione "contrasto: 60".
zh_hans: 20191218: 显示配置部分不再支持 "lcd_type: st7567"。请使用 "uc1701 "显示类型代替：设置 "lcd_type: uc1701 "，将 "rs_pin: some_pin "改为 "rst_pin: some_pin"。可能还需要增加一个 "contrast: 60"的配置设置。

source: 20191210: The builtin T0, T1, T2, ... commands have been removed. The extruder activate_gcode and deactivate_gcode config options have been removed. If these commands (and scripts) are needed then define individual [gcode_macro T0] style macros that call the ACTIVATE_EXTRUDER command. See the config/sample-idex.cfg and sample-multi-extruder.cfg files for examples.
fr: 20191210 : Les commandes intégrées T0, T1, T2, ... ont été supprimées. Les options de configuration activate_gcode et deactivate_gcode de l'extrudeuse ont été supprimées. Si ces commandes (et scripts) sont nécessaires, définissez des macros individuelles de type [gcode_macro T0] qui appellent la commande ACTIVATE_EXTRUDER. Voir les fichiers config/sample-idex.cfg et sample-multi-extruder.cfg pour des exemples.
hu: 20191210: A beépített T0, T1, T2, ... parancsok eltávolításra kerültek. Az extruder activate_gcode és deactivate_gcode konfigurációs opciók eltávolításra kerültek. Ha szükség van ezekre a parancsokra (és szkriptekre), akkor definiáljon egyedi [gcode_macro T0] stílusú makrókat, amelyek meghívják az ACTIVATE_EXTRUDER parancsot. Példákért lásd a config/sample-idex.cfg és sample-multi-extruder.cfg fájlokat.
it: 20191210: I comandi integrati T0, T1, T2, ... sono stati rimossi. Le opzioni di configurazione activate_gcode e deactivate_gcode dell'estrusore sono state rimosse. Se questi comandi (e script) sono necessari, definire le singole macro di stile [gcode_macro T0] che chiamano il comando ACTIVATE_EXTRUDER. Vedere i file config/sample-idex.cfg e sample-multi-extruder.cfg per esempi.
zh_hans: 20191210：删除了内置的T0、T1、T2...命令。移除了挤出机 activate_gcode 和 deactivate_gcode 配置选项。如果需要这些命令（和脚本），请定义单独的[gcode_macro T0]风格的宏，调用ACTIVATE_EXTRUDER命令。参见config/sample-idex.cfg和sample-multi-extruder.cfg文件中的例子。

source: 20191210: Support for the M206 command has been removed. Replace with calls to SET_GCODE_OFFSET. If support for M206 is needed, add a [gcode_macro M206] config section that calls SET_GCODE_OFFSET. (For example "SET_GCODE_OFFSET Z=-{params.Z}".)
fr: 20191210 : La prise en charge de la commande M206 a été supprimée. Remplacer par des appels à SET_GCODE_OFFSET. Si le support de M206 est nécessaire, ajoutez une section de configuration [gcode_macro M206] qui appelle SET_GCODE_OFFSET. (Par exemple "SET_GCODE_OFFSET Z=-{params.Z}".)
hu: 20191210: Az M206 parancs támogatása megszűnt. A SET_GCODE_OFFSET hívásával helyettesítjük. Ha szükség van az M206 támogatására, adjunk hozzá egy [gcode_macro M206] config szakaszt, amely meghívja a SET_GCODE_OFFSET-et. (Például "SET_GCODE_OFFSET Z=-{params.Z}".)
it: 20191210: il supporto per il comando M206 è stato rimosso. Sostituisci con chiamate a SET_GCODE_OFFSET. Se è necessario il supporto per M206, aggiungere una sezione di configurazione [gcode_macro M206] che richiami SET_GCODE_OFFSET. (Ad esempio "SET_GCODE_OFFSET Z=-{params.Z}".)
zh_hans: 20191210：移除了对M206命令的支持。用调用SET_GCODE_OFFSET来代替。如果需要对M206的支持，请添加一个[gcode_macro M206]配置部分，调用SET_GCODE_OFFSET。(例如 "SET_GCODE_OFFSET Z=-{params.Z}"。)

source: 20191202: Support for the undocumented "S" parameter of the "G4" command has been removed. Replace any occurrences of S with the standard "P" parameter (the delay specified in milliseconds).
fr: 20191202 : La prise en charge du paramètre non documenté "S" de la commande "G4" a été supprimée. Remplacez toutes les occurrences de S par le paramètre standard "P" (le délai spécifié en millisecondes).
hu: 20191202: A "G4" parancs nem dokumentált "S" paraméterének támogatása megszűnt. Az S minden előfordulását a szabványos "P" paraméterrel helyettesíti (a milliszekundumokban megadott késleltetés).
it: 20191202: il supporto per il parametro "S" non documentato del comando "G4" è stato rimosso. Sostituire eventuali occorrenze di S con il parametro "P" standard (il ritardo specificato in millisecondi).
zh_hans: 20191202：移除了对 "G4 "命令中无标注的 "S "参数的支持。用标准的 "P "参数（以毫秒为单位的延迟）取代任何出现的S。

source: 20191126: The USB names have changed on micro-controllers with native USB support. They now use a unique chip id by default (where available). If an "mcu" config section uses a "serial" setting that starts with "/dev/serial/by-id/" then it may be necessary to update the config. Run "ls /dev/serial/by-id/*" in an ssh terminal to determine the new id.
fr: 20191126 : Les noms USB ont changé sur les micro-contrôleurs avec un support USB natif. Ils utilisent désormais un identifiant de puce unique par défaut (lorsqu'il est disponible). Si une section de configuration "mcu" utilise un paramètre "serial" qui commence par "/dev/serial/by-id/", il peut être nécessaire de mettre à jour la configuration. Exécutez "ls /dev/serial/by-id/*" dans un terminal ssh pour déterminer le nouvel identifiant.
hu: 20191126: Az USB nevek megváltoztak a natív USB-támogatással rendelkező mikrovezérlőkön. Mostantól alapértelmezés szerint egyedi chip-azonosítót használnak (ahol van ilyen). Ha egy "MCU" config szakasz olyan "serial" beállítást használ, amely "/dev/serial/by-id/" kezdetű, akkor szükség lehet a config frissítésére. Futtassa a "ls /dev/serial/by-id/*" parancsot egy SSH terminálban az új azonosító meghatározásához.
it: 20191126: i nomi USB sono cambiati sui microcontrollori con supporto USB nativo. Ora usano un ID chip univoco per impostazione predefinita (ove disponibile). Se una sezione di configurazione "mcu" utilizza un'impostazione "serial" che inizia con "/dev/serial/by-id/", potrebbe essere necessario aggiornare la configurazione. Esegui "ls /dev/serial/by-id/*" in un terminale ssh per determinare il nuovo ID.
zh_hans: 20191126：改变了那些原生USB支持的微控制器上的USB名称。现在默认使用唯一的芯片ID（如果可用）。如果 "MCU "配置部分使用以"/dev/serial/by-id/"开头的 "串口 "设置，那么可能有必要更新配置。在ssh终端运行 "ls /dev/serial/by-id/*"来确定新的id。
