Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Config_Changes.po
Languages: fr, hu, it, zh_hans

source: 20210720: A controller_fan section now monitors all stepper motors by default (not just the kinematic stepper motors). If the previous behavior is desired, see the `stepper` config option in the [config reference](Config_Reference.md#controller_fan).
fr: 20210720 : Une section controller_fan surveille maintenant tous les moteurs pas à pas par défaut (pas seulement les moteurs pas à pas cinématiques). Si le comportement précédent est souhaité, voir l'option de configuration `stepper` dans la [référence de configuration](Config_Reference.md#controller_fan).
hu: 20210720: A controller_fan szakasz most már alapértelmezés szerint az összes léptetőmotort figyeli (nem csak a kinematikus léptetőmotorokat). Ha a korábbi működést szeretnénk, lásd a [konfigurációs referencia](Config_Reference.md#controller_fan)-ban a `stepper` config opciót.
it: 20210720: una sezione controller_fan ora monitora tutti i motori passo-passo per impostazione predefinita (non solo i motori passo-passo cinematici). Se si desidera il comportamento precedente, vedere l'opzione di configurazione `stepper` nel [riferimento di configurazione](Config_Reference.md#controller_fan).
zh_hans: 20210720: controller_fan部分现在默认监控所有步进电机（而不仅仅是运动型步进电机）。如果需要以前的行为，请参考[config reference](Config_Reference.md#controller_fan)中的`stepper`配置选项。

source: Configuration Changes
fr: Changements de configuration
hu: Konfigurációs változások
it: Modifiche alla configurazione
zh_hans: 配置变更

source: 20210819: In some cases, a `G28` homing move may end in a position that is nominally outside the valid movement range. In rare situations this may result in confusing "Move out of range" errors after homing. If this occurs, change your start scripts to move the toolhead to a valid position immediately after homing.
fr: 20210819 : Dans certains cas, un mouvement de retour à l'origine `G28` peut se terminer dans une position qui est nominalement en dehors de la plage de mouvement valide. Dans de rares situations, cela peut entraîner des erreurs déroutantes "Move out of range" après le retour à la position initiale. Si cela se produit, modifiez vos scripts de démarrage pour déplacer la tête d'outil vers une position valide immédiatement après le retour à la position initiale.
hu: 20210819: Bizonyos esetekben egy `G28` célbaérési mozgás olyan pozícióban végződhet, amely névlegesen az érvényes mozgási tartományon kívül esik. Ritka helyzetekben ez zavaró "Move out of range" hibákat eredményezhet a kezdőpont felvétele után. Ha ez előfordul, módosítsa az indítási szkripteket úgy, hogy a szerszámfej a kezdőpont felvétel után azonnal érvényes pozícióba kerüljön.
it: 20210819: In alcuni casi, un movimento di riferimento `G28` può terminare in una posizione che è nominalmente al di fuori dell'intervallo di movimento valido. In rare situazioni ciò può causare errori di "spostamento fuori portata" confusi dopo l'homing. In tal caso, modificare gli script di avvio per spostare la testa utensile in una posizione valida subito dopo l'homing.
zh_hans: 20210819: 在某些情况下，`G28`的归零动作可能在某个超出有效移动范围的位置结束。在少数情况下，这可能导致归位后出现 "移动超出范围（Move out of range）"的错误。如果发生这种情况，请改变你的启动脚本，在归位后立即将打印头移动到有效位置。

source: 20210814: The analog only pseudo-pins on the atmega168 and atmega328 have been renamed from PE0/PE1 to PE2/PE3.
fr: 20210814 : Les pseudo-pins analogiques sur l'atmega168 et l'atmega328 ont été renommés de PE0/PE1 à PE2/PE3.
hu: 20210814: Az atmega168 és atmega328 csak analóg pszeudo-tüskéi PE0/PE1-ről PE2/PE3-ra lettek átnevezve.
it: 20210814: Gli pseudo-pin solo analogici su atmega168 e atmega328 sono stati rinominati da PE0/PE1 a PE2/PE3.
zh_hans: 20210814: atmega168和atmega328上的仅有模拟的伪引脚已经从PE0/PE1改名为PE2/PE3。

source: 20210903: The default [`smooth_time`](Config_Reference.md#extruder) for heaters has changed to 1 second (from 2 seconds). For most printers this will result in more stable temperature control.
fr: 20210903 : La valeur par défaut de [`smooth_time`](Config_Reference.md#extruder) pour les éléments chauffants est passée à 1 seconde (au lieu de 2 secondes). Pour la plupart des imprimantes, cela permettra un contrôle plus stable de la température.
hu: 20210903: Az alapértelmezett [`smooth_time`](Config_Reference.md#extruder) a fűtőberendezésekhez 1 másodpercre változott (2 másodpercről). A legtöbb nyomtatónál ez stabilabb hőmérséklet-szabályozást eredményez.
it: 20210903: Il valore predefinito [`smooth_time`](Config_Reference.md#extruder) per i riscaldatori è cambiato in 1 secondo (da 2 secondi). Per la maggior parte delle stampanti ciò si tradurrà in un controllo della temperatura più stabile.
zh_hans: 20210903: 加热器的默认[`smooth_time`](Config_Reference.md#extruder)已改为1秒（从2秒）。对于大多数打印机来说，这将使温度控制更加稳定。

source: 20210830: The default adxl345 name is now "adxl345". The default CHIP parameter for the `ACCELEROMETER_MEASURE` and `ACCELEROMETER_QUERY` is now also "adxl345".
fr: 20210830 : Le nom par défaut de adxl345 est maintenant "adxl345". Le paramètre CHIP par défaut pour les fonctions `ACCELEROMETER_MEASURE` et `ACCELEROMETER_QUERY` est maintenant aussi "adxl345".
hu: 20210830: Az alapértelmezett adxl345 név mostantól "adxl345". Az `ACCELEROMETER_MEASURE` és `ACCELEROMETER_QUERY` alapértelmezett CHIP paramétere mostantól szintén "adxl345".
it: 20210830: il nome adxl345 predefinito è ora "adxl345". Il parametro CHIP predefinito per `ACCELEROMETER_MEASURE` e `ACCELEROMETER_QUERY` ora è "adxl345".
zh_hans: 20210830: 默认的adxl345名称现在是 "adxl345"。`ACCELEROMETER_MEASURE`和`ACCELEROMETER_QUERY`的默认CHIP参数现在也是 "adxl345"。

source: 20210830: The adxl345 ACCELEROMETER_MEASURE command no longer supports a RATE parameter. To alter the query rate, update the printer.cfg file and issue a RESTART command.
fr: 20210830 : La commande adxl345 ACCELEROMETER_MEASURE ne prend plus en charge un paramètre RATE. Pour modifier le taux d'interrogation, mettez à jour le fichier printer.cfg et lancez une commande RESTART.
hu: 20210830: Az adxl345 ACCELEROMETER_MEASURE parancs már nem támogatja a RATE paramétert. A lekérdezési sebesség módosításához frissítse a printer.cfg fájlt, és adjon ki egy RESTART parancsot.
it: 20210830: il comando adxl345 ACCELEROMETER_MEASURE non supporta più un parametro RATE. Per modificare la frequenza delle query, aggiornare il file printer.cfg ed eseguire un comando RESTART.
zh_hans: 20210830: adxl345 ACCELEROMETER_MEASURE命令不再支持RATE参数。要改变查询速率，请更新printer.cfg文件并发出RESTART命令。

source: 20210821: Several config settings in `printer.configfile.settings` will now be reported as lists instead of raw strings. If the actual raw string is desired, use `printer.configfile.config` instead.
fr: 20210821 : Plusieurs paramètres de configuration dans `printer.configfile.settings` seront maintenant rapportés sous forme de listes au lieu de chaînes brutes. Si vous souhaitez obtenir une chaîne de caractères brute, utilisez `printer.configfile.config` à la place.
hu: 20210821: A `printer.configfile.settings` több konfigurációs beállítása mostantól listaként lesz jelentve a nyers karakterláncok helyett. Ha a tényleges nyers karakterláncra van szükség, használja helyette a `printer.configfile.config`-t.
it: 20210821: Diverse impostazioni di configurazione in `printer.configfile.settings` verranno ora riportate come elenchi anziché come stringhe grezze. Se si desidera la stringa grezza effettiva, utilizzare invece `printer.configfile.config`.
zh_hans: 20210821: `printer.configfile.settings`中的一些配置设置现在将以列表形式报告，而不是原始字符串。如果需要原始的字符串，请使用`printer.configfile.config`代替。

source: 20211110: The "NTC 100K beta 3950" temperature sensor is deprecated. This sensor will be removed in the near future. Most users will find the "Generic 3950" temperature sensor more accurate. To continue to use the older (typically less accurate) definition, define a custom [thermistor](Config_Reference.md#thermistor) with `temperature1: 25`, `resistance1: 100000`, and `beta: 3950`.
fr: 20211110 : Le capteur de température "NTC 100K beta 3950" est déprécié. Ce capteur sera supprimé dans un avenir proche. La plupart des utilisateurs trouveront le capteur de température "Generic 3950" plus précis. Pour continuer à utiliser l'ancienne définition (généralement moins précise), définissez une [thermistance personnalisée ](Config_Reference.md#thermistor) avec `température1 : 25`, `résistance1 : 100000`, et `beta : 3950`.
hu: 20211110: Az "NTC 100K beta 3950" hőmérséklet-érzékelő elavult. Ez az érzékelő a közeljövőben eltávolításra kerül. A legtöbb felhasználó a "Generic 3950" hőmérséklet-érzékelőt pontosabbnak fogja találni. Ha továbbra is a régebbi (jellemzően kevésbé pontos) definíciót szeretné használni, definiáljon egy egyéni [termisztort](Config_Reference.md#thermistor) a `temperature1: 25`, `resistance1: 100000`, és `beta: 3950` értékeken.
it: 20211110: Il sensore di temperatura "NTC 100K beta 3950" è obsoleto. Questo sensore verrà rimosso nel prossimo futuro. La maggior parte degli utenti troverà il sensore di temperatura "Generico 3950" più accurato. Per continuare a utilizzare la definizione precedente (in genere meno accurata), definire un [termistore](Config_Reference.md#thermistor) personalizzato con `temperature1: 25`, `resistance1: 100000` e `beta: 3950`.
zh_hans: 20211110: 弃用"NTC 100K beta 3950 "温度传感器。未来会删除这个传感器。大多数用户会发现 "Generic 3950 "温度传感器更准确。要继续使用旧的（通常不太准确）定义，请定义一个自定义的[thermistor](Config_Reference.md#thermistor)，其中包括`temperature1: 25`，`resistance1: 100000`和`beta: 3950`。

source: 20211102: Several deprecated features have been removed. The stepper `step_distance` option has been removed (deprecated on 20201222). The `rpi_temperature` sensor alias has been removed (deprecated on 20210219). The mcu `pin_map` option has been removed (deprecated on 20210325). The gcode_macro `default_parameter_<name>` and macro access to command parameters other than via the `params` pseudo-variable has been removed (deprecated on 20210503). The heater `pid_integral_max` option has been removed (deprecated on 20210612).
fr: 20211102 : Plusieurs fonctionnalités obsolètes ont été supprimées. L'option `step_distance` du stepper a été supprimée (obsolète depuis 20201222). L'alias du capteur `rpi_temperature` a été supprimé (obsolète depuis 20210219). L'option mcu `pin_map` a été supprimée (obsolète depuis 20210325). L'option gcode_macro `default_parameter_<name>` et l'accès aux paramètres de commande par la macro autrement que par la pseudo-variable `params` ont été supprimés (obsolète depuis 20210503). L'option heater `pid_integral_max` a été supprimée (obsolète le 20210612).
hu: 20211102: Számos elavult funkciót eltávolítottunk. A léptető `step_distance` opciót eltávolítottuk (20201222-től elavult). Az `rpi_temperature` érzékelő álnév eltávolításra került (elavult 20210219). Az MCU `pin_map` opció eltávolításra került (elavult 20210325). A gcode_macro `default_parameter_<name>` és a parancsparaméterekhez való, `params` pszeudováltozótól eltérő makróhoz való hozzáférés eltávolításra került (elavult 20210503). A fűtés `pid_integral_max` opciót eltávolítottuk (elavult 20210612).
it: 20211102: diverse funzionalità deprecate sono state rimosse. L'opzione stepper `step_distance` è stata rimossa (obsoleta nel 20201222). L'alias del sensore `rpi_temperature` è stato rimosso (obsoleto il 20210219). L'opzione mcu `pin_map` è stata rimossa (deprecata su 20210325). La gcode_macro `default_parameter_<name>` e l'accesso macro ai parametri dei comandi diversi dalla pseudo-variabile `params` sono stati rimossi (deprecato in 20210503). L'opzione del riscaldatore `pid_integral_max` è stata rimossa (obsoleta il 20210612).
zh_hans: 20211102：删除了多个废弃的功能。删除了步进器`step_distance`选项（已于20201222废弃）。删除了`rpi_temperature`传感器别名（已于20210219废弃）。删除了mcu的`pin_map`选项（已于20210325废弃）。删除了gcode_macro `default_parameter_<name>`和通过`params`伪变量以外的宏访问命令参数（已于20210503废弃）。删除了加热器的`pid_integral_max`选项（已于20210612废弃）。

source: 20210929: Klipper v0.10.0 released.
fr: 20210929 : Sortie de Klipper v0.10.0.
hu: 20210929: Klipper v0.10.0 megjelent.
it: 20210929: Klipper v0.10.0 rilasciato.
zh_hans: 20210929: Klipper v0.10.0发布。

source: 20210503: The gcode_macro `default_parameter_<name>` config option is deprecated. Use the `params` pseudo-variable to access macro parameters. Other methods for accessing macro parameters will be removed in the near future. Most users can replace a `default_parameter_NAME: VALUE` config option with a line like the following in the start of the macro: ` {% set NAME = params.NAME|default(VALUE)|float %}`. See the [Command Templates document](Command_Templates.md#macro-parameters) for examples.
fr: 20210503 : L'option de configuration gcode_macro `default_parameter_<name>` est obsolète. Utilisez la pseudo-variable `params` pour accéder aux paramètres de la macro. Les autres méthodes d'accès aux paramètres des macros seront supprimées dans un futur proche. La plupart des utilisateurs peuvent remplacer une option de configuration `default_parameter_NAME : VALUE` par une ligne comme la suivante au début de la macro : ` {% set NAME = params.NAME|default(VALUE)|float %}`. Voir le document [Modèles de commandes](Command_Templates.md#macro-parameters) pour des exemples.
hu: 20210503: A gcode_macro `default_parameter_<name>` konfig opció elavult. Használja a `params` álváltozót a makró paramétereinek eléréséhez. A makroparaméterek elérésének egyéb módszerei a közeljövőben eltávolításra kerülnek. A legtöbb felhasználó helyettesítheti a `default_parameter_NAME: VALUE` konfigurációs opciót egy olyan sorral, mint a következő a makró elején: ` {% set NAME = params.NAME|default(VALUE)|float %}`. Példákat lásd a [Parancssablonok dokumentumban](Command_Templates.md#macro-parameters).
it: 20210503: L'opzione di configurazione gcode_macro `default_parameter_<nome>` è obsoleta. Usa la pseudo-variabile `params` per accedere ai parametri della macro. Altri metodi per accedere ai parametri macro verranno rimossi nel prossimo futuro. La maggior parte degli utenti può sostituire un'opzione di configurazione `default_parameter_NAME: VALUE` con una riga come la seguente all'inizio della macro: ` {% set NAME = params.NAME|default(VALUE)|float %}`. Vedere il [documento dei modelli di comando](Command_Templates.md#macro-parameters) per esempi.
zh_hans: 20210503: 废弃了gcode_macro `default_parameter_<名称>`配置选项。使用`params`伪变量来访问宏参数。其他访问宏参数的方法将在不久的将来被删除。对于大多数情况，要替换`default_parameter_NAME: VALUE`配置选项，可以在宏的开始部分写上如下一行进行替换：`{% set NAME = params.NAME|default(VALUE)|float %}`。有关示例，请参见 [命令模板文档](Command_Templates.md#macro-parameters)。

source: 20190628: All configuration options have been removed from the [skew_correction] section. Configuration for skew_correction is now done via the SET_SKEW gcode. See [Skew Correction](Skew_Correction.md) for recommended usage.
fr: 20190628 : Toutes les options de configuration ont été supprimées de la section [skew_correction]. La configuration de la correction d'obliquité se fait désormais via le gcode SET_SKEW. Voir [Correction de l'obliquité](Skew_Correction.md) pour l'utilisation recommandée.
hu: 20190628: A [skew_correction] szakaszból eltávolítottuk az összes konfigurációs opciót. A skew_correction konfigurálása mostantól a SET_SKEW G-kódon keresztül történik. Lásd a [Ferdeség Korrekció](Skew_Correction.md) ajánlott használatát.
it: 20190628: tutte le opzioni di configurazione sono state rimosse dalla sezione [skew_correction]. La configurazione per skew_correction viene ora eseguita tramite il gcode SET_SKEW. Vedere [Correzione inclinazione](Correzione_inclinazione.md) per l'utilizzo consigliato.
zh_hans: 20190628：移除了[skew_correction]部分所有的配置选项。现在，对skew_correction的配置是通过SET_SKEW gcode完成的。推荐使用方法请参见[倾斜校正](Skew_Correction.md)。

source: 20211104: The "step pulse duration" option in "make menuconfig" has been removed. The default step duration for TMC drivers configured in UART or SPI mode is now 100ns. A new `step_pulse_duration` setting in the [stepper config section](Config_Reference.md#stepper) should be set for all steppers that need a custom pulse duration.
fr: 20211104 : L'option "step pulse duration" dans "make menuconfig" a été supprimée. La durée d'impulsion par défaut pour les pilotes TMC configurés en mode UART ou SPI est maintenant de 100ns. Un nouveau paramètre `step_pulse_duration` dans la section [configuration des moteurs](Config_Reference.md#stepper) doit être défini pour tous les moteurs nécessitant une durée d'impulsion personnalisée.
hu: 20211104: A "step pulse duration" opció a "make menuconfig" menüből eltávolításra került. Az UART vagy SPI módban konfigurált TMC-meghajtók alapértelmezett lépésimpulzus időtartama mostantól 100ns. Egy új `step_pulse_duration` beállítást kell megadni a [stepper config szakaszban](Config_Reference.md#stepper) minden olyan stepper esetében, amely egyéni impulzus időtartamot igényel.
it: 20211104: L'opzione "step pulse duration" in "make menuconfig" è stata rimossa. La durata del passaggio predefinita per i driver TMC configurati in modalità UART o SPI è ora di 100 ns. Una nuova impostazione `step_pulse_duration` nella [sezione stepper config](Config_Reference.md#stepper) dovrebbe essere impostata per tutti gli stepper che necessitano di una durata dell'impulso personalizzata.
zh_hans: 20211104：删除了"make menuconfig "中的 "step pulse duration "选项。现在在UART或SPI模式下配置的TMC驱动器的默认步长是100ns。在[stepper config section](Config_Reference.md#stepper)中的增加了一个新的`step_pulse_duration`设置，所有需要自定义脉冲持续时间的步进驱动器都需要设置。

source: 20220116: The tmc2130, tmc2208, tmc2209, and tmc2660 `run_current` calculation code has changed. For some `run_current` settings the drivers may now be configured differently. This new configuration should be more accurate, but it may invalidate previous tmc driver tuning.
fr: 20220116 : Le code de calcul `run_current` des tmc2130, tmc2208, tmc2209, et tmc2660 a changé. Pour certains paramètres `run_current` les pilotes peuvent maintenant être configurés différemment. Cette nouvelle configuration devrait être plus précise, mais elle peut invalider les réglages précédents des pilotes tmc.
hu: 20220116: A tmc2130, tmc2208, tmc2209 és tmc2660 `run_current` számítási kód megváltozott. Egyes `run_current` beállításoknál az illesztőprogramok most másképp konfigurálhatók. Ennek az új konfigurációnak pontosabbnak kell lennie, de érvénytelenítheti a korábbi TMC illesztőprogram-hangolást.
it: 20220116: Il codice di calcolo della `run_current` per tmc2130, tmc2208, tmc2209 e tmc2660 è cambiato. Per alcune impostazioni di `run_current` i driver possono ora essere configurati in modo diverso. Questa nuova configurazione dovrebbe essere più accurata, ma potrebbe invalidare la precedente ottimizzazione del driver tmc.
zh_hans: 20220116: 变更了tmc2130、tmc2208、tmc2209和tmc2660的 `run_current` 计算代码。对于一些 `run_current`设置，驱动程序现在的配置结果可能被和原来不同。新的配置应该更准确，但它可能导致前的tmc驱动调谐失效。

source: 20211230: Scripts to tune input shaper (`scripts/calibrate_shaper.py` and `scripts/graph_accelerometer.py`) were migrated to use Python3 by default. As a result, users must install Python3 versions of certain packages (e.g. `sudo apt install python3-numpy python3-matplotlib`) to continue using these scripts. For more details, refer to [Software installation](Measuring_Resonances.md#software-installation). Alternatively, users can temporarily force the execution of these scripts under Python 2 by explicitly calling Python2 interpretor in the console: `python2 ~/klipper/scripts/calibrate_shaper.py ...`
fr: 20211230 : Les scripts pour ajuster le façonneur d'entrée (`scripts/calibrate_shaper.py` et `scripts/graph_accelerometer.py`) ont été migrés pour utiliser Python3 par défaut. Par conséquent, les utilisateurs doivent installer les versions Python3 de certains paquets (par exemple, `sudo apt install python3-numpy python3-matplotlib`) pour continuer à utiliser ces scripts. Pour plus de détails, reportez-vous à [Installation du logiciel](Measuring_Resonances.md#software-installation). Alternativement, les utilisateurs peuvent temporairement forcer l'exécution de ces scripts sous Python 2 en appelant explicitement l'interpréteur Python2 dans la console : `python2 ~/klipper/scripts/calibrate_shaper.py ...`
hu: 20211230: A bemeneti alakító hangolására szolgáló szkriptek (`scripts/calibrate_shaper.py` és `scripts/graph_accelerometer.py`) alapértelmezés szerint Python3-at használnak. Ennek eredményeképpen a felhasználóknak telepíteniük kell bizonyos csomagok Python3 verzióit (pl. `sudo apt install python3-numpy python3-matplotlib`), hogy továbbra is használni tudják ezeket a szkripteket. További részletekért lásd a [Szoftvertelepítés](Measuring_Resonances.md#software-installation) című részt. Alternatívaként a felhasználók ideiglenesen kikényszeríthetik ezeknek a szkripteknek a Python 2 alatti végrehajtását a Python2 interpretor explicit meghívásával a konzolon: `python2 ~/klipper/scripts/calibrate_shaper.py ...`
it: 20211230: Gli script per ottimizzare l'input shaper (`scripts/calibrate_shaper.py` e `scripts/graph_accelerometer.py`) sono stati migrati per utilizzare Python3 per impostazione predefinita. Di conseguenza, gli utenti devono installare le versioni Python3 di determinati pacchetti (ad esempio `sudo apt install python3-numpy python3-matplotlib`) per continuare a utilizzare questi script. Per maggiori dettagli, fare riferimento a [Installazione del software](Measuring_Resonances.md#software-installation). In alternativa, gli utenti possono forzare temporaneamente l'esecuzione di questi script in Python 2 chiamando esplicitamente l'interprete Python2 nella console: `python2 ~/klipper/scripts/calibrate_shaper.py ...`
zh_hans: 20211230: 迁移输入整形器调整脚本（`scripts/calibrate_shaper.py`和`scripts/graph_accelerometer.py`），新脚本默认使用Python3。因此，必须安装Python3版本的某些软件包（例如，`sudo apt install python3-numpy python3-matplotlib`）才能继续使用这些脚本。更多细节，请参考[软件安装](Measuring_Resonances.md#software-installation)。另外，用户可以通过在控制台显性调用Python2解释器，临时强制在Python 2下执行这些脚本：`python2 ~/klipper/scripts/calibrate_shaper.py ...`
