Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Config_Changes.po
Languages: fr, hu, it, zh_hans

source: This document covers recent software changes to the config file that are not backwards compatible. It is a good idea to review this document when upgrading the Klipper software.
fr: Ce document couvre les modifications logicielles apportées au fichier de configuration qui ne sont pas rétro compatibles. Il est conseillé de consulter ce document lors de la mise à jour du logiciel Klipper.
hu: Ez a dokumentum a konfigurációs fájl legújabb szoftveres változtatásait tartalmazza, amelyek nem kompatibilisek visszafelé. A Klipper szoftver frissítésekor érdemes áttanulmányozni ezt a dokumentumot.
it: Questo documento copre le modifiche software recenti al file di configurazione che non sono compatibili con le versioni precedenti. È una buona idea rivedere questo documento durante l'aggiornamento del software Klipper.
zh_hans: 本文档涵盖了软件更新中对配置文件不向后兼容的部分。在升级 Klipper 时，最好也查看一下这份文档。

source: All dates in this document are approximate.
fr: Toutes les dates de ce document sont approximatives.
hu: A dokumentumban szereplő valamennyi dátum hozzávetőleges.
it: Tutte le date in questo documento sono approssimative.
zh_hans: 本文档中的所有日期都是不精确的。

source: Changes
fr: Changements
hu: Változások
it: Cambiamenti
zh_hans: 变更

source: 20210612: The `pid_integral_max` config option in heater and temperature_fan sections is deprecated. The option will be removed in the near future.
fr: 20210612 : l'option de configuration `pid_integral_max` dans les sections heater et temperature_fan est obsolète. Cette option sera supprimée dans les prochaines versions.
hu: 20210612: A `pid_integral_max` konfigurációs opció a fűtés és a temperature_fan szakaszokban elavult. Az opció a közeljövőben eltávolításra kerül.
it: 20210612: L'opzione di configurazione `pid_integral_max` nelle sezioni riscaldatore e temperature_fan è obsoleta. L'opzione verrà rimossa nel prossimo futuro.
zh_hans: 20210612: 加热器(heater)和温度控制风扇(temperature_fan)配置中的`pid_integral_max`选项已被弃用。该选项将在未来被移除。

source: 20210430: The SET_VELOCITY_LIMIT (and M204) command may now set a velocity, acceleration, and square_corner_velocity larger than the specified values in the config file.
fr: 20210430 : la commande SET_VELOCITY_LIMIT (et M204) peuvent maintenant définir une "velocity", "acceleration", et "square_corner_velocity" supérieurs aux valeurs spécifiées dans le fichier de configuration.
hu: 20210430: A SET_VELOCITY_LIMIT (és az M204) parancs mostantól a konfigurációs fájlban megadott értékeknél nagyobb sebességet, gyorsulást és square_corner_velocity-t is beállíthat.
it: 20210430: il comando SET_VELOCITY_LIMIT (e M204) ora può impostare una velocità, un'accelerazione e una square_corner_velocity maggiori dei valori specificati nel file di configurazione.
zh_hans: 20210430: SET_VELOCITY_LIMIT（和M204）命令现在可以设置大于配置文件中指定值的速度(velocity)、加速度(acceleration)和转角离心速度(square_corner_velocity)。

source: 20210325: Support for the `pin_map` config option is deprecated. Use the [sample-aliases.cfg](../config/sample-aliases.cfg) file to translate to the actual micro-controller pin names. The `pin_map` config option will be removed in the near future.
fr: 20210325 : La prise en charge de l'option de configuration `pin_map` est obsolète. Utilisez le fichier [sample-aliases.cfg](../config/sample-aliases.cfg) pour traduire les noms des broches réelles du microcontrôleur. L'option de configuration `pin_map` sera supprimée dans les prochaines version.
hu: 20210325: A `pin_map` config opció támogatása elavult. Használja a [sample-aliases.cfg](../config/sample-aliases.cfg) fájlt a tényleges mikrokontroller pin nevekre való fordításhoz. A `pin_map` config opció a közeljövőben eltávolításra kerül.
it: 20210325: il supporto per l'opzione di configurazione `pin_map` è deprecato. Utilizzare il file [sample-aliases.cfg](../config/sample-aliases.cfg) per tradurre i nomi dei pin del microcontroller effettivi. L'opzione di configurazione `pin_map` verrà rimossa nel prossimo futuro.
zh_hans: 20210325:配置中的`pin_map`选项已被废弃。使用[sample-aliases.cfg](../config/sample-aliases.cfg)文件将现有的引脚名翻译成实际的微控制器引脚名称。配置中的`pin_map` 选项将在未来被移除。

source: 20210313: Klipper's support for micro-controllers that communicate with CAN bus has changed. If using CAN bus then all micro-controllers must be reflashed and the [Klipper configuration must be updated](CANBUS.md).
fr: 20210313 : La prise en charge de Klipper pour les microcontrôleurs CAN bus a été modifiée. Si vous utilisez CANBus, tous les microcontrôleurs doivent être reflashés et [le fichier de configuration de Klipper doit être mise à jour](CANBUS.md).
hu: 20210313: A Klipper CAN-busszal kommunikáló mikrovezérlők támogatása megváltozott. Ha CAN-buszt használ, akkor az összes mikrokontrollert újra kell égetni és a [Klipper konfigurációt frissíteni kell](CANBUS.md).
it: 20210313: Il supporto di Klipper per i microcontrollori che comunicano con il bus CAN è cambiato. Se si utilizza il bus CAN, è necessario eseguire nuovamente il flashing di tutti i microcontrollori e la [configurazione di Klipper deve essere aggiornata](CANBUS.md).
zh_hans: 20210313：Klipper对CAN总线通信的微控制器的支持发生了变化。如果使用CAN总线，全部微控制器必须被重新刷写并更新[Klipper CAN 总线配置](CANBUS.md)。

source: 20210310: The TMC2660 default for driver_SFILT has been changed from 1 to 0.
fr: 20210310 : la valeur par défaut de driver_SFILT pour les TMC2660 a été modifiée : passage de 1 à 0 par défaut.
hu: 20210310: A TMC2660 alapértelmezett driver_SFILT értéke 1-ről 0-ra változott.
it: 20210310: Il valore predefinito TMC2660 per driver_SFILT è stato modificato da 1 a 0.
zh_hans: 20210310：TMC2660 默认 driver_SFILT 从1 改为 0。

source: 20210227: TMC stepper motor drivers in UART or SPI mode are now queried once per second whenever they are enabled - if the driver can not be contacted or if the driver reports an error, then Klipper will transition to a shutdown state.
fr: 20210227 : Les pilotes de moteur pas à pas TMC en mode UART ou SPI sont désormais interrogés une fois par seconde si ils sont activés - si le pilote ne peut pas être contacté ou si le pilote signale une erreur, alors Klipper passera à un état d'arrêt.
hu: 20210227: Az UART vagy SPI módban lévő TMC léptetőmotor-meghajtók mostantól másodpercenként egyszer lekérdezésre kerülnek, amikor engedélyezve vannak. Ha a meghajtóval nem lehet kapcsolatba lépni, vagy ha a meghajtó hibát jelent, akkor a Klipper leállási állapotba lép.
it: 20210227: I driver del motore passo-passo TMC in modalità UART o SPI ora vengono interrogati una volta al secondo ogni volta che sono abilitati - se il driver non può essere contattato o se il driver segnala un errore, Klipper passerà allo stato di spegnimento.
zh_hans: 20210227：现在每当启用 UART 或 SPI 模式的 TMC 步进电机驱动活跃时，每秒会查询一次 - 如果无法联系到驱动或如果驱动报告错误，则 Klipper 将过渡到关闭状态。

source: 20210219: The `rpi_temperature` module has been renamed to `temperature_host`. Replace any occurrences of `sensor_type: rpi_temperature` with `sensor_type: temperature_host`. The path to the temperature file may be specified in the `sensor_path` config variable. The `rpi_temperature` name is deprecated and will be removed in the near future.
fr: 20210219 : Le module `rpi_temperature` a été renommé en `temperature_host`. Remplacez toutes les occurrences de `sensor_type : rpi_temperature` par `sensor_type : temperature_host`. Le chemin vers le fichier de température peut être spécifié dans la variable de configuration `sensor_path`. Le nom `rpi_temperature` est obsolète et sera supprimé dans les prochaines versions.
hu: 20210219: Az `rpi_temperature` modult átneveztük `temperature_host`-ra. A `sensor_type: rpi_temperature` minden előfordulását cserélje ki `sensor_type: temperature_host`-ra. A hőmérsékleti fájl elérési útvonalát a `sensor_path` config változóban lehet megadni. Az `rpi_temperature` név elavult, és a közeljövőben eltávolításra kerül.
it: 20210219: Il modulo `rpi_temperature` è stato rinominato in `temperature_host`. Sostituisci tutte le occorrenze di `sensor_type: rpi_temperature` con `sensor_type: temperature_host`. Il percorso del file di temperatura può essere specificato nella variabile di configurazione `sensor_path`. Il nome `rpi_temperature` è deprecato e verrà rimosso nel prossimo futuro.
zh_hans: 20210219：`rpi_temperature` 模块已被重新命名为 `temperature_host`。用 `sensor_type: temperature_host` 替换全部的 `sensor_type: rpi_temperature`。温度文件的路径可以在 `sensor_path` 配置变量中指定。名称“`rpi_temperature`”已被废弃，在不久的将来会被删除。

source: 20210201: The `TEST_RESONANCES` command will now disable input shaping if it was previously enabled (and re-enable it after the test). In order to override this behavior and keep the input shaping enabled, one can pass an additional parameter `INPUT_SHAPING=1` to the command.
fr: 20210201: La commande `TEST_RESONANCES` va maintenant désactiver la mise en forme des entrées si elle était précédemment activée (et la réactiver après le test). Afin d'outrepasser ce comportement et de garder la mise en forme de l'entrée activée, on peut passer un paramètre supplémentaire `INPUT_SHAPING=1` à la commande.
hu: 20210201: A `TEST_RESONANCES` parancs mostantól letiltja a bemeneti alakítást, ha az korábban engedélyezve volt (és a teszt után újra engedélyezi). Ennek a viselkedésnek a felülírása és a bemeneti alakítás engedélyezve tartása érdekében egy további `INPUT_SHAPING=1` paramétert adhatunk át a parancsnak.
it: 20210201: Il comando `TEST_RESONANCES` ora disabiliterà l'input shaping se era stato precedentemente abilitato (e lo riattiverà dopo il test). Per ignorare questo comportamento e mantenere abilitato lo shaping dell'input, è possibile passare un parametro aggiuntivo `INPUT_SHAPING=1` al comando.
zh_hans: 20210201: `TEST_RESONANCES` 命令现在将禁用之前启用的输入整形（并在测试后重新启用）。如果需要覆盖这一行为并保持输入整形在测试时启用，可以在命令中传递一个附加参数 `INPUT_SHAPING=1`。

source: 20210201: The `ACCELEROMETER_MEASURE` command will now append the name of the accelerometer chip to the output file name if the chip was given a name in the corresponding adxl345 section of the printer.cfg.
fr: 20210201 : La commande `ACCELEROMETER_MEASURE` ajoutera désormais le nom de la puce accéléromètre au nom du fichier de sortie si un nom a été donné à la puce dans la section adxl345 correspondante du printer.cfg.
hu: 20210201: Az `ACCELEROMETER_MEASURE` parancs mostantól a kimeneti fájl nevéhez hozzáadja a gyorsulásmérő chip nevét, ha a chipnek a printer.cfg megfelelő adxl345 szakaszában adtak nevet.
it: 20210201: Il comando `ACCELEROMETER_MEASURE` aggiungerà ora il nome del chip dell'accelerometro al nome del file di output se al chip è stato assegnato un nome nella corrispondente sezione adxl345 di printer.cfg.
zh_hans: 20210201：如果一个加速度计芯片在printer.cfg的相应 adxl345 分段被赋予了一个名称，`ACCELEROMETER_MEASURE` 命令的输出文件现在会包含它的名称。

source: 20201222: The `step_distance` setting in the stepper config sections is deprecated. It is advised to update the config to use the [`rotation_distance`](Rotation_Distance.md) setting. Support for `step_distance` will be removed in the near future.
fr: 20201222 : Le paramètre `step_distance` dans les sections de configuration de moteur est obsolète. Il est conseillé de mettre à jour la configuration pour utiliser le paramètre [`rotation_distance`](Rotation_Distance.md). Le support de `step_distance` sera supprimé dans un futur proche.
hu: 20201222: A `step_distance` beállítás a stepper config szakaszokban elavult. Javasoljuk, hogy frissítse a konfigurációt a [`rotation_distance`](Rotation_Distance.md) beállítás használatára. A `step_distance` támogatása a közeljövőben megszűnik.
it: 20201222: L'impostazione `step_distance` nelle sezioni di configurazione dello stepper è obsoleta. Si consiglia di aggiornare la configurazione per utilizzare l'impostazione [`rotation_distance`](Rotation_Distance.md). Il supporto per `step_distance` verrà rimosso nel prossimo futuro.
zh_hans: 20201222：步进配置分段中的`step_distance`设置已被废弃。建议更新配置以使用[`rotrot_distance`](Rotation_Distance.md)设置。对`step_distance`的支持将在不久的将来被移除。

source: 20201218: The `endstop_phase` setting in the endstop_phase module has been replaced with `trigger_phase`. If using the endstop phases module then it will be necessary to convert to [`rotation_distance`](Rotation_Distance.md) and recalibrate any endstop phases by running the ENDSTOP_PHASE_CALIBRATE command.
fr: 20201218 : Le paramètre `endstop_phase` du module endstop_phase a été remplacé par `trigger_phase`. Si vous utilisez le module endstop phases, il sera nécessaire de convertir en [`rotation_distance`](Rotation_Distance.md) et de recalibrer les phases endstop en exécutant la commande ENDSTOP_PHASE_CALIBRATE.
hu: 20201218: Az endstop_phase modulban az `endstop_phase` beállítás helyébe a `trigger_phase` beállítás lépett. Ha az endstop phase modult használja, akkor át kell konvertálni a [`rotation_distance`](Rotation_Distance.md) értékre, és az ENDSTOP_PHASE_CALIBRATE parancs futtatásával újra kell kalibrálni az esetleges endstop fázisokat.
it: 20201218: L'impostazione `endstop_phase` nel modulo endstop_phase è stata sostituita con `trigger_phase`. Se si utilizza il modulo fasi endstop, sarà necessario convertire in [`rotation_distance`](Rotation_Distance.md) e ricalibrare eventuali fasi endstop eseguendo il comando ENDSTOP_PHASE_CALIBRATE.
zh_hans: 20201218：endstop_phase 模块中的 `endstop_phase` 设置已被 `trigger_phase` 取代。如果使用相位限位模块，则需要转换为 [`rotation_distance`](Rotation_Distance.md)，并通过运行 ENDSTOP_PHASE_CALIBRATE 命令重新校准任何相位限位。

source: 20201218: Rotary delta and polar printers must now specify a `gear_ratio` for their rotary steppers, and they may no longer specify a `step_distance` parameter. See the [config reference](Config_Reference.md#stepper) for the format of the new gear_ratio paramter.
fr: 20201218 : Les imprimantes rotatives delta et polaires doivent maintenant spécifier un `gear_ratio` pour leurs moteurs rotatifs, et elles ne peuvent plus spécifier un paramètre `step_distance`. Voir la [référence de configuration](Config_Reference.md#stepper) pour le format du nouveau paramètre gear_ratio.
hu: 20201218: A forgó delta- és polárnyomtatóknak mostantól meg kell adniuk egy `gear_ratio` paramétert a forgó léptetőikhez, és többé nem adhatnak meg `step_distance` paramétert. Az új gear_ratio paraméter formátumát lásd a [konfigurációs hivatkozás](Config_Reference.md#stepper) dokumentumban.
it: 20201218: le stampanti rotanti delta e polari ora devono specificare un `gear_ratio` per i loro stepper rotanti e potrebbero non specificare più un parametro `step_distance`. Vedere il [riferimento di configurazione](Config_Reference.md#stepper) per il formato del nuovo parametro gear_ratio.
zh_hans: 20201218：旋转三角洲和极点打印机现在必须为旋转步进电机指定 `gear_ratio ` ，并且它们可以不再指定 `step_distance ` 参数。有关新 gear_ratio 参数的格式，请参阅 [配置参考](Config_Reference.md#stepper)。

source: 20201213: It is not valid to specify a Z "position_endstop" when using "probe:z_virtual_endstop". An error will now be raised if a Z "position_endstop" is specified with "probe:z_virtual_endstop". Remove the Z "position_endstop" definition to fix the error.
fr: 20201213 : Il n'est pas valide de spécifier un Z "position_endstop" lors de l'utilisation de "probe:z_virtual_endstop". Une erreur sera maintenant soulevée si un Z "position_endstop" est spécifié avec "probe:z_virtual_endstop". Supprimez la définition de Z "position_endstop" pour corriger l'erreur.
hu: 20201213: A "probe:z_virtual_endstop" használatakor nem érvényes a Z "position_endstop" megadása. Mostantól hibaüzenet jelenik meg, ha Z "position_endstop" van megadva a "probe:z_virtual_endstop" használatával. A hiba kijavításához távolítsa el a Z "position_endstop" meghatározást.
it: 20201213: Non è valido specificare una Z "position_endstop" quando si utilizza "probe:z_virtual_endstop". Verrà ora generato un errore se viene specificata una Z "position_endstop" con "probe:z_virtual_endstop". Rimuovere la definizione Z "position_endstop" per correggere l'errore.
zh_hans: 20201213：当使用"probe:z_virtual_endstop"时，指定的 Z "position_endstop"是无效的。现在，如果用"probe:z_virtual_endstop"指定一个 Z "position_endstop"，将会报告一个错误。删除 Z 的 "position_endstop"定义以解决这个错误。

source: 20201120: The `[board_pins]` config section now specifies the mcu name in an explicit `mcu:` parameter. If using board_pins for a secondary mcu, then the config must be updated to specify that name. See the [config reference](Config_Reference.md#board_pins) for further details.
fr: 20201120 : La section de configuration `[board_pins]` spécifie maintenant le nom du mcu dans un paramètre explicite `mcu:`. Si vous utilisez board_pins pour un mcu secondaire, alors la config doit être mise à jour pour spécifier ce nom. Voir la [référence config](Config_Reference.md#board_pins) pour plus de détails.
hu: 20201120: A `[board_pins]` config szakasz most már explicit `mcu:` paraméterben adja meg az MCU nevét. Ha board_pins-t használunk egy másodlagos MCU-hoz, akkor a configot frissíteni kell, hogy megadja ezt a nevet. További részletekért lásd a [konfigurációs referenciát](Config_Reference.md#board_pins).
it: 20201120: La sezione di configurazione `[board_pins]` ora specifica il nome mcu in un parametro esplicito `mcu:`. Se si utilizza board_pins per un mcu secondario, è necessario aggiornare la configurazione per specificare quel nome. Vedere il [riferimento di configurazione](Config_Reference.md#board_pins) per ulteriori dettagli.
zh_hans: 20201120: `[board_pins]`配置部分现在在`mcu:`参数中明确指定了对应MCU名称。如果使用辅助MCU的board_pins，则必须更新配置以指定该MCU名称。参见 [配置参考](Config_Reference.md#board_pins) 以了解更多细节。

source: 20201112: The time reported by `print_stats.print_duration` has changed. The duration prior to the first detected extrusion is now excluded.
fr: 20201112 : La durée rapportée par `print_stats.print_duration` a changé. La durée précédant la première extrusion détectée est maintenant exclue.
hu: 20201112: A `print_stats.print_duration` által bejelentett idő megváltozott. Az első észlelt extrudálás előtti időtartamot mostantól nem veszi figyelembe.
it: 20201112: Il tempo riportato da `print_stats.print_duration` è cambiato. La durata precedente alla prima estrusione rilevata è ora esclusa.
zh_hans: 20201112: 由`print_stats.print_duration`控制的报告时间已经改变。现在不包括检测到的首次挤出之前的时间。

source: 20201029: The neopixel `color_order_GRB` config option has been removed. If necessary, update the config to set the new `color_order` option to RGB, GRB, RGBW, or GRBW.
fr: 20201029 : L'option de configuration neopixel `color_order_GRB` a été supprimée. Si nécessaire, mettez à jour la configuration pour définir la nouvelle option `color_order` sur RGB, GRB, RGBW, ou GRBW.
hu: 20201029: A neopixel `color_order_GRB` config opciót eltávolítottuk. Szükség esetén frissítse a configot, hogy az új `color_order` opciót RGB, GRB, RGBW vagy GRBW értékre állítsa be.
it: 20201029: L'opzione di configurazione `color_order_GRB` di neopixel è stata rimossa. Se necessario, aggiorna la configurazione per impostare la nuova opzione `color_order` su RGB, GRB, RGBW o GRBW.
zh_hans: 20201029: neopixel `color_order_GRB` 配置已从配置中移除。如果需要，请更新配置文件，将新的`color_order`选项设置为RGB、GRB、RGBW或GRBW。

source: 20201029: The serial option in the mcu config section no longer defaults to /dev/ttyS0. In the rare situation where /dev/ttyS0 is the desired serial port, it must be specified explicitly.
fr: 20201029 : L'option serial dans la section mcu config ne prend plus par défaut /dev/ttyS0. Dans la rare situation où /dev/ttyS0 est le port série désiré, il doit être indiqué explicitement.
hu: 20201029: A serial opció az mcu config szakaszban már nem /dev/ttyS0 az alapértelmezett érték. Abban a ritka helyzetben, amikor a /dev/ttyS0 a kívánt soros port, azt kifejezetten meg kell adni.
it: 20201029: L'opzione seriale nella sezione di configurazione di mcu non è più impostata su /dev/ttyS0. Nella rara situazione in cui /dev/ttyS0 è la porta seriale desiderata, deve essere specificata esplicitamente.
zh_hans: 20201029: mcu配置部分的串行选项不再默认为 /dev/ttyS0 。在极其罕见的情况下，如果 /dev/ttyS0 是所需的串行端口，必须明确指定它。

source: 20201020: Klipper v0.9.0 released.
fr: 20201020 : Sortie de Klipper v0.9.0.
hu: 20201020: Klipper v0.9.0 megjelent.
it: 20201020: Klipper v0.9.0 rilasciato.
zh_hans: 20201020: Klipper v0.9.0发布。

source: 20200902: The RTD resistance-to-temperature calculation for MAX31865 converters has been corrected to not read low. If you are using such a device, you should recalibrate your print temperature and PID settings.
fr: 20200902 : Le calcul de la résistance à la température des RTD des convertisseurs MAX31865 a été corrigé pour ne pas lire une valeur basse. Si vous utilisez un tel dispositif, vous devez recalibrer votre température d'impression et vos paramètres PID.
hu: 20200902: A MAX31865 átalakítók RTD ellenállás-hőmérséklet számítása javításra került, hogy ne legyen alacsony. Ha ilyen eszközt használ, akkor kalibrálja újra a nyomtatási hőmérsékletet és a PID-beállításokat.
it: 20200902: Il calcolo della resistenza-to-temperatura dell'RTD per i convertitori MAX31865 è stato corretto in modo che non fosse basso. Se si utilizza un dispositivo di questo tipo, è necessario ricalibrare la temperatura di stampa e le impostazioni PID.

source: 20200816: The gcode macro `printer.gcode` object has been renamed to `printer.gcode_move`. Several undocumented variables in `printer.toolhead` and `printer.gcode` have been removed. See docs/Command_Templates.md for a list of available template variables.
fr: 20200816 : L'objet macro gcode `printer.gcode` a été renommé en `printer.gcode_move`. Plusieurs variables non documentées dans `printer.toolhead` et `printer.gcode` ont été supprimées. Voir docs/Command_Templates.md pour une liste des variables de modèles disponibles.
hu: 20200816: A G-kód makró `printer.gcode` objektumot átneveztük `printer.gcode_move` objektumra. A `printer.toolhead` és `printer.gcode` objektumokból több nem dokumentált változót eltávolítottunk. A rendelkezésre álló sablonváltozók listáját lásd a docs/Command_Templates.md fájlban.
it: 20200816: L'oggetto `printer.gcode` della macro gcode è stato rinominato in `printer.gcode_move`. Diverse variabili non documentate in `printer.toolhead` e `printer.gcode` sono state rimosse. Vedere docs/Command_Templates.md per un elenco delle variabili di modello disponibili.
zh_hans: 20200816: G代码宏`printer.gcode`对象已被重命名为`printer.gcode_move`。删除了 `printer.toolhead` 和 `printer.gcode` 中几个没有文档的变量。参见 docs/Command_Templates.md 以获得可用的模板变量列表。

source: 20200816: The gcode macro "action_" system has changed. Replace any calls to `printer.gcode.action_emergency_stop()` with `action_emergency_stop()`, `printer.gcode.action_respond_info()` with `action_respond_info()`, and `printer.gcode.action_respond_error()` with `action_raise_error()`.
fr: 20200816 : Le système de macro gcode "action_" a changé. Remplacez tout appel à `printer.gcode.action_emergency_stop()` par `action_emergency_stop()`, `printer.gcode.action_respond_info()` par `action_respond_info()`, et `printer.gcode.action_respond_error()` par `action_raise_error()`.
hu: 20200816: A G-kód makró "action_" rendszere megváltozott. Cserélje ki a `printer.gcode.action_emergency_stop()` hívásokat `action_emergency_stop()`, `printer.gcode.action_respond_info()` a `action_respond_info()`, és `printer.gcode.action_respond_error()` a `action_raise_error()`-el.
it: 20200816: Il sistema "action_" della macro gcode è cambiato. Sostituisci tutte le chiamate a `printer.gcode.action_emergency_stop()` con `action_emergency_stop()`, `printer.gcode.action_respond_info()` con `action_respond_info()` e `printer.gcode.action_respond_error()` con `action_raise_error( )`.
zh_hans: 20200816: gcode宏 "action_"系统已经改变。请用`action_emergency_stop()`替换所有`printer.gcode.action_emergency_stop()` ，用`action_respond_info()`替换所有`printer.gcode.action_respond_info()`，用`action_raise_error()`替换所有`printer.gcode.action_respond_error()`。
