Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Config_Changes.po
Languages: fr, hu, it, zh_hans

source: 20191121: The pressure_advance_lookahead_time parameter has been removed. See example.cfg for alternate configuration settings.
fr: 20191121 : Le paramètre pressure_advance_lookahead_time a été supprimé. Voir example.cfg pour d'autres paramètres de configuration.
hu: 20191121: A pressure_advance_lookahead_time paramétert eltávolítottuk. Az alternatív konfigurációs beállításokat lásd a example.cfg fájlban.
it: 20191121: il parametro pressure_advance_lookahead_time è stato rimosso. Vedere example.cfg per impostazioni di configurazione alternative.
zh_hans: 20191121：移除了pressure_advance_lookahead_time参数。查看example.cfg以了解替代的配置设置。

source: 20191112: The tmc stepper driver virtual enable capability is now automatically enabled if the stepper does not have a dedicated stepper enable pin. Remove references to tmcXXXX:virtual_enable from the config. The ability to control multiple pins in the stepper enable_pin config has been removed. If multiple pins are needed then use a multi_pin config section.
fr: 20191112 : La capacité d'activation virtuelle du pilote de pas à pas tmc est désormais automatiquement activée si le moteur pas à pas ne possède pas de broche d'activation dédiée. Supprimez les références à tmcXXXX:virtual_enable de la configuration. La possibilité de contrôler plusieurs broches dans la configuration enable_pin du moteur a été supprimée. Si plusieurs broches sont nécessaires, utilisez une section de configuration multi_pin.
hu: 20191112: A TMC léptető vezérlő virtuális engedélyezési képessége mostantól automatikusan engedélyezve van, ha a léptető nem rendelkezik dedikált léptető engedélyező pin-nel. A tmcXXXX:virtual_enable-re való hivatkozások eltávolítása a konfigurációból. A stepper enable_pin konfigurációban több pin vezérlésének lehetősége megszűnt. Ha több pinre van szükség, akkor használjon egy multi_pin config szekciót.
it: 20191112: la funzionalità di abilitazione virtuale del driver stepper tmc è ora abilitata automaticamente se lo stepper non dispone di un pin di abilitazione stepper dedicato. Rimuovere i riferimenti a tmcXXXX:virtual_enable dal file config. La possibilità di controllare più pin nella configurazione stepper enable_pin è stata rimossa. Se sono necessari più pin, utilizzare una sezione di configurazione multi_pin.
zh_hans: 20191112：如果步进驱动器没有专用的步进电机使能引脚，那么就会自动启用tmc步进驱动器的虚拟使能功能。从配置中删除对tmcXXXX:virtual_enable的引用。移除了在步进驱动器 enable_pin 配置中控制多个引脚的能力。如果需要控制多个引脚，请使用multi_pin 配置部分。

source: 20191107: The primary extruder config section must be specified as "extruder" and may no longer be specified as "extruder0". Gcode command templates that query the extruder status are now accessed via "{printer.extruder}".
fr: 20191107 : La section de configuration de l'extrudeur primaire doit être spécifiée comme "extruder" et ne peut plus être spécifiée comme "extruder0". Les modèles de commande Gcode qui interrogent le statut de l'extrudeur sont désormais accessibles via "{printer.extruder}".
hu: 20191107: Az elsődleges extruder konfigurációs szakaszát "extruder" néven kell megadni, és már nem lehet "extruder0" néven megadni. Az extruder állapotát lekérdező Gcode parancssablonokat mostantól a "{printer.extruder}" segítségével lehet elérni.
it: 20191107: La sezione di configurazione dell'estrusore primario deve essere specificata come "extruder" e non può più essere specificata come "extruder0". I modelli di comando Gcode che richiedono lo stato dell'estrusore sono ora accessibili tramite "{printer.extruder}".
zh_hans: 20191107：主挤出机配置部分必须指定为 "extruder"，不得再指定为 "extruder0"。查询挤出机状态的Gcode命令模板现在可以通过"{printer.extruder}"访问。

source: 20191021: Klipper v0.8.0 released
fr: 20191021 : Sortie de Klipper v0.8.0
hu: 20191021: Klipper v0.8.0 megjelent
it: 20191021: Klipper v0.8.0 rilasciato
zh_hans: 20191021: Klipper v0.8.0发布

source: 20191003: The move_to_previous option in [safe_z_homing] now defaults to False. (It was effectively False prior to 20190918.)
fr: 20191003 : L'option move_to_previous de [safe_z_homing] a désormais la valeur par défaut False. (Elle était effectivement False avant 20190918.)
hu: 20191003: A move_to_previous opció a [safe_z_homing]-ban mostantól alapértelmezés szerint False. (A 20190918 előtt ténylegesen False volt.)
it: 20191003: L'opzione move_to_previous in [safe_z_homing] ora è impostata su False. (Era effettivamente Falso prima del 20190918.)
zh_hans: 20191003: [safe_z_homing] 中的 move_to_previous 选项现在默认为 False。(在20190918年之前，它实际上是False。)

source: 20190918: The zhop option in [safe_z_homing] is always re-applied after Z axis homing completed. This might need users to update custom scripts based on this module.
fr: 20190918 : L'option zhop de [safe_z_homing] est toujours réappliquée après la fin du homing sur l'axe Z. Cela peut obliger les utilisateurs à mettre à jour les scripts personnalisés basés sur ce module.
hu: 20190918: A z-hop opció a [safe_z_homing]-ban mindig újra alkalmazásra kerül, miután a Z tengelyre történő homing befejeződött. Ez szükségessé teheti a felhasználók számára, hogy frissítsék az ezen a modulon alapuló egyéni szkripteket.
it: 20190918: L'opzione zhop in [safe_z_homing] viene sempre riapplicata dopo il completamento dell'homing dell'asse Z. Ciò potrebbe richiedere agli utenti di aggiornare gli script personalizzati basati su questo modulo.
zh_hans: 20190918: [safe_z_homing]中的 zhop 选项总是在Z轴归位完成后重新应用。这可能需要用户更新基于此模块的自定义脚本。

source: 20190806: The SET_NEOPIXEL command has been renamed to SET_LED.
fr: 20190806 : La commande SET_NEOPIXEL a été renommée SET_LED.
hu: 20190806: A SET_NEOPIXEL parancsot átnevezték SET_LED-re.
it: 20190806: Il comando SET_NEOPIXEL è stato rinominato in SET_LED.
zh_hans: 20190806: SET_NEOPIXEL 命令已被重新命名为 SET_LED。

source: 20190726: The mcp4728 digital-to-analog code has changed. The default i2c_address is now 0x60 and the voltage reference is now relative to the mcp4728's internal 2.048 volt reference.
fr: 20190726 : Le code numérique-analogique du mcp4728 a été modifié. L'adresse i2c_address par défaut est maintenant 0x60 et la référence de tension est maintenant relative à la référence interne de 2,048 volts du mcp4728.
hu: 20190726: Az mcp4728 digitális-analóg kódja megváltozott. Az alapértelmezett i2c_address most 0x60, és a feszültségreferencia most az mcp4728's belső 2,048 voltos referenciához viszonyítva van.
it: 20190726: il codice del dac mcp4728 è cambiato. L'indirizzo i2c predefinito è ora 0x60 e il riferimento di tensione è ora relativo al riferimento interno di 2,048 volt del mcp4728.
zh_hans: 20190726：更改了mcp4728的数模转换代码。默认的i2c_address现在是0x60，电压参考现在是相对于mcp4728的内部2.048V参考源。

source: 20190710: The z_hop option was removed from the [firmware_retract] config section. The z_hop support was incomplete and could cause incorrect behavior with several common slicers.
fr: 20190710 : L'option z_hop a été supprimée de la section de configuration [firmware_retract]. La prise en charge de z_hop était incomplète et pouvait provoquer un comportement incorrect avec plusieurs trancheurs courants.
hu: 20190710: A [firmware_retract] konfigurációs szakaszból eltávolították a z_hop opciót. A z_hop támogatása hiányos volt, és több gyakori szeletelővel hibás viselkedést okozott.
it: 20190710: l'opzione z_hop è stata rimossa dalla sezione di configurazione [firmware_retract]. Il supporto z_hop era incompleto e potrebbe causare un comportamento errato con diversi filtri dei dati comuni.
zh_hans: 20190710: 删除了[firmware_retract]配置部分中的z_hop选项。由于对z_hop的支持不完整，可能会导致几个常见切片软件的异常行为。

source: 20190710: The optional parameters of the PROBE_ACCURACY command have changed. It may be necessary to update any macros or scripts that use that command.
fr: 20190710 : Les paramètres optionnels de la commande PROBE_ACCURACY ont été modifiés. Il peut être nécessaire de mettre à jour les macros ou les scripts qui utilisent cette commande.
hu: 20190710: A PROBE_ACCURACY parancs opcionális paraméterei megváltoztak. Szükség lehet a parancsot használó makrók vagy szkriptek frissítésére.
it: 20190710: I parametri opzionali del comando PROBE_ACCURACY sono stati modificati. Potrebbe essere necessario aggiornare eventuali macro o script che utilizzano quel comando.
zh_hans: 20190710：改变了PROBE_ACCURACY命令的可选参数。如果宏或脚本使用了该命令，可能需要更新。

source: 20190607: The "variable_X" parameters of gcode_macro (along with the VALUE parameter of SET_GCODE_VARIABLE) are now parsed as Python literals. If a value needs to be assigned a string then wrap the value in quotes so that it is evaluated as a string.
fr: 20190607 : Les paramètres "variable_X" de gcode_macro (ainsi que le paramètre VALUE de SET_GCODE_VARIABLE) sont maintenant analysés comme des littéraux Python. Si une valeur doit être assignée à une chaîne de caractères, mettez-la entre guillemets pour qu'elle soit évaluée comme une chaîne de caractères.
hu: 20190607: A gcode_macro "variable_X" paraméterei (a SET_GCODE_VARIABLE VALUE paraméterével együtt) mostantól Python literálokként kerülnek értelmezésre. Ha egy értékhez karakterláncot kell rendelni, akkor csomagolja az értéket idézőjelekbe, hogy karakterláncként kerüljön kiértékelésre.
it: 20190607: I parametri "variable_X" di gcode_macro (insieme al parametro VALUE di SET_GCODE_VARIABLE) vengono ora analizzati come valori literals di Python. Se è necessario assegnare un valore a una stringa, racchiudere il valore tra virgolette in modo che venga valutato come una stringa.
zh_hans: 20190607: gcode_macro 的 "variable_X "参数（以及 SET_GCODE_VARIABLE 的 VALUE 参数）现在被解析为 Python 字符。如果一个值需要分配成字符串型，那么用引号包裹该值以确保它被解析为一个字符串。

source: 20190606: The "samples", "samples_result", and "sample_retract_dist" config options have been moved to the "probe" config section. These options are no longer supported in the "delta_calibrate", "bed_tilt", "bed_mesh", "screws_tilt_adjust", "z_tilt", or "quad_gantry_level" config sections.
fr: 20190606 : Les options de configuration "samples", "samples_result" et "sample_retract_dist" ont été déplacées vers la section de configuration "probe". Ces options ne sont plus supportées dans les sections de configuration "delta_calibrate", "bed_tilt", "bed_mesh", "screws_tilt_adjust", "z_tilt", ou "quad_gantry_level".
hu: 20190606: A "samples", "samples_result" és "sample_retract_dist" konfigurációs beállítások átkerültek a "probe" konfigurációs szakaszba. Ezek az opciók már nem támogatottak a "delta_calibrate", "bed_tilt", "bed_mesh", "screws_tilt_adjust", "z_tilt", vagy "quad_gantry_level" config szakaszokban.
it: 20190606: le opzioni di configurazione "samples", "samples_result" e "sample_retract_dist" sono state spostate nella sezione di configurazione "probe". Queste opzioni non sono più supportate nelle sezioni di configurazione "delta_calibrate", "bed_tilt", "bed_mesh", "screws_tilt_adjust", "z_tilt" o "quad_gantry_level".
zh_hans: 20190606: samples"、"samples_result "和 "samples_retract_dist "配置选项已被移至 "probe "配置部分。在 "delta_calibrate"、"bed_tilt"、"bed_mesh"、"screw_tilt_adjust"、"z_tilt "或 "quad_gantry_level "配置部分不再支持这些选项。

source: 20190528: The magic "status" variable in gcode_macro template evaluation has been renamed to "printer".
fr: 20190528 : La variable magique "status" dans l'évaluation du modèle gcode_macro a été renommée en "printer".
hu: 20190528: A gcode_macro sablon kiértékelésében a mágikus "status" változót átneveztük "printer" -re.
it: 20190528: La variabile magica "status" nella valutazione del modello gcode_macro è stata rinominata "printer".
zh_hans: 20190528：gcode_macro模板评估中的特殊 "status "变量已更名为 "printer"。

source: 20190520: The SET_GCODE_OFFSET command has changed; update any g-code macros accordingly. The command will no longer apply the requested offset to the next G1 command. The old behavior may be approximated by using the new "MOVE=1" parameter.
fr: 20190520 : La commande SET_GCODE_OFFSET a été modifiée ; mettez à jour vos macros de code G en conséquence. La commande n'appliquera plus le décalage demandé à la prochaine commande G1. L'ancien comportement peut être approché en utilisant le nouveau paramètre "MOVE=1".
hu: 20190520: A SET_GCODE_OFFSET parancs megváltozott; ennek megfelelően frissítse a G-kód makrókat. A parancs már nem alkalmazza a kért eltolást a következő G1 parancsra. A régi viselkedés megközelíthető az új "MOVE=1" paraméter használatával.
it: 20190520: Il comando SET_GCODE_OFFSET è stato modificato; aggiorna tutte le macro del codice g di conseguenza. Il comando non applicherà più l'offset richiesto al successivo comando G1. Il vecchio comportamento può essere approssimato utilizzando il nuovo parametro "MOVE=1".
zh_hans: 20190520: SET_GCODE_OFFSET命令已经改变，请相应地更新G代码宏。该命令将不再把要求的偏移量应用于下一个G1命令。旧的行为可以通过使用新的 "MOVE=1 "参数来近似实现。

source: 20190404: The Python host software packages were updated. Users will need to rerun the ~/klipper/scripts/install-octopi.sh script (or otherwise upgrade the python dependencies if not using a standard OctoPi installation).
fr: 20190404 : Les paquets du logiciel hôte Python ont été mis à jour. Les utilisateurs devront réexécuter le script ~/klipper/scripts/install-octopi.sh (ou mettre à jour les dépendances python s'ils n'utilisent pas une installation OctoPi standard).
hu: 20190404: A Python gazda szoftvercsomagok frissítésre kerültek. A felhasználóknak újra kell futtatniuk a ~/klipper/scripts/install-octopi.sh szkriptet (vagy más módon frissíteniük kell a python függőségeket, ha nem standard OctoPi telepítést használnak).
it: 20190404: i pacchetti software host Python sono stati aggiornati. Gli utenti dovranno eseguire nuovamente lo script ~/klipper/scripts/install-octopi.sh (o in altro modo aggiornare le dipendenze di Python se non si utilizza un'installazione OctoPi standard).
zh_hans: 20190404：Python主机软件包已经更新。用户需要重新运行~/klipper/scripts/install-octopi.sh脚本（如果不使用标准的OctoPi安装，则需要升级Python的依赖关系）。

source: 20190404: The i2c_bus and spi_bus parameters (in various config sections) now take a bus name instead of a number.
fr: 20190404 : Les paramètres i2c_bus et spi_bus (dans diverses sections de configuration) prennent désormais un nom de bus au lieu d'un numéro.
hu: 20190404: Az i2c_bus és spi_bus paraméterek (a különböző konfigurációs szakaszokban) mostantól szám helyett busznevet fogadnak el.
it: 20190404: I parametri i2c_bus e spi_bus (in varie sezioni di configurazione) ora prendono un nome bus anziché un numero.
zh_hans: 20190404：现在i2c_bus和spi_bus参数（在各个配置部分）采用总线名称而不是数字。

source: 20190404: The sx1509 config parameters have changed. The 'address' parameter is now 'i2c_address' and it must be specified as a decimal number. Where 0x3E was previously used, specify 62.
fr: 20190404 : Les paramètres de configuration du sx1509 ont changé. Le paramètre 'adresse' est maintenant 'i2c_address' et doit être spécifié comme un nombre décimal. Là où 0x3E était précédemment utilisé, spécifiez 62.
hu: 20190404: Az sx1509 konfigurációs paraméterei megváltoztak. Az 'address' paraméter mostantól 'i2c_address', és decimális számként kell megadni. A korábban használt 0x3E helyett 62-t kell megadni.
it: 20190404: I parametri di configurazione sx1509 sono stati modificati. Il parametro 'address' ora è 'i2c_address' e deve essere specificato come numero decimale. Dove 0x3E è stato utilizzato in precedenza, specificare 62.
zh_hans: 20190404：变更了sx1509的配置参数。'address' 参数改名为 'i2c_address'且必须被指定为十进制数字。以前使用的是0x3E，现在则用62。

source: 20190328: The min_speed value in [temperature_fan] config will now be respected and the fan will always run at this speed or higher in PID mode.
fr: 20190328 : La valeur min_speed dans la configuration [temperature_fan] sera désormais respectée et le ventilateur fonctionnera toujours à cette vitesse ou plus en mode PID.
hu: 20190328: A [temperature_fan] konfigurációban megadott min_speed értéket mostantól tiszteletben tartjuk, és a ventilátor PID üzemmódban mindig ezen vagy annál magasabb fordulatszámon fog működni.
it: 20190328: Il valore min_speed nella configurazione [temperature_fan] verrà ora rispettato e la ventola funzionerà sempre a questa velocità o superiore in modalità PID.
zh_hans: 20190328：现在[temperature_fan]配置中的min_speed值将被使用，在PID模式下，风扇将始终以这个速度或更高的速度转动。

source: 20190322: The default value for "driver_HEND" in [tmc2660] config sections was changed from 6 to 3. The "driver_VSENSE" field was removed (it is now automatically calculated from run_current).
fr: 20190322 : La valeur par défaut de "driver_HEND" dans les sections de configuration [tmc2660] a été modifiée de 6 à 3. Le champ "driver_VSENSE" a été supprimé (il est désormais calculé automatiquement à partir de run_current).
hu: 20190322: A "driver_HEND" alapértelmezett értéke a [tmc2660] konfigurációs szakaszokban 6-ról 3-ra változott. A "driver_VSENSE" mezőt eltávolítottuk (mostantól automatikusan a run_current-ből számítják ki).
it: 20190322: il valore predefinito per "driver_HEND" nelle sezioni di configurazione [tmc2660] è stato modificato da 6 a 3. Il campo "driver_VSENSE" è stato rimosso (ora viene calcolato automaticamente da run_current).
zh_hans: 20190322: [tmc2660] 配置部分中 "driver_HEND "的默认值从6改为3。"driver_VSENSE "字段被删除（从run_current中自动计算的）。

source: 20190310: The [controller_fan] config section now always takes a name (such as [controller_fan my_controller_fan]).
fr: 20190310 : La section de configuration [controller_fan] prend désormais toujours un nom (tel que [controller_fan my_controller_fan]).
hu: 20190310: A [controller_fan] config szakasz mostantól mindig kap egy nevet (például [controller_fan my_controller_fan]).
it: 20190310: La sezione di configurazione [controller_fan] ora prende sempre un nome (come [controller_fan my_controller_fan]).
zh_hans: 20190310：现在[controller_fan]配置部分总是包含一个名字（例如[controller_fan my_controller_fan]）。

source: 20190308: The "driver_BLANK_TIME_SELECT" field in [tmc2130] and [tmc2208] config sections has been renamed to "driver_TBL".
fr: 20190308 : Le champ "driver_BLANK_TIME_SELECT" dans les sections de configuration [tmc2130] et [tmc2208] a été renommé "driver_TBL".
hu: 20190308: A [tmc2130] és [tmc2208] konfigurációs szakaszok "driver_BLANK_TIME_SELECT" mezője át lett nevezve "driver_TBL" -re.
it: 20190308: Il campo "driver_BLANK_TIME_SELECT" nelle sezioni di configurazione [tmc2130] e [tmc2208] è stato rinominato in "driver_TBL".
zh_hans: 20190308：[tmc2130]和[tmc2208]配置部分中的 "driver_BLANK_TIME_SELECT "字段已被重新命名为 "driver_TBL"。

source: 20190308: The [tmc2660] config section has changed. A new sense_resistor config parameter must now be provided. The meaning of several of the driver_XXX parameters has changed.
fr: 20190308 : La section config [tmc2660] a été modifiée. Un nouveau paramètre de configuration sense_resistor doit maintenant être fourni. La signification de plusieurs des paramètres driver_XXX a été modifiée.
hu: 20190308: A [tmc2660] config szakasz megváltozott. Mostantól egy új sense_resistor config paramétert kell megadni. A driver_XXX paraméterek közül többnek a jelentése is megváltozott.
it: 20190308: la sezione di configurazione [tmc2660] è stata modificata. Ora deve essere fornito un nuovo parametro di configurazione sense_resistor. Il significato di molti dei parametri driver_XXX è cambiato.
zh_hans: 20190308：变更了[tmc2660]配置部分。现在必须提供一个新的sense_resistor配置参数。变更了几个driver_XXX参数的含义。

source: 20190228: Users of SPI or I2C on SAMD21 boards must now specify the bus pins via a [samd_sercom] config section.
fr: 20190228 : Les utilisateurs de SPI ou I2C sur les cartes SAMD21 doivent maintenant spécifier les broches du bus via une section de configuration [samd_sercom].
hu: 20190228: A SAMD21 kártyákon SPI vagy I2C-t használóknak mostantól a [samd_sercom] config szakaszban kell megadniuk a BUSZ csatlakozásait.
it: 20190228: gli utenti di SPI o I2C su schede SAMD21 devono ora specificare i pin del bus tramite una sezione di configurazione [samd_sercom].
zh_hans: 20190228: SAMD21板上的SPI或I2C现在必须通过[samd_sercom]配置部分指定总线引脚。

source: 20190224: The bed_shape option has been removed from bed_mesh. The radius option has been renamed to bed_radius. Users with round beds should supply the bed_radius and round_probe_count options.
fr: 20190224 : L'option bed_shape a été supprimée de bed_mesh. L'option radius a été renommée bed_radius. Les utilisateurs avec des lits ronds doivent fournir les options bed_radius et round_probe_count.
hu: 20190224: A bed_shape opciót eltávolítottuk a bed_mesh-ből. A radius opciót átneveztük bed_radiusra. A kerek ágyakkal rendelkező felhasználóknak a bed_radius és a round_probe_count opciókat kell megadniuk.
it: 20190224: l'opzione bed_shape è stata rimossa da bed_mesh. L'opzione raggio è stata rinominata bed_radius. Gli utenti con letti rotondi dovrebbero fornire le opzioni bed_radius e round_probe_count.
zh_hans: 20190224: bed_shape选项已从bed_mesh中移除。半径（radius）选项已被重新命名为bed_radius。如果使用圆形床，需要提供bed_radius和round_probe_count选项。

source: 20190107: The i2c_address parameter in the mcp4451 config section changed. This is a common setting on Smoothieboards. The new value is half the old value (88 should be changed to 44, and 90 should be changed to 45).
fr: 20190107 : Le paramètre i2c_address de la section config du mcp4451 a été modifié. Il s'agit d'un paramètre courant sur les Smoothieboards. La nouvelle valeur est la moitié de l'ancienne valeur (88 doit être changé en 44, et 90 doit être changé en 45).
hu: 20190107: Az i2c_address paraméter az mcp4451 config szakaszban megváltozott. Ez egy gyakori beállítás a Smoothie alaplapokon. Az új érték a régi érték fele (a 88-as értéket 44-re, a 90-es értéket pedig 45-re kell módosítani).
it: 20190107: il parametro i2c_address nella sezione di configurazione mcp4451 è stato modificato. Questa è un'impostazione comune su Smoothieboards. Il nuovo valore è la metà del vecchio valore (88 dovrebbe essere cambiato in 44 e 90 dovrebbe essere cambiato in 45).
zh_hans: 20190107：变更了mcp4451配置部分的i2c_address参数。这是Smoothieboards上的一个常规设置。新值是旧值的一半（88应改为44，而90应改为45）。

source: 20181220: Klipper v0.7.0 released
fr: 20181220 : Sortie de Klipper v0.7.0
hu: 20181220: Klipper v0.7.0 megjelent
it: 20181220: Klipper v0.7.0 rilasciato
zh_hans: 20181220: Klipper v0.7.0发布

source: 20210703: A `samd_sercom` config section must now specify the sercom bus it is configuring via the `sercom` option.
fr: 20210703 : Une section de configuration `samd_sercom` doit maintenant spécifier le bus sercom qu'elle configure via l'option `sercom`.
hu: 20210703: A `samd_sercom` konfigurációs szakasznak mostantól meg kell adnia az általa konfigurált sercom buszt a `sercom` opcióval.
it: 20210703: Una sezione di configurazione `samd_sercom` deve ora specificare il bus sercom che sta configurando tramite l'opzione `sercom`.
zh_hans: 20210703: `samd_sercom`配置部分现在必须通过`sercom`选项指定它要配置的sercom总线。
