Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Config_Reference.po
Languages: fr, zh_hans

source: [tmc2660 stepper_x] cs_pin: # The pin corresponding to the TMC2660 chip select line. This pin # will be set to low at the start of SPI messages and set to high # after the message transfer completes. This parameter must be # provided. #spi_speed: 4000000 # SPI bus frequency used to communicate with the TMC2660 stepper # driver. The default is 4000000. #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # See the "common SPI settings" section for a description of the # above parameters. #interpolate: True # If true, enable step interpolation (the driver will internally # step at a rate of 256 micro-steps). This only works if microsteps # is set to 16. Interpolation does introduce a small systemic # positional deviation - see TMC_Drivers.md for details. The default # is True. run_current: # The amount of current (in amps RMS) used by the driver during # stepper movement. This parameter must be provided. #sense_resistor: # The resistance (in ohms) of the motor sense resistor. This # parameter must be provided. #idle_current_percent: 100 # The percentage of the run_current the stepper driver will be # lowered to when the idle timeout expires (you need to set up the # timeout using a [idle_timeout] config section). The current will # be raised again once the stepper has to move again. Make sure to # set this to a high enough value such that the steppers do not lose # their position. There is also small delay until the current is # raised again, so take this into account when commanding fast moves # while the stepper is idling. The default is 100 (no reduction). #driver_TBL: 2 #driver_RNDTF: 0 #driver_HDEC: 0 #driver_CHM: 0 #driver_HEND: 3 #driver_HSTRT: 3 #driver_TOFF: 4 #driver_SEIMIN: 0 #driver_SEDN: 0 #driver_SEMAX: 0 #driver_SEUP: 0 #driver_SEMIN: 0 #driver_SFILT: 0 #driver_SGT: 0 #driver_SLPH: 0 #driver_SLPL: 0 #driver_DISS2G: 0 #driver_TS2G: 3 # Set the given parameter during the configuration of the TMC2660 # chip. This may be used to set custom driver parameters. The # defaults for each parameter are next to the parameter name in the # list above. See the TMC2660 datasheet about what each parameter # does and what the restrictions on parameter combinations are. Be # especially aware of the CHOPCONF register, where setting CHM to # either zero or one will lead to layout changes (the first bit of # HDEC) is interpreted as the MSB of HSTRT in this case).
fr: [tmc2660 stepper_x] cs_pin: # La broche correspondant à la ligne de sélection de la puce TMC2660. Cette broche # sera mise à l'état bas au début des messages SPI et passera à l'état haut # après la fin du transfert du message. Ce paramètre doit être fourni. #spi_speed: 4000000 # Fréquence du bus SPI utilisée pour communiquer avec le pilote de pas à pas TMC2660. # La valeur par défaut est 4000000. #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # Voir la section "paramètres SPI communs" pour une description des # paramètres ci-dessus. #interpolate: True # Si vrai, active l'interpolation par pas (le pilote fera un pas interne à un taux de 256 micro-pas). # Cela ne fonctionne que si les micro-pas sont fixés à 16. L'interpolation introduit une petite # déviation systémique positionnelle - voir TMC_Drivers.md pour plus de détails. # La valeur par défaut est True. run_current: # La quantité de courant (en ampères RMS) utilisée par le pilote pendant le déplacement du # moteur pas à pas. Ce paramètre doit être fourni. #sense_resistor: # La résistance (en ohms) de la résistance de détection du moteur (Vréf). Ce paramètre # doit être fourni. #idle_current_percent 100 # Le pourcentage du courant de fonctionnement auquel le pilote pas à pas sera # abaissé lorsque le délai d'inactivité expirera (vous devez configurer le # délai à l'aide d'une section de configuration [idle_timeout]). Le courant sera # remonté dès que le moteur devra à nouveau se déplacer. Assurez-vous de # définir une valeur suffisamment élevée pour que les moteurs ne perdent pas # leur position. Il y a également un petit délai avant que le courant ne soit remis, # il faut donc en tenir compte lors de demandes de mouvements rapides alors # que le pilote est inactif. La valeur par défaut est 100 (aucune réduction). #driver_TBL: 2 #driver_RNDTF: 0 #driver_HDEC: 0 #driver_CHM: 0 #driver_HEND: 3 #driver_HSTRT: 3 #driver_TOFF: 4 #driver_SEIMIN: 0 #driver_SEDN: 0 #driver_SEMAX: 0 #driver_SEUP: 0 #driver_SEMIN: 0 #driver_SFILT: 0 #driver_SGT: 0 #driver_SLPH: 0 #driver_SLPL: 0 #driver_DISS2G: 0 #driver_TS2G: 3 # Définit les paramètres à utiliser pendant la configuration de la puce TMC2660. # Ceci peut être utilisé pour définir des paramètres de pilote personnalisés. Les valeurs par défaut de # chaque paramètre sont indiquées à côté du nom du paramètre dans la liste ci-dessus. # Consultez la fiche technique du TMC2660 pour connaître la fonction de chaque paramètre ainsi que # les restrictions sur les combinaisons de paramètres. Soyez particulièrement attentif au # registre CHOPCONF, où le fait de régler CHM à soit zéro, soit un, entraîne des modifications de # la disposition (le premier bit de HDEC est interprété comme le MSB de HSTRT dans ce cas).
zh_hans: [tmc2660 stepper_x] cs_pin: # 对应于TMC2660芯片选择线的引脚。此引脚在SPI消息开始时将设置 # 为低，消息传输完成后将设置为高。 # 必须提供此参数。 #spi_speed: 4000000 # 用于与TMC2660步进驱动器通信的SPI总线频率。 # 默认为4000000。 #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # 有关上述参数的描述，请参见“常见SPI设置”章节。 #interpolate: True # 如果为真，则启用步进插值（驱动器将以256微步的速度内部步进）。 # 只有当microsteps设置为16时，这才有效。插值会引入了极小的系统性位置 # 偏差 - 有关详细信息，请参见TMC_Drivers.md。 # 默认为True。 run_current: # 驱动器在步进运动期间使用的电流量（以安培RMS为单位）。 # 必须提供此参数。 #sense_resistor: # 电机感应电阻的阻值（以欧姆为单位）。 # 必须提供此参数。 #idle_current_percent: 100 # 当空闲超时到期时，步进驱动器将降低至run_current的百分比（您需要使用 # [idle_timeout]配置部分设置超时）。一旦步进器需要再次移动，电流将再次 # 增加。确保将其设置为足够高的值，以便步进器不会丢失位置。在电流再次 # 增加之前也会有小的延迟，因此在步进器空闲时指令快速移动时请考虑此因素。 # 默认为100（不减少）。 #driver_TBL: 2 #driver_RNDTF: 0 #driver_HDEC: 0 #driver_CHM: 0 #driver_HEND: 3 #driver_HSTRT: 3 #driver_TOFF: 4 #driver_SEIMIN: 0 #driver_SEDN: 0 #driver_SEMAX: 0 #driver_SEUP: 0 #driver_SEMIN: 0 #driver_SFILT: 0 #driver_SGT: 0 #driver_SLPH: 0 #driver_SLPL: 0 #driver_DISS2G: 0 #driver_TS2G: 3 # 在配置TMC2660芯片时设置给定参数。这可以用于设置自定义驱动器参数。每个参 # 数的默认值都在参数名称旁边的上面的列表中。请参阅TMC2660数据表了解每个参 # 数的作用以及参数组合的限制。特别注意CHOPCONF寄存器，将CHM设置为0或1 # 将导致布局更改（在这种情况下，HDEC的第一位被解释为HSTRT的MSB）。

source: [tmc5160 stepper_x] cs_pin: # The pin corresponding to the TMC5160 chip select line. This pin # will be set to low at the start of SPI messages and raised to high # after the message completes. This parameter must be provided. #spi_speed: #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # See the "common SPI settings" section for a description of the # above parameters. #chain_position: #chain_length: # These parameters configure an SPI daisy chain. The two parameters # define the stepper position in the chain and the total chain length. # Position 1 corresponds to the stepper that connects to the MOSI signal. # The default is to not use an SPI daisy chain. #interpolate: True # If true, enable step interpolation (the driver will internally # step at a rate of 256 micro-steps). The default is True. run_current: # The amount of current (in amps RMS) to configure the driver to use # during stepper movement. This parameter must be provided. #hold_current: # The amount of current (in amps RMS) to configure the driver to use # when the stepper is not moving. Setting a hold_current is not # recommended (see TMC_Drivers.md for details). The default is to # not reduce the current. #sense_resistor: 0.075 # The resistance (in ohms) of the motor sense resistor. The default # is 0.075 ohms. #stealthchop_threshold: 0 # The velocity (in mm/s) to set the "stealthChop" threshold to. When # set, "stealthChop" mode will be enabled if the stepper motor # velocity is below this value. The default is 0, which disables # "stealthChop" mode. #driver_IHOLDDELAY: 6 #driver_TPOWERDOWN: 10 #driver_TBL: 2 #driver_TOFF: 3 #driver_HEND: 2 #driver_HSTRT: 5 #driver_FD3: 0 #driver_TPFD: 4 #driver_CHM: 0 #driver_VHIGHFS: 0 #driver_VHIGHCHM: 0 #driver_DISS2G: 0 #driver_DISS2VS: 0 #driver_PWM_AUTOSCALE: True #driver_PWM_AUTOGRAD: True #driver_PWM_FREQ: 0 #driver_FREEWHEEL: 0 #driver_PWM_GRAD: 0 #driver_PWM_OFS: 30 #driver_PWM_REG: 4 #driver_PWM_LIM: 12 #driver_SGT: 0 #driver_SEMIN: 0 #driver_SEUP: 0 #driver_SEMAX: 0 #driver_SEDN: 0 #driver_SEIMIN: 0 #driver_SFILT: 0 # Set the given register during the configuration of the TMC5160 # chip. This may be used to set custom motor parameters. The # defaults for each parameter are next to the parameter name in the # above list. #diag0_pin: #diag1_pin: # The micro-controller pin attached to one of the DIAG lines of the # TMC5160 chip. Only a single diag pin should be specified. The pin # is "active low" and is thus normally prefaced with "^!". Setting # this creates a "tmc5160_stepper_x:virtual_endstop" virtual pin # which may be used as the stepper's endstop_pin. Doing this enables # "sensorless homing". (Be sure to also set driver_SGT to an # appropriate sensitivity value.) The default is to not enable # sensorless homing.
fr: [tmc5160 stepper_x] cs_pin: # La broche correspondant à la ligne de sélection de la puce TMC5160. Cette broche # sera mise à l'état bas au début des messages SPI et remontée à l'état haut # après la fin du message. Ce paramètre doit être fourni. #spi_speed: #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # Voir la section "paramètres SPI communs" pour une description des # paramètres ci-dessus. #chain_position: #chain_length: # Ces paramètres configurent une guirlande SPI. Les deux paramètres # définissent la position du pilote dans la chaîne et la longueur totale de la chaîne. # La position 1 correspond au pilote qui se connecte au signal MOSI. # La valeur par défaut est de ne pas utiliser de guirlande SPI. # Interpolate: True # Si true, active l'interpolation de pas (le pilote va faire un pas interne à un taux # de 256 micro-pas). La valeur par défaut est True. run_current: # La quantité de courant (en ampères RMS) pour configurer le pilote qu'il utilisera # pendant le mouvement du moteur pas à pas. Ce paramètre doit être fourni. #hold_current: # La quantité de courant (en ampères RMS) à configurer que le pilote utilise # lorsque le moteur pas à pas n'est pas en mouvement. La définition d'un hold_current n'est pas # recommandée (voir TMC_Drivers.md pour plus de détails). La valeur par défaut est de # ne pas réduire le courant. #sense_resistor: 0.075 # La résistance (en ohms) de la résistance de détection du moteur (Vréf). La valeur par défaut # est de 0,075 ohms. #stealthchop_threshold: 0 # La vitesse (en mm/s) à laquelle le seuil de "stealthChop" doit être fixé. Lorsque # défini, le mode "stealthChop" sera activé si la vitesse du moteur pas à pas # est inférieure à cette valeur. La valeur par défaut est 0, ce qui désactive # le mode "stealthChop". #driver_IHOLDDELAY: 6 #driver_TPOWERDOWN: 10 #driver_TBL: 2 #driver_TOFF: 3 #driver_HEND: 2 #driver_HSTRT: 5 #driver_FD3: 0 #driver_TPFD: 4 #driver_CHM: 0 #driver_VHIGHFS: 0 #driver_VHIGHCHM: 0 #driver_DISS2G: 0 #driver_DISS2VS: 0 #driver_PWM_AUTOSCALE: True #driver_PWM_AUTOGRAD: True #driver_PWM_FREQ: 0 #driver_FREEWHEEL: 0 #driver_PWM_GRAD: 0 #driver_PWM_OFS: 30 #driver_PWM_REG: 4 #driver_PWM_LIM: 12 #driver_SGT: 0 #driver_SEMIN: 0 #driver_SEUP: 0 #driver_SEMAX: 0 #driver_SEDN: 0 #driver_SEIMIN: 0 #driver_SFILT: 0 # Définit les registres à régler pendant la configuration de la puce TMC5160 # Ceci peut être utilisé pour définir les paramètres personnalisés du moteur. # Les valeurs par défaut de chaque paramètre sont à côté du nom du paramètre # dans la liste ci-dessus. #diag0_pin: #diag1_pin: # La broche du microcontrôleur reliée à l'une des lignes DIAG de la puce TMC5160. # Une seule broche diag doit être spécifiée. La broche est "active low" et est donc # normalement précédée de "^ !". Ce réglage crée une broche virtuelle # "tmc5160_stepper_x:virtual_endstop" pouvant être utilisée comme broche d'arrêt # du moteur. Cela permet d'activer le mode "sensorless homing". (Assurez-vous de # régler également driver_SGT à une valeur de sensibilité appropriée). # La valeur par défaut est de ne pas activer la recherche d'origine sans capteur.

source: POLAR KINEMATICS ARE A WORK IN PROGRESS. Moves around the 0, 0 position are known to not work properly.
fr: LA CINÉMATIQUE POLAIRE EST UN TRAVAIL EN COURS. Les déplacements autour de la position 0, 0 sont connus pour ne pas fonctionner correctement.
zh_hans: 极坐标运动学还在开发中。在0, 0位置周围移动有一些已知问题。

source: CABLE WINCH SUPPORT IS EXPERIMENTAL. Homing is not implemented on cable winch kinematics. In order to home the printer, manually send movement commands until the toolhead is at 0, 0, 0 and then issue a `G28` command.
fr: LE SUPPORT DU TREUIL À CÂBLE EST EXPÉRIMENTAL. La mise à l'origine n'est pas implémentée dans la cinématique du treuil à câble. Pour ramener l'imprimante à l'origine, envoyez des commandes manuelles de mouvements jusqu'à ce que la tête de l'outil soit à 0, 0, 0, puis envoyez la commande `G28`.
zh_hans: 缆绳铰盘支持是实验性的。归位在缆绳绞盘运动学中没有实现。在打印机归位时需要手动发送运动指令将工具头处于0, 0, 0位置，然后发出`G28`归位。

source: [printer] kinematics: winch # The stepper_a section describes the stepper connected to the first # cable winch. A minimum of 3 and a maximum of 26 cable winches may be # defined (stepper_a to stepper_z) though it is common to define 4. [stepper_a] rotation_distance: # The rotation_distance is the nominal distance (in mm) the toolhead # moves towards the cable winch for each full rotation of the # stepper motor. This parameter must be provided. anchor_x: anchor_y: anchor_z: # The X, Y, and Z position of the cable winch in cartesian space. # These parameters must be provided.
fr: [printer] kinematics: winch # La section stepper_a décrit le moteur pas à pas connecté au premier treuil à câble. # Un minimum de 3 et un maximum de 26 treuils à câble peuvent être définis (stepper_a à stepper_z) # bien qu'il soit courant d'en définir 4. [stepper_a] rotation_distance: # La rotation_distance est la distance nominale (en mm) à laquelle la tête de l'outil # se déplace vers le treuil de câble pour chaque rotation complète du moteur # pas à pas. Ce paramètre doit être fourni. anchor_x: anchor_y: anchor_z: # Les positions X, Y et Z du treuil à câble dans l'espace cartésien. # Ces paramètres doivent être fournis.
zh_hans: [printer] kinematics: winch # stepper_a 分段描述了连接到缆绳铰盘的第一个步进器。 # 最少3个，最多26个缆绳铰盘可以被定义(stepper_a 到 stepper_z)，但通常 # 会定义4个。 [stepper_a] rotation_distance: # rotation_distance 是工具头在步进电机每转一圈时向缆绳绞盘移动的额定距离（单位：mm）。 # 必须提供这个参数。 anchor_x: anchor_y: anchor_z: # 缆绳绞盘在笛卡尔空间的X、Y和Z位置。 # 必须提供这些参数。

source: rectangular bed, probe_count = 3, 3: x---x---x (max_point) | x---x---x | (min_point) x---x---x round bed, round_probe_count = 5, bed_radius = r: x (0, r) end / x---x---x \ (-r, 0) x---x---x---x---x (r, 0) \ x---x---x / x (0, -r) start
fr: lit rectangulaire, probe_count = 3, 3: x---x---x (max_point) | x---x---x | (min_point) x---x---x lit circulaire, round_probe_count = 5, bed_radius = r: x (0, r) fin / x---x---x \ (-r, 0) x---x---x---x---x (r, 0) \ x---x---x / x (0, -r) début
zh_hans: 矩形热床，probe_count = 3, 3: x---x---x (max_point) | x---x---x | (min_point) x---x---x 圆形热床，round_probe_count = 5, bed_radius = r: x (0, r) 结束点 / x---x---x \ (-r, 0) x---x---x---x---x (r, 0) \ x---x---x / x (0, -r) 起点
