Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Config_Reference.po
Languages: fr, zh_hans

source: [temperature_sensor my_sensor] #sensor_type: #sensor_pin: #min_temp: #max_temp: # See the "extruder" section for the definition of the above # parameters. #gcode_id: # See the "heater_generic" section for the definition of this # parameter.
fr: [temperature_sensor my_sensor] #sensor_type: #sensor_pin: #min_temp: #max_temp: # Voir la section "extrudeuse" pour la définition des paramètres # ci-dessus. #gcode_id: # Voir la section "heater_generic" pour la définition de ce # paramètre.
zh_hans: [temperature_sensor my_sensor] #sensor_type: #sensor_pin: #min_temp: #max_temp: # 以上参数的定义请见“extruder”章节。 #gcode_id: # 以上参数的定义请见“heater_generic”章节。

source: sensor_type: # One of "PT100 INA826", "AD595", "AD597", "AD8494", "AD8495", # "AD8496", or "AD8497". sensor_pin: # Analog input pin connected to the sensor. This parameter must be # provided. #adc_voltage: 5.0 # The ADC comparison voltage (in Volts). The default is 5 volts. #voltage_offset: 0 # The ADC voltage offset (in Volts). The default is 0.
fr: sensor_type: # Un parmi "PT100 INA826", "AD595", "AD597", "AD8494", "AD8495", # "AD8496", ou "AD8497". sensor_pin: # Broche d'entrée analogique connectée au capteur. Ce paramètre doit être # fourni. #adc_voltage: 5.0 # La tension de comparaison ADC (en Volts). La valeur par défaut est de 5 volts. #voltage_offset: 0 # Décalage de la tension de l'ADC (en Volts). La valeur par défaut est 0.
zh_hans: sensor_type: # "PT100 INA826", "AD595", "AD597", "AD8494", "AD8495", # "AD8496", 或 "AD8497"中的一种。 sensor_pin: # 连接到传感器的模拟输入引脚。 # 必须提供此参数。 #adc_voltage: 5.0 # ADC比较电压（以伏特为单位）。 # 默认为5伏特。 #voltage_offset: 0 # ADC电压偏移（以伏特为单位）。 # 默认为0。

source: sensor_type: PT1000 sensor_pin: # Analog input pin connected to the sensor. This parameter must be # provided. #pullup_resistor: 4700 # The resistance (in ohms) of the pullup attached to the sensor. The # default is 4700 ohms.
fr: sensor_type : PT1000 sensor_pin: # Broche d'entrée analogique connectée au capteur. Ce paramètre doit être # fourni. #pullup_resistor: 4700 # La résistance (en ohms) de tirage (pullup) relié au capteur. La valeur par # défaut est 4700 ohms.
zh_hans: sensor_type: PT1000 sensor_pin: # 连接到传感器的模拟引脚。 # 必须提供此参数。 #pullup_resistor: 4700 # 连接到传感器的上拉电阻阻值（单位：ohm）。 # 默认为 4700 ohms。

source: sensor_type: # One of "MAX6675", "MAX31855", "MAX31856", or "MAX31865". sensor_pin: # The chip select line for the sensor chip. This parameter must be # provided. #spi_speed: 4000000 # The SPI speed (in hz) to use when communicating with the chip. # The default is 4000000. #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # See the "common SPI settings" section for a description of the # above parameters. #tc_type: K #tc_use_50Hz_filter: False #tc_averaging_count: 1 # The above parameters control the sensor parameters of MAX31856 # chips. The defaults for each parameter are next to the parameter # name in the above list. #rtd_nominal_r: 100 #rtd_reference_r: 430 #rtd_num_of_wires: 2 #rtd_use_50Hz_filter: False # The above parameters control the sensor parameters of MAX31865 # chips. The defaults for each parameter are next to the parameter # name in the above list.
fr: sensor_type : # Un parmi les types suivants : "MAX6675", "MAX31855", "MAX31856" ou "MAX31865". sensor_pin: # La broche de sélection de puce pour la puce du capteur. Ce paramètre doit être # fourni. #spi_speed: 4000000 # La vitesse SPI (en hz) à utiliser lors de la communication avec la puce. # La valeur par défaut est 4000000. #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # Voir la section "paramètres SPI communs" pour une description des # paramètres ci-dessus. #tc_type: K #tc_use_50Hz_filter: False #tc_averaging_count: 1 # Les paramètres ci-dessus contrôlent les paramètres des capteurs des puces MAX31856 # Les valeurs par défaut de chaque paramètre sont indiquées à côté du nom du paramètre # dans la liste ci-dessus. #rtd_nominal_r: 100 #rtd_reference_r: 430 #rtd_num_of_wires: 2 #rtd_use_50Hz_filter: False # Les paramètres ci-dessus contrôlent les paramètres des capteurs des puces MAX31865 # Les valeurs par défaut de chaque paramètre sont indiquées à côté du nom du paramètre # dans la liste ci-dessus.
zh_hans: sensor_type: # "MAX6675", "MAX31855", "MAX31856", 或者 "MAX31865" 中的一种。 sensor_pin: # 传感器芯片的芯片选择线(cs)。 # 必须提供此参数。 #spi_speed: 4000000 # 与芯片通讯时使用的SPI速度（以hz为单位）。 # 默认值为4000000。 #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # 以上参数的描述，请参阅“常见SPI设置”章节。 #tc_type: K #tc_use_50Hz_filter: False #tc_averaging_count: 1 # 以上参数控制MAX31856芯片的传感器参数。 # 每个参数的默认值在上述列表的参数名称旁边。 #rtd_nominal_r: 100 #rtd_reference_r: 430 #rtd_num_of_wires: 2 #rtd_use_50Hz_filter: False # 以上参数控制MAX31865芯片的传感器参数。 # 每个参数的默认值在上述列表的参数名称旁边。

source: sensor_type: BME280 #i2c_address: # Default is 118 (0x76). Some BME280 sensors have an address of 119 # (0x77). #i2c_mcu: #i2c_bus: #i2c_speed: # See the "common I2C settings" section for a description of the # above parameters.
fr: sensor_type: BME280 #i2c_address: # La valeur par défaut est 118 (0x76). Certains capteurs BME280 ont une adresse de 119 # (0x77). #i2c_mcu: #i2c_bus: #i2c_speed: # Voir la section "paramètres I2C communs" pour une description des # paramètres ci-dessus.
zh_hans: sensor_type: BME280 #i2c_address: # 默认为118(0x76)。一些BME280传感器的地址为119(0x77). #i2c_mcu: #i2c_bus: #i2c_speed: # 参见 "常见的I2C设置 "部分，以了解对上述参数的描述。

source: sensor_type: # Must be "HTU21D" , "SI7013", "SI7020", "SI7021" or "SHT21" #i2c_address: # Default is 64 (0x40). #i2c_mcu: #i2c_bus: #i2c_speed: # See the "common I2C settings" section for a description of the # above parameters. #htu21d_hold_master: # If the sensor can hold the I2C buf while reading. If True no other # bus communication can be performed while reading is in progress. # Default is False. #htu21d_resolution: # The resolution of temperature and humidity reading. # Valid values are: # 'TEMP14_HUM12' -> 14bit for Temp and 12bit for humidity # 'TEMP13_HUM10' -> 13bit for Temp and 10bit for humidity # 'TEMP12_HUM08' -> 12bit for Temp and 08bit for humidity # 'TEMP11_HUM11' -> 11bit for Temp and 11bit for humidity # Default is: "TEMP11_HUM11" #htu21d_report_time: # Interval in seconds between readings. Default is 30
fr: sensor_type: # Doit être "HTU21D" , "SI7013", "SI7020", "SI7021" ou "SHT21". #i2c_address: # La valeur par défaut est 64 (0x40). #i2c_mcu: #i2c_bus: #i2c_speed: # Voir la section "paramètres I2C communs" pour une description des # paramètres ci-dessus. #htu21d_hold_master: # Si le capteur peut maintenir le tampon I2C pendant la lecture. Si Vrai, aucune autre # communication par bus ne peut être effectuée pendant que la lecture est en cours. # La valeur par défaut est False. #htu21d_resolution: # La résolution de lecture de la température et de l'humidité. # Les valeurs valides sont : # 'TEMP14_HUM12' -> 14bit pour la température et 12bit pour l'humidité. # 'TEMP13_HUM10' -> 13 bits pour la température et 10 bits pour l'humidité. # 'TEMP12_HUM08' -> 12bit pour la température et 08bit pour l'humidité # 'TEMP11_HUM11' -> 11bit pour la température et 11bit pour l'humidité # La valeur par défaut est "TEMP11_HUM11" #htu21d_report_time: # Intervalle en secondes entre les lectures. La valeur par défaut est 30
zh_hans: sensor_type: # 必须是 "HTU21D" , "SI7013", "SI7020", "SI7021" 或 "SHT21" #i2c_address: # 默认为64 (0x40). #i2c_mcu: #i2c_bus: #i2c_speed: # 参见 "常见的I2C设置 "章节，了解关于上述参数的描述。 #htu21d_hold_master: # 如果传感器在读取时可以保持I2C缓冲区。如果是 "真"，则没有其他 # 总线通信可以在读取过程中进行。 # 默认为 False。 #htu21d_resolution: # 温度和湿度读数的分辨率。 # 有效值有： # 'TEMP14_HUM12' -> 温度为14位，湿度为12位 # 'TEMP13_HUM10' -> 温度为13位，湿度为10位 # 'TEMP12_HUM08' -> 温度为12位，湿度为8位 # 'TEMP11_HUM11' -> 温度为11位，湿度为11位 # 默认为："TEMP11_HUM11" #htu21d_report_time: # 读数之间的间隔，以秒为单位。 # 默认为30

source: sensor_type: temperature_mcu #sensor_mcu: mcu # The micro-controller to read from. The default is "mcu". #sensor_temperature1: #sensor_adc1: # Specify the above two parameters (a temperature in Celsius and an # ADC value as a float between 0.0 and 1.0) to calibrate the # micro-controller temperature. This may improve the reported # temperature accuracy on some chips. A typical way to obtain this # calibration information is to completely remove power from the # printer for a few hours (to ensure it is at the ambient # temperature), then power it up and use the QUERY_ADC command to # obtain an ADC measurement. Use some other temperature sensor on # the printer to find the corresponding ambient temperature. The # default is to use the factory calibration data on the # micro-controller (if applicable) or the nominal values from the # micro-controller specification. #sensor_temperature2: #sensor_adc2: # If sensor_temperature1/sensor_adc1 is specified then one may also # specify sensor_temperature2/sensor_adc2 calibration data. Doing so # may provide calibrated "temperature slope" information. The # default is to use the factory calibration data on the # micro-controller (if applicable) or the nominal values from the # micro-controller specification.
fr: sensor_type: temperature_mcu #sensor_mcu: mcu # Le micro-contrôleur à lire. La valeur par défaut est "mcu". #sensor_temperature1: #sensor_adc1: # Spécifiez les deux paramètres ci-dessus (une température en Celsius et une valeur d' # ADC sous forme de flottant entre 0,0 et 1,0) pour calibrer la température du # microcontrôleur. Cela peut améliorer la précision de la température rapportée sur certaines puces. # Une façon typique d'obtenir ces informations d'étalonnage est de couper complètement l'alimentation # de l'imprimante pendant quelques heures (afin de s'assurer qu'elle est à la température ambiante), # puis de la remettre sous tension et d'utiliser la fonction QUERY_ADC pour obtenir une mesure ADC. # Utilisez un autre capteur de température sur l'imprimante pour trouver la température ambiante # correspondante. La valeur par défaut est d'utiliser les données d'étalonnage d'usine du microcontrôleur # (le cas échéant) ou les valeurs nominales de la spécification du microcontrôleur. #sensor_temperature2: #sensor_adc2: # Si sensor_temperature1/sensor_adc1 est spécifié, on peut également spécifier les données # d'étalonnage de sensor_temperature2/sensor_adc2. En procédant ainsi on peut fournir des # informations calibrées sur la "pente de température". La valeur par défaut est d'utiliser les données # d'étalonnage d'usine sur le microcontrôleur (le cas échéant) ou les valeurs nominales de la # spécification du microcontrôleur.
zh_hans: sensor_type: temperature_mcu #sensor_mcu: mcu # 要读取的微控制器。 # 默认为"mcu"。 #sensor_temperature1: #sensor_adc1: # 指定以上两个参数（以摄氏度为单位的温度和一个在0.0到1.0之间的 # 浮点ADC值）来校准微控制器的温度。这可能会提高某些芯片上报告 # 的温度准确性。获取此校准信息的一种典型方法是几小时内完全断开 # 打印机的电源（以确保它处于环境温度），然后开机并使用 # QUERY_ADC命令获取一个ADC测量值。使用打印机上的其他温度传感 # 器来找出相应的环境温度。 # 默认情况下是使用微控制器上的工厂校准数据（如果适用）或微控制 # 器规格书中的公称值。 # 必须提供此参数。 #sensor_temperature2: #sensor_adc2: # 如果指定了sensor_temperature1/sensor_adc1，那么也可以指定 # sensor_temperature2/sensor_adc2的校准数据。这样做可能会提供校 # 准的"温度斜率"信息。 # 默认情况下是使用微控制器上的工厂校准数据（如果适用）或微控 # 制器规格书中的公称值。

source: sensor_type: temperature_host #sensor_path: # The path to temperature system file. The default is # "/sys/class/thermal/thermal_zone0/temp" which is the temperature # system file on a Raspberry Pi computer.
fr: sensor_type: temperature_host #sensor_path: # Le chemin d'accès au fichier système de température. La valeur par défaut est # " /sys/class/thermal/thermal_zone0/temp " qui est le fichier système de # température sur un ordinateur Raspberry Pi.
zh_hans: sensor_type: temperature_host #sensor_path: # 此路径指向温度系统文件。默认为 # "/sys/class/thermal/thermal_zone0/temp"，这是 Raspberry Pi # 计算机上的温度系统文件。

source: sensor_type: DS18B20 serial_no: # Each 1-wire device has a unique serial number used to identify the device, # usually in the format 28-031674b175ff. This parameter must be provided. # Attached 1-wire devices can be listed using the following Linux command: # ls /sys/bus/w1/devices/ #ds18_report_time: # Interval in seconds between readings. Default is 3.0, with a minimum of 1.0 #sensor_mcu: # The micro-controller to read from. Must be the host_mcu
fr: sensor_type: DS18B20 serial_no: # Chaque dispositif à 1 fil possède un numéro de série unique utilisé pour l'identifier, # généralement au format 28-031674b175ff. Ce paramètre doit être fourni. # Les périphériques 1-wire connectés peuvent être listés à l'aide de la commande Linux suivante : # ls /sys/bus/w1/devices/ #ds18_report_time: # Intervalle en secondes entre les lectures. La valeur par défaut est de 3,0, avec un minimum de 1,0. #sensor_mcu: # Le micro-contrôleur à lire. Doit être le host_mcu
zh_hans: sensor_type: DS18B20 serial_no: # 每个1-wire 设备都有一个唯一的序列号，用于识别设备，通常格式类似 # 28-031674b175ff。 # 必须提供此参数。 # 可以使用以下 Linux 命令列出连接的 1 线设备： # ls /sys/bus/w1/devices/ #ds18_report_time: # 读数之间的间隔（以秒为单位）。 # 默认值为 3.0，最小值为 1.0 #sensor_mcu： # 读取的微控制器。必须是host_mcu

source: [servo my_servo] pin: # PWM output pin controlling the servo. This parameter must be # provided. #maximum_servo_angle: 180 # The maximum angle (in degrees) that this servo can be set to. The # default is 180 degrees. #minimum_pulse_width: 0.001 # The minimum pulse width time (in seconds). This should correspond # with an angle of 0 degrees. The default is 0.001 seconds. #maximum_pulse_width: 0.002 # The maximum pulse width time (in seconds). This should correspond # with an angle of maximum_servo_angle. The default is 0.002 # seconds. #initial_angle: # Initial angle (in degrees) to set the servo to. The default is to # not send any signal at startup. #initial_pulse_width: # Initial pulse width time (in seconds) to set the servo to. (This # is only valid if initial_angle is not set.) The default is to not # send any signal at startup.
fr: [servo my_servo] pin: # Broche de sortie PWM contrôlant le servo. Ce paramètre doit être # fourni. #maximum_servo_angle: 180 # L'angle maximum (en degrés) auquel ce servo peut être réglé. La valeur # par défaut est de 180 degrés. #minimum_pulse_width: 0.001 # La durée minimale de la largeur d'impulsion (en secondes). Cela devrait correspondre # avec un angle de 0 degré. La valeur par défaut est de 0,001 seconde. #maximum_pulse_width: 0.002 # La durée maximale de la largeur d'impulsion (en secondes). Cela devrait correspondre # avec l'angle de maximum_servo_angle. La valeur par défaut est 0.002 secondes. #initial_angle: # Angle initial (en degrés) sur lequel régler le servo. La valeur par défaut est de # ne pas envoyer de signal au démarrage. #initial_pulse_width: # Durée initiale de la largeur d'impulsion (en secondes) à laquelle le servo doit être réglé. (Ceci # n'est valable que si initial_angle n'est pas défini). La valeur par défaut est de n'envoyer # aucun signal au démarrage.
zh_hans: [servo my_servo] pin: # 控制伺服的PWM输出引脚。 # 必须提供此参数。 #maximum_servo_angle: 180 # 这个伺服可以设定的最大角度（以度为单位）。 # 默认是180度。 #minimum_pulse_width: 0.001 # 最小脉宽时间（以秒为单位）。这应该对应于0度的角度。 # 默认是0.001秒。 #maximum_pulse_width: 0.002 # 最大脉宽时间（以秒为单位）。这应该对应于maximum_servo_angle的角度。 # 默认是0.002秒。 #initial_angle: # 初始设定的伺服角度（以度为单位）。 # 默认启动时不发送任何信号。 #initial_pulse_width: # 初始设定的脉宽时间（以秒为单位）。（只有在未设定initial_angle时才有效）。 # 默认启动时不发送任何信号。

source: [gcode_button my_gcode_button] pin: # The pin on which the button is connected. This parameter must be # provided. #analog_range: # Two comma separated resistances (in Ohms) specifying the minimum # and maximum resistance range for the button. If analog_range is # provided then the pin must be an analog capable pin. The default # is to use digital gpio for the button. #analog_pullup_resistor: # The pullup resistance (in Ohms) when analog_range is specified. # The default is 4700 ohms. #press_gcode: # A list of G-Code commands to execute when the button is pressed. # G-Code templates are supported. This parameter must be provided. #release_gcode: # A list of G-Code commands to execute when the button is released. # G-Code templates are supported. The default is to not run any # commands on a button release.
fr: [gcode_button my_gcode_button] pin: # La broche sur laquelle le bouton est connecté. Ce paramètre doit être # fourni. #analog_range: # Deux résistances séparées par des virgules (en Ohms) spécifiant la plage de # résistance minimale et maximale de la résistance du bouton. Si le paramètre # analog_range est fourni, la broche doit être une broche à capacité analogique. # La valeur par défaut est d'utiliser un gpio numérique pour le bouton. #analog_pullup_resistor: # La résistance d'excursion (en Ohms) lorsque la gamme analogique est spécifiée. # La valeur par défaut est 4700 ohms. #press_gcode: # Une liste de commandes G-Code à exécuter lorsque le bouton est pressé. # Les modèles G-Code sont pris en charge. Ce paramètre doit être fourni. #release_gcode: # Une liste de commandes G-code à exécuter lorsque le bouton est relâché. # Les modèles G-Code sont supportés. La valeur par défaut est de ne pas exécuter # de commandes lors du relâchement d'un bouton.
zh_hans: [gcode_button my_gcode_button] pin: # 连接到按钮的引脚。 # 必须提供此参数。 #analog_range: # 两个逗号分隔的阻值(单位：欧姆)，指定了按钮的最小和最大电阻。 # 如果提供了 analog_range ，必须使用一个模拟功能的引脚。默认 # 情况下为按钮使用数字GPIO。 # analog_pullup_resistor: # 当定义 analog_range 时的上拉电阻(欧姆)。默认为4700欧姆。 #press_gcode: # 当按钮被按下时要执行的 G-Code 命令序列，支持G-Code模板。 # 必须提供此参数。 #release_gcode: # 当按钮被释放时要执行的G-Code命令序列，支持G-Code模板。 # 默认在按钮释放时不运行任何命令。

source: [output_pin my_pin] pin: # The pin to configure as an output. This parameter must be # provided. #pwm: False # Set if the output pin should be capable of pulse-width-modulation. # If this is true, the value fields should be between 0 and 1; if it # is false the value fields should be either 0 or 1. The default is # False. #static_value: # If this is set, then the pin is assigned to this value at startup # and the pin can not be changed during runtime. A static pin uses # slightly less ram in the micro-controller. The default is to use # runtime configuration of pins. #value: # The value to initially set the pin to during MCU configuration. # The default is 0 (for low voltage). #shutdown_value: # The value to set the pin to on an MCU shutdown event. The default # is 0 (for low voltage). #maximum_mcu_duration: # The maximum duration a non-shutdown value may be driven by the MCU # without an acknowledge from the host. # If host can not keep up with an update, the MCU will shutdown # and set all pins to their respective shutdown values. # Default: 0 (disabled) # Usual values are around 5 seconds. #cycle_time: 0.100 # The amount of time (in seconds) per PWM cycle. It is recommended # this be 10 milliseconds or greater when using software based PWM. # The default is 0.100 seconds for pwm pins. #hardware_pwm: False # Enable this to use hardware PWM instead of software PWM. When # using hardware PWM the actual cycle time is constrained by the # implementation and may be significantly different than the # requested cycle_time. The default is False. #scale: # This parameter can be used to alter how the 'value' and # 'shutdown_value' parameters are interpreted for pwm pins. If # provided, then the 'value' parameter should be between 0.0 and # 'scale'. This may be useful when configuring a PWM pin that # controls a stepper voltage reference. The 'scale' can be set to # the equivalent stepper amperage if the PWM were fully enabled, and # then the 'value' parameter can be specified using the desired # amperage for the stepper. The default is to not scale the 'value' # parameter.
fr: [output_pin my_pin] pin: # La broche à configurer comme une sortie. Ce paramètre doit être # fourni. #pwm: False # Définit si la broche de sortie doit être capable de modulation de largeur d'impulsion. # Si ce paramètre est vrai, les champs de valeur doivent être compris entre 0 et 1. # La valeur par défaut est False. #static_value: # Si cette valeur est définie, la broche est affectée à cette valeur au démarrage et # et la broche ne peut pas être modifiée pendant l'exécution. Une broche statique utilise # légèrement moins de RAM dans le micro-contrôleur. Le défaut est d'utiliser # la configuration des broches paramétrées lors du démarrage. #value: # La valeur à donner initialement à la broche pendant la configuration du MCU. # La valeur par défaut est 0 (pour une tension basse). #shutdown_value: # La valeur à donner à la broche lors d'un événement d'arrêt du MCU. La valeur par défaut # est 0 (pour une tension basse). #maximum_mcu_duration: # La durée maximale pendant laquelle une valeur de non-arrêt peut être pilotée par le MCU # sans un accusé de réception de l'hôte. # Si l'hôte ne peut pas suivre une mise à jour, le MCU s'éteindra # et met toutes les broches à leurs valeurs d'arrêt respectives. # Défaut : 0 (désactivé) # Les valeurs habituelles sont d'environ 5 secondes. #cycle_time: 0.100 # La durée (en secondes) par cycle PWM. Il est recommandé # que ce soit 10 millisecondes ou plus lorsque vous utilisez un PWM logiciel. # La valeur par défaut est de 0.100 secondes pour les broches PWM. #hardware_pwm: False # Activez pour utiliser le PWM matériel au lieu du PWM logiciel. Lors de # l'utilisation d'un PWM matériel, le temps de cycle réel est limité par # l'implémentation et peut être significativement différent du # cycle_time demandé. La valeur par défaut est False. #scale : # Ce paramètre peut être utilisé pour modifier la façon dont les paramètres 'value' et # 'shutdown_value' sont interprétés pour les broches pwm. Si # fourni, alors le paramètre 'value' doit être compris entre 0.0 et # 'scale'. Cela peut être utile lors de la configuration d'une broche PWM qui # contrôle une référence de tension d'un moteur pas à pas. L''échelle' peut être définie sur # l'intensité du moteur pas à pas équivalent si le PWM était entièrement activé, et # puis le paramètre 'value' peut être spécifié en utilisant l'intensité souhaitée pour # le moteur pas à pas. La valeur par défaut est de ne pas mettre à l'échelle le # paramètre 'value'.
zh_hans: [output_pin my_pin] pin: # 需要配置为输出的引脚。此参数必须提供。 #pwm: False # 设置输出引脚是否应能够进行脉冲宽度调制。如果为真，值字段应在 # 0和1之间；如果为假，值字段应为0或1。 # 默认为False。 #static_value: # 如果设置了此项，则引脚在启动时被分配此值，并且引脚在运行时无 # 法更改。静态引脚在微控制器中使用的RAM略少。 # 默认情况下，使用引脚的运行时配置。 #value: # 在MCU配置期间最初设置引脚的值。 # 默认为0（低电压）。 #shutdown_value: # 在MCU关闭事件中设置引脚的值。 # 默认为0（低电压）。 #maximum_mcu_duration: # MCU可以在未从主机获取确认的情况下驱动非关闭值的最大持续时间。 # 如果主机无法跟上更新，MCU将关闭并将所有引脚设置为各自的关闭值。 # 默认值：0（禁用） # 通常的值约为5秒。 #cycle_time: 0.100 # 每个PWM周期的时间（以秒为单位）。建议在使用基于软件的PWM时， # 这个值应大于或等于10毫秒。 # 对于pwm引脚，默认值为0.100秒。 #hardware_pwm: False # 启用此项以使用硬件PWM而不是软件PWM。在使用硬件PWM时，实际的 # 周期时间受到实现的限制，可能与请求的cycle_time显著不同。 # 默认值为False。 #scale: # 此参数可以用来改变如何解释'value'和'shutdown_value'参数对于pwm # 引脚。如果提供了此参数，那么'value'参数应在0.0和'scale'之间。当配 # 置一个控制步进电机电压参考的PWM引脚时，这可能会很有用。'scale' # 可以设置为PWM全开时相当于步进电机的电流，然后可以使用步进电机 # 的期望电流来指定'value'参数。 # 默认情况下，不对'value'参数进行缩放。

source: [static_digital_output my_output_pins] pins: # A comma separated list of pins to be set as GPIO output pins. The # pin will be set to a high level unless the pin name is prefaced # with "!". This parameter must be provided.
fr: [static_digital_output my_output_pins] pins: # Une liste de broches séparées par des virgules à définir comme broches de sortie GPIO. La broche # sera définie à un niveau haut, sauf si le nom de la broche est précédé de "!". # Ce paramètre doit être fourni.
zh_hans: [static_digital_output my_output_pins] pins： # 将被设置为GPIO输出的引脚的逗号分隔列表。引脚将被设置为高 # 电平，除非引脚名称前面有"!"。 # 必须提供这个参数。

source: [multi_pin my_multi_pin] pins: # A comma separated list of pins associated with this alias. This # parameter must be provided.
fr: [multi_pin my_multi_pin] pins: # Une liste séparée par des virgules des broches associées à cet alias. Ce paramètre # doit être fourni.
zh_hans: [multi_pin my_multi_pin] pins: # 与此别名关联的引脚的逗号分隔列表。 # 必须提供此参数。
