Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Config_checks.po
Languages: bg, de, es, fr, hu, ko, pl, pt, pt_br, sk, tr, zh_hans, zh_hant

source: If the printer has a heated bed and it supports being driven by PWM (Pulse Width Modulation) then it is recommended to use PID control for the bed. (When the bed heater is controlled using the PID algorithm it may turn on and off ten times a second, which may not be suitable for heaters using a mechanical switch.) A typical bed PID calibration command is: `PID_CALIBRATE HEATER=heater_bed TARGET=60`
bg: Ако принтерът има отопляемо легло и той поддържа да се управлява от PWM (Модулация на ширината на импулса) тогава се препоръчва да се използва PID контрол за леглото. (Когато нагревателят за легло се управлява с помощта на алгоритъма PID той може да включва и изключва десет пъти в секунда, което може да не е подходящо за нагреватели с помощта на механичен превключвател.) Типична команда за калибриране на PID за легло е: `PID_CALIBRATE HEATER=heater_bed TARGET=60`
de: Wenn der Drucker über ein beheiztes Bett verfügt und die Ansteuerung durch PWM (Pulsweitenmodulation) unterstützt, wird empfohlen, eine PID-Regelung für das Bett zu verwenden. (Wenn die Bettheizung mit dem PID-Algorithmus gesteuert wird, schaltet sie möglicherweise zehnmal pro Sekunde ein und aus, was für Heizungen mit einem mechanischen Schalter möglicherweise nicht geeignet ist). Ein typischer PID-Kalibrierungsbefehl für das Bett lautet: `PID_CALIBRATE HEATER=heater_bed TARGET=60`
es: Si la impresora está equipada con una cama de calefacción y soporta ser manejada por PWM (Modulación de Ancho de Pulsos) entonces es recomienda el usar control PID para la cama. (Cuando el calentador de cama es controlado usando el algoritmo PID, se puede prender y apagar diez veces por segundo, lo cual no puede ser adecuado para calentadores que utilicen un interruptor mecánico.) Un comando de calibración PID de cama típico es: `PID_CALIBRATE HEATER=heater_bed TARGET=60`
fr: Si l'imprimante est équipée d'un lit chauffant et qu'elle peut être pilotée par PWM (Pulse Width Modulation), il est recommandé d'utiliser la commande PID pour le plateau (lorsque le chauffage du lit est contrôlé à l'aide de l'algorithme PID, il peut s'allumer et s'éteindre dix fois par seconde, ce qui peut ne pas convenir aux chauffages utilisant un interrupteur mécanique). Une commande typique de calibrage PID du plateau est : `PID_CALIBRATE HEATER=heater_bed TARGET=60`
hu: Ha a nyomtató fűtött ággyal rendelkezik, és az támogatja a PWM (impulzusszélesség-moduláció) vezérlést, akkor ajánlott PID vezérlést használni a tárgyasztalhoz. (Ha a tárgyasztal fűtést PID algoritmussal vezérled, akkor másodpercenként tízszer is be- és kikapcsolhat, ami nem biztos, hogy megfelelő a mechanikus kapcsolót használó fűtőberendezésekhez.) A tipikus tárgyasztal PID-kalibrálási parancs: `PID_CALIBRATE HEATER=heater_bed TARGET=60`
ko: 프린터에 히팅베드가 있고 PWM(Pulse Width Modulation) 구동을 지원하는 경우 베드에 PID 제어를 사용하는 것이 좋습니다. (베드 히터가 PID 알고리즘을 사용하여 제어될 경우 1초에 10번씩 켜지고 꺼질 수 있으므로 기계식 스위치를 사용하는 히터에는 적합하지 않을 수 있습니다.) 일반적인 베드 PID 교정 명령은 다음과 같습니다: `PID_CALIBRATE HEATER=heater_bed TARGET=60`
pl: Jeśli drukarka ma podgrzewane łoże i obsługuje ono sterowanie PWM (modulacja szerokości impulsu), zaleca się stosowanie sterowania PID dla łoża. (Gdy podgrzewacz łoża jest sterowany za pomocą algorytmu PID, może on włączać się i wyłączać dziesięć razy na sekundę, co może nie być odpowiednie dla podgrzewaczy wykorzystujących przełącznik mechaniczny). Typowa komenda kalibracji PID łóżka to: `PID_CALIBRATE HEATER=heater_bed TARGET=60`.
pt: Se a impressora possui uma cama aquecida e ela suporta ser controlada por PWM (Modulação por Largura de Pulso), então é recomendado usar o controle PID para a cama. (Quando o aquecedor da cama é controlado usando o algoritmo PID, ele pode ligar e desligar dez vezes por segundo, o que pode não ser adequado para aquecedores que usam uma chave mecânica.) Um comando típico de calibração PID da cama é: `PID_CALIBRATE HEATER=heater_bed TARGET=60`
pt_br: Se a impressora tiver uma base aquecida e for compatível com o acionamento por PWM (Pulse Width Modulation, ou modulação por largura de pulso em português), é recomendável usar o controle PID para a base. (Quando o aquecedor da base é controlado usando o algoritmo PID, ele pode ligar e desligar dez vezes por segundo, o que pode não ser adequado para aquecedores que usam um interruptor mecânico). Na maioria dos casos o comando para calibração PID da base é: `PID_CALIBRATE HEATER=heater_bed TARGET=60`
sk: Ak má tlačiareň vyhrievané lôžko a podporuje riadenie pomocou PWM (Pulse Width Modulation), potom sa odporúča použiť pre lôžko PID riadenie. (Keď je ohrievač lôžka riadený pomocou algoritmu PID, môže sa zapnúť a vypnúť desaťkrát za sekundu, čo nemusí byť vhodné pre ohrievače používajúce mechanický spínač.) Typický príkaz na kalibráciu PID lôžka je: `PID_CALIBRATE HEATER=heater_bed TARGET=60`
tr: Yazıcı ısıtılmış bir baskı yatağına sahipse ve PWM (Pulse Width Modulation) ile sürülmeyi destekliyorsa baskı yatağı için PID kontrolü kullanılması önerilir. (Baskı yatağı ısıtıcısı bir PID algoritması ile kontrol ediliyorsa saniyede on kere açılıp kapanabilir, bu durum mekanik anahtar kullanan ısıtıcılar için uygun olmayabilir.) Tipik bir baskı yatağı PID kalibrasyonu komutu şu şekildedir: `PID_CALIBRATE HEATER=heater_bed TARGET=60`
zh_hans: 如果打印机有加热床，并且支持PWM（脉宽调制）驱动，那么建议加热床使用PID控制。 （当使用 PID 算法控制床加热器时，它可能每秒打开和关闭十次，这可能不适用于使用机械开关的加热器。）一般床 PID 校准命令是：`PID_CALIBRATE HEATER=heater_bed TARGET= 60`
zh_hant: 如果印表機有加熱床，並且支援PWM（脈寬調製）驅動，那麼建議對加熱床使用PID控制。 （當使用 PID 演算法控制床加熱器時，它可能每秒打開和關閉十次，這可能不適用于使用機械開關的加熱器。）一般的熱床 PID 校準命令是：`PID_CALIBRATE HEATER=heater_bed TARGET= 60`

source: Next steps
bg: Следваща стъпка
de: Nächste Schritte
es: Pasos Siguientes
fr: Prochaines étapes
hu: Következő lépések
ko: 다음 단계
pl: Następne kroki
pt: Próximos passos
pt_br: Próximos passos
sk: Ďalšie kroky
tr: Sonraki adımlar
zh_hans: 下一步
zh_hant: 下一步

source: This guide is intended to help with basic verification of pin settings in the Klipper configuration file. Be sure to read the [bed leveling](Bed_Level.md) guide. Also see the [Slicers](Slicers.md) document for information on configuring a slicer with Klipper.
bg: Това ръководство има за цел да помогне при основната проверка на настройките на пиновете в конфигурационния файл на Klipper. Не забравяйте да прочетете ръководството [Изравняване на леглото](Bed_Level.md). Също така вижте документа [Slicers](Slicers.md) за информация относно конфигурирането на машина за рязане с Klipper.
de: Diese Anleitung soll bei der grundlegenden Überprüfung der Pin-Einstellungen in der Klipper-Konfigurationsdatei helfen. Lesen Sie unbedingt die Anleitung [Bed leveling](Bed_Level.md). Lesen Sie auch das Dokument [Slicers](Slicers.md) für Informationen zur Konfiguration eines Slicers mit Klipper.
es: Esta guía pretende el ayudar con la verificación básica de las configuraciones del alfiler en el archivo de configuración de Klipper. Asegúrese de leer la guía de [nivelación de cama](Bed_Level.md). También vea el documento sobre [Rebanadores](Slicers.md) para información sobre el configurar un rebanador con Klipper.
fr: Ce guide a pour but d'aider à la vérification de base des paramètres des broches dans le fichier de configuration de Klipper. Veillez à lire le guide [bed leveling](Bed_Level.md). Consultez également le document [Slicers](Slicers.md) pour obtenir des informations sur la configuration d'un trancheur avec Klipper.
hu: Ez az útmutató a Klipper konfigurációs fájlban lévő tű-beállítások alapvető ellenőrzéséhez nyújt segítséget. Mindenképpen olvasd el a [tárgyasztal szintezése](Bed_Level.md) útmutatót. A Klipperrel történő szeletelő konfigurálásával kapcsolatos információkért olvasd el a [Szeletelők](Slicers.md) dokumentumot is.
ko: 이 가이드는 Klipper 구성 파일의 핀 설정에 대한 기본적인 확인을 돕기 위한 것입니다. [bed leveling](Bed_Level.md) 가이드를 반드시 읽어주세요. 또한 Klipper로 슬라이서를 구성하는 방법에 대한 정보는 [Slicers](Slicers.md) 문서를 참조하십시오.
pl: Ten dokument ma na celu pomóc w podstawowej weryfikacji ustawień pinów w pliku konfiguracyjnym Klippera. Należy zapoznać się z przewodnikiem [Bed Leveling](Bed_Level.md). Zobacz także dokument [Slicers](Slicers.md), aby uzyskać informacje na temat konfigurowania slicera za pomocą programu Klipper.
pt: Este guia pretende ajudar na verificação básica das configurações de pinos no ficheiro de configuração do Klipper. Certifique-se de ler o guia de [nivelamento da cama](Bed_Level.md). Veja também o documento [Fatiadores](Slicers.md) para informações sobre como configurar um fatiador com o Klipper.
pt_br: Este guia tem como objetivo ajudar na verificação básica das configurações dos pinos no arquivo de configuração do Klipper. Certifique-se de ler o guia [nivelamento da base](Bed_Level.md). Consulte também o documento [Fatiadores](Slicers.md) para obter informações sobre como configurar apropriadamente um fatiador (ou slicer, em inglês) com Klipper.
sk: Táto príručka je určená na pomoc so základným overením nastavení pinov v konfiguračnom súbore Klipper. Nezabudnite si prečítať príručku [vyrovnanie postele](Bed_Level.md). Pozrite si tiež dokument [Slicers](Slicers.md), kde nájdete informácie o konfigurácii filtra pomocou Klipper.
tr: Bu kılavuz, Klipper konfigürasyon dosyasındaki pin ayarlarının temel doğrulamasına yardımcı olmayı amaçlamaktadır. [Yatak düzeyleme](Bed_Level.md) kılavuzunu mutlaka okuyunuz. Ayrıca Klipper ile dilimleyici yapılandırma hakkında bilgi sahibi olmak için [Dilimleyiciler](Slicers.md) dokümanına bakınız.
zh_hans: 本指南旨在帮助对 Klipper 配置文件中的引脚设置进行基本验证。 请务必阅读 [床位调平](Bed_Level.md) 指南。 另请参阅 [Slicers](Slicers.md) 文档，了解有关使用 Klipper 配置切片器的信息。
zh_hant: 本指南旨在幫助對 Klipper 配置檔案中的引腳設定進行基本驗證。 請務必閱讀 [床位調平](Bed_Level.md) 指南。 另請參閱 [Slicers](Slicers.md) 文件，瞭解有關使用 Klipper 配置切片器的資訊。

source: After one has verified that basic printing works, it is a good idea to consider calibrating [pressure advance](Pressure_Advance.md).
bg: След като сте се уверили, че основният печат работи, е добре да помислите за калибриране на [аванс на налягането](Pressure_Advance.md).
de: Nachdem man sich vergewissert hat, dass der Grunddruck funktioniert, sollte man eine Kalibrierung der [Druckweiterschaltung](Pressure_Advance.md) in Betracht ziehen.
es: Después de haber verificado que la impresión básica funciona, es una buena idea el considerar calibrar el [Avance de presión](Pressure_Advance.md).
fr: Après avoir vérifié que l'impression de base fonctionne, il est bon d'envisager de calibrer [l'avance de pression](Pressure_Advance.md).
hu: Miután meggyőződtünk arról, hogy az alapnyomtatás működik, érdemes megfontolni a [nyomás előtolás](Pressure_Advance.md) kalibrálását.
ko: 기본 인쇄가 작동하는지 확인한 후 [pressure advance](Pressure_Advance.md)보정을 고려하는 것이 좋습니다.
pl: Po sprawdzeniu, że podstawowe drukowanie działa, warto rozważyć kalibrację [pressure advance] (Pressure_Advance.md).
pt: Depois de verificar que a impressão básica funciona, é uma boa ideia considerar a calibração do [avanço de pressão](Pressure_Advance.md).
pt_br: Depois de verificar se o básico da impressão funciona, é uma boa ideia considerar a calibração [avanço da pressão (pressure advance, em inglês)](Pressure_Advance.md).
sk: Po overení, že základná tlač funguje, je dobré zvážiť kalibráciu [pressure advance] (Pressure_Advance.md).
tr: Temel yazdırma işleminin çalıştığı doğrulandıktan sonra [basınç avansını](Pressure_Advance.md) kalibre etmeyi değerlendirmek iyi bir fikir olacaktır.
zh_hans: 在验证基本打印工作后，最好考虑校准 [压力提前](Pressure_Advance.md)。
zh_hant: 在驗證基本列印工作后，最好考慮校準 [壓力提前](Pressure_Advance.md)。

source: It may be necessary to perform other types of detailed printer calibration - a number of guides are available online to help with this (for example, do a web search for "3d printer calibration"). As an example, if you experience the effect called ringing, you may try following [resonance compensation](Resonance_Compensation.md) tuning guide.
bg: Възможно е да се наложи да извършите други видове подробна калибрация на принтера - в интернет има редица ръководства, които помагат за това (например, потърсете в интернет "3d printer calibration"). Като пример, ако изпитвате ефекта, наречен звънене, можете да опитате да следвате ръководството за настройка [Resonance compensation](Resonance_Compensation.md).
de: Es kann notwendig sein, andere Arten der detaillierten Druckerkalibrierung durchzuführen - eine Reihe von Anleitungen sind online verfügbar, um dabei zu helfen (führen Sie z. B. eine Websuche nach "3d printer calibration" durch). Wenn Sie z. B. den Effekt "Klingeln" feststellen, können Sie versuchen, die Abstimmungsanleitung [Resonanzkompensation](Resonance_Compensation.md) zu befolgen.
es: Puede ser necesario el realizar otros tipos de calibración detallada de la impresora - un número de guías están disponibles en línea para ayudar con esto (por ejemplo, realice una búsqueda web de "calibración de impresora 3d"). Como un ejemplo, si experimenta el efecto llamado "ringing", puede probar seguir la guía de ajuste de la [Compensación de Resonancia](Resonance_Compensation.md).
fr: Il peut être nécessaire d'effectuer d'autres types de calibrage détaillé de l'imprimante - un certain nombre de guides sont disponibles en ligne pour vous aider (par exemple, faites une recherche sur le Web pour "3d printer calibration"). Par exemple, si vous rencontrez un effet appelé "ringing", vous pouvez essayer de suivre le guide de réglage de la [compensation de résonance](Resonance_Compensation.md).
hu: Előfordulhat, hogy más típusú részletes nyomtató-kalibrálásra is szükség lehet. Ehhez számos útmutató áll rendelkezésre az interneten (keress rá például a "3d nyomtató kalibrálás" szövegre). Ha például a gyűrődésnek nevezett hatást tapasztalod, megpróbálhatod követni a [rezonancia kompenzáció](Resonance_Compensation.md) hangolási útmutatót.
ko: 다른 유형의 자세한 프린터 보정을 수행해야 할 수도 있습니다. 이를 돕기 위해 온라인에서 여러 가이드를 사용할 수 있습니다(예: "3d 프린터 보정"에 대한 웹 검색 수행). 예를 들어 링잉(ringing)이라는 효과가 발생한다면 [resonance compensation](Resonance_Compensation.md) 튜닝 가이드를 따라 해보시면 됩니다.
pl: Może być konieczne przeprowadzenie innych rodzajów szczegółowej kalibracji drukarki - w sieci dostępnych jest wiele poradników, które w tym pomogą (na przykład wyszukaj w Internecie hasło "3d printer calibration"). Na przykład, jeśli doświadczasz efektu zwanego dzwonieniem, możesz spróbować zastosować się do instrukcji strojenia [Kompensacja rezonansu](Resonance_Compensation.md).
pt: Pode ser necessário realizar outros tipos de calibração detalhada da impressora - existem vários guias disponíveis online para ajudar com isso (por exemplo, faça uma pesquisa na web por "calibração de impressora 3D"). Como exemplo, se você experimentar o efeito chamado 'ringing', você pode tentar seguir o guia de ajuste de [resonance compensation](Resonance_Compensation.md).
pt_br: Pode ser necessário realizar outros tipos de calibração detalhada da impressora - vários guias estão disponíveis online para ajudar lhe com isso (por exemplo, faça uma pesquisa na web por "calibração da impressora 3D" ou "3d printer calibration"). Por exemplo, se você perceber o efeito chamado "ringing" (também conhecido como “ghosting” ou “ripples”), você pode tentar seguir o guia de ajuste [compensação de ressonância (resonance compensation, em inglês)](Resonance_Compensation.md).
sk: Možno bude potrebné vykonať iné typy podrobnej kalibrácie tlačiarne – online je k dispozícii množstvo príručiek, ktoré vám s tým pomôžu (napríklad vyhľadajte na webe výraz „kalibrácia 3D tlačiarne“). Ak napríklad pocítite efekt nazývaný zvonenie, môžete skúsiť postupovať podľa sprievodcu ladením [kompenzácia rezonancie](Resonance_Compensation.md).
tr: Başka detaylı yazıcı kalibrasyonu tiplerinin uygulanmasına ihtiyaç duyulabilir - bu konuda destek alınabilecek online kılavuzlar mevcuttur (mesela, webde şunu aratın: "üç boyutlu yazıcı kalibrasyonu"). Örnek olarak, ringing denen etki ile karşılaşırsanız [rezonans dengeleme](Resonance_Compensation.md) ayar kılavuzunu takip edebilirsiniz.
zh_hans: 可能需要执行其他类型的详细打印机校准 - 网络上提供了许多指南来帮助解决此问题（例如，在网络上搜索“3d 打印机校准”）。 例如，如果您遇到称为振铃的效果，您可以尝试遵循 [共振补偿](Resonance_Compensation.md) 调谐指南。
zh_hant: 可能需要執行其他型別的詳細印表機校準 - 網路上提供了許多指南來幫助解決此問題（例如，在網路上搜索「3d 印表機校準」）。 例如，如果您遇到稱為振鈴的效果，您可以嘗試遵循 [共振補償](Resonance_Compensation.md) 調諧指南。

source: Configuration checks
bg: Проверки на конфигурацията
es: Verificación de Configuración
hu: Konfigurációs ellenőrzések
ko: 구성 확인
pl: Kontrola konfiguracji
pt: Verificações de Configuração
pt_br: Verificações de configuração
sk: Kontroly konfigurácie
tr: Konfigürasyon denetimi
zh_hans: 配置检查
zh_hant: 配置檢查

source: Klipper supports [PID control](https://en.wikipedia.org/wiki/PID_controller) for the extruder and bed heaters. In order to use this control mechanism, it is necessary to calibrate the PID settings on each printer (PID settings found in other firmwares or in the example configuration files often work poorly).
bg: Klipper поддържа [PID контрол](https://en.wikipedia.org/wiki/PID_controller) за екструдера и нагревателите на леглото. За да се използва този механизъм за управление, е необходимо да се калибрират PID настройките на всеки принтер (PID настройките, намерени в други фърмуери или в примерните конфигурационни файлове, често работят лошо).
es: Klipper soporta [controladores PID](https://es.wikipedia.org/wiki/Controlador_PID) para el extrusor y calienta camas. Para usar este mecanismo de control, es necesario calibrar los ajustes PID en cada impresora (Los ajustes PID de otros firmwares y los de los archivos de configuracion de ejemplo trabajan pobremente).
hu: A Klipper támogatja a [PID-szabályozást](https://hu.wikipedia.org/wiki/PID_szab%C3%A1lyoz%C3%B3) az extruder és a tárgyasztal fűtés számára. Ahhoz, hogy ezt a vezérlési mechanizmust használni lehessen, a PID-beállításokat minden nyomtatónál kalibrálni kell (a más firmware-ekben vagy a példakonfigurációs fájlokban található PID-beállítások gyakran rosszul működnek).
pt: O Klipper suporta o [controle PID](https://en.wikipedia.org/wiki/PID_controller) para os aquecedores do extrusor e da cama. Para utilizar este mecanismo de controle, é necessário calibrar as configurações PID em cada impressora (as configurações PID encontradas em outros firmwares ou nos ficheiros de configuração de exemplo muitas vezes funcionam mal).
sk: Klipper podporuje [PID ovládanie](https://en.wikipedia.org/wiki/PID_controller) pre extrudér a ohrievače lôžka. Aby bolo možné použiť tento riadiaci mechanizmus, je potrebné kalibrovať nastavenia PID na každej tlačiarni (nastavenia PID nachádzajúce sa v iných firmvéroch alebo v príkladoch konfiguračných súborov často fungujú zle).
tr: Klipper, ekstrüder ve baskı yatağı ısıtıcıları için [PID kontrolünü](https://en.wikipedia.org/wiki/PID_controller) destekler. Bu kontrol mekanizmasını kullanmak için PID ayarları her yazıcı için ayrıca kalibre edilmelidir (diğer aygıt yazılımlarında veya örnek konfigürasyon dosyalarında bulunan PID ayarları genellikle kötü bir performans sergiler).
zh_hant: Klipper支援擠出機和熱床加熱器的[PID控制](https://en.wikipedia.org/wiki/PID_controller)。爲了使用這種控制機制，必須對每臺印表機的 PID 參數進行校準（在其他韌體或示例配置檔案中找到的 PID 設定往往效果不佳）。

source: Start by verifying that temperatures are being properly reported. Navigate to the temperature graph section in the user interface. Verify that the temperature of the nozzle and bed (if applicable) are present and not increasing. If it is increasing, remove power from the printer. If the temperatures are not accurate, review the "sensor_type" and "sensor_pin" settings for the nozzle and/or bed.
es: Comience por verificar que las temperaturas se están notificando correctamente. Vaya a la sección del gráfico de temperatura en la interfaz de usuario. Verifique que la temperatura de la boquilla y la cama (si procede) están presentes y no están aumentando. Si está aumentando, desconecte la alimentación de la impresora. Si las temperaturas no son precisas, revise los ajustes "sensor_type" y "sensor_pin" para la boquilla y/o la cama.
hu: Kezd annak ellenőrzésével, hogy a hőmérsékletek megfelelően jelennek-e meg. Navigálj a felhasználói felület hőmérsékletgrafikon szakaszához. Ellenőrizd, hogy a fúvóka és az ágy hőmérséklete (ha van ilyen) jelen van-e, és nem emelkedik-e. Ha növekszik, kapcsold le a nyomtató tápellátását. Ha a hőmérsékletek nem pontosak, vizsgáld felül a fúvóka és/vagy az ágy "sensor_type" és "sensor_pin" beállításait.
pt: Comece por verificar se as temperaturas estão a ser corretamente comunicadas. Navegue até à secção do gráfico de temperatura na interface do utilizador. Verifique se a temperatura do bocal e da base (se aplicável) está presente e não está a aumentar. Se estiver a aumentar, desligue a impressora. Se as temperaturas não forem exatas, reveja as definições "sensor_type" e "sensor_pin" do bocal e/ou da base.
sk: Začnite tým, že si overíte, či sú teploty správne hlásené. Prejdite do časti grafu teploty v používateľskom rozhraní. Skontrolujte, či je teplota dýzy a lôžka (ak je k dispozícii) prítomná a nezvyšuje sa. Ak sa zvyšuje, odpojte tlačiareň od napájania. Ak teploty nie sú presné, skontrolujte nastavenia „sensor_type“ a „sensor_pin“ pre trysku a/alebo lôžko.

source: Navigate to the command console and issue an M112 command in the terminal box. This command requests Klipper to go into a "shutdown" state. It will cause an error to show, which can be cleared with a FIRMWARE_RESTART command in the command console. Octoprint will also require a reconnect. Then navigate to the temperature graph section and verify that temperatures continue to update and the temperatures are not increasing. If temperatures are increasing, remove power from the printer.
es: Navegue a la consola de comandos y escribe un comando M112 en el cuadro de terminal. Este comando solicita que Klipper entre en un estado de "apagado". Se mostrará un error, que puede ser borrado con un comando FIRMWARE_RESTART en la consola de comandos. Octoprint también requerirá una reconexión. A continuación, vaya a la sección del gráfico de temperatura y compruebe que las temperaturas siguen actualizándose y que no están aumentando. Si las temperaturas están aumentando, desconecte la alimentación de la impresora.
hu: Navigálj a parancskonzolra, és adj ki egy M112 parancsot a terminálmezőben. Ez a parancs arra kéri a Klippert, hogy "leállási" állapotba kerüljön. Ez egy hiba megjelenését okozza, amely a FIRMWARE_RESTART paranccsal törölhető a parancskonzolon. Az Octoprint is újrakapcsolást fog kérni. Ezután navigálj a hőmérsékleti grafikon részhez, és ellenőrizd, hogy a hőmérsékletek továbbra is frissülnek, és a hőmérsékletek nem emelkednek. Ha a hőmérsékletek emelkednek, kapcsold ki a nyomtató tápellátását.
pt: Navegue para a consola de comando e emita um comando M112 na caixa de terminal. Este comando pede ao Klipper para entrar num estado de "encerramento". Isto provocará um erro que pode ser apagado com um comando FIRMWARE_RESTART na consola de comando. O Octoprint também requererá uma nova ligação. Depois navegue para a secção do gráfico de temperatura e verifique que as temperaturas continuam a ser atualizadas e não estão a aumentar. Se as temperaturas estão a aumentar, desligue a impressora.
sk: Prejdite na príkazovú konzolu a zadajte príkaz M112 v svorkovnici. Tento príkaz požaduje, aby Klipper prešiel do stavu „vypnutia“. Spôsobí to zobrazenie chyby, ktorú možno vymazať príkazom FIRMWARE_RESTART v príkazovej konzole. Octoprint bude tiež vyžadovať opätovné pripojenie. Potom prejdite do sekcie teplotného grafu a overte, či sa teploty naďalej aktualizujú a teploty sa nezvyšujú. Ak sa teplota zvyšuje, odpojte tlačiareň od napájania.
