Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Config_Reference.po
Languages: fr, zh_hans

source: [tmc2209 stepper_x] uart_pin: #tx_pin: #select_pins: #interpolate: True run_current: #hold_current: #sense_resistor: 0.110 #stealthchop_threshold: 0 # See the "tmc2208" section for the definition of these parameters. #uart_address: # The address of the TMC2209 chip for UART messages (an integer # between 0 and 3). This is typically used when multiple TMC2209 # chips are connected to the same UART pin. The default is zero. #driver_IHOLDDELAY: 8 #driver_TPOWERDOWN: 20 #driver_TBL: 2 #driver_TOFF: 3 #driver_HEND: 0 #driver_HSTRT: 5 #driver_PWM_AUTOGRAD: True #driver_PWM_AUTOSCALE: True #driver_PWM_LIM: 12 #driver_PWM_REG: 8 #driver_PWM_FREQ: 1 #driver_PWM_GRAD: 14 #driver_PWM_OFS: 36 #driver_SGTHRS: 0 # Set the given register during the configuration of the TMC2209 # chip. This may be used to set custom motor parameters. The # defaults for each parameter are next to the parameter name in the # above list. #diag_pin: # The micro-controller pin attached to the DIAG line of the TMC2209 # chip. The pin is normally prefaced with "^" to enable a pullup. # Setting this creates a "tmc2209_stepper_x:virtual_endstop" virtual # pin which may be used as the stepper's endstop_pin. Doing this # enables "sensorless homing". (Be sure to also set driver_SGTHRS to # an appropriate sensitivity value.) The default is to not enable # sensorless homing.
fr: [tmc2209 stepper_x] uart_pin: #tx_pin #select_pins: #interpolate: True run_current: #hold_current: #sense_resistor: 0.110 #stealthchop_threshold: 0 # Voir la section "tmc2208" pour la définition de ces paramètres. #uart_address: # L'adresse de la puce TMC2209 pour les messages UART (un entier entre 0 et 3). # entre 0 et 3). Ce paramètre est généralement utilisé lorsque plusieurs puces TMC2209 # sont connectées à la même broche UART. La valeur par défaut est zéro. #driver_IHOLDDELAY: 8 #driver_TPOWERDOWN: 20 #driver_TBL: 2 #driver_TOFF: 3 #driver_HEND: 0 #driver_HSTRT: 5 #driver_PWM_AUTOGRAD: True #driver_PWM_AUTOSCALE: True #driver_PWM_LIM: 12 #driver_PWM_REG: 8 #driver_PWM_FREQ: 1 #driver_PWM_GRAD: 14 #driver_PWM_OFS: 36 #driver_SGTHRS: 0 # Définir le registre donné pendant la configuration de la puce TMC2209. # Ceci peut être utilisé pour définir les paramètres personnalisés du moteur. Les valeurs par défaut de # chaque paramètre sont indiquées à côté du nom du paramètre dans la liste ci-dessus. #diag_pin: # La broche du microcontrôleur reliée à la ligne DIAG de la puce TMC2209. # La broche est normalement précédée de "^" pour activer un pullup. # Le paramétrage de cette broche crée une broche virtuelle "tmc2209_stepper_x:virtual_endstop" # pouvant être utilisée comme broche d'arrêt du stepper. Ainsi cela active le "sensorless homing". # (Assurez-vous de définir également driver_SGTHRS à une valeur de sensibilité appropriée). # La valeur par défaut est de ne pas activer la recherche d'origine sans capteur.
zh_hans: [tmc2209 stepper_x] uart_pin: #tx_pin: #select_pins: #interpolate: True run_current: #hold_current: #sense_resistor: 0.110 #stealthchop_threshold: 0 # 以上参数见"tmc2208"部分 #uart_address: # TMC2209的UART地址（0-3的整数） # 这个参数通常用于多个TMC2209连接到同个UART接口 # 默认是0 #driver_IHOLDDELAY: 8 #driver_TPOWERDOWN: 20 #driver_TBL: 2 #driver_TOFF: 3 #driver_HEND: 0 #driver_HSTRT: 5 #driver_PWM_AUTOGRAD: True #driver_PWM_AUTOSCALE: True #driver_PWM_LIM: 12 #driver_PWM_REG: 8 #driver_PWM_FREQ: 1 #driver_PWM_GRAD: 14 #driver_PWM_OFS: 36 #driver_SGTHRS: 0 # 配置TMC2209时配置的寄存器 # 这些参数通常用于设定自己定制的电机参数 # 每个参数的默认值如上 #diag_pin: # 微控制器连接到TMC2209的DIAG接口的引脚 # 这个引脚通常使用"^"前缀来开启内部上拉 # 设置这个会创建一个名为"tmc2209_stepper_x:virtual_endstop"的虚拟引脚 # 用做步进电机的终止引脚。 # 在启动"sensorless homing"（无限位归零）时设置这个。 # （确保同时设置了driver_SGTHRS为一个合适的灵敏度） # 默认是关闭了无限位归零

source: [ad5206 my_digipot] enable_pin: # The pin corresponding to the AD5206 chip select line. This pin # will be set to low at the start of SPI messages and raised to high # after the message completes. This parameter must be provided. #spi_speed: #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # See the "common SPI settings" section for a description of the # above parameters. #channel_1: #channel_2: #channel_3: #channel_4: #channel_5: #channel_6: # The value to statically set the given AD5206 channel to. This is # typically set to a number between 0.0 and 1.0 with 1.0 being the # highest resistance and 0.0 being the lowest resistance. However, # the range may be changed with the 'scale' parameter (see below). # If a channel is not specified then it is left unconfigured. #scale: # This parameter can be used to alter how the 'channel_x' parameters # are interpreted. If provided, then the 'channel_x' parameters # should be between 0.0 and 'scale'. This may be useful when the # AD5206 is used to set stepper voltage references. The 'scale' can # be set to the equivalent stepper amperage if the AD5206 were at # its highest resistance, and then the 'channel_x' parameters can be # specified using the desired amperage value for the stepper. The # default is to not scale the 'channel_x' parameters.
fr: [ad5206 my_digipot] enable_pin: # La broche correspondant à la ligne de sélection de la puce AD5206. Cette broche # sera réglée à un niveau bas au début des messages SPI et sera relevée à un niveau élevé # après la fin du message. Ce paramètre doit être fourni. #spi_speed: #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # Voir la section "paramètres communs SPI" pour une description des paramètres ci-dessus. # #channel_1: #channel_2: #channel_3: #channel_4: #channel_5: #channel_6: # La valeur pour définir statiquement le canal AD5206 donné. Cette valeur est # généralement définie sur un nombre compris entre 0,0 et 1,0. 1,0 étant la résistance # la plus élevée et 0,0 la résistance la plus faible. Cependant, la plage peut être # modifiée à l'aide du paramètre 'scale' (voir ci-dessous). # Si un canal n'est pas spécifié, il n'est pas configuré. # scale: # Ce paramètre peut être utilisé pour modifier l'interprétation des paramètres 'channel_x'. # S'il est fourni, alors les paramètres 'channel_x' doivent être compris entre 0.0 et 'scale'. # Cela peut être utile lorsque le AD5206 est utilisé pour définir des références de tension # pas à pas. L''échelle' peut être réglée sur l'intensité équivalente de la commande pas à pas # si l'AD5206 était à sa résistance la plus élevée, puis les paramètres 'channel_x' peuvent être # spécifiés en utilisant la valeur d'intensité désirée pour le pilote pas à pas. La configuration # par défaut est de ne pas mettre à l'échelle les paramètres 'channel_x'.
zh_hans: [ad5206 my_digipot] enable_pin: # 对应AD5206 芯片选择(chip select)线路的引脚。这个引脚将 # 在 SPI 消息开始时拉低，并在消息结束后拉高。必须提供 # 这个参数。 #spi_speed: #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # 以上参数的定义请查看 "常规 SPI 设置" 章节 #channel_1: #channel_2: #channel_3: #channel_4: #channel_5: #channel_6: # 设置AD5206通道的静态值。通常在0.0和1.0之间，1.0为最高 # 电阻，而0.0为最低电阻。然而，这个范围也可以被 ‘scale’ 参 # 数配置。（见下文）如果一个通道没有参数则它不会被配置。 #scale: # 这个参数可以用来修改 ‘channel_x’ 参数的定义。如被提供， # 则 ‘channel_x’ 的范围会在 0.0 和 ‘scale’ 之间。在 AD5206 被作 # 为步进电机参考电压时可能很有帮助。当AD5206在最高电阻时 # ‘scale’ 可以被设置为步进电机的电流， 然后 ‘channel_x’ 参数可 # 以设置为步进电机的期望电流安培。默认为不对 'channel_x' 参 # 数进行缩放。

source: [mcp4451 my_digipot] i2c_address: # The i2c address that the chip is using on the i2c bus. This # parameter must be provided. #i2c_mcu: #i2c_bus: #i2c_speed: # See the "common I2C settings" section for a description of the # above parameters. #wiper_0: #wiper_1: #wiper_2: #wiper_3: # The value to statically set the given MCP4451 "wiper" to. This is # typically set to a number between 0.0 and 1.0 with 1.0 being the # highest resistance and 0.0 being the lowest resistance. However, # the range may be changed with the 'scale' parameter (see below). # If a wiper is not specified then it is left unconfigured. #scale: # This parameter can be used to alter how the 'wiper_x' parameters # are interpreted. If provided, then the 'wiper_x' parameters should # be between 0.0 and 'scale'. This may be useful when the MCP4451 is # used to set stepper voltage references. The 'scale' can be set to # the equivalent stepper amperage if the MCP4451 were at its highest # resistance, and then the 'wiper_x' parameters can be specified # using the desired amperage value for the stepper. The default is # to not scale the 'wiper_x' parameters.
fr: [mcp4451 mon_digipot] i2c_address: # L'adresse i2c que la puce utilise sur le bus i2c. Ce paramètre # doit être fourni. #i2c_mcu: #i2c_bus: #i2c_speed: # Voir la section "paramètres I2C communs" pour une description des # paramètres ci-dessus. #wiper_0: #wiper_1: #wiper_2: #wiper_3: # La valeur pour définir statiquement le "wiper" MCP4451 donné. Cette valeur est # généralement réglée sur un nombre compris entre 0.0 et 1.0, 1.0 étant la résistance # la plus élevée et 0.0 la résistance la plus faible. Cependant, la plage peut être modifiée # à l'aide du paramètre 'scale' (voir ci-dessous). Si un wiper n'est pas spécifié, il n'est # pas configuré. #scale: # Ce paramètre peut être utilisé pour modifier l'interprétation des paramètres 'wiper_x'. # S'il est fourni, alors les paramètres 'wiper_x' doivent être compris entre 0,0 et 'scale'. # Ceci peut être utile lorsque le MCP4451 est utilisé pour définir des références de tension # du pilote pas à pas.L''échelle' peut être réglée sur l'intensité du pilote pas à pas équivalent # si le MCP4451 était à sa résistance la plus élevée, puis les paramètres 'wiper_x' peuvent # être spécifiés en utilisant la valeur d'intensité désirée pour le pilote pas à pas. La valeur # par défaut est de ne pas mettre à l'échelle les paramètres 'wiper_x'.
zh_hans: [mcp4451 my_digipot] i2c_address: # 芯片在i2c总线上使用的i2c地址。 # 必须提供此参数。 #i2c_mcu: #i2c_bus: #i2c_speed: # 参见"常见I2C设置"部分以获取上述参数的描述。 #wiper_0: #wiper_1: #wiper_2: #wiper_3: # 静态设置给定MCP4451 "wiper"的值。这通常设置为0.0到1.0之间的 # 数字，其中1.0是最高阻值，0.0是最低阻值。然而，可以用'scale'参 # 数（见下文）改变范围。 # 如果没有指定wiper，则不对其进行配置。 #scale: # 此参数可用于改变对'wiper_x'参数的解释。如果提供了此参数， # 那么'wiper_x'参数应在0.0和'scale'之间。当MCP4451用于设置步进电 # 压引用时，这可能很有用。'scale'可以设置为当MCP4451处于最高阻 # 值时的等效步进电流，然后可以使用步进电机所需的电流值来指定 # 'wiper_x'参数。 # 默认不对'wiper_x'参数进行缩放。

source: [mcp4728 my_dac] #i2c_address: 96 # The i2c address that the chip is using on the i2c bus. The default # is 96. #i2c_mcu: #i2c_bus: #i2c_speed: # See the "common I2C settings" section for a description of the # above parameters. #channel_a: #channel_b: #channel_c: #channel_d: # The value to statically set the given MCP4728 channel to. This is # typically set to a number between 0.0 and 1.0 with 1.0 being the # highest voltage (2.048V) and 0.0 being the lowest voltage. # However, the range may be changed with the 'scale' parameter (see # below). If a channel is not specified then it is left # unconfigured. #scale: # This parameter can be used to alter how the 'channel_x' parameters # are interpreted. If provided, then the 'channel_x' parameters # should be between 0.0 and 'scale'. This may be useful when the # MCP4728 is used to set stepper voltage references. The 'scale' can # be set to the equivalent stepper amperage if the MCP4728 were at # its highest voltage (2.048V), and then the 'channel_x' parameters # can be specified using the desired amperage value for the # stepper. The default is to not scale the 'channel_x' parameters.
fr: [mcp4728 my_dac] #i2c_address: 96 # L'adresse i2c que la puce utilise sur le bus i2c. La valeur par défaut # est 96. #i2c_mcu: #i2c_bus: #i2c_speed: # Voir la section "paramètres I2C communs" pour une description des # paramètres ci-dessus. #channel_a: #channel_b: #channel_c: #channel_d: # La valeur pour définir statiquement le canal MCP4728 donné. Ceci est # généralement définie par un nombre compris entre 0.0 et 1.0, 1.0 représentant # la tension la plus élevée (2.048V) et 0.0 la tension la plus basse. # Cependant, la plage peut être modifiée à l'aide du paramètre 'scale' (cf. # ci-dessous). Si un canal n'est pas spécifié, il n'est pas configuré. #scale: # Ce paramètre peut être utilisé pour modifier l'interprétation des paramètres 'channel_x'. # S'il est fourni, le paramètre 'channel_x' doit être compris entre 0,0 et 'scale'. # Cela peut être utile lorsque le MCP4728 est utilisé pour définir des références de tension # de moteur pas à pas. L''échelle' peut être réglée sur l'intensité équivalente de la commande # de moteur pas à pas si le MCP4728 était à sa tension la plus élevée (2.048V), et ensuite les # paramètres 'channel_x' peuvent être spécifiés en utilisant l'intensité désirée pour le # moteur pas à pas. La valeur par défaut est de ne pas mettre à l'échelle les # paramètres 'channel_x'.
zh_hans: [mcp4728 my_dac] #i2c_address: 96 # 芯片在I2C总线上使用的地址。 # 默认为96。 #i2c_mcu: #i2c_bus: #i2c_speed: # 以上参数请见“常见的I2C设置” #channel_a: #channel_b: #channel_c: #channel_d: # 设置 MCP4728 通道为给定的静态值。通常它被设置为一个在 # 0.0和1.0之间，1.0代表最高电压（2.048V）而0.0代表最低电压。 # 然而，该范围可以被'scale'（ 缩放）参数改变（见下文）。没有给 # 定值的通道不会被配置。 #scale: # 该参数可以改变'channel_x'参数被解释的方式。如果设定了该参数， # 'channel_x'参数的范围会在0.0 和 'scale'之间。该功能在使用MCP4728 产生 # 步进电机参考电压时可能有用。The 'scale' can # be set to the equivalent stepper amperage if the MCP4728 were at # its highest voltage (2.048V), and then the 'channel_x' parameters # can be specified using the desired amperage value for the # stepper.默认不对channel_x'参数进行缩放。

source: [mcp4018 my_digipot] scl_pin: # The SCL "clock" pin. This parameter must be provided. sda_pin: # The SDA "data" pin. This parameter must be provided. wiper: # The value to statically set the given MCP4018 "wiper" to. This is # typically set to a number between 0.0 and 1.0 with 1.0 being the # highest resistance and 0.0 being the lowest resistance. However, # the range may be changed with the 'scale' parameter (see below). # This parameter must be provided. #scale: # This parameter can be used to alter how the 'wiper' parameter is # interpreted. If provided, then the 'wiper' parameter should be # between 0.0 and 'scale'. This may be useful when the MCP4018 is # used to set stepper voltage references. The 'scale' can be set to # the equivalent stepper amperage if the MCP4018 is at its highest # resistance, and then the 'wiper' parameter can be specified using # the desired amperage value for the stepper. The default is to not # scale the 'wiper' parameter.
fr: [mcp4018 my_digipot] scl_pin: # La broche d'horloge SCL. Ce paramètre doit être fourni. sda_pin: # La broche de "données" SDA. Ce paramètre doit être fourni. wiper: # La valeur à laquelle définir statiquement le "wiper" MCP4018 donné. Ce paramètre est # généralement réglée sur un nombre compris entre 0,0 et 1,0, 1,0 étant la résistance # la plus élevée et 0.0 la résistance la plus faible. Cependant, la plage peut être modifiée à # l'aide du paramètre 'scale' (voir ci-dessous). Ce paramètre doit être fourni. #scale: # Ce paramètre peut être utilisé pour modifier l'interprétation du paramètre 'wiper'. # S'il est fourni, le paramètre 'wiper' doit se situer entre 0,0 et 'scale'. Ceci peut être utile # lorsque le MCP4018 est utilisé pour définir des références de tension pas à pas. # L''échelle' peut être réglée sur l'intensité du pilote pas à pas équivalent si le MCP4018 # est à sa plus grande# résistance la plus élevée, puis le paramètre 'wiper' peut être spécifié # en utilisant la valeur d'intensité désirée pour le pilote pas à pas. La valeur par défaut est # de ne pas mettre à l'échelle le paramètre 'wiper'.
zh_hans: [mcp4018 my_digipot] scl_pin: # SCL "时钟"引脚。 # 必须提供此参数。 sda_pin: # SDA "数据"引脚。 # 必须提供此参数。 wiper: # 静态设置给定MCP4018 "wiper"的值。这通常设置为0.0到1.0之间 # 的数字，其中1.0是最高阻值，0.0是最低阻值。然而，可以用 # 'scale'参数（见下文）改变范围。 # 必须提供此参数。 #scale: # 此参数可用于改变对'wiper'参数的解释。如果提供了此参数， # 那么'wiper'参数应在0.0和'scale'之间。当MCP4018用于设置步进 # 电压引用时，这可能很有用。'scale'可以设置为当MCP4018处于 # 最高阻值时的等效步进电流，然后可以使用步进电机所需的电 # 流值来指定'wiper'参数。 # 默认不对'wiper'参数进行缩放。

source: [display] lcd_type: hd44780 # Set to "hd44780" for hd44780 displays. rs_pin: e_pin: d4_pin: d5_pin: d6_pin: d7_pin: # The pins connected to an hd44780 type lcd. These parameters must # be provided. #hd44780_protocol_init: True # Perform 8-bit/4-bit protocol initialization on an hd44780 display. # This is necessary on real hd44780 devices. However, one may need # to disable this on some "clone" devices. The default is True. #line_length: # Set the number of characters per line for an hd44780 type lcd. # Possible values are 20 (default) and 16. The number of lines is # fixed to 4. ...
fr: [display] lcd_type: hd44780 # Définir à "hd44780" pour les écrans hd44780. rs_pin: e_pin: d4_pin: d5_pin: d6_pin: d7_pin: # Broches connectées à un lcd de type hd44780. Ces paramètres doivent # être fournis. #hd44780_protocol_init: True # Effectuer l'initialisation du protocole 8-bit/4-bit sur un écran hd44780. # Ceci est nécessaire sur les vrais dispositifs hd44780. Cependant, on peut avoir besoin # de le désactiver avec certains périphériques "clones". La valeur par défaut est True. #line_length: # Définit le nombre de caractères par ligne pour un lcd de type hd44780. # Les valeurs possibles sont 20 (par défaut) et 16. Le nombre de lignes est # fixé à 4. ...
zh_hans: [display] lcd_type: hd44780 # 对于hd44780显示屏，填写 "hd44780"。 rs_pin: e_pin: d4_pin: d5_pin: d6_pin: d7_pin: # 连接到hd44780 类LCD的引脚。 # 必须提供这些参数 #hd44780_protocol_init: True # 在一个 hd44780 显示器上执行 8-bit/4-bit 协议初始化。对于所有 # 正版的 hd44780 设备，这是必须的。但是，在一些克隆的设备上 # 可能需要禁用。 # 默认为True（启用）。 #line_length: # 设置 hd44780 类LCD 每行显示的字符数。可能的数值有20（默认） # 和16。行数被锁定为4行。 ...

source: [display] lcd_type: hd44780_spi # Set to "hd44780_spi" for hd44780_spi displays. latch_pin: spi_software_sclk_pin: spi_software_mosi_pin: spi_software_miso_pin: # The pins connected to the shift register controlling the display. # The spi_software_miso_pin needs to be set to an unused pin of the # printer mainboard as the shift register does not have a MISO pin, # but the software spi implementation requires this pin to be # configured. #hd44780_protocol_init: True # Perform 8-bit/4-bit protocol initialization on an hd44780 display. # This is necessary on real hd44780 devices. However, one may need # to disable this on some "clone" devices. The default is True. #line_length: # Set the number of characters per line for an hd44780 type lcd. # Possible values are 20 (default) and 16. The number of lines is # fixed to 4. ...
fr: [display] lcd_type: hd44780_spi # Définir à "hd44780_spi" pour les écrans hd44780_spi. latch_pin: spi_software_sclk_pin: spi_software_mosi_pin: spi_software_miso_pin: # Broches connectées au registre à décalage contrôlant l'affichage. # La broche spi_software_miso_pin doit être définie sur une broche inutilisée # de la carte mère de l'imprimante, car le registre à décalage contrôlant l'affichage # n'a pas de broche MISO, mais l'implémentation logicielle de spi nécessite que # cette broche soit configurée. #hd44780_protocol_init: True # Effectue l'initialisation du protocole 8-bit/4-bit sur un écran hd44780. # Ceci est nécessaire sur les vrais dispositifs hd44780. Cependant, on peut avoir besoin # de le désactiver avec certains périphériques "clones". La valeur par défaut est True. #line_length: # Définit le nombre de caractères par ligne pour un lcd de type hd44780. # Les valeurs possibles sont 20 (par défaut) et 16. Le nombre de lignes est # fixé à 4. ...
zh_hans: [display] lcd_type: hd44780_spi # 对于hd44780_spi 显示器，设置为“hd44780_spi”。 latch_pin: spi_software_sclk_pin: spi_software_mosi_pin: spi_software_miso_pin: # 控制显示器的移位寄存器的引脚。由于位移寄存器没有 MISO 引 # 脚，但是软件 SPI 实现需要这个引脚被配置， # spi_software_miso_pin 需要被设置为一个打印机主板上未被使 # 用的引脚。 #hd44780_protocol_init: True # 在 hd44780 显示器上执行 8-bit/4-bit 协议初始化。正版的 # hd44780 设备必须执行此操作，但是某些克隆设备上可能需要 # 禁用。 # 默认为True（启用）。 #line_length: # 设置一个 hd44780 类 LCD 每行显示的字符数量。可能的值为20 # （默认）和 16。行数固定为4。 ...

source: [display] lcd_type: st7920 # Set to "st7920" for st7920 displays. cs_pin: sclk_pin: sid_pin: # The pins connected to an st7920 type lcd. These parameters must be # provided. ...
fr: [display] lcd_type: st7920 # Définir à "st7920" pour les écrans st7920. cs_pin: sclk_pin: sid_pin: # Les broches connectées à un lcd de type st7920. Ces paramètres doivent être # fournis. ...
zh_hans: [display] lcd_type: st7920 # 为st7920显示器设置为 "st7920"。 cs_pin: sclk_pin: sid_pin: # 连接到 st7920 类LCD的引脚。 # 这些参数必须被提供。 ...

source: [display] lcd_type: emulated_st7920 # Set to "emulated_st7920" for emulated_st7920 displays. en_pin: spi_software_sclk_pin: spi_software_mosi_pin: spi_software_miso_pin: # The pins connected to an emulated_st7920 type lcd. The en_pin # corresponds to the cs_pin of the st7920 type lcd, # spi_software_sclk_pin corresponds to sclk_pin and # spi_software_mosi_pin corresponds to sid_pin. The # spi_software_miso_pin needs to be set to an unused pin of the # printer mainboard as the st7920 as no MISO pin but the software # spi implementation requires this pin to be configured. ...
fr: [display] lcd_type: emulated_st7920 # Définir à "emulated_st7920" pour les écrans emulated_st7920. en_pin: spi_software_sclk_pin: spi_software_mosi_pin: spi_software_miso_pin: # Les broches connectées à un lcd de type emulated_st7920. L'en_pin # correspond à la cs_pin du lcd de type st7920, # spi_software_sclk_pin correspond à sclk_pin et # spi_software_mosi_pin correspond à sid_pin. La broche # spi_software_miso_pin doit être réglée sur une broche non utilisée de la carte # mère de l'imprimante car le st7920 n'a pas de broche MISO mais l'implémentation # logicielle spi nécessite que cette broche soit configurée. ...
zh_hans: [display] lcd_type: emulated_st7920 # 对于 emulated_st7920 显示屏，设置为"emulated_st7920"。 en_pin: spi_software_sclk_pin: spi_software_mosi_pin: spi_software_miso_pin: # 连接到 emulated_st7920 类LCD的引脚。 en_pin 对应 # st7920 类LCD的 cs_pin。spi_software_sclk_pin 对应 sclk_pin， # 还有 spi_software_mosi_pin 对应 sid_pin。由于软件SPI实现 # 的方式，虽然 ST7920 不使用 MISO 引脚， 依旧需要将 # spi_software_miso_pin设为一个打印机控制板上一个没有被 # 使用的引脚。 ...

source: [display] lcd_type: uc1701 # Set to "uc1701" for uc1701 displays. cs_pin: a0_pin: # The pins connected to a uc1701 type lcd. These parameters must be # provided. #rst_pin: # The pin connected to the "rst" pin on the lcd. If it is not # specified then the hardware must have a pull-up on the # corresponding lcd line. #contrast: # The contrast to set. The value may range from 0 to 63 and the # default is 40. ...
fr: [display] lcd_type: uc1701 # Définir à "uc1701" pour les écrans uc1701. cs_pin: a0_pin: # Les broches connectées à un lcd de type uc1701. Ces paramètres doivent être # fournis. #rst_pin: # La broche connectée à la broche "rst" du lcd. Si elle n'est pas spécifiée, # le matériel doit avoir un pull-up sur la ligne lcd correspondante. #contrast: # Le contraste à définir. La valeur peut aller de 0 à 63 , la valeur par # défaut est 40. ...
zh_hans: [display] lcd_type: uc1701 # uc1701 显示屏应设为"uc1701"。 cs_pin: a0_pin: # 连接到 uc1701 类LCD的引脚。 # 必须提供这些参数。 #rst_pin: # 连接到 LCD "rst" 的引脚。 如果没有定义，则硬件必须在LCD # 相应的线路上带一个LCD引脚。 #contrast: # 显示屏的对比度。必须在0和63之间。 # 默认为40。 ...
