Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Config_Reference.po
Languages: fr, zh_hans

source: [tmc2130 stepper_x] cs_pin: # The pin corresponding to the TMC2130 chip select line. This pin # will be set to low at the start of SPI messages and raised to high # after the message completes. This parameter must be provided. #spi_speed: #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # See the "common SPI settings" section for a description of the # above parameters. #chain_position: #chain_length: # These parameters configure an SPI daisy chain. The two parameters # define the stepper position in the chain and the total chain length. # Position 1 corresponds to the stepper that connects to the MOSI signal. # The default is to not use an SPI daisy chain. #interpolate: True # If true, enable step interpolation (the driver will internally # step at a rate of 256 micro-steps). This interpolation does # introduce a small systemic positional deviation - see # TMC_Drivers.md for details. The default is True. run_current: # The amount of current (in amps RMS) to configure the driver to use # during stepper movement. This parameter must be provided. #hold_current: # The amount of current (in amps RMS) to configure the driver to use # when the stepper is not moving. Setting a hold_current is not # recommended (see TMC_Drivers.md for details). The default is to # not reduce the current. #sense_resistor: 0.110 # The resistance (in ohms) of the motor sense resistor. The default # is 0.110 ohms. #stealthchop_threshold: 0 # The velocity (in mm/s) to set the "stealthChop" threshold to. When # set, "stealthChop" mode will be enabled if the stepper motor # velocity is below this value. The default is 0, which disables # "stealthChop" mode. #driver_MSLUT0: 2863314260 #driver_MSLUT1: 1251300522 #driver_MSLUT2: 608774441 #driver_MSLUT3: 269500962 #driver_MSLUT4: 4227858431 #driver_MSLUT5: 3048961917 #driver_MSLUT6: 1227445590 #driver_MSLUT7: 4211234 #driver_W0: 2 #driver_W1: 1 #driver_W2: 1 #driver_W3: 1 #driver_X1: 128 #driver_X2: 255 #driver_X3: 255 #driver_START_SIN: 0 #driver_START_SIN90: 247 # These fields control the Microstep Table registers directly. The optimal # wave table is specific to each motor and might vary with current. An # optimal configuration will have minimal print artifacts caused by # non-linear stepper movement. The values specified above are the default # values used by the driver. The value must be specified as a decimal integer # (hex form is not supported). In order to compute the wave table fields, # see the tmc2130 "Calculation Sheet" from the Trinamic website. #driver_IHOLDDELAY: 8 #driver_TPOWERDOWN: 0 #driver_TBL: 1 #driver_TOFF: 4 #driver_HEND: 7 #driver_HSTRT: 0 #driver_PWM_AUTOSCALE: True #driver_PWM_FREQ: 1 #driver_PWM_GRAD: 4 #driver_PWM_AMPL: 128 #driver_SGT: 0 # Set the given register during the configuration of the TMC2130 # chip. This may be used to set custom motor parameters. The # defaults for each parameter are next to the parameter name in the # above list. #diag0_pin: #diag1_pin: # The micro-controller pin attached to one of the DIAG lines of the # TMC2130 chip. Only a single diag pin should be specified. The pin # is "active low" and is thus normally prefaced with "^!". Setting # this creates a "tmc2130_stepper_x:virtual_endstop" virtual pin # which may be used as the stepper's endstop_pin. Doing this enables # "sensorless homing". (Be sure to also set driver_SGT to an # appropriate sensitivity value.) The default is to not enable # sensorless homing.
zh_hans: [tmc2130 stepper_x] cs_pin: # 对应TMC2130芯片选择线的引脚。此引脚将在SPI消息开始时设置为 # 低电平，并在消息完成后提升为高电平。 # 必须提供此参数。 #spi_speed: #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # 有关上述参数的描述，请参阅“常见SPI设置”分段。 #chain_position: #chain_length: # 这些参数配置SPI串行连接。这两个参数定义了链中的步进位置和总 # 链长。位置1对应连接到MOSI信号的步进器。 # 默认情况下不使用SPI串行连接。 #interpolate: True # 如果为真，则启用步进插值（驱动器将内部以256微步的速度步进）。 # 这种插值确实引入了一个小的系统位置偏差 - 详情请参见TMC_Drivers.md。 # 默认为True。 run_current: # 配置驱动器在步进电机移动期间使用的电流（以安培RMS为单位）。 # 必须提供此参数。 #hold_current: # 配置驱动器在步进电机不移动时使用的电流（以安培RMS为单位）。 # 不推荐设置hold_current（详见TMC_Drivers.md）。 # 默认情况下不降低电流。 #sense_resistor: 0.110 # 电机感应电阻的电阻值（以欧姆为单位）。 # 默认值为0.110欧姆。 #stealthchop_threshold: 0 # 设定“StealthChop”阈值的速度（以毫米/秒为单位）。当设定时，如果步进 # 电机的速度低于此值，“StealthChop”模式将被启用。 # 默认值为0，此值会禁用“StealthChop”模式。 #driver_MSLUT0: 2863314260 #driver_MSLUT1: 1251300522 #driver_MSLUT2: 608774441 #driver_MSLUT3: 269500962 #driver_MSLUT4: 4227858431 #driver_MSLUT5: 3048961917 #driver_MSLUT6: 1227445590 #driver_MSLUT7: 4211234 #driver_W0: 2 #driver_W1: 1 #driver_W2: 1 #driver_W3: 1 #driver_X1: 128 #driver_X2: 255 #driver_X3: 255 #driver_START_SIN: 0 #driver_START_SIN90: 247 # 这些字段直接控制Microstep Table寄存器。最佳波形表是特定于每个电机 # 的，并可能随电流变化。最优的配置将最小化由非线性步进运动引起的 # 打印件的瑕疵。上述指定的值是驱动器默认使用的值。值必须以十进制 # 整数形式指定（不支持十六进制形式）。要计算波形表字段，请参见 # Trinamic网站上的tmc2130 "Calculation Sheet"。 #driver_IHOLDDELAY: 8 #driver_TPOWERDOWN: 0 #driver_TBL: 1 #driver_TOFF: 4 #driver_HEND: 7 #driver_HSTRT: 0 #driver_PWM_AUTOSCALE: True #driver_PWM_FREQ: 1 #driver_PWM_GRAD: 4 #driver_PWM_AMPL: 128 #driver_SGT: 0 # 在配置TMC2130芯片期间设置给定的寄存器。这可以用于设置自定义电 # 机参数。 # 上述列表中每个参数的默认值都在参数名旁边。 #diag0_pin: #diag1_pin: # 连接到TMC2130芯片的DIAG线之一的微控制器引脚。只应指定一个diag引 # 脚。引脚是"低电平有效"，因此通常以"^!"为前缀。设置这会创建一个 # "tmc2130_stepper_x:virtual_endstop"虚拟引脚，可以作为步进器的endstop_pin # 使用。这样做可以启用"无感应归位"。（确保也将driver_SGT设置为适当的敏感 # 度值。） # 默认情况下不启用无感应归位。

source: [printer] kinematics: deltesian max_z_velocity: # For deltesian printers, this limits the maximum velocity (in mm/s) of # moves with z axis movement. This setting can be used to reduce the # maximum speed of up/down moves (which require a higher step rate # than other moves on a deltesian printer). The default is to use # max_velocity for max_z_velocity. #max_z_accel: # This sets the maximum acceleration (in mm/s^2) of movement along # the z axis. Setting this may be useful if the printer can reach higher # acceleration on XY moves than Z moves (eg, when using input shaper). # The default is to use max_accel for max_z_accel. #minimum_z_position: 0 # The minimum Z position that the user may command the head to move # to. The default is 0. #min_angle: 5 # This represents the minimum angle (in degrees) relative to horizontal # that the deltesian arms are allowed to achieve. This parameter is # intended to restrict the arms from becoming completely horizontal, # which would risk accidental inversion of the XZ axis. The default is 5. #print_width: # The distance (in mm) of valid toolhead X coordinates. One may use # this setting to customize the range checking of toolhead moves. If # a large value is specified here then it may be possible to command # the toolhead into a collision with a tower. This setting usually # corresponds to bed width (in mm). #slow_ratio: 3 # The ratio used to limit velocity and acceleration on moves near the # extremes of the X axis. If vertical distance divided by horizontal # distance exceeds the value of slow_ratio, then velocity and # acceleration are limited to half their nominal values. If vertical # distance divided by horizontal distance exceeds twice the value of # the slow_ratio, then velocity and acceleration are limited to one # quarter of their nominal values. The default is 3. # The stepper_left section is used to describe the stepper controlling # the left tower. This section also controls the homing parameters # (homing_speed, homing_retract_dist) for all towers. [stepper_left] position_endstop: # Distance (in mm) between the nozzle and the bed when the nozzle is # in the center of the build area and the endstops are triggered. This # parameter must be provided for stepper_left; for stepper_right this # parameter defaults to the value specified for stepper_left. arm_length: # Length (in mm) of the diagonal rod that connects the tower carriage to # the print head. This parameter must be provided for stepper_left; for # stepper_right, this parameter defaults to the value specified for # stepper_left. arm_x_length: # Horizontal distance between the print head and the tower when the # printers is homed. This parameter must be provided for stepper_left; # for stepper_right, this parameter defaults to the value specified for # stepper_left. # The stepper_right section is used to describe the stepper controlling the # right tower. [stepper_right] # The stepper_y section is used to describe the stepper controlling # the Y axis in a deltesian robot. [stepper_y]
zh_hans: [printer] kinematics: deltesian max_z_velocity: # 对于deltesian打印机，这限制了带有z轴移动的运动的最大速度（ # 以mm/s为单位）。此设置可以用于减小上下移动的最大速度（这 # 需要比deltesian打印机上的其他移动更高的步进率）。 # 默认情况下，max_z_velocity使用max_velocity的值。 #max_z_accel: # 这设置了沿z轴移动的最大加速度（以mm/s^2为单位）。如果打印 # 机在XY移动上可以达到比Z轴移动更高的加速度（例如，当使用输入 # 整形器时），那么设置这个可能会很有用。 # 默认情况下，max_z_accel使用max_accel的值。 #minimum_z_position: 0 # 用户可以命令头部移动到的最小Z位置。 # 默认值为0。 #min_angle: 5 # 这代表deltesian手臂相对于水平线所能达到的最小角度（以度为单位）。 # 此参数旨在限制手臂变得完全水平，这可能会导致XZ轴意外翻转。 # 默认值为5。 #print_width: # 有效工具头X坐标的距离（以mm为单位）。人们可以使用此设置来自 # 定义工具头移动的范围检查。如果在此处指定了一个大值，那么可能会 # 命令工具头与塔发生碰撞。 # 此设置通常对应于床宽（以mm为单位）。 #slow_ratio: 3 # 用于在X轴极限附近限制移动速度和加速度的比率。如果垂直距离除以 # 水平距离超过slow_ratio的值，那么速度和加速度就限制为其标称值的 # 一半。如果垂直距离除以水平距离超过slow_ratio值的两倍，那么速度 # 和加速度就限制为其标称值的四分之一。 # 默认值为3。 # stepper_left部分用于描述控制左塔的步进马达。此部分还控制所有塔 # 的归零参数（homing_speed, homing_retract_dist）。 [stepper_left] position_endstop: # 当喷嘴在构建区域的中心并且终点开关被触发时，喷嘴与床之间的距 # 离（以mm为单位）。此参数必须为stepper_left提供；对于stepper_right， # 此参数默认为为stepper_left指定的值。 arm_length: # 连接塔运输车与打印头的对角杆的长度（以mm为单位）。 # 此参数必须为stepper_left提供； # 对于stepper_right，此参数默认为为stepper_left指定的值。 arm_x_length: # 打印机归位时，打印头与塔之间的水平距离。此参数必须 # 为stepper_left提供； # 对于stepper_right，此参数默认为为stepper_left指定的值。 # stepper_right部分用于描述控制右塔的步进马达。 [stepper_right] # stepper_y部分用于描述控制deltesian机器人的Y轴的步进马达。 [stepper_y]

source: [screws_tilt_adjust] #screw1: # The (X, Y) coordinate of the first bed leveling screw. This is a # position to command the nozzle to so that the probe is directly # above the bed screw (or as close as possible while still being # above the bed). This is the base screw used in calculations. This # parameter must be provided. #screw1_name: # An arbitrary name for the given screw. This name is displayed when # the helper script runs. The default is to use a name based upon # the screw XY location. #screw2: #screw2_name: #... # Additional bed leveling screws. At least two screws must be # defined. #speed: 50 # The speed (in mm/s) of non-probing moves during the calibration. # The default is 50. #horizontal_move_z: 5 # The height (in mm) that the head should be commanded to move to # just prior to starting a probe operation. The default is 5. #screw_thread: CW-M3 # The type of screw used for bed leveling, M3, M4, or M5, and the # rotation direction of the knob that is used to level the bed. # Accepted values: CW-M3, CCW-M3, CW-M4, CCW-M4, CW-M5, CCW-M5. # Default value is CW-M3 which most printers use. A clockwise # rotation of the knob decreases the gap between the nozzle and the # bed. Conversely, a counter-clockwise rotation increases the gap.
zh_hans: [screws_tilt_adjust] #screw1: # 第一个调平螺丝的（X，Y）坐标。这是一个命令喷嘴的位置，使得 # 探针直接位于床螺丝的正上方（或者尽可能靠近并且仍在床上）。 # 这是用于计算的基础螺丝。 # 必须提供此参数。 #screw1_name: # 给定螺丝的任意名称。当助手脚本运行时，将显示此名称。 # 默认情况下，使用基于螺丝 XY 位置的名称。 #screw2: #screw2_name: #... # 额外的床调平螺丝。至少必须定义两个螺丝。 #speed: 50 # 在校准期间非探测移动的速度（以mm / s为单位）。 # 默认值为50。 #horizontal_move_z: 5 # 头部应该在开始探测操作之前移动到的高度（以mm为单位）。 # 默认值为5。 #screw_thread: CW-M3 # 用于床平整的螺丝类型，M3，M4或M5，以及用于调平床的旋钮的旋转方向。 # 接受的值：CW-M3，CCW-M3，CW-M4，CCW-M4，CW-M5，CCW-M5。 # 默认值是大多数打印机使用的CW-M3。旋钮的顺时针旋转减小了喷嘴和床之 # 间的间隙。相反，逆时针旋转增加了间隙。

source: Configure a TMC2240 stepper motor driver via SPI bus. To use this feature, define a config section with a "tmc2240" prefix followed by the name of the corresponding stepper config section (for example, "[tmc2240 stepper_x]").
zh_hans: 通过 SPI 总线配置 TMC2240 步进电机驱动器。要使用此功能，请定义一个配置分段，其前缀为 "tmc2240"，后跟相应步进配置分段的名称（例如，"[tmc2240 stepper_x]"）。

source: [tmc2240 stepper_x] cs_pin: # The pin corresponding to the TMC2240 chip select line. This pin # will be set to low at the start of SPI messages and raised to high # after the message completes. This parameter must be provided. #spi_speed: #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # See the "common SPI settings" section for a description of the # above parameters. #chain_position: #chain_length: # These parameters configure an SPI daisy chain. The two parameters # define the stepper position in the chain and the total chain length. # Position 1 corresponds to the stepper that connects to the MOSI signal. # The default is to not use an SPI daisy chain. #interpolate: True # If true, enable step interpolation (the driver will internally # step at a rate of 256 micro-steps). The default is True. run_current: # The amount of current (in amps RMS) to configure the driver to use # during stepper movement. This parameter must be provided. #hold_current: # The amount of current (in amps RMS) to configure the driver to use # when the stepper is not moving. Setting a hold_current is not # recommended (see TMC_Drivers.md for details). The default is to # not reduce the current. #rref: 12000 # The resistance (in ohms) of the resistor between IREF and GND. The # default is 12000. #stealthchop_threshold: 0 # The velocity (in mm/s) to set the "stealthChop" threshold to. When # set, "stealthChop" mode will be enabled if the stepper motor # velocity is below this value. The default is 0, which disables # "stealthChop" mode. #driver_MSLUT0: 2863314260 #driver_MSLUT1: 1251300522 #driver_MSLUT2: 608774441 #driver_MSLUT3: 269500962 #driver_MSLUT4: 4227858431 #driver_MSLUT5: 3048961917 #driver_MSLUT6: 1227445590 #driver_MSLUT7: 4211234 #driver_W0: 2 #driver_W1: 1 #driver_W2: 1 #driver_W3: 1 #driver_X1: 128 #driver_X2: 255 #driver_X3: 255 #driver_START_SIN: 0 #driver_START_SIN90: 247 #driver_OFFSET_SIN90: 0 # These fields control the Microstep Table registers directly. The optimal # wave table is specific to each motor and might vary with current. An # optimal configuration will have minimal print artifacts caused by # non-linear stepper movement. The values specified above are the default # values used by the driver. The value must be specified as a decimal integer # (hex form is not supported). In order to compute the wave table fields, # see the tmc2130 "Calculation Sheet" from the Trinamic website. # Additionally, this driver also has the OFFSET_SIN90 field which can be used # to tune a motor with unbalanced coils. See the `Sine Wave Lookup Table` # section in the datasheet for information about this field and how to tune # it. #driver_IHOLDDELAY: 6 #driver_IRUNDELAY: 4 #driver_TPOWERDOWN: 10 #driver_TBL: 2 #driver_TOFF: 3 #driver_HEND: 2 #driver_HSTRT: 5 #driver_FD3: 0 #driver_TPFD: 4 #driver_CHM: 0 #driver_VHIGHFS: 0 #driver_VHIGHCHM: 0 #driver_DISS2G: 0 #driver_DISS2VS: 0 #driver_PWM_AUTOSCALE: True #driver_PWM_AUTOGRAD: True #driver_PWM_FREQ: 0 #driver_FREEWHEEL: 0 #driver_PWM_GRAD: 0 #driver_PWM_OFS: 29 #driver_PWM_REG: 4 #driver_PWM_LIM: 12 #driver_SGT: 0 #driver_SEMIN: 0 #driver_SEUP: 0 #driver_SEMAX: 0 #driver_SEDN: 0 #driver_SEIMIN: 0 #driver_SFILT: 0 #driver_SG4_ANGLE_OFFSET: 1 # Set the given register during the configuration of the TMC2240 # chip. This may be used to set custom motor parameters. The # defaults for each parameter are next to the parameter name in the # above list. #diag0_pin: #diag1_pin: # The micro-controller pin attached to one of the DIAG lines of the # TMC2240 chip. Only a single diag pin should be specified. The pin # is "active low" and is thus normally prefaced with "^!". Setting # this creates a "tmc2240_stepper_x:virtual_endstop" virtual pin # which may be used as the stepper's endstop_pin. Doing this enables # "sensorless homing". (Be sure to also set driver_SGT to an # appropriate sensitivity value.) The default is to not enable # sensorless homing.
zh_hans: [tmc2240 stepper_x] cs_pin: # 对应于TMC2240芯片选择线的引脚。此引脚在SPI消息开始时设为低电平， # 并在消息完成后设为高电平。 # 必须提供此参数。 #spi_speed: #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # 有关上述参数的描述，请参见“常见SPI设置”部分。 #chain_position: #chain_length: # 这些参数配置一个SPI菊链。这两个参数定义了菊花链中的步进器 # 位置和总链长度。位置1对应连接到MOSI信号的步进器。 # 默认不使用SPI菊链。 #interpolate: True # 如果为真，启用步进插补（驱动器将内部以256微步的速率步进）。 # 默认为True。 run_current: # 在步进电机移动期间，配置驱动器使用的电流（以安培RMS为单位） # 量。必须提供此参数。 #hold_current: # 当步进电机不移动时，配置驱动器使用的电流（以安培RMS为单位） # 量。不建议设置hold_current（详见TMC_Drivers.md）。 # 默认不降低电流。 #rref: 12000 # IREF和GND之间的电阻器的电阻（以欧姆为单位）。 # 默认为12000。 #stealthchop_threshold: 0 # 将“stealthChop”阈值设为的速度（以mm/s为单位）。设定后， # 如果步进电机的速度低于此值，将启用“stealthChop”模式。 # 默认为0，这将禁用“stealthChop”模式。 #driver_MSLUT0: 2863314260 #driver_MSLUT1: 1251300522 #driver_MSLUT2: 608774441 #driver_MSLUT3: 269500962 #driver_MSLUT4: 4227858431 #driver_MSLUT5: 3048961917 #driver_MSLUT6: 1227445590 #driver_MSLUT7: 4211234 #driver_W0: 2 #driver_W1: 1 #driver_W2: 1 #driver_W3: 1 #driver_X1: 128 #driver_X2: 255 #driver_X3: 255 #driver_START_SIN: 0 #driver_START_SIN90: 247 #driver_OFFSET_SIN90: 0 # 这些字段直接控制Microstep Table寄存器。每个电机的最优波表 # 特定，并可能随电流变化。最优配置会将由非线性步进器运动引 # 起的打印件制造缺陷降至最低。上述指定的值是驱动器默认使用的值。 # 该值必须以十进制整数形式指定（不支持十六进制形式）。为了计算 # 波表字段，请参见Trinamic网站上的tmc2130“计算表”。 # 此外，这款驱动器还有OFFSET_SIN90字段，可以用来调整一个具有不平 # 衡线圈的电机。有关此字段以及如何调整它的信息，请参见数据表中的 # `正弦波查找表`部分。 #driver_IHOLDDELAY: 6 #driver_IRUNDELAY: 4 #driver_TPOWERDOWN: 10 #driver_TBL: 2 #driver_TOFF: 3 #driver_HEND: 2 #driver_HSTRT: 5 #driver_FD3: 0 #driver_TPFD: 4 #driver_CHM: 0 #driver_VHIGHFS: 0 #driver_VHIGHCHM: 0 #driver_DISS2G: 0 #driver_DISS2VS: 0 #driver_PWM_AUTOSCALE: True #driver_PWM_AUTOGRAD: True #driver_PWM_FREQ: 0 #driver_FREEWHEEL: 0 #driver_PWM_GRAD: 0 #driver_PWM_OFS: 29 #driver_PWM_REG: 4 #driver_PWM_LIM: 12 #driver_SGT: 0 #driver_SEMIN: 0 #driver_SEUP: 0 #driver_SEMAX: 0 #driver_SEDN: 0 #driver_SEIMIN: 0 #driver_SFILT: 0 #driver_SG4_ANGLE_OFFSET: 1 # 在配置TMC2240芯片期间设置给定的寄存器这可以用于设置自定义电机 # 参数。 # 每个参数的默认值在参数名称旁边的上面的列表中。 #diag0_pin: #diag1_pin: # 连接到TMC2240芯片的DIAG线的微控制器引脚。应只指定一个diag引脚。 # 该引脚为“活动低”，因此通常加上"^!"前缀。设置 # 这个会创建一个“tmc2240_stepper_x:virtual_endstop”虚拟引脚 # 可以用作步进器的endstop_pin。这样做可以启用“无传感器归位”。 # （确保也将driver_SGT设置为适当的灵敏度值。） # 默认不启用无传感器归位。

source: [palette2] serial: # The serial port to connect to the Palette 2. #baud: 115200 # The baud rate to use. The default is 115200. #feedrate_splice: 0.8 # The feedrate to use when splicing, default is 0.8 #feedrate_normal: 1.0 # The feedrate to use after splicing, default is 1.0 #auto_load_speed: 2 # Extrude feedrate when autoloading, default is 2 (mm/s) #auto_cancel_variation: 0.1 # Auto cancel print when ping variation is above this threshold
zh_hans: [palette2] serial: # 与 Palette 2 连接的串口。 #baud: 115200 # 使用的波特率。 # 默认是 115200。 #feedrate_splice: 0.8 # 拼接时使用的进给速度， # 默认是 0.8 #feedrate_normal: 1.0 # 拼接后使用的进给速度， # 默认是 1.0 #auto_load_speed: 2 # 自动装载时的挤出进给速度， # 默认是 2 (mm/s) #auto_cancel_variation: 0.1 # 当 ping 变化超过此阈值时，自动取消打印

source: Note that Klipper's current micro-controller support for I2C is generally not tolerant to line noise. Unexpected errors on the I2C wires may result in Klipper raising a run-time error. Klipper's support for error recovery varies between each micro-controller type. It is generally recommended to only use I2C devices that are on the same printed circuit board as the micro-controller.
zh_hans: 请注意，Klipper当前的微控制器对I2C的支持通常不能容忍线路噪声。I2C线路上的意外错误可能会导致Klipper产生运行时错误。Klipper 对错误恢复的支持在每种微控制器类型之间有所不同。通常建议只使用与微控制器位于同一印刷电路板上的I2C设备。

source: Most Klipper micro-controller implementations only support an `i2c_speed` of 100000 (*standard mode*, 100kbit/s). The Klipper "Linux" micro-controller supports a 400000 speed (*fast mode*, 400kbit/s), but it must be [set in the operating system](RPi_microcontroller.md#optional-enabling-i2c) and the `i2c_speed` parameter is otherwise ignored. The Klipper "RP2040" micro-controller and ATmega AVR family support a rate of 400000 via the `i2c_speed` parameter. All other Klipper micro-controllers use a 100000 rate and ignore the `i2c_speed` parameter.
zh_hans: 大多数Klipper微控制器实现只支持100000的`i2c_speed`（*标准模式*，100kbit/s）。Klipper的"Linux"微控制器支持400000的速度（*快速模式*，400kbit/s），但它必须[在操作系统中设置](RPi_microcontroller.md#optional-enabling-i2c)，否则会忽略`i2c_speed`参数。Klipper的"RP2040"微控制器和ATmega AVR系列通过`i2c_speed`参数支持400000的速率。所有其他Klipper微控制器使用100000的速率并忽略`i2c_speed`参数。

source: #i2c_address: # The i2c address of the device. This must specified as a decimal # number (not in hex). The default depends on the type of device. #i2c_mcu: # The name of the micro-controller that the chip is connected to. # The default is "mcu". #i2c_bus: # If the micro-controller supports multiple I2C busses then one may # specify the micro-controller bus name here. The default depends on # the type of micro-controller. #i2c_speed: # The I2C speed (in Hz) to use when communicating with the device. # The Klipper implementation on most micro-controllers is hard-coded # to 100000 and changing this value has no effect. The default is # 100000. Linux, RP2040 and ATmega support 400000.
zh_hans: #i2c_address: # 设备的i2c地址。必须以十进制数指定（不是十六进制）。 # 默认取决于设备的类型。 #i2c_mcu: # 芯片连接的微控制器的名称。 # 默认为"mcu"。 #i2c_bus: # 如果微控制器支持多个I2C总线，则可以在此处指定微控制 # 器总线名称。 # 默认取决于微控制器的类型。 #i2c_speed: # 与设备通信时使用的I2C速度（以Hz为单位）。Klipper在大 # 多数微控制器上的实现都是硬编码为100000，改变这个值 # 没有效果。 # 默认值是100000。Linux，RP2040和ATmega支持400000。
