Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Config_Changes.po
Languages: fr, hu, it, zh_hans

source: 20220210: The `SYNC_STEPPER_TO_EXTRUDER` command is deprecated; the `SET_EXTRUDER_STEP_DISTANCE` command is deprecated; the [extruder](Config_Reference.md#extruder) `shared_heater` config option is deprecated. These features will be removed in the near future. Replace `SET_EXTRUDER_STEP_DISTANCE` with `SET_EXTRUDER_ROTATION_DISTANCE`. Replace `SYNC_STEPPER_TO_EXTRUDER` with `SYNC_EXTRUDER_MOTION`. Replace extruder config sections using `shared_heater` with [extruder_stepper](Config_Reference.md#extruder_stepper) config sections and update any activation macros to use [SYNC_EXTRUDER_MOTION](G-Codes.md#sync_extruder_motion).
fr: 20220210 : La commande `SYNC_STEPPER_TO_EXTRUDER` est obsolète ; la commande `SET_EXTRUDER_STEP_DISTANCE` est obsolète ; l'option de configuration `shared_heater` de l'[extrudeuse](Config_Reference.md#extruder) est obsolète. Ces fonctionnalités seront supprimées dans un futur proche. Remplacez `SET_EXTRUDER_STEP_DISTANCE` par `SET_EXTRUDER_ROTATION_DISTANCE`. Remplacez `SYNC_STEPPER_TO_EXTRUDER` par `SYNC_EXTRUDER_MOTION`. Remplacez les sections de configuration de l'extrudeuse utilisant `shared_heater` par les sections de configuration [extruder_stepper](Config_Reference.md#extruder_stepper) et mettez à jour toutes les macros d'activation pour utiliser [SYNC_EXTRUDER_MOTION](G-Codes.md#sync_extruder_motion).
hu: 20220210: A `SYNC_STEPPER_TO_EXTRUDER` parancs elavult; a `SET_EXTRUDER_STEP_DISTANCE` parancs elavult; az [extruder](Config_Reference.md#extruder) `shared_heater` config opció elavult. Ezek a funkciók a közeljövőben eltávolításra kerülnek. A `SET_EXTRUDER_STEP_DISTANCE` helyett `SET_EXTRUDER_ROTATION_DISTANCE`. Cserélje ki a `SYNC_STEPPER_TO_EXTRUDER` értéket a `SYNC_EXTRUDER_MOTION` értékre. Cserélje ki a `shared_heater` extruder konfigurációs szakaszokat [extruder_stepper](Config_Reference.md#extruder_stepper) konfigurációs szakaszokra, és frissítse az aktiválási makrókat a [SYNC_EXTRUDER_MOTION](G-Codes.md#sync_extruder_motion) használatára.
it: 20220210: Il comando `SYNC_STEPPER_TO_EXTRUDER` è deprecato; il comando `SET_EXTRUDER_STEP_DISTANCE` è deprecato; l'opzione di configurazione [extruder](Config_Reference.md#extruder) `shared_heater` è deprecata. Queste funzionalità verranno rimosse nel prossimo futuro. Sostituisci `SET_EXTRUDER_STEP_DISTANCE` con `SET_EXTRUDER_ROTATION_DISTANCE`. Sostituisci `SYNC_STEPPER_TO_EXTRUDER` con `SYNC_EXTRUDER_MOTION`. Sostituisci le sezioni di configurazione dell'estrusore usando `shared_heater` con le sezioni di configurazione [extruder_stepper](Config_Reference.md#extruder_stepper) e aggiorna le macro di attivazione per usare [SYNC_EXTRUDER_MOTION](G-Codes.md#sync_extruder_motion).
zh_hans: 20220210：`SYNC_STEPPER_TO_EXTRUDER`、`SET_EXTRUDER_STEP_DISTANCE`、[extruder](Config_Reference.md#extruder)的 `shared_heater` 配置选项已弃用。这些功能将在不久的将来被删除。将`SET_EXTRUDER_STEP_DISTANCE`替换为`SET_EXTRUDER_ROTATION_DISTANCE`，`SYNC_STEPPER_TO_EXTRUDER`替换为`SYNC_EXTRUDER_MOTION`，使用 `shared_heater` 与 [extruder_stepper](Config_Reference.md#extruder_stepper)配置分段替换 extruder 配置分段，并更新所有激活宏以使用 [SYNC_EXTRUDER_MOTION](G-Codes.md#sync_extruder_motion)。

source: 20220304: There is no longer a default for the `extruder` parameter of [extruder_stepper](Config_Reference.md#extruder_stepper) config sections. If desired, specify `extruder: extruder` explicitly to associate the stepper motor with the "extruder" motion queue at startup.
fr: 20220304 : Il n'y a plus de valeur par défaut pour le paramètre `extruder` des sections de configuration [extruder_stepper](Config_Reference.md#extruder_stepper). Si vous le souhaitez, spécifiez explicitement `extruder : extruder` pour associer le moteur pas à pas à la file d'attente de mouvement "extruder" au démarrage.
hu: 20220304: Az [extruder_stepper](Config_Reference.md#extruder_stepper) konfigurációs szakaszok `extruder` paramétere már nem alapértelmezett. Ha szükséges, adja meg kifejezetten az `extruder: extruder` paramétert, hogy a léptetőmotort indításkor az "extruder" mozgássorhoz társítsa.
it: 20220304: Non esiste più un valore predefinito per il parametro `extruder` delle sezioni di configurazione [extruder_stepper](Config_Reference.md#extruder_stepper). Se lo si desidera, specificare esplicitamente `extruder: extruder` per associare il motore passo-passo alla coda di movimento "estrusore" all'avvio.

source: 20220307: `M73` will no longer set print progress to 0 if `P` is missing.
fr: 20220307 : `M73` ne mettra plus la progression de l'impression à 0 si `P` est absent.
hu: 20220307: `M73` már nem állítja 0-ra a nyomtatás előrehaladását, ha `P` hiányzik.
it: 20220307: `M73` non imposterà più l'avanzamento della stampa su 0 se manca `P`.

source: 20220407: The temperature_fan `pid_integral_max` config option has been removed (it was deprecated on 20210612).
fr: 20220407 : L'option de configuration `pid_integral_max` de temperature_fan a été supprimée (elle était obsolète depuis 20210612).
it: 20220407: l'opzione di configurazione temperature_fan `pid_integral_max` è stata rimossa (era deprecata su 20210612).

source: 20220407: The default color order for pca9632 LEDs is now "RGBW". Add an explicit `color_order: RBGW` setting to the pca9632 config section to obtain the previous behavior.
fr: 20220407 : L'ordre des couleurs par défaut pour les LEDs pca9632 est maintenant "RGBW". Ajoutez un paramètre explicite `color_order : RBGW` à la section pca9632 config pour obtenir le comportement précédent.
it: 20220407: L'ordine dei colori predefinito per i LED pca9632 è ora "RGBW". Aggiungi un'impostazione esplicita `color_order: RBGW` alla sezione di configurazione di pca9632 per ottenere il comportamento precedente.

source: 20220330: The format of the `printer.neopixel.color_data` status information for neopixel and dotstar modules has changed. The information is now stored as a list of color lists (instead of a list of dictionaries). See the [status reference](Status_Reference.md#led) for details.
fr: 20220330 : Le format des informations d'état `printer.neopixel.color_data` des modules neopixel et dotstar a changé. L'information est maintenant stockée comme une liste de listes de couleurs (au lieu d'une liste de dictionnaires). Voir la [référence d'état](Status_Reference.md#led) pour plus de détails.
it: 20220330: Il formato delle informazioni di stato `printer.neopixel.color_data` per i moduli neopixel e dotstar è cambiato. Le informazioni sono ora memorizzate come un elenco di elenchi di colori (invece di un elenco di dizionari). Per i dettagli, vedere il [riferimento dello stato](Status_Reference.md#led).

source: 20220616: It was previously possible to flash an rp2040 in bootloader mode by running `make flash FLASH_DEVICE=first`. The equivalent command is now `make flash FLASH_DEVICE=2e8a:0003`.
fr: 20220616 : Il était auparavant possible de flasher un rp2040 en mode bootloader en exécutant `make flash FLASH_DEVICE=first`. La commande équivalente est maintenant `make flash FLASH_DEVICE=2e8a:0003`.
it: 20220616: in precedenza era possibile eseguire il flashing di un rp2040 in modalità bootloader eseguendo `make flash FLASH_DEVICE=first`. Il comando equivalente è ora `make flash FLASH_DEVICE=2e8a:0003`.

source: 20220612: The rp2040 micro-controller now has a workaround for the "rp2040-e5" USB errata. This should make initial USB connections more reliable. However, it may result in a change in behavior for the gpio15 pin. It is unlikely the gpio15 behavior change will be noticeable.
fr: 20220612 : Le micro-contrôleur rp2040 a maintenant une solution de contournement pour l'errata USB "rp2040-e5". Cela devrait rendre les premières connexions USB plus fiables. Cependant, cela peut entraîner un changement de comportement de la broche gpio15. Il est peu probable que le changement de comportement de la gpio15 soit perceptible.
it: 20220612: Il microcontrollore rp2040 ora ha una soluzione alternativa per l'errata USB "rp2040-e5". Ciò dovrebbe rendere più affidabili le connessioni USB iniziali. Tuttavia, potrebbe comportare un cambiamento nel comportamento del pin gpio15. È improbabile che il cambiamento di comportamento di gpio15 sia evidente.

source: 20221122: Previously, with safe_z_home, it was possible that the z_hop after the g28 homing would go in the negative z direction. Now, a z_hop is performed after g28 only if it results in a positive hop, mirroring the behavior of the z_hop that occurs before the g28 homing.
fr: 20221122 : Auparavant, avec safe_z_home, il était possible que le z_hop après la mise à l'origine g28 aille dans une direction z négative. Maintenant, un saut en z n'est effectué après g28 que s'il résulte en un saut positif, reflétant le comportement du saut en z se produisant avant la mise à l'origine g28.
it: 20221122: In precedenza, con safe_z_home, era possibile che z_hop dopo l'homing g28 andasse nella direzione z negativa. Ora, uno z_hop viene eseguito dopo g28 solo se risulta in un hop positivo, rispecchiando il comportamento dello z_hop che si verifica prima dell'homing g28.

source: 20230201: The `[bed_mesh]` module no longer loads the `default` profile on startup. It is recommended that users who use the `default` profile add `BED_MESH_PROFILE LOAD=default` to their `START_PRINT` macro (or to their slicer's "Start G-Code" configuration when applicable).
it: 20230201: Il modulo `[bed_mesh]` non carica più il profilo `default` all'avvio. Si consiglia agli utenti che usano il profilo `default` di aggiungere `BED_MESH_PROFILE LOAD=default` alla loro macro `START_PRINT` (o alla configurazione "Start G-Code" del loro slicer quando applicabile).

source: 20230103: It is now possible with the flash-sdcard.sh script to flash both variants of the Bigtreetech SKR-2, STM32F407 and STM32F429. This means that the original tag of btt-skr2 now has changed to either btt-skr-2-f407 or btt-skr-2-f429.
it: 20230103: Ora è possibile con lo script flash-sdcard.sh eseguire il flashing di entrambe le varianti di Bigtreetech SKR-2, STM32F407 e STM32F429. Ciò significa che il tag originale di btt-skr2 ora è cambiato in btt-skr-2-f407 o btt-skr-2-f429.

source: 20221128: Klipper v0.11.0 released.
it: 20221128: rilascio di Klipper v0.11.0.
