Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Config_checks.po
Languages: bg, de, es, fr, hu, ko, pl, pt, pt_br, sk, tr, zh_hans, zh_hant

source: Verify that all of the printer axes can manually move freely (the stepper motors are disabled). If not, issue an M84 command to disable the motors. If any of the axes still can not move freely, then verify the stepper "enable_pin" configuration for the given axis. On most commodity stepper motor drivers, the motor enable pin is "active low" and therefore the enable pin should have a "!" before the pin (for example, "enable_pin: !ar38").
de: Stellen Sie sicher, dass sich alle Druckerachsen manuell frei bewegen können (die Schrittmotoren sind deaktiviert). Wenn nicht, geben Sie einen M84-Befehl aus, um die Motoren zu deaktivieren. Wenn sich eine der Achsen immer noch nicht frei bewegen kann, überprüfen Sie die Stepper-Konfiguration "enable_pin" für die angegebene Achse. Bei den meisten Handelsüblichen Schrittmotortreibern ist der Motoraktivierungspin "aktiv niedrig" und daher sollte der Aktivierungsstift vor dem Stift ein "!" haben (z. B. "enable_pin: !ar38").
fr: Vérifiez que tous les axes de l'imprimante peuvent se déplacer librement manuellement (les moteurs pas à pas sont désactivés). Si ce n'est pas le cas, lancez une commande M84 pour désactiver les moteurs. Si l'un des axes ne peut toujours pas se déplacer librement, vérifiez la configuration de la "broche d'activation" du moteur pas à pas pour l'axe en question. Sur la plupart des pilotes de moteurs pas à pas, la broche d'activation du moteur est "active basse" et la broche d'activation doit donc être précédée d'un " !" (par exemple, "enable_pin : !ar38").
ko: 모든 프린터 축이 수동으로 자유롭게 움직일 수 있는지 확인합니다(스테퍼 모터가 비활성화됨). 그렇지 않은 경우 M84 명령을 실행하여 모터를 비활성화하십시오. 여전히 자유롭게 이동할 수 없는 축이 있으면 해당 축에 대한 스테퍼 "enable_pin" 구성을 확인하십시오. 대부분의 상용 스테퍼 모터 드라이버에서 모터 enable pin은 "active low"이므로 enable pin 앞에 "!"가 있어야 합니다. (예: "enable_pin: !ar38").
pl: Sprawdź, czy wszystkie osie drukarki można przesunąć ręcznie (przy wyłączonych silnikach krokowych). Jeśli nie, wyłącz silniki komendą M84. Jeśli któraś z osi nadal pozostanie aktywna, sprawdź konfigurację "enable_pin" danej osi. Większość sterowników silników krokowych ma pin enable aktywny przy niskim stanie dlatego w konfiguracji pin należy wstawić "!" przed nazwą pinu (np. enable_pin:!ar38").
pt_br: Verifique se todos os eixos da impressora podem ser movido livremente com as mãos (os motores de passo precisam estar desabilitados). Se não estiverem, execute o comando M84 para desabilitá-los. Se algum eixo ainda não puder ser movido livremente, verifique a configuração de "enable_pin" do motor de passo do o eixo em questão. Na maioria dos drivers de motor de passo convencionais, o pino de ativação do motor tem "sinal invertido" (ou "active low"em inglês) e, portanto, o pino de ativação deve ter uma "!" antes do pino (por exemplo, "enable_pin: !ar38").
zh_hans: 验证所有打印机轴都可以手动自由移动（步进电机已禁用）。 如果没有，请发出 M84 命令以禁用电机。 如果任何轴仍然无法自由移动，则验证给定轴的步进器“enable_pin”配置。 在大多数步进电机驱动器上，电机使能引脚为“低电平有效”，因此使能引脚在pin之前应带有“！” （例如，“enable_pin: !ar38”）。
zh_hant: 驗證所有印表機軸都可以用手自由移動（步進電機已禁用）。 如果沒有，請發出 M84 命令禁用電機。 如果任何軸仍然無法自由移動，需要檢查該軸的步進驅動「enable_pin」（使能引腳）配置。 在大多數步進電機驅動器上，電機使能引腳為「低電平有效」，因此使能引腳在pin之前應帶有「！」 （例如，「enable_pin: !ar38」）。

source: Verify endstops
bg: Проверка на крайните спирания
de: Endstopps verifizieren
es: Verifique el paro programado
fr: Vérifier les capteurs de fin de course
hu: Végállások ellenőrzése
ko: endstops 확인
pl: Sprawdź krańcówki
pt: Verique os fins de curso
pt_br: Verique os fins de curso
sk: Overenie koncákov
tr: Sonlandırıcıları doğrula
zh_hans: 验证限位开关
zh_hant: 驗證限位開關

source: Manually move all the printer axes so that none of them are in contact with an endstop. Send a QUERY_ENDSTOPS command via the Octoprint terminal tab. It should respond with the current state of all of the configured endstops and they should all report a state of "open". For each of the endstops, rerun the QUERY_ENDSTOPS command while manually triggering the endstop. The QUERY_ENDSTOPS command should report the endstop as "TRIGGERED".
de: Bewegen Sie alle Druckerachsen manuell so, dass keine von ihnen mit einem Endanschlag in Kontakt ist. Senden Sie einen QUERY_ENDSTOPS-Befehl über das Octoprint-Terminalregister. Er sollte mit dem aktuellen Status aller konfigurierten Endstops antworten und sie sollten alle den Status "offen" melden. Führen Sie für jeden der Endstopps den Befehl QUERY_ENDSTOPS erneut aus, während Sie den Endstopp manuell auslösen. Der QUERY_ENDSTOPS-Befehl sollte den Endstopp als "TRIGGERED" melden.
fr: Déplacez manuellement tous les axes de l'imprimante afin qu'aucun d'entre eux ne soit en contact avec une butée. Envoyez une commande QUERY_ENDSTOPS via l'onglet du terminal Octoprint. L'imprimante devrait répondre avec l'état actuel de toutes les butées configurées et elles devraient toutes rapporter un état "ouvert". Pour chacun des arrêts, réexécutez la commande QUERY_ENDSTOPS en déclenchant manuellement l'arrêt. La commande QUERY_ENDSTOPS doit indiquer que la fin de course est "TRIGGERED".
ko: 모든 프린터 축을 수동으로 이동하여 어느 것도 endstop과 접촉하지 않도록 합니다. Octoprint 터미널 탭을 통해 QUERY_ENDSTOPS 명령을 보냅니다. 구성된 모든 endstop의 현재 상태를 응답해야 하며 모두 "open" 상태이어야 합니다. 각 endstop에 대해 endstop을 수동으로 누른 상태에서 QUERY_ENDSTOPS 명령을 다시 실행하십시오. QUERY_ENDSTOPS 명령은 endstop을 "TRIGGERED"로 보고해야 합니다.
pl: Ręcznie przesunąć wszystkie osie drukarki tak, aby żadna z nich nie stykała się z ogranicznikiem krańcowym. Wysłać polecenie QUERY_ENDSTOPS przez kartę terminala Octoprint. Powinno ono odpowiedzieć podając aktualny stan wszystkich skonfigurowanych ograniczników krańcowych i wszystkie powinny zgłaszać stan "otwarty". Dla każdego z tych punktów końcowych ponownie uruchomić polecenie QUERY_ENDSTOPS, ręcznie wyzwalając punkt końcowy. Polecenie QUERY_ENDSTOPS powinno zgłaszać wyłącznik krańcowy jako "TRIGGERED" (wyzwolony).
pt_br: Mova com as mãos todos os eixos da impressora para que nenhum deles entre em contato com a chave de fim de curso. Execute o comando QUERY_ENDSTOPS por meio do terminal do Octoprint. Ele deve responder com o estado atual de todos as chaves de fim de curso configuradas e todos eles devem constar como "OPEN". Para cada uma das chaves de fim de curso, acione-o manualmente e em seguida execute o comando QUERY_ENDSTOPS. O comando QUERY_ENDSTOPS deverá retornar "TRIGGERED".
zh_hans: 手动移动所有打印机轴，使它们都不与限位器接触。 通过 Octoprint 终端选项卡发送 QUERY_ENDSTOPS 命令。 它应该以所有配置的限位器的当前状态做出响应，并且它们都应该报告“打开”状态。 对于每个限位器，在手动触发限位器的同时重新运行 QUERY_ENDSTOPS 命令。 QUERY_ENDSTOPS 命令应该将终点站报告为“TRIGGERED”。
zh_hant: 手動移動所有印表機軸，使它們都不與限位器接觸。 通過 Octoprint 終端發送 QUERY_ENDSTOPS 命令。 它應該以所有配置的限位的當前狀態做出響應，並且它們都應該報告「open」（未觸發）狀態。 手動觸發每個限位器的同時重新執行 QUERY_ENDSTOPS 命令。相應的限位應該被 QUERY_ENDSTOPS 報告為「TRIGGERED」。

source: If the endstop appears inverted (it reports "open" when triggered and vice-versa) then add a "!" to the pin definition (for example, "endstop_pin: ^!ar3"), or remove the "!" if there is already one present.
de: Wenn der Endstopp invertiert erscheint (er meldet "offen", wenn er ausgelöst wird und umgekehrt), fügen Sie der Pin-Definition ein "!" hinzu (z. B. "endstop_pin: ^!ar3"), oder entfernen Sie das "!", wenn bereits eines vorhanden ist.
fr: Si la fin de course semble inversée (elle signale qu'elle est "ouverte" lorsqu'elle est déclenchée et vice-versa), ajoutez un " !" à la définition de la broche (par exemple, "endstop_pin : ^!ar3"), ou supprimez le " !" s'il est déjà présent.
ko: endstop이 거꾸로 표시되면(눌렀을 때 "open"으로 나오고 그 반대의 경우도 마찬가지임) "!"를 핀 정의에 추가하거나(예: "endstop_pin: ^!ar3") "!" 이미 있는 경우, 제거 합니다.
pl: Jeśli endstop wydaje się odwrócony (zgłasza "otwarty", gdy jest wyzwolony i odwrotnie), to dodaj "!" do definicji pinu (na przykład, "endstop_pin: ^!ar3"), lub usuń "!", jeśli już jest obecny.
pt_br: Se a chave de fim de curso parecer invertido (retornar "OPEN" quando acionado e vice-versa), adicione um "!" à configuração de pino (por exemplo, "endstop_pin: ^!ar3") ou remova o "!" se já houver um na configuração.
zh_hans: 如果限位器出现倒置（触发时报告“open”，反之亦然），则添加“！” 到引脚定义（例如，“endstop_pin: ^!ar3”），如果存在“！”就将之删除。
zh_hant: 如果限位狀態是相反的（觸發時報告「open」，反之亦然），則新增「！」 到引腳定義（例如，「endstop_pin: ^!ar3」），如果存在「！」就將之刪除。

source: If the endstop does not change at all then it generally indicates that the endstop is connected to a different pin. However, it may also require a change to the pullup setting of the pin (the '^' at the start of the endstop_pin name - most printers will use a pullup resistor and the '^' should be present).
bg: Ако крайният ограничител изобщо не се променя, това обикновено означава, че крайният ограничител е свързан към друг щифт. Това обаче може да изисква и промяна на настройката за издърпване на извода (символът "^" в началото на името на endstop_pin - повечето принтери използват резистор за издърпване и символът "^" трябва да присъства).
de: Wenn sich der Endstop überhaupt nicht ändert, deutet dies im Allgemeinen darauf hin, dass der Endstop an einen anderen Pin angeschlossen ist. Es kann jedoch auch eine Änderung der Pullup-Einstellung des Pins erforderlich sein (das '^' am Anfang des endstop_pin-Namens - die meisten Drucker verwenden einen Pullup-Widerstand und das '^' sollte vorhanden sein).
es: Si el final de carrera no cambia en absoluto, entonces generalmente indica que el final de carrera está conectado a un alfiler diferente. Sin embargo, puede requerir también un cambio a la configuración del levantado del alfiler (el '^' al comienzo del nombre de endstop_pin - la mayoría de las impresoras usarán un resistor de levantado y el '^' debería estar presente).
fr: Si la fin de course ne change pas du tout, cela indique généralement que la fin de course est connectée à une autre broche. Cependant, cela peut également nécessiter une modification du paramètre de pullup de la broche (le '^' au début du nom endstop_pin - la plupart des imprimantes utilisent une résistance pullup et le '^' doit être présent).
hu: Ha a végállás egyáltalán nem változik, akkor ez általában azt jelzi, hogy a végállás egy másik tűhöz van csatlakoztatva. Azonban az is előfordulhat, hogy a tű "pullup" beállításának megváltoztatására van szükség (a '^' az endstop_pin név elején, a legtöbb nyomtató "pullup" ellenállást használ, és a '^' -nek jelen kell lennie).
ko: endstop이 전혀 변경되지 않으면 일반적으로 endstop이 다른 핀에 연결되었음을 나타냅니다. 핀의 풀업 설정을 변경해야 할 수도 있습니다. (endstop_pin 이름 시작 부분의 '^' - 대부분의 프린터는 풀업 저항을 사용하며 '^'이 있어야 함).
pl: Jeżeli endstop w ogóle się nie zmienia, to generalnie oznacza to, że endstop jest podłączony do innego pinu. Jednak może to również wymagać zmiany ustawienia pullup dla tego pinu ('^' na początku nazwy endstop_pin - większość drukarek będzie używać rezystora pullup i '^' powinno być obecne).
pt: Se o fim de curso não mudar, geralmente indica que o fim de curso está conectado a um pino diferente. No entanto, também pode exigir uma alteração na configuração de pullup do pino (o '^' no início do nome do endstop_pin - a maioria das impressoras usará um resistor de pullup e o '^' deve estar presente).
pt_br: Se o fim de curso não mudar de estado, pode indicar que a chave de fim de curso está conectada a um pino diferente. No entanto, também pode exigir uma alteração na configuração "pullup" do pino (o '^' no início do nome endstop_pin - a maioria das impressoras usará um resistor "pullup" e o '^' deve estar presente).
sk: Ak sa koncová poloha vôbec nezmení, potom to vo všeobecnosti znamená, že koncová poloha je pripojená k inému pinu. Môže to však vyžadovať aj zmenu nastavenia pullup pinu ('^' na začiatku názvu endstop_pin - väčšina tlačiarní bude používať pullup rezistor a '^' by mal byť prítomný).
tr: Sonlandırıcıda hiçbir değişiklik olmuyorsa bu genellikle sonlandırıcının başka bir pine bağlı olduğunu işaret eder. Ancak bu, pine ait pullup ayarının değiştirilmesini de gerektirebilir (endstop_pin isminin başındaki '^' - çoğu yazıcı bir pullup direnci kullanır ve '^' zaten bulunmalıdır).
zh_hans: 如果限位器根本没有变化，则通常表示限位器连接到不同的引脚。 但是，它可能还需要更改引脚的上拉设置（endstop_pin 名称开头的“^” - 大多数打印机将使用上拉电阻并且应该存在“^”）。
zh_hant: 如果限位狀態根本沒有變化，則通常表示限位器連線到不同的引腳。 但是，它也可能表示需要更改引腳的上拉設定（endstop_pin 名稱開頭的「^」 - 大多數印表機需要使用上拉電阻並且應該存在「^」）。

source: Verify stepper motors
bg: Проверка на стъпковите двигатели
de: Schrittmotoren überprüfen
es: Verificar el motor a pasos
fr: Vérifier les moteurs pas à pas
hu: Léptetőmotorok ellenőrzése
ko: 스테퍼 모터 확인
pl: Weryfikacja silników krokowych
pt: Verifique motores de passo
pt_br: Verifique os motores de passo
sk: Skontrolujte krokové motory
tr: Step motorları doğrula
zh_hans: 验证步进电机
zh_hant: 驗證步進電機

source: Use the STEPPER_BUZZ command to verify the connectivity of each stepper motor. Start by manually positioning the given axis to a midway point and then run `STEPPER_BUZZ STEPPER=stepper_x`. The STEPPER_BUZZ command will cause the given stepper to move one millimeter in a positive direction and then it will return to its starting position. (If the endstop is defined at position_endstop=0 then at the start of each movement the stepper will move away from the endstop.) It will perform this oscillation ten times.
de: Verwenden Sie den Befehl STEPPER_BUZZ, um die Konnektivität der einzelnen Schrittmotoren zu überprüfen. Beginnen Sie mit der manuellen Positionierung der angegebenen Achse auf einen mittleren Punkt und führen Sie dann `STEPPER_BUZZ STEPPER=stepper_x` aus. Der Befehl STEPPER_BUZZ bewirkt, dass sich der angegebene Schrittmotor einen Millimeter in eine positive Richtung bewegt und dann in seine Ausgangsposition zurückkehrt. (Wenn der Endanschlag mit position_endstop=0 definiert ist, bewegt sich der Stepper zu Beginn jeder Bewegung vom Endanschlag weg). Diese Oszillation wird zehnmal durchgeführt.
fr: Utilisez la commande STEPPER_BUZZ pour vérifier la connectivité de chaque moteur pas à pas. Commencez par positionner manuellement l'axe donné à un point médian, puis exécutez la commande `STEPPER_BUZZ STEPPER=stepper_x`. La commande STEPPER_BUZZ fera en sorte que le moteur pas à pas donné se déplace d'un millimètre dans une direction positive, puis il reviendra à sa position de départ. (Si la fin de course est définie à position_endstop=0, alors au début de chaque mouvement, le stepper s'éloignera de la fin de course). Il effectuera cette oscillation dix fois.
ko: STEPPER_BUZZ 명령을 사용하여 각 스테퍼 모터의 연결을 확인합니다. 주어진 축을 중간 지점에 수동으로 배치하여 시작한 다음 `STEPPER_BUZZ STEPPER=stepper_x`를 실행합니다. STEPPER_BUZZ 명령은 주어진 스테퍼 모터가 양의 방향으로 1밀리미터 이동하도록 한 다음 시작 위치로 돌아갑니다. (만약 endstop이 position_endstop=0에 정의되어 있다면, 각 움직임이 시작될 때 스테퍼는 endstop에서 멀어질 것입니다.) 이 진동을 10번 수행할 것입니다.
pl: Użyj komendy STEPPER_BUZZ aby zweryfikować łączność każdego silnika krokowego. Zacznij od ręcznego ustawienia danej osi w punkcie środkowym, a następnie uruchom `STEPPER_BUZZ STEPPER=stepper_x`. Komenda STEPPER_BUZZ spowoduje, że dany krokowiec przesunie się o jeden milimetr w kierunku dodatnim, a następnie powróci do pozycji wyjściowej. (Jeśli endstop jest zdefiniowany na position_endstop=0 to na początku każdego ruchu stepper odsunie się od endstopu). Oscylacja ta zostanie wykonana dziesięć razy.
pt_br: Use o comando STEPPER_BUZZ para verificar a conectividade de cada motor de passo. Comece posicionando manualmente o eixo dado em um ponto intermediário e então execute `STEPPER_BUZZ STEPPER = stepper_x` no terminal. O comando STEPPER_BUZZ fará com que o motor de passo solicitado se mova um milímetro em uma direção positiva e então ele retornará à sua posição inicial. (Se o fim de curso estiver definido em position_endstop=0, então, no início de cada movimento, o stepper se afastará do fim de curso). Essa oscilação será executada dez vezes.
zh_hans: 使用 STEPPER_BUZZ 命令验证每个步进电机的连通性。 首先将要验证的轴手动挪到到中间点，然后运行`STEPPER_BUZZ STEPPER=stepper_x`。 STEPPER_BUZZ 命令将使X轴的步进器开始振荡，沿正方向移动一毫米，然后返回到其起始位置。 （如果在 position_endstop=0 处定义了限位器，则在每次运动开始时，步进器将远离限位器。）它将执行这个动作十次。
zh_hant: 使用 STEPPER_BUZZ 命令驗證每個步進電機的連通性。 首先將要驗證的軸手動挪到到中間點，然後執行`STEPPER_BUZZ STEPPER=stepper_x`。 STEPPER_BUZZ 命令將使X軸向正方向移動一毫米，再返回到其起始位置。 （如果在 position_endstop=0 處定義了限位的位置，則在每次運動開始時，步進器將遠離限位。）它將執行這個動作十次。

source: If the stepper does not move at all, then verify the "enable_pin" and "step_pin" settings for the stepper. If the stepper motor moves but does not return to its original position then verify the "dir_pin" setting. If the stepper motor oscillates in an incorrect direction, then it generally indicates that the "dir_pin" for the axis needs to be inverted. This is done by adding a '!' to the "dir_pin" in the printer config file (or removing it if one is already there). If the motor moves significantly more or significantly less than one millimeter then verify the "rotation_distance" setting.
bg: Ако стъпковият механизъм изобщо не се движи, проверете настройките "enable_pin" и "step_pin" за стъпковия механизъм. Ако стъпковият двигател се движи, но не се връща в първоначалното си положение, тогава проверете настройката "dir_pin". Ако стъпковият двигател се колебае в неправилна посока, то това обикновено показва, че "dir_pin" за оста трябва да се обърне. Това става чрез добавяне на символа "!" към "dir_pin" във файла за конфигуриране на принтера (или премахването му, ако вече има такъв). Ако двигателят се движи значително повече или значително по-малко от един милиметър, тогава проверете настройката "rotation_distance".
de: Wenn sich der Schrittmotor überhaupt nicht bewegt, dann überprüfen Sie die Einstellungen "enable_pin" und "step_pin" für den Schrittmotor. Wenn sich der Schrittmotor bewegt, aber nicht in seine ursprüngliche Position zurückkehrt, überprüfen Sie die Einstellung von "dir_pin". Wenn der Schrittmotor in eine falsche Richtung schwingt, deutet dies in der Regel darauf hin, dass der "dir_pin" für die Achse invertiert werden muss. Dies geschieht durch Hinzufügen eines '!' zum "dir_pin" in der Druckerkonfigurationsdatei (oder durch Entfernen, falls dort bereits eines vorhanden ist). Wenn sich der Motor deutlich mehr oder deutlich weniger als einen Millimeter bewegt, überprüfen Sie die Einstellung "rotation_distance".
es: Si el motor a pasos no se mueve en absoluto, entonces verifique las configuraciones de "enable_pin" y "step_pin" para el motor a pasos. Si el motor a pasos se mueve pero no regresa a su posición original entonces verifique la configuración de "dir_pin". Si el motor a pasos oscila en una dirección incorrecta, entonces generalmente indica que la "dir_pin" para un eje necesita ser invertida. Esto puede hacerse con agregar un '!' a la "dir_pin" en el archivo de configuración de la impresora (o quitándole si ya esta ahí). Si el motor se mueve significativamente más o significativamente menos que un milímetro entonces verifique la configuración "rotation_distance".
fr: Si le moteur pas à pas ne bouge pas du tout, vérifiez les réglages "enable_pin" et "step_pin" du moteur pas à pas. Si le moteur pas à pas se déplace mais ne revient pas à sa position initiale, vérifiez le réglage "dir_pin". Si le moteur pas à pas oscille dans une direction incorrecte, cela indique généralement que le paramètre "dir_pin" de l'axe doit être inversé. Pour ce faire, il suffit d'ajouter un " !" au paramètre "dir_pin" dans le fichier de configuration de l'imprimante (ou de le supprimer s'il y en a déjà un). Si le moteur se déplace de manière significativement supérieure ou inférieure à un millimètre, vérifiez le paramètre "rotation_distance".
hu: Ha a léptető egyáltalán nem mozog, akkor ellenőrizd az "enable_pin" és "step_pin" beállításokat a léptetőnél. Ha a léptetőmotor mozog, de nem tér vissza az eredeti helyzetébe, akkor ellenőrizd a "dir_pin" beállítást. Ha a léptetőmotor helytelen irányban mozog, akkor ez általában azt jelzi, hogy a tengely "dir_pin" beállítását meg kell fordítani. Ezt úgy lehet megtenni, hogy a nyomtató konfigurációs fájlban a "dir_pin" értékhez hozzáadunk egy '!' jelet (vagy eltávolítjuk, ha már van ilyen). Ha a motor egy milliméternél lényegesen többet vagy lényegesen kevesebbet mozog, akkor ellenőrizd a "rotation_distance" beállítást.
ko: 스테퍼 모터가 전혀 움직이지 않으면 "enable_pin" 및 "step_pin" 설정을 확인하십시오. 스테퍼 모터가 움직이지만 원래 위치로 돌아가지 않으면 "dir_pin" 설정을 확인하십시오. 스테퍼 모터가 잘못된 방향으로 진동하는 경우 일반적으로 축의 "dir_pin"을 반전해야 함을 나타냅니다. 이것은 프린터 구성 파일의 "dir_pin"에'!'를 추가하면 됩니다. (또는 이미 있는 경우 제거). 모터가 1밀리미터보다 훨씬 많거나 훨씬 적게 움직이는 경우 "rotation_distance" 설정을 확인하십시오.
pl: Jeśli stepper nie porusza się w ogóle, to następnie sprawdc ustawienia "enable_pin" i "step_pin" dla steppera. Jeśli silnik krokowy porusza się, ale nie powraca do pozycji wyjściowej, należy sprawdzić ustawienie "dir_pin". Jeśli silnik krokowy oscyluje w niewłaściwym kierunku, oznacza to z reguły, że "dir_pin" dla osi musi zostać odwrócony. W tym celu należy dodać znak "!" do "dir_pin" w pliku konfiguracyjnym drukarki (lub usunąć go, jeśli już tam jest). Jeśli silnik porusza się znacznie więcej lub znacznie mniej niż jeden milimetr, należy sprawdzić ustawienie "rotation_distance".
pt: Se o motor de passo não se mover, verifique as configurações de "enable_pin" e "step_pin" para o motor de passo. Se o motor de passo se mover, mas não retornar à sua posição original, verifique a configuração de "dir_pin". Se o motor de passo oscilar numa direção incorreta, geralmente indica que o "dir_pin" para o eixo precisa ser invertido. Isso é feito adicionando um '!' ao "dir_pin" no ficheiro de configuração da impressora (ou removendo-o se já houver um lá). Se o motor se mover significativamente mais ou significativamente menos que um milímetro, então verifique a configuração de "rotation_distance".
pt_br: Se o motor de passo não se mover, verifique as configurações "enable_pin" e "step_pin" do motor. Se o motor de passo se mover, mas não retornar à sua posição original, verifique a configuração de "dir_pin". Se o motor de passo oscilar em uma direção incorreta, geralmente indica que o "dir_pin" do eixo precisa ser invertido. Isso é feito adicionando um '!' ao "dir_pin" no arquivo de configuração da impressora (ou removendo-o se já houver um). Se o motor se mover significativamente mais ou significativamente menos do que um milímetro, verifique a configuração de "rotation_distance".
sk: Ak sa stepper vôbec nepohybuje, skontrolujte nastavenia „enable_pin“ a „step_pin“ pre stepper. Ak sa krokový motor pohne, ale nevráti sa do svojej pôvodnej polohy, skontrolujte nastavenie "dir_pin". Ak krokový motor osciluje v nesprávnom smere, potom to vo všeobecnosti znamená, že "dir_pin" pre os je potrebné prevrátiť. To sa dosiahne pridaním '!' na "dir_pin" v konfiguračnom súbore tlačiarne (alebo ho odstráňte, ak tam už nejaký je). Ak sa motor pohybuje výrazne viac alebo výrazne menej ako jeden milimeter, overte nastavenie "rotation_distance".
tr: Step motor hiç hareket etmez ise motorun "enable_pin" ve "step_pin" ayarlarını doğrulayın. Step motor hareket eder ama orjinal pozisyonuna dönmez ise "dir_pin" ayarını doğrulayın. Motor yanlış bir yönde salınım yaparsa bu genellikle o eksene ait "dir_pin" değerinin ters çevrilmesi gerektiğini işaret eder. Yazıcı konfigürasyon dosyasındaki "dir_pin" değerine "!" eklenerek (veya zaten var ise silinerek) bu işlem gerçekleştirilir. Motor bir milimetreden önemli ölçüde az veya fazla hareket ederse "rotation_distance" ayarını doğrulayın.
zh_hans: 如果步进器根本不移动，则验证步进器的“enable_pin”和“step_pin”设置。 如果步进电机移动但没有返回其原始位置，则验证“dir_pin”设置。 如果步进电机的振荡方向不正确，则通常表示需要反转轴的“dir_pin”。 即通过添加“！”来完成， 到打印机配置文件中的“dir_pin”（如果已经存在“！”，则将其删除）。 如果电机移动明显大于或小于一毫米，则验证“rotation_distance”设置。
zh_hant: 如果步進電機根本不動，則需要驗證步進驅動的「enable_pin」和「step_pin」設定。 如果步進電機移動但沒有返回其原始位置，則需要驗證「dir_pin」設定。 如果步進電機的振盪方向不正確，則通常表示需要反轉驅動的「dir_pin」。 即通過新增「!」 到印表機配置檔案中的「dir_pin」設定來完成（如果已經存在"!"，則將其刪除）。 如果電機移動明顯大於或小於一毫米，則需要驗證「rotation_distance」設定。
