Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Config_Reference.po
Languages: fr, zh_hans

source: [bed_mesh] #speed: 50 # The speed (in mm/s) of non-probing moves during the calibration. # The default is 50. #horizontal_move_z: 5 # The height (in mm) that the head should be commanded to move to # just prior to starting a probe operation. The default is 5. #mesh_radius: # Defines the radius of the mesh to probe for round beds. Note that # the radius is relative to the coordinate specified by the # mesh_origin option. This parameter must be provided for round beds # and omitted for rectangular beds. #mesh_origin: # Defines the center X, Y coordinate of the mesh for round beds. This # coordinate is relative to the probe's location. It may be useful # to adjust the mesh_origin in an effort to maximize the size of the # mesh radius. Default is 0, 0. This parameter must be omitted for # rectangular beds. #mesh_min: # Defines the minimum X, Y coordinate of the mesh for rectangular # beds. This coordinate is relative to the probe's location. This # will be the first point probed, nearest to the origin. This # parameter must be provided for rectangular beds. #mesh_max: # Defines the maximum X, Y coordinate of the mesh for rectangular # beds. Adheres to the same principle as mesh_min, however this will # be the furthest point probed from the bed's origin. This parameter # must be provided for rectangular beds. #probe_count: 3, 3 # For rectangular beds, this is a comma separate pair of integer # values X, Y defining the number of points to probe along each # axis. A single value is also valid, in which case that value will # be applied to both axes. Default is 3, 3. #round_probe_count: 5 # For round beds, this integer value defines the maximum number of # points to probe along each axis. This value must be an odd number. # Default is 5. #fade_start: 1.0 # The gcode z position in which to start phasing out z-adjustment # when fade is enabled. Default is 1.0. #fade_end: 0.0 # The gcode z position in which phasing out completes. When set to a # value below fade_start, fade is disabled. It should be noted that # fade may add unwanted scaling along the z-axis of a print. If a # user wishes to enable fade, a value of 10.0 is recommended. # Default is 0.0, which disables fade. #fade_target: # The z position in which fade should converge. When this value is # set to a non-zero value it must be within the range of z-values in # the mesh. Users that wish to converge to the z homing position # should set this to 0. Default is the average z value of the mesh. #split_delta_z: .025 # The amount of Z difference (in mm) along a move that will trigger # a split. Default is .025. #move_check_distance: 5.0 # The distance (in mm) along a move to check for split_delta_z. # This is also the minimum length that a move can be split. Default # is 5.0. #mesh_pps: 2, 2 # A comma separated pair of integers X, Y defining the number of # points per segment to interpolate in the mesh along each axis. A # "segment" can be defined as the space between each probed point. # The user may enter a single value which will be applied to both # axes. Default is 2, 2. #algorithm: lagrange # The interpolation algorithm to use. May be either "lagrange" or # "bicubic". This option will not affect 3x3 grids, which are forced # to use lagrange sampling. Default is lagrange. #bicubic_tension: .2 # When using the bicubic algorithm the tension parameter above may # be applied to change the amount of slope interpolated. Larger # numbers will increase the amount of slope, which results in more # curvature in the mesh. Default is .2. #relative_reference_index: # A point index in the mesh to reference all z values to. Enabling # this parameter produces a mesh relative to the probed z position # at the provided index. #faulty_region_1_min: #faulty_region_1_max: # Optional points that define a faulty region. See docs/Bed_Mesh.md # for details on faulty regions. Up to 99 faulty regions may be added. # By default no faulty regions are set.
fr: [bed_mesh] #speed: 50 # La vitesse (en mm/s) des déplacements entre les points de palpage # durant l'étalonnage. # La valeur par défaut est 50. #horizontal_move_z: 5 # La hauteur (en mm) à laquelle la tête doit être relevée juste avant de # lancer une opération de palpage. La valeur par défaut est 5. #mesh_radius: # Définit le rayon de la maille à palper pour les lits circulaires. Notez que # le rayon est relatif aux coordonnées spécifiées par l'option # mesh_origin. Ce paramètre doit être fourni pour des lits circulaires # et omis pour des lits rectangulaires. #mesh_origin: # Définit les coordonnées X, Y du centre du maillage des lits circulaires. Ces # coordonnées sont relatives à l'emplacement de la sonde. Il peut être utile # d'ajuster l'origine du maillage afin de maximiser la taille du rayon du maillage. # La valeur par défaut est 0, 0. Ce paramètre doit être omis pour des lits rectangulaires. #mesh_min: # Définit les coordonnées X, Y minimales du maillage pour les lits rectangulaires. # Ces coordonnées sont relatives à l'emplacement de la sonde. Cette position # sera le premier point sondé, le plus proche de l'origine. Ce paramètre doit # être fourni pour des lits rectangulaires. #mesh_max: # Définit les coordonnées X, Y maximales du maillage pour les lits rectangulaires. # Le principe est le même que pour mesh_min, mais ce sera le point le plus éloigné # atteignable par rapport à l'origine du lit. Ce paramètre doit être fourni pour # des lits rectangulaires. #probe_count: 3, 3 # Pour les lits rectangulaires, il s'agit d'une paire d'entiers X, Y séparés par des virgules, # définissant le nombre de points à palper le long de chaque axe. # Une valeur seule est également valide, auquel cas cette valeur sera appliquée aux # deux axes. La valeur par défaut est 3, 3. #round_probe_count: 5 # Pour les lits circulaires, cette valeur entière définit le nombre maximum de points # à palper le long de chaque axe. Cette valeur doit être un nombre impair. # La valeur par défaut est 5. #fade_start: 1.0 # La position z du gcode à partir de laquelle il faut commencer à éliminer progressivement # l'ajustement z lorsque la compensation est activée. La valeur par défaut est 1.0. #fade_end: 0.0 # La position z du gcode à partir de laquelle la compensation se termine. Lorsqu'elle est # définie à une valeur inférieure à fade_start, la compensation est désactivée. Notez que # la compensation peut ajouter une mise à l'échelle indésirable le long de l'axe z d'une impression. # Si un utilisateur souhaite activer la compensation, une valeur de 10.0 est recommandée. # La valeur par défaut est 0.0, ce qui désactive la compensation. #fade_target: # La position z vers laquelle la compensation doit converger. Lorsque cette valeur est # définie à une valeur non nulle, elle doit se situer dans la plage des valeurs z du maillage. # Les utilisateurs qui souhaitent converger vers la position de mise à l'origine du Z # doivent régler cette valeur à 0. # La valeur par défaut est la valeur z moyenne du maillage. #split_delta_z: .025 # Le delta de différence de Z (en mm) le long d'un mouvement qui déclenchera une séparation. # La valeur par défaut est de 0,025. #move_check_distance: 5.0 # La distance (en mm) le long d'un mouvement pour vérifier le split_delta_z. # C'est également la longueur minimale pour laquelle un mouvement peut être divisé. # La valeur par défaut est 5.0. #mesh_pps: 2, 2 # Une paire de nombres entiers X, Y séparés par des virgules, définissant le nombre de # points par segment à interpoler dans le maillage le long de chaque axe. Un "segment" # étant défini comme l'espace entre chaque point palpé. # L'utilisateur peut saisir une seule valeur qui sera appliquée aux deux axes. # La valeur par défaut est 2, 2. #algorithme: lagrange # L'algorithme d'interpolation à utiliser. Soit "lagrange", soit "bicubic". Cette option # n'affecte pas les grilles 3x3 forcées d'utiliser l'échantillonnage de lagrange. # La valeur par défaut est lagrange. #bicubic_tension: .2 # Lors de l'utilisation de l'algorithme bicubic, le paramètre de tension ci-dessus peut # être appliqué pour modifier la quantité de pente interpolée. # Des nombres plus grands augmenteront la quantité de pente entraînant une plus grande # courbure du maillage. La valeur par défaut est 0,2. #relative_reference_index: # Un index de points dans le maillage auquel référencer toutes les valeurs z. En activant # ce paramètre, on produit un maillage relatif à la position z palpée de l'indice fourni. #faulty_region_1_min: #faulty_region_1_max: # Points optionnels définissant une région défectueuse. Voir docs/Bed_Mesh.md pour # plus de détails sur les régions défectueuses. Jusqu'à 99 régions défectueuses peuvent # être ajoutées. # Par défaut, aucune région défectueuse n'est définie.
zh_hans: [bed_mesh] #speed: 50 # 校准期间非探测移动的速度(mm/s) # 默认是 50. #horizontal_move_z: 5 # 在探测中喷头的高度单位是mm # 默认值是5 #mesh_radius: # 定义探测圆形热床的网格半径 # 半径是相对于mesh_origin指定的坐标 # 此选项只适用于圆形热床 #mesh_origin: # 定义圆形热床的中心X Y坐标 # 此坐标相对于探头的位置 # 调整 mesh_origin可能会对最大化mesh_radius有帮助 # 默认值是0,0 # 此选项只适用于圆形热床 #mesh_min: # 定义矩形热床的最小X Y 坐标 # 这个坐标是相对于 # 这是探测的第一个点在原点附近 # 矩形热床必须要提供此参数 #mesh_max: # 定义矩形热床的最大X Y 坐标 # 与mesh_min相同但是这将是离床的原点最远的探测点 # 矩形热床必须要提供此参数 #probe_count: 3, 3 # 对于矩形热床，这个逗号分开了在X Y 轴需要探测的点数 # 单个值也是有效的，在这个情况下值会被应用到两个轴 # 默认值是 3, 3 #round_probe_count: 5 # 对于圆形热床，这个值去定义了每个轴最大的探测点的数量 # 这个值必须要是奇数 # 默认值是 5 #fade_start: 1.0 # 启用fade_start时开始分阶段调整的gcode z位置 # 默认值是 1.0. #fade_end: 0.0 # 在完成渐变后的gcode z 位置 # 当值比 fade_start低的时候会禁用此功能 # 注意这个功能可能会在打印的时候往z轴添加不需要的缩放 # 如果希望启用过度那么, 推荐值为10.0 # 默认值是 0.0 不启用过度 #fade_target: # 淡化应该聚集的z位置 # 当这个值被设置为非零值时那么就必须在网格中的Z值范围内 # 用户希望汇聚的时候z原点的位置 # 应该被设置为0 # 默认是网格的平均值 #split_delta_z: .025 # 触发分层的沿途Z差量 (mm) # 默认值是 .025. #move_check_distance: 5.0 # 检查split_delta_z的距离 # 这也是一个动作可以分层的最小长度。 # 默认值是 5.0 #mesh_pps: 2, 2 # 一对以逗号分隔的整数X、Y，定义每段的点的数量 # 在网格中沿每个轴插值的点数 # "segment "可以被定义为每个探测点之间的空间 # 如果用户输入了一个值那么将会应用到两个轴上 # 默认值上 2, 2 #algorithm: lagrange # 要使用的插值算法 # 可以是"lagrange"或者"bicubic" # 这个选项不会影响 3x3 的网格因为3x3 的网格会强制使用lagrange采样 # 默认值是lagrange #bicubic_tension: .2 # 当使用bicubic算法时使用bicubic_tension参数来改变插值的斜率量 # 较大的数字会增加斜率的数量会在网格中产生更多的弯曲 # 默认值是 .2 #relative_reference_index: # 网格中的一个点索引，用来引用所有的Z值 # 启用这个参数可以产生一个相对于所提供的索引处的 # 探测到的Z位置的网格 #faulty_region_1_min: #faulty_region_1_max: # 可选点被定义为故障区域 # 更多对于故障区域多信息See docs/Bed_Mesh.md # 最多可添加 99 个故障区域。 # 默认没有设置故障区域

source: [bed_tilt] #x_adjust: 0 # The amount to add to each move's Z height for each mm on the X # axis. The default is 0. #y_adjust: 0 # The amount to add to each move's Z height for each mm on the Y # axis. The default is 0. #z_adjust: 0 # The amount to add to the Z height when the nozzle is nominally at # 0, 0. The default is 0. # The remaining parameters control a BED_TILT_CALIBRATE extended # g-code command that may be used to calibrate appropriate x and y # adjustment parameters. #points: # A list of X, Y coordinates (one per line; subsequent lines # indented) that should be probed during a BED_TILT_CALIBRATE # command. Specify coordinates of the nozzle and be sure the probe # is above the bed at the given nozzle coordinates. The default is # to not enable the command. #speed: 50 # The speed (in mm/s) of non-probing moves during the calibration. # The default is 50. #horizontal_move_z: 5 # The height (in mm) that the head should be commanded to move to # just prior to starting a probe operation. The default is 5.
fr: [bed_tilt] #x_adjust: 0 # Quantité à ajouter à la hauteur Z de chaque mouvement pour chaque mm sur l'axe X. # La valeur par défaut est 0. #y_adjust: 0 # Quantité à ajouter à la hauteur Z de chaque mouvement pour chaque mm sur l'axe Y. # La valeur par défaut est 0. #z_adjust: 0 # Quantité à ajouter à la hauteur Z lorsque la buse est nominalement à 0, 0. # La valeur par défaut est 0. # Les paramètres suivants contrôlent la commande g-code étendue BED_TILT_CALIBRATE # utilisée pour calibrer les paramètres de réglage x et y appropriés. #points: # Une liste de coordonnées X, Y (une par ligne ; les lignes suivantes indentées) devant # être palpées pendant une commande BED_TILT_CALIBRATE # Spécifiez les coordonnées de la buse et assurez-vous que la sonde est au-dessus du lit # aux coordonnées données de la buse. # La valeur par défaut est de ne pas activer la commande. #speed: 50 # Vitesse (en mm/s) des mouvements de déplacements hors palpage pendant l'étalonnage. # La valeur par défaut est 50. #horizontal_move_z: 5 # Hauteur (en mm) à laquelle la tête doit être relevée lors du déplacement juste avant # de lancer une opération de palpage. La valeur par défaut est 5.
zh_hans: [bed_tilt] #x_调整：0 # 在 X 轴上每 mm 添加到每次移动的 Z 高度的量 # 轴。默认值为 0。 #y_调整：0 # 在 Y 轴上每 mm 添加到每次移动的 Z 高度的量 # 轴。默认值为 0。 #z_调整：0 # 喷嘴标称位置时添加到 Z 高度的量 # 0, 0。默认为 0。 # 其余参数控制一个 BED_TILT_CALIBRATE 扩展 # g-code 命令，可用于校准适当的 x 和 y #调整参数。 #点： # X、Y 坐标列表（每行一个；后续行 # indented) 应该在 BED_TILT_CALIBRATE 期间探测 ＃ 命令。指定喷嘴的坐标并确保探头 # 在给定喷嘴坐标处的床上方。默认是 # 不启用命令。 #速度：50 # 校准期间非探测移动的速度（以 mm/s 为单位）。 # 默认为 50。 #horizontal_move_z：5 # 头部应该被命令移动到的高度（以毫米为单位） # 就在开始探测操作之前。默认值为 5。

source: [bed_screws] #screw1: # The X, Y coordinate of the first bed leveling screw. This is a # position to command the nozzle to that is directly above the bed # screw (or as close as possible while still being above the bed). # This parameter must be provided. #screw1_name: # An arbitrary name for the given screw. This name is displayed when # the helper script runs. The default is to use a name based upon # the screw XY location. #screw1_fine_adjust: # An X, Y coordinate to command the nozzle to so that one can fine # tune the bed leveling screw. The default is to not perform fine # adjustments on the bed screw. #screw2: #screw2_name: #screw2_fine_adjust: #... # Additional bed leveling screws. At least three screws must be # defined. #horizontal_move_z: 5 # The height (in mm) that the head should be commanded to move to # when moving from one screw location to the next. The default is 5. #probe_height: 0 # The height of the probe (in mm) after adjusting for the thermal # expansion of bed and nozzle. The default is zero. #speed: 50 # The speed (in mm/s) of non-probing moves during the calibration. # The default is 50. #probe_speed: 5 # The speed (in mm/s) when moving from a horizontal_move_z position # to a probe_height position. The default is 5.
fr: [bed_screws] #screw1: # Coordonnées X, Y de la première vis de réglage du niveau du lit. Il s'agit de la # position vers laquelle déplacer la buse afin qu'elle soit placée au-dessus de cette # vis de réglage (ou aussi proche que possible tout en étant au-dessus du lit). # Ce paramètre doit être fourni. #screw1_name: # Un nom arbitraire pour la vis donnée. Ce nom est affiché lors de # l'exécution du script d'aide. Par défaut, le nom utilisé est basé sur # la position XY de la vis. #screw1_fine_adjust : # Coordonnées X, Y pour commander la buse afin de pouvoir affiner le réglage de la vis de mise # à niveau du lit. Par défaut, il n'y a pas de réglage fin sur la vis de mise à niveau du lit. #screw2: #screw2_name: #screw2_fine_adjust: #... # Vis supplémentaires de mise à niveau du lit. Au moins trois vis doivent être # définies. #horizontal_move_z: 5 # Hauteur (en mm) à laquelle la tête doit être relevée pour se déplacer # lors du passage d'une vis à la suivante. La valeur par défaut est 5. #probe_height: 0 # Hauteur de la sonde (en mm) après ajustement dû à la dilatation thermique # du lit et de la buse. La valeur par défaut est zéro. #speed: 50 # Vitesse (en mm/s) des déplacements entre les palpages pendant l'étalonnage. # La valeur par défaut est 50. #probe_speed: 5 # Vitesse (en mm/s) lors du déplacement d'une position horizontal_move_z # à la position probe_height. La valeur par défaut est 5.
zh_hans: [bed_screws] #screw1: # 第一颗打印机调平螺丝的X,Y坐标。这是将命令喷嘴移动到螺丝正 # 上方时的位置（或在床上方时尽可能接近的位置）。 # 必须提供此参数。 #screw1_name: # 给定螺丝的名称。当调平助手脚本运行时会使用该名称。 # 默认值是螺丝的 XY 位置 #screw1_fine_adjust: # 用于精细调整第一颗调平螺丝时的喷嘴被命令移动到的X,Y坐标。 # 默认值为不执行对打印床螺丝的精细调整。 #screw2: #screw2_name: #screw2_fine_adjust: #... # 可以有而外的调平螺丝但是至少需要3个 #horizontal_move_z: 5 # 打印头在两个点之间移动时候的高度 # 默认值为 5 #probe_height: 0 # 探针高度 (mm) 在打印床和热端热膨胀后探针的高度。 # 默认值为 0 #speed: 50 # 校准过程中非探测移动的速度 (mm/s) # 默认值为 50 #probe_speed: 5 # 从 horizontal_move_z 位置移动到 probe_height 位置的速度 (mm/s) # 默认值为 5

source: [z_tilt] #z_positions: # A list of X, Y coordinates (one per line; subsequent lines # indented) describing the location of each bed "pivot point". The # "pivot point" is the point where the bed attaches to the given Z # stepper. It is described using nozzle coordinates (the X, Y position # of the nozzle if it could move directly above the point). The # first entry corresponds to stepper_z, the second to stepper_z1, # the third to stepper_z2, etc. This parameter must be provided. #points: # A list of X, Y coordinates (one per line; subsequent lines # indented) that should be probed during a Z_TILT_ADJUST command. # Specify coordinates of the nozzle and be sure the probe is above # the bed at the given nozzle coordinates. This parameter must be # provided. #speed: 50 # The speed (in mm/s) of non-probing moves during the calibration. # The default is 50. #horizontal_move_z: 5 # The height (in mm) that the head should be commanded to move to # just prior to starting a probe operation. The default is 5. #retries: 0 # Number of times to retry if the probed points aren't within # tolerance. #retry_tolerance: 0 # If retries are enabled then retry if largest and smallest probed # points differ more than retry_tolerance. Note the smallest unit of # change here would be a single step. However if you are probing # more points than steppers then you will likely have a fixed # minimum value for the range of probed points which you can learn # by observing command output.
fr: [z_tilt] #z_positions: # Une liste de coordonnées X, Y (une par ligne ; les lignes subséquentes # indentées) décrivant l'emplacement de chaque "point de pivot" du lit. # Le "point de pivot" est le point où le lit s'attache à l'élément Z # donné. Il est décrit à l'aide des coordonnées de la buse (la position X, Y # de la buse si elle pouvait se déplacer directement au-dessus du point). La # première entrée correspond à stepper_z, la deuxième à stepper_z1, # la troisième à stepper_z2, etc. Ce paramètre doit être fourni. #points: # Une liste de coordonnées X, Y (une par ligne ; les lignes ultérieures # indentées) qui doivent être palpées pendant une commande Z_TILT_ADJUST. # Spécifiez les coordonnées de la buse et assurez-vous que le palpeur est au-dessus # du lit aux coordonnées données de la buse. Ce paramètre doit être # fourni. #speed: 50 # La vitesse (en mm/s) des mouvements de déplacements hors palpage # pendant l'étalonnage. La valeur par défaut est 50. #horizontal_move_z: 5 # Hauteur (en mm) à laquelle la tête doit être relevée pour se déplacer juste avant # de lancer une opération de palpage. La valeur par défaut est 5. #retries: 0 # Nombre de tentatives à effectuer si les points palpés ne sont pas dans la tolérance. #retry_tolerance: 0 # Si les réessais sont activés, réessayer si les points sondés les plus grands et les plus petits # diffèrent plus que la tolérance retry_tolerance. Notez que la plus petite unité de # changement ici serait un seul pas. Cependant, si vous sondez plus de points que de steppers, # il est probable que vous aurez une valeur minimale fixe pour la plage de points sondés. Vous # pouvez en apprendre plus en observant la sortie de la commande.

source: Where x is the 0, 0 point on the bed
fr: Où x est la position 0, 0 sur le lit

source: [quad_gantry_level] #gantry_corners: # A newline separated list of X, Y coordinates describing the two # opposing corners of the gantry. The first entry corresponds to Z, # the second to Z2. This parameter must be provided. #points: # A newline separated list of four X, Y points that should be probed # during a QUAD_GANTRY_LEVEL command. Order of the locations is # important, and should correspond to Z, Z1, Z2, and Z3 location in # order. This parameter must be provided. For maximum accuracy, # ensure your probe offsets are configured. #speed: 50 # The speed (in mm/s) of non-probing moves during the calibration. # The default is 50. #horizontal_move_z: 5 # The height (in mm) that the head should be commanded to move to # just prior to starting a probe operation. The default is 5. #max_adjust: 4 # Safety limit if an adjustment greater than this value is requested # quad_gantry_level will abort. #retries: 0 # Number of times to retry if the probed points aren't within # tolerance. #retry_tolerance: 0 # If retries are enabled then retry if largest and smallest probed # points differ more than retry_tolerance.
fr: [quad_gantry_level] #gantry_corners: # Une liste de coordonnées X, Y, séparées par des nouvelles lignes, décrivant les deux # coins opposés du portique. La première entrée correspond à Z, la seconde à Z2. # Ce paramètre doit être fourni. #points: # Une liste, séparée par des retours à la ligne, de quatre points X, Y qui doivent être palpés # pendant une commande QUAD_GANTRY_LEVEL. L'ordre des emplacements est # important, et doit correspondre aux emplacements Z, Z1, Z2 et Z3 dans l'ordre. # Ce paramètre doit être fourni. Pour une précision maximale, assurez-vous que les décalages # de votre sonde sont configurés. #speed: 50 # La vitesse (en mm/s) des mouvements sans palpage pendant l'étalonnage. # La valeur par défaut est 50. #horizontal_move_z: 5 # La hauteur (en mm) à laquelle la tête doit être relevée pour se déplacer # juste avant de lancer une opération de palpage. La valeur par défaut est 5. #max_adjust: 4 # Limite de sécurité si un ajustement supérieur à cette valeur est demandé. # quad_gantry_level abandonnera. #retries: 0 # Nombre de tentatives si les points palpés ne sont pas dans la tolérance. #retry_tolerance: 0 # Si les re-tentatives (retries) sont activés, réessayer si les points palpés les plus grands et les plus # petits diffèrent plus que la tolérance de re-tentative (retry_tolerance).
zh_hans: [quad_gantry_level] #gantry_corners: # 描述龙门两个对立角的X，Y坐标的换行分隔列表。第一行对应Z， # 第二行对应Z2。 # 必须提供此参数。 #points: # 应在QUAD_GANTRY_LEVEL命令期间探测的四个X，Y点的换行分隔列表。 # 位置的顺序很重要，应该按照Z，Z1，Z2和Z3的位置顺序。 # 必须提供此参数。 # 为了最大的准确性，请确保配置了你的探针偏移。 #speed: 50 # 校准期间非探测移动的速度（以mm/s为单位）。 # 默认值是50。 #horizontal_move_z: 5 # 头部应被命令移动到的高度（以mm为单位），在开始探针操作之前。 # 默认值是5。 #max_adjust: 4 # 如果请求的调整大于此值，则quad_gantry_level将中止。 #retries: 0 # 如果探测的点不在容忍范围内，重试的次数。 #retry_tolerance: 0 # 如果启用了重试，则在最大和最小的探测点差异超过 # retry_tolerance时重试。

source: Safe Z homing. One may use this mechanism to home the Z axis at a specific X, Y coordinate. This is useful if the toolhead, for example has to move to the center of the bed before Z can be homed.
fr: Mise à l'origine sûre de l'axe Z. On peut utiliser ce mécanisme pour centrer l'axe Z sur des coordonnées X, Y spécifiques. Ceci est utile si la tête de l'outil, par exemple, doit se déplacer vers le centre du lit avant que l'axe Z puisse être mis à l'origine.
zh_hans: 安全Z轴归位。可以用该机制定义Z轴归位时的 X, Y 坐标。在工具头必须先移动到打印床中央再进行Z归位时很有用。
