Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Config_Reference.po
Languages: fr, zh_hans

source: Run-time configurable output pins (one may define any number of sections with an "output_pin" prefix). Pins configured here will be setup as output pins and one may modify them at run-time using "SET_PIN PIN=my_pin VALUE=.1" type extended [g-code commands](G-Codes.md#output_pin).
fr: Broches de sortie configurables à l'exécution (on peut définir un nombre quelconque de sections avec un préfixe "output_pin"). Les broches configurées ici seront paramétrées comme des broches de sortie modifiables au moment de l'exécution en utilisant des [commandes g-code étendues](G-Codes.md#output_pin) de type "SET_PIN PIN=my_pin VALUE=.1"
zh_hans: 运行时可配置的输出引脚（可以定义任意数量的带有 "output_pin "前缀的分段）。在这里配置的引脚将被设置为输出引脚，可以在运行时使用 "SET_PIN PIN=my_pin VALUE=.1 "类型的扩展[G代码命令](G-Code.md#output_pin)对其进行修改。

source: Configuration of Trinamic stepper motor drivers in UART/SPI mode. Additional information is in the [TMC Drivers guide](TMC_Drivers.md) and in the [command reference](G-Codes.md#tmcxxxx).
fr: Configuration des pilotes de moteurs pas à pas Trinamic en mode UART/SPI. Des informations supplémentaires sont disponibles dans le [guide des pilotes TMC](TMC_Drivers.md) et dans la [référence des commandes](G-Codes.md#tmcxxxx).
zh_hans: 在UART/SPI模式下配置Trinamic步进电机驱动器。其他信息在[TMC驱动程序指南](TMC_Drivers.md)和[命令参考](G-Code.md#tmcxxxx)中。

source: See the [command reference](G-Codes.md#filament_switch_sensor) for more information.
fr: Voir la [référence de la commande](G-Codes.md#filament_switch_sensor) pour plus d'informations.
zh_hans: 更多信息请参阅[命令参考](G-Codes.md#filament_switch_sensor)。

source: The extruder section is used to describe the heater parameters for the nozzle hotend along with the stepper controlling the extruder. See the [command reference](G-Codes.md#extruder) for additional information. See the [pressure advance guide](Pressure_Advance.md) for information on tuning pressure advance.
fr: La section de l'extrudeuse est utilisée pour décrire les paramètres de chauffe de la buse ainsi que pour les commandes pas à pas de l'extrudeuse. Voir la [référence de commande](G-Codes.md#extruder) pour plus d'informations. Voir le [guide d'avance de pression](Pressure_Advance.md) pour des informations sur le réglage de l'avance de pression.

source: [extruder_stepper my_extra_stepper] extruder: # The extruder this stepper is synchronized to. If this is set to an # empty string then the stepper will not be synchronized to an # extruder. This parameter must be provided. #step_pin: #dir_pin: #enable_pin: #microsteps: #rotation_distance: # See the "stepper" section for the definition of the above # parameters.
fr: [extrudeur_stepper my_extra_stepper] extruder: # L'extrudeur sur lequel ce pilote moteur est synchronisé. Si ce paramètre est # défini sur une chaîne vide, le pilote ne sera pas synchronisé avec un extrudeur. # Ce paramètre doit être fourni. #step_pin: #dir_pin: #enable_pin: #microsteps: #rotation_distance: # Voir la section "stepper" pour la définition des paramètres # ci-dessus.
zh_hans: [extruder_stepper my_extra_stepper] extruder: # 这个步进电机将要同步到的挤出机名称 # 如果被设为空字符串，这个步进电机将不会被同步到挤出机 # 必须提供此参数 #step_pin: #dir_pin: #enable_pin: #microsteps: #rotation_distance: # 以上参数详见“stepper”配置分段。

source: [printer] kinematics: polar max_z_velocity: # This sets the maximum velocity (in mm/s) of movement along the z # axis. This setting can be used to restrict the maximum speed of # the z stepper motor. The default is to use max_velocity for # max_z_velocity. max_z_accel: # This sets the maximum acceleration (in mm/s^2) of movement along # the z axis. It limits the acceleration of the z stepper motor. The # default is to use max_accel for max_z_accel. # The stepper_bed section is used to describe the stepper controlling # the bed. [stepper_bed] gear_ratio: # A gear_ratio must be specified and rotation_distance may not be # specified. For example, if the bed has an 80 toothed pulley driven # by a stepper with a 16 toothed pulley then one would specify a # gear ratio of "80:16". This parameter must be provided. # The stepper_arm section is used to describe the stepper controlling # the carriage on the arm. [stepper_arm] # The stepper_z section is used to describe the stepper controlling # the Z axis. [stepper_z]
fr: [printer] kinematics: polar max_z_velocity: # Ceci définit la vitesse maximale (en mm/s) du mouvement le long de l'axe z # Ce paramètre peut être utilisé pour limiter la vitesse maximale du moteur pas à pas z. # La valeur par défaut est d'utiliser max_velocity pour max_z_velocity. max_z_accel: # Ce paramètre définit l'accélération maximale (en mm/s^2) du mouvement sur l'axe z. # Cela limite l'accélération du moteur pas à pas z. La valeur # par défaut est d'utiliser max_accel pour max_z_accel. # La section stepper_bed est utilisée pour décrire le moteur pas à pas contrôlant # le lit. [stepper_bed] gear_ratio: # Un rapport de vitesse doit être spécifié et la distance de rotation ne peut pas être spécifiée. # Par exemple, si le lit est équipé d'une poulie à 80 dents entraînée par un stepper à 16 dents, # il faut spécifier le rapport d'engrenage de "80:16". # Ce paramètre doit être fourni. # La section stepper_arm est utilisée pour décrire le moteur pas à pas contrôlant # le chariot sur le bras. [stepper_arm] # La section stepper_z permet de décrire le moteur pas à pas contrôlant l'axe Z. [stepper_z]
zh_hans: [printer] kinematics: polar max_z_velocity: # 定义了z轴的极限速度（单位：mm/s）。该设置可以单独限制 # Z轴步进电机的极限速度。 # 默认使用 max_velocity 为 max_z_velocity。 max_z_accel: # 定义了Z轴的极限加速度（单位：mm/s^2）。该设置单独限制了 # Z轴步进电机的加速度。 # 默认使用max_accel为max_z_accel。 # stepper_bed 分段定义了控制打印床的步进电机。 [stepper_bed] gear_ratio: # 必须指定齿轮比，但不必须指定旋转距离。例如，如果打印床有 # 一个80齿的滑轮，由一个16齿的步进电机驱动，那么可以指定 # 齿轮比为"80:16"。 # 必须提供此参数。 # stepper_arm分段定义了控制机械臂上滑车的步进电机。 [stepper_arm] # stepper_z 分段定义了控制Z轴的步进电机。 [stepper_z]

source: [bltouch] sensor_pin: # Pin connected to the BLTouch sensor pin. Most BLTouch devices # require a pullup on the sensor pin (prefix the pin name with "^"). # This parameter must be provided. control_pin: # Pin connected to the BLTouch control pin. This parameter must be # provided. #pin_move_time: 0.680 # The amount of time (in seconds) to wait for the BLTouch pin to # move up or down. The default is 0.680 seconds. #stow_on_each_sample: True # This determines if Klipper should command the pin to move up # between each probe attempt when performing a multiple probe # sequence. Read the directions in docs/BLTouch.md before setting # this to False. The default is True. #probe_with_touch_mode: False # If this is set to True then Klipper will probe with the device in # "touch_mode". The default is False (probing in "pin_down" mode). #pin_up_reports_not_triggered: True # Set if the BLTouch consistently reports the probe in a "not # triggered" state after a successful "pin_up" command. This should # be True for all genuine BLTouch devices. Read the directions in # docs/BLTouch.md before setting this to False. The default is True. #pin_up_touch_mode_reports_triggered: True # Set if the BLTouch consistently reports a "triggered" state after # the commands "pin_up" followed by "touch_mode". This should be # True for all genuine BLTouch devices. Read the directions in # docs/BLTouch.md before setting this to False. The default is True. #set_output_mode: # Request a specific sensor pin output mode on the BLTouch V3.0 (and # later). This setting should not be used on other types of probes. # Set to "5V" to request a sensor pin output of 5 Volts (only use if # the controller board needs 5V mode and is 5V tolerant on its input # signal line). Set to "OD" to request the sensor pin output use # open drain mode. The default is to not request an output mode. #x_offset: #y_offset: #z_offset: #speed: #lift_speed: #samples: #sample_retract_dist: #samples_result: #samples_tolerance: #samples_tolerance_retries: # See the "probe" section for information on these parameters.
fr: [bltouch] sensor_pin: # Broche connectée à la broche du capteur (sensor) BLTouch. La plupart des BLTouch # exigent un pullup sur la broche du capteur (préfixez le nom de la broche par "^"). # Ce paramètre doit être fourni. control_pin: # Broche connectée à la broche de commande du BLTouch. # Ce paramètre doit être fourni. #pin_move_time: 0.680 # Durée d'attente (en secondes) pour que la broche BLTouch se déplace vers # le haut ou le bas. La valeur par défaut est de 0,680 seconde. #stow_on_each_sample: True # Détermine si Klipper doit ordonner à la broche de se déplacer vers le haut entre # chaque palpage lors d'une séquence de palpages multiples. # Lisez les instructions dans docs/BLTouch.md avant de régler ce paramètre à False. # La valeur par défaut est True. #probe_with_touch_mode: False # Si ce paramètre est défini sur True, Klipper palpera avec le périphérique en # "touch_mode". La valeur par défaut est False (palpage en mode "pin_down"). #pin_up_reports_not_triggered: True # Définit si le BLTouch rapporte systématiquement le palpeur dans un état "non # déclenché" après une commande "pin_up" réussie. Ceci devrait être True pour # tous les BLTouch authentiques. Lisez les instructions de docs/BLTouch.md avant # de régler cette valeur à False. La valeur par défaut est True. #pin_up_touch_mode_reports_triggered: True # Définit si le BLTouch rapporte systématiquement un état "déclenché" après la # commande "pin_up_mode_reports_triggered". Ceci devrait être True pour tous les # BLTouch authentiques. Lisez les instructions de docs/BLTouch.md avant de régler # cette valeur à False. La valeur par défaut est True. #set_output_mode: # Demande un mode de sortie particulier de la broche du capteur sur un BLTouch V3.0 # (et ultérieurs). Ce paramètre ne doit pas être utilisé sur d'autres types de sondes. # Réglez sur "5V" pour demander une sortie de 5 Volts de la broche du capteur (à n'utiliser # que si la carte contrôleur nécessite le mode 5V et est tolérante à 5V sur sa ligne de signal # d'entrée). Réglez sur "OD" pour demander l'utilisation de la sortie de la broche du capteur # en mode drain ouvert. La valeur par défaut est de ne pas demander de mode de sortie. #x_offset: #y_offset: #z_offset: #speed: #lift_speed: #samples: #sample_retract_dist: #samples_result: #samples_tolerance: #samples_tolerance_retries: # Voir la section "probe" pour des informations sur ces paramètres.
zh_hans: [bltouch] sensor_pin: # 连接到 BLTouch sensor 针脚的引脚。大多数 BLTouch 需要在传感器引脚 # 上有一个上拉（在引脚名称前加上"^"）。 # 必须提供这个参数。 control_pin: # 连接到 BLTouch control 引脚的引脚。 # 必须提供这个参数。 #pin_move_time: 0.680 # 等待 BLTouch 引脚向上或向下移动的时间（秒）。 # 默认为0.680秒。 #stow_on_each_sample: True # 决定 Klipper 在多次探测的序列中每一次探测间是否命令缩回探针。 # 在设置为False之前，请阅读docs/BLTouch.md中的说明。 # 默认值是True。 #probe_with_touch_mode: False # 如果为True，那么Klipper将在设备处于"touch_mode"模式下进行 # 探测。 # 默认为False(在"pin_down"模式下探测)。 #pin_up_reports_not_triggered: True # 设置 BLTouch 在每次成功的发送“pin_up"命令收针后时候会持续 # 报告探针处于"未触发"状态。所有正版的 BLTouch 都应该是 True。 # 在设置为False前请阅读docs/BLTouch.md中的说明。 # 默认为True。 #pin_up_touch_mode_reports_triggered:True # 设置 BLTouch 在连续发送"pin_up"和"touch_mode"后是否持续报告 # "触发"状态。所有正版 BLTouch 都是True。在设置为False之前，请先阅读 # docs/BLTouch.md中的说明。 # 默认为True。 #set_output_mode: # 在BLTouch V3.0(及以后的版本)上请求一个特定的传感器引脚输出模式。 # 在其他类型的探针上不应该请求任何输出模式。设置为"5V"以要求传感 # 器引脚输出5伏电压（只在打印机主板引脚需要 5V 模式，并且其输入的 # 信号线可以容忍5V时可以使用）。设置为"OD"以要求传感器引脚输出 # 使用开漏(open drain)模式。 # 默认不要求输出模式。 #x_offset: #y_offset: #z_offset: #z_offset: #speed: #lift_speed: #samples: #sample_retract_dist: #samples_result: #samples_tolerance: #samples_tolerance_retries: #samples_tolerance_retries: # 有关这些参数的信息，请参见"probe"分段。

source: PCA9632 LED support. The PCA9632 is used on the FlashForge Dreamer.
fr: Support des LEDs du PCA9632. Le PCA9632 est utilisé sur le FlashForge Dreamer.
zh_hans: PCA9632 LED支持。PCA9632在FlashForge Dreamer上使用。
