Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Config_checks.po
Languages: bg, de, es, fr, hu, ko, pl, pt, pt_br, sk, tr, zh_hans, zh_hant

source: Run the above test for each stepper motor defined in the config file. (Set the STEPPER parameter of the STEPPER_BUZZ command to the name of the config section that is to be tested.) If there is no filament in the extruder then one can use STEPPER_BUZZ to verify the extruder motor connectivity (use STEPPER=extruder). Otherwise, it's best to test the extruder motor separately (see the next section).
bg: Изпълнете горния тест за всеки стъпков двигател, дефиниран в конфигурационния файл. (Задайте параметъра STEPPER на командата STEPPER_BUZZ на името на раздела от конфигурацията, който ще бъде тестван.) Ако в екструдера няма нишка, тогава може да се използва STEPPER_BUZZ, за да се провери свързаността на двигателя на екструдера (използвайте STEPPER=extruder). В противен случай е най-добре да се тества отделно двигателят на екструдера (вж. следващия раздел).
de: Führen Sie den obigen Test für jeden in der Config-Datei definierten Schrittmotor durch. (Setzen Sie den Parameter STEPPER des Befehls STEPPER_BUZZ auf den Namen des Konfigurationsabschnitts, der getestet werden soll.) Wenn sich kein Filament im Extruder befindet, kann man STEPPER_BUZZ verwenden, um die Konnektivität des Extrudermotors zu überprüfen (verwenden Sie STEPPER=extruder). Andernfalls ist es am besten, den Extrudermotor separat zu testen (siehe den nächsten Abschnitt).
es: Ejecute el test anterior para cada motor a pasos definido en el archivo de configuración. (Establezca el parámetro STEPPER del comando STEPPER_BUZZ al nombre de la sección de configuración que va a ser evaluada.) Si no hay un filamento en el extrusor entonces uno puede usar STEPPER_BUZZ para verificar la conectividad del motor (use STEPPER=extruder). De otra forma, es mejor el evaluar el motor del extrusor separadamente (ver la próxima sección).
fr: Exécutez le test ci-dessus pour chaque moteur pas à pas défini dans le fichier de configuration. (Définissez le paramètre STEPPER de la commande STEPPER_BUZZ au nom de la section de la configuration qui doit être testée). S'il n'y a pas de filament dans l'extrudeur, on peut utiliser STEPPER_BUZZ pour vérifier la connectivité du moteur de l'extrudeur (utilisez STEPPER=extrudeur). Sinon, il est préférable de tester le moteur de l'extrudeur séparément (voir la section suivante).
hu: Futtasd a fenti tesztet a konfigurációs fájlban definiált minden egyes léptetőmotorra. (Állítsd a STEPPER_BUZZ parancs STEPPER paraméterét a tesztelendő konfigurációs szakasz nevére). Ha nincs nyomtatószál az extruderben, akkor a STEPPER_BUZZ paranccsal ellenőrizheted az extruder motor csatlakozását (használd a STEPPER=extruder parancsot). Ellenkező esetben a legjobb ha az extruder motort külön teszteljük (lásd a következő szakaszt).
ko: 구성 파일에 정의된 각 스테퍼 모터에 대해 위의 테스트를 실행합니다. (STEPPER_BUZZ 명령의 STEPPER 매개변수를 테스트할 구성 섹션의 이름으로 설정합니다.) 압출기에 필라멘트가 없으면 STEPPER_BUZZ를 사용하여 압출기 모터 연결을 확인할 수 있습니다(STEPPER=extruder 사용). 아니면, 압출기 모터를 별도로 테스트하는 것이 가장 좋습니다.(다음 섹션 참조).
pl: Uruchom powyższy test dla każdego silnika krokowego zdefiniowanego w pliku konfiguracyjnym. (Ustaw parametr STEPPER komendy STEPPER_BUZZ na nazwę sekcji konfiguracyjnej, która ma być testowana.) Jeśli w ekstruderze nie ma filamentu, można użyć STEPPER_BUZZ do weryfikacji połączenia silnika ekstrudera (użyj STEPPER=extruder). W przeciwnym razie najlepiej przetestować silnik ekstrudera osobno (patrz następna sekcja).
pt: Execute o teste acima para cada motor de passo definido no ficheiro de configuração. (Defina o parâmetro STEPPER do comando STEPPER_BUZZ para o nome da secção de configuração que será testada.) Se não houver filamento no extrusor, é possível usar o STEPPER_BUZZ para verificar a conectividade do motor do extrusor (use STEPPER=extruder). Caso contrário, é melhor testar o motor do extrusor separadamente (veja a próxima seção).
pt_br: Execute o teste acima para cada um dos motores de passo definido no arquivo de configuração. (Defina o parâmetro STEPPER do comando STEPPER_BUZZ com o nome da seção de configuração que deve ser testada). Se não houver filamento na extrusora, poderá usar STEPPER_BUZZ para verificar a conectividade do motor da extrusora (use STEPPER=extruder). Caso contrário, é melhor testar o motor da extrusora separadamente (consulte a próxima seção).
sk: Spustite vyššie uvedený test pre každý krokový motor definovaný v konfiguračnom súbore. (Nastavte parameter STEPPER príkazu STEPPER_BUZZ na názov konfiguračnej sekcie, ktorá sa má testovať.) Ak v extrudéri nie je žiadne vlákno, môžete použiť STEPPER_BUZZ na overenie pripojenia motora extrudéra (použite STEPPER=extruder). V opačnom prípade je najlepšie vyskúšať motor extrudéra samostatne (pozri nasledujúcu časť).
tr: Yukarıdaki testi konfigürasyon dosyasında tanımlanan her step motor için çalıştır. (STEPPER_BUZZ komutundaki STEPPER parametresininin değerini test edilecek konfigürasyon bölümünün adı yapın.) Ekstrüderde filaman yok ise STEPPER_BUZZ komutunu ekstrüder motoru bağlantısını doğrulamak için kullanabilirsiniz (STEPPER=extruder yapın). Aksi halde, en iyisi ekstrüder motorunu ayrıca test etmektir (bir sonraki bölüme bakınız).
zh_hans: 对配置文件中定义的每个步进电机运行上述测试。 （将 STEPPER_BUZZ 命令的 STEPPER 参数设置为要测试的配置部分的名称。）如果挤出机中没有耗材，则可以使用 STEPPER_BUZZ 验证挤出机电机连接（使用 STEPPER=extruder）。 否则，最好单独测试挤出机电机（参见下一节）。
zh_hant: 對配置檔案中定義的每個步進電機執行上述測試。 （將 STEPPER_BUZZ 命令的 STEPPER 參數設定為要測試的配置部分的名稱。）如果擠出機中沒有耗材，也可以使用 STEPPER_BUZZ 驗證擠出機電機的接線（使用 STEPPER=extruder）。 否則，最好單獨測試擠出機電機（參見下一節）。

source: After verifying all endstops and verifying all stepper motors the homing mechanism should be tested. Issue a G28 command to home all axes. Remove power from the printer if it does not home properly. Rerun the endstop and stepper motor verification steps if necessary.
bg: След проверка на всички крайни спирачки и проверка на всички стъпкови двигатели механизмът за насочване трябва да се тества. Изпълнете команда G28, за да настроите всички оси. Прекъснете захранването на принтера, ако той не се прибере правилно. Ако е необходимо, повторете стъпките за проверка на крайните ограничители и стъпковите двигатели.
de: Nach der Verifizierung aller Endanschläge und der Verifizierung aller Schrittmotoren sollte der Referenziermechanismus getestet werden. Geben Sie einen G28-Befehl aus, um alle Achsen zu referenzieren. Trennen Sie den Drucker von der Stromversorgung, wenn er nicht ordnungsgemäß referenziert. Führen Sie die Schritte zur Überprüfung der Endanschläge und Schrittmotoren erneut durch, falls erforderlich.
es: Después de verificar todos los finales de carrera y verificar todos los motores a pasos, el mecanismo de guiado al inicio debería ser evaluado. Envíe un comando G28 para enviar al inicio todos los ejes. Quite la alimentación de poder de la impresora si no se guían al inicio adecuadamente. Repita los pasos de verificación de finales de carrera y de los motores a pasos si es necesario.
fr: Après avoir vérifié tous les arrêts et tous les moteurs pas à pas, le mécanisme d'auto-home doit être testé. Envoyez une commande G28 pour ramener tous les axes à leur position initiale. Coupez l'alimentation de l'imprimante si elle ne se positionne pas correctement. Répétez les étapes de vérification des fins de course et des moteurs pas à pas si nécessaire.
hu: Az összes végállás és léptetőmotor ellenőrzése után a célba állítási mechanizmust tesztelni kell. Adj ki egy G28 parancsot az összes tengely alaphelyzetbe állításához. Ha a nyomtató nem állítható be megfelelően, akkor kapcsold ki. Ha szükséges, ismételd meg a végállások és a léptetőmotorok ellenőrzését.
ko: 모든 endstop을 확인하고 모든 스테퍼 모터를 확인한 후 원점 복귀 메커니즘을 테스트해야 합니다. 모든 축을 홈으로 이동하려면 G28 명령을 실행하십시오. 홈으로 가지 않으면 프린터에서 전원을 제거하십시오. endstop 및 스테퍼 모터 확인 단계를 다시 실행합니다.
pl: Po sprawdzeniu wszystkich ograniczników i sprawdzeniu wszystkich silników krokowych należy przetestować mechanizm samonaprowadzający. Wydaj polecenie G28, aby bazować wszystkie osie. Odłącz zasilanie od drukarki, jeśli nie działa prawidłowo. W razie potrzeby ponownie wykonaj kroki weryfikacji ogranicznika i silnika krokowego.
pt: Após verificar todos os fins de curso e verificar todos os motores de passo, o mecanismo de referência deve ser testado. Emita um comando G28 para referenciar todos os eixos. Remova a energia da impressora se ela não se referenciar corretamente. Execute novamente os passos de verificação do fim de curso e do motor de passo, se necessário.
pt_br: Depois de verificar todos os finais de curso e verificar todos os motores de passo, o mecanismo de homing deverá ser testado. Execute o comando G28 para enviar todos os eixos para a posição inicial. Desligue energia da impressora se ela funcionar erraticamente. Se necessário, execute novamente as etapas de verificação de fim de curso e do motor de passo.
sk: Po overení všetkých koncových dorazov a overení všetkých krokových motorov by sa mal otestovať navádzací mechanizmus. Zadajte príkaz G28, aby ste uviedli všetky osi. Ak tlačiareň nefunguje správne, odpojte ju od napájania. V prípade potreby zopakujte kroky overenia koncového dorazu a krokového motora.
tr: Bütün sonlandırıcılar ve step motorlar doğrulandıktan sonra hedef arama mekanizması test edilmelidir. Bütün eksenleri hedeflemek için G28 komutunu çalıştırın. Hedefleme doğru yapılmıyorsa yazıcıyı güçten çekin. Gerekirse sonlandırıcı ve step motor doğrulama adımlarını yeniden çalıştırın.
zh_hans: 在验证所有限位器并验证所有步进电机后，应测试归位机制。 发出 G28 命令以归零所有轴。 如果打印机不能正常归位，请断开打印机电源。 然后，重新运行限位器和步进电机验证步骤。
zh_hant: 在驗證完所有限位器和所有步進電機后，應測試歸位機制。 發出 G28 命令以歸位所有軸。 如果印表機不能正常歸位，請斷開印表機電源。 然後，重新執行限位器和步進電機驗證流程。

source: Verify extruder motor
bg: Проверете двигателя на екструдера
de: Prüfen Sie den Extrudermotor
es: Verificar el motor del extrusor
fr: Vérifier le moteur de l'extrudeur
hu: Extruder motor ellenőrzése
ko: 압출기 모터 확인
pl: Sprawdź silnik wytłaczarki
pt: Verificar motor de exclusão
pt_br: Verifique o motor da extrusora
sk: Skontrolujte motor extrudéra
tr: Ekstrüder motorunu doğrula
zh_hans: 验证挤出机电机
zh_hant: 驗證擠出機電機

source: To test the extruder motor it will be necessary to heat the extruder to a printing temperature. Navigate to the Octoprint temperature tab and select a target temperature from the temperature drop-down box (or manually enter an appropriate temperature). Wait for the printer to reach the desired temperature. Then navigate to the Octoprint control tab and click the "Extrude" button. Verify that the extruder motor turns in the correct direction. If it does not, see the troubleshooting tips in the previous section to confirm the "enable_pin", "step_pin", and "dir_pin" settings for the extruder.
de: Um den Extrudermotor zu testen, muss der Extruder auf eine Drucktemperatur erhitzen. Navigieren Sie zur Registerkarte Octoprint-Temperatur und wählen Sie eine Zieltemperatur aus dem Dropdown-Feld Temperatur aus (oder geben Sie manuell eine geeignete Temperatur ein). Warten Sie, bis der Drucker die gewünschte Temperatur erreicht hat. Navigieren Sie dann zur Registerkarte Octoprint-Steuerelement und klicken Sie auf die Schaltfläche "Extrudieren". Stellen Sie sicher, dass sich der Extrudermotor in die richtige Richtung dreht. Wenn dies nicht der Fall ist, lesen Sie die Tipps zur Fehlerbehebung im vorherigen Abschnitt, um die Einstellungen "enable_pin", "step_pin" und "dir_pin" für den Extruder zu bestätigen.
fr: Pour tester le moteur de l'extrudeur, il sera nécessaire de chauffer l'extrudeur à une température d'impression. Naviguez vers l'onglet température d'Octoprint et sélectionnez une température cible dans la boîte déroulante de température (ou entrez manuellement une température appropriée). Attendez que l'imprimante atteigne la température désirée. Naviguez ensuite vers l'onglet de contrôle Octoprint et cliquez sur le bouton "Extrude". Vérifiez que le moteur de l'extrudeur tourne dans la bonne direction. Si ce n'est pas le cas, consultez les conseils de dépannage de la section précédente pour confirmer les paramètres "enable_pin", "step_pin" et "dir_pin" de l'extrudeur.
ko: 압출기 모터를 테스트하려면 압출기를 인쇄 온도로 가열해야 합니다. Octoprint 온도 탭으로 이동하여 온도 드롭다운 상자에서 목표 온도를 선택합니다(또는 적절한 온도를 수동으로 입력). 프린터가 원하는 온도에 도달할 때까지 기다립니다. 그런 다음 Octoprint 제어 탭으로 이동하여 "Extrude" 버튼을 클릭합니다. 압출기 모터가 올바른 방향으로 회전하는지 확인합니다. 그렇지 않은 경우 이전 섹션의 문제 해결 팁을 참조하여 압출기의 "enable_pin", "step_pin" 및 "dir_pin" 설정을 확인하십시오.
pl: Aby przetestować silnik ekstrudera, konieczne będzie podgrzanie ekstrudera do temperatury drukowania. Przejdź do zakładki Octoprint temperature i wybierz temperaturę docelową z listy rozwijanej temperatury (lub ręcznie wprowadź odpowiednią temperaturę). Poczekaj, aż drukarka osiągnie żądaną temperaturę. Następnie przejdź do zakładki Octoprint control i kliknij przycisk „Extrude”. Sprawdź, czy silnik ekstrudera obraca się we właściwym kierunku. Jeśli tak nie jest, zapoznaj się ze wskazówkami rozwiązywania problemów w poprzedniej sekcji, aby potwierdzić ustawienia „enable_pin”, „step_pin” i „dir_pin” dla ekstrudera.
pt_br: Para testar o motor da extrusora, será necessário aquecer o bico até a temperatura de impressão. Navegue até a guia de temperatura do Octoprint e selecione uma temperatura adequada para o filamento na caixa suspensa de temperatura (ou insira manualmente uma temperatura apropriada). Aguarde até que a impressora alcance a temperatura desejada. Em seguida, navegue até a guia de controle Octoprint e clique no botão "Extrudar". Verifique se o motor da extrusora gira na direção correta. Caso contrário, consulte as dicas de solução de problemas na seção anterior para confirmar as configurações de "enable_pin", "step_pin" e "dir_pin" para a extrusora.
zh_hans: 要测试挤出机电机，必须将挤出机加热到打印温度。 找到 Octoprint 温度选项卡并从温度下拉框中选择目标温度（或手动输入适当的温度）。 等待打印机达到所需温度。 然后找到 Octoprint 控制选项卡并单击“Extrude”按钮。 确认挤出机电机以正确的方向转动。 如果没有，请参阅上一节中的故障排除提示，以确认挤出机的“enable_pin”、“step_pin”和“dir_pin”设置。
zh_hant: 要測試擠出機電機，必須先將熱端加熱到列印溫度。導航到 Octoprint 溫度選項卡並在溫度下拉框中選擇目標溫度（或手動輸入適當的溫度）。等待印表機達到目標溫度，然後找到 Octoprint 控制選項卡並單擊「Extrude」（擠出）按鈕。 確認擠出機電機以正確的方向轉動。 如果沒有，請參閱上一節中的故障排除提示，以確認擠出機的「enable_pin」、「step_pin」和「dir_pin」設定。

source: Calibrate PID settings
bg: Калибриране на PID настройките
de: PID-Einstellungen kalibrieren
es: Calibrar las configuraciones de PID
fr: Calibrer les paramètres PID
hu: PID beállítások kalibrálása
ko: PID 설정 보정
pl: Skalibruj ustawienia PID
pt: Calibrar configurações PID
pt_br: Calibrar configurações de PID
sk: Kalibrujte nastavenia PID
tr: PID kalibrasyon ayarları
zh_hans: 校准 PID 设置
zh_hant: 校準 PID 設定

source: Klipper supports [PID control](https://en.wikipedia.org/wiki/PID_controller) for the extruder and bed heaters. In order to use this control mechanism it is necessary to calibrate the PID settings on each printer. (PID settings found in other firmwares or in the example configuration files often work poorly.)
de: Klipper unterstützt die [PID-Regelung] (https://en.wikipedia.org/wiki/PID_controller) für den Extruder und die Bettheizungen. Um diesen Regelungsmechanismus zu nutzen, ist es notwendig, die PID-Einstellungen an jedem Drucker zu kalibrieren. (PID-Einstellungen, die in anderen Firmwares oder in den Beispielkonfigurationsdateien gefunden werden, funktionieren oft schlecht).
fr: Klipper prend en charge la [commande PID](https://en.wikipedia.org/wiki/PID_controller) pour l'extrudeuse et les dispositifs de chauffage du lit. Afin d'utiliser ce mécanisme de contrôle, il est nécessaire de calibrer les paramètres PID sur chaque imprimante. (Les paramètres PID trouvés dans d'autres firmwares ou dans les fichiers de configuration d'exemple fonctionnent souvent mal).
ko: Klipper는 압출기 및 베드 히터에 대한 [PID control](https://en.wikipedia.org/wiki/PID_controller)를 지원합니다. 이 제어 메커니즘을 사용하려면 각 프린터에서 PID 설정을 보정해야 합니다. (다른 펌웨어나 예제 구성 파일에 있는 PID 설정은 제대로 작동하지 않습니다.)
pl: Klipper obsługuje [PID control](https://en.wikipedia.org/wiki/PID_controller) dla ekstrudera i podgrzewaczy stołu. Aby skorzystać z tego mechanizmu sterującego, konieczne jest skalibrowanie ustawień PID na każdej drukarce. (Ustawienia PID znalezione w innych firmware lub w przykładowych plikach konfiguracyjnych często działają słabo.)
pt_br: O Klipper suporta [controle de PID](https://en.wikipedia.org/wiki/PID_controller) para os aquecedores da extrusora e da base. Para usar este mecanismo de controle, é necessário calibrar as configurações de PID em cada impressora (as configurações de PID encontradas em outros firmwares ou nos arquivos de configuração de exemplo podem não funcionar adequadamente).
zh_hans: Klipper 支持挤出机和床加热器的 [PID 控制](https://en.wikipedia.org/wiki/PID_controller)。 为了使用这种控制机制，必须校准每台打印机上的 PID 设置。 （在其他固件或示例配置文件中找到的 PID 设置通常效果不佳。）

source: To calibrate the extruder, navigate to the OctoPrint terminal tab and run the PID_CALIBRATE command. For example: `PID_CALIBRATE HEATER=extruder TARGET=170`
de: Um den Extruder zu kalibrieren, navigieren Sie zur Registerkarte OctoPrint-Terminal und führen Sie den Befehl PID_CALIBRATE aus. Zum Beispiel: `PID_CALIBRATE HEATER=extruder TARGET=170`
fr: Pour calibrer l'extrudeur, naviguez dans l'onglet du terminal OctoPrint et exécutez la commande PID_CALIBRATE. Par exemple : `PID_CALIBRATE HEATER=extruder TARGET=170`
ko: 압출기를 보정하려면 OctoPrint 터미널 탭으로 이동하여 PID_CALIBRATE 명령을 실행하십시오. 예시: `PID_CALIBRATE HEATER=extruder TARGET=170`
pl: Aby skalibrować ekstruder, przejdź do zakładki terminala OctoPrint i uruchom polecenie PID_CALIBRATE. Na przykład: `PID_CALIBRATE HEATER=extruder TARGET=170`.`
pt_br: Para calibrar a extrusora, navegue até a aba de terminal do OctoPrint e execute o comando PID_CALIBRATE. Por exemplo: `PID_CALIBRATE HEATER=extrusor TARGET=170`
zh_hans: 要校准挤出机，请找到 OctoPrint 终端选项卡并运行 PID_CALIBRATE 命令。 例如：`PID_CALIBRATE HEATER=extruder TARGET=170`
zh_hant: 要校準擠出機，請找到 OctoPrint 終端選項卡並執行 PID_CALIBRATE 命令。 例如：`PID_CALIBRATE HEATER=extruder TARGET=170`

source: At the completion of the tuning test run `SAVE_CONFIG` to update the printer.cfg file the new PID settings.
bg: След приключване на теста за настройка стартирайте `SAVE_CONFIG`, за да актуализирате файла printer.cfg с новите настройки на PID.
de: Führen Sie nach Abschluss des Abstimmungstests `SAVE_CONFIG` aus, um die Datei printer.cfg mit den neuen PID-Einstellungen zu aktualisieren.
es: Cuando se complete la prueba de ajuste ejecute `SAVE_CONFIG` para actualizar el archivo printer.cfg con las nuevas configuraciones de PID.
fr: A la fin du test de réglage, exécutez `SAVE_CONFIG` pour mettre à jour le fichier printer.cfg avec les nouveaux paramètres PID.
hu: A hangolási teszt végén futtasd a `SAVE_CONFIG` parancsot a printer.cfg fájl új PID-beállításainak frissítéséhez.
ko: 조정 테스트가 완료되면 `SAVE_CONFIG`를 실행하여 printer.cfg 파일을 업데이트하여 새 PID 설정을 업데이트합니다.
pl: Po zakończeniu testu dostrajania uruchom `SAVE_CONFIG`, aby zaktualizować plik printer.cfg o nowemu ustawienia PID.
pt: Ao concluir o teste de calibração, execute `SAVE_CONFIG` para atualizar o ficheiro printer.cfg com as novas configurações de PID.
pt_br: Ao concluir o teste de ajuste, execute `SAVE_CONFIG` para atualizar o arquivo printer.cfg com as novas configurações de PID.
sk: Po dokončení testu ladenia spustite `SAVE_CONFIG` na aktualizáciu súboru printer.cfg na nové nastavenia PID.
tr: Yeni PID ayarlarını printer.cfg dosyasına yazmak için ayar testi bitiminde `SAVE_CONFIG` komutunu çalıştırın.
zh_hans: 调整测试完成后，运行 `SAVE_CONFIG` 以更新printer.cfg 文件的新PID 设置。
zh_hant: 調整測試完成後，執行 `SAVE_CONFIG` 以儲存新PID設定到printer.cfg檔案。
