Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/CONTRIBUTING.po
Languages: hu, it

source: Does the submission provide a "high impact" benefit to real-world users performing real-world tasks?
hu: A beadott pályázat "nagy hatású" előnyt jelent-e a valós felhasználók számára, akik valós feladatokat látnak el?
it: L'invio fornisce un vantaggio "ad alto impatto" per gli utenti del mondo reale che svolgono attività nel mondo reale?

source: Reviewers need to identify, at least in their own minds, roughly "who the target audience is", a rough scale of "the size of that audience", the "benefit" they will obtain, how the "benefit is measured", and the "results of those measurement tests". In most cases this will be obvious to both the submitter and the reviewer, and it is not explicitly stated during a review.
hu: A bírálóknak - legalábbis a saját fejükben - nagyjából meg kell határozniuk, hogy "ki a célközönség", hogy "mekkora a célközönség", hogy "milyen előnyökhöz" jutnak, hogy "az előnyöket hogyan mérik", és hogy "milyen eredményeket hoznak ezek a mérési tesztek". A legtöbb esetben ez mind a benyújtó, mind a bíráló számára nyilvánvaló, és a bírálat során nem kerül kifejezett kijelentésre.
it: I revisori devono identificare, almeno nella loro mente, approssimativamente "chi è il pubblico di destinazione", una scala approssimativa delle "dimensioni di quel pubblico", il "beneficio" che otterranno, come "il beneficio viene misurato" e i "risultati di tali prove di misurazione". Nella maggior parte dei casi questo sarà ovvio sia per il mittente che per il revisore e non è esplicitamente dichiarato durante una revisione.

source: Submissions to the master Klipper branch are expected to have a noteworthy target audience. As a general "rule of thumb", submissions should target a user base of at least a 100 real-world users.
hu: A mester Klipper ágba küldött beadványok várhatóan figyelemre méltó célközönséggel rendelkeznek. Általános "ökölszabályként" a beadványoknak legalább 100 valós felhasználóból álló felhasználói bázist kell megcélozniuk.
it: Le proposte al ramo principale di Klipper dovrebbero avere un pubblico di destinazione degno di nota. Come "regola pratica" generale, gli invii dovrebbero avere come target una base di utenti di almeno 100 utenti del mondo reale.

source: If a reviewer asks for details on the "benefit" of a submission, please don't consider it criticism. Being able to understand the real-world benefits of a change is a natural part of a review.
hu: Ha egy bíráló részleteket kér egy beadvány "hasznáról", kérjük, ne tekintsd ezt kritikának. Az, hogy képesek legyünk megérteni egy változtatás valós előnyeit, a felülvizsgálat természetes része.
it: Se un revisore chiede dettagli sul "beneficio" di un invio, non considerarlo una critica. Essere in grado di comprendere i vantaggi reali di un cambiamento è una parte naturale di una revisione.

source: All new modules, config options, commands, command parameters, and documents should have "high impact". We do not want to burden users with options that they can not reasonably configure nor do we want to burden them with options that don't provide a notable benefit.
hu: Minden új modulnak, konfigurációs opciónak, parancsnak, parancsparaméternek és dokumentumnak "nagy hatással" kell rendelkeznie. Nem akarjuk a felhasználókat olyan opciókkal terhelni, amelyeket nem tudnak ésszerűen konfigurálni, és nem akarjuk őket olyan opciókkal terhelni, amelyek nem nyújtanak számottevő előnyt.
it: Tutti i nuovi moduli, opzioni di configurazione, comandi, parametri di comando e documenti dovrebbero avere un "impatto elevato". Non vogliamo appesantire gli utenti con opzioni che non possono configurare ragionevolmente né vogliamo appesantirli con opzioni che non forniscono un vantaggio notevole.

source: A reviewer may ask for clarification on how a user is to configure an option - an ideal response will contain details on the process - for example, "users of the MegaX500 are expected to set option X to 99.3 while users of the Elite100Y are expected to calibrate option X using procedure ...".
hu: A bíráló kérhet pontosítást arról, hogy a felhasználónak hogyan kell beállítania egy opciót - az ideális válasz tartalmazza a folyamat részleteit - például: "a MegaX500 felhasználóinak az X opciót 99,3-ra kell beállítaniuk, míg az Elite100Y felhasználóinak az X opciót a ..." eljárással kell kalibrálniuk...".
it: Un revisore può chiedere chiarimenti su come un utente deve configurare un'opzione - una risposta ideale conterrà dettagli sul processo - ad esempio, "gli utenti del MegaX500 dovrebbero impostare l'opzione X su 99,3 mentre gli utenti dell'Elite100Y dovrebbero calibrare l'opzione X usando la procedura ...".

source: If the goal of an option is to make the code more modular then prefer using code constants instead of user facing config options.
hu: Ha az opció célja, hogy a kódot modulárisabbá tegye, akkor inkább használj kódkonstansokat a felhasználóval szembenéző konfigurációs opciók helyett.
it: Se l'obiettivo di un'opzione è rendere il codice più modulare, è preferibile utilizzare le costanti del codice invece delle opzioni di configurazione rivolte all'utente.

source: New modules, new options, and new parameters should not provide similar functionality to existing modules - if the differences are arbitrary than it's preferable to utilize the existing system or refactor the existing code.
hu: Az új modulok, új opciók és új paraméterek nem biztosíthatnak hasonló funkciókat a meglévő modulokhoz - ha a különbségek önkényesek, akkor inkább a meglévő rendszert kell használni, vagy a meglévő kódot kell átalakítani.
it: Nuovi moduli, nuove opzioni e nuovi parametri non dovrebbero fornire funzionalità simili ai moduli esistenti: se le differenze sono arbitrarie, è preferibile utilizzare il sistema esistente o effettuare refactoring del codice esistente.

source: Klipper does not implement a strict "coding style guide", but modifications to existing code should follow the high-level code flow, code indentation style, and format of that existing code. Submissions of new modules and systems have more flexibility in coding style, but it is preferable for that new code to follow an internally consistent style and to generally follow industry wide coding norms.
hu: A Klipper nem alkalmaz szigorú "kódolási stílus útmutatót", de a meglévő kód módosításainak követniük kell a meglévő kód magas szintű kódáramlását, kódbehúzási stílusát és formátumát. Az új modulok és rendszerek benyújtása esetén a kódolási stílus rugalmasabb, de előnyösebb, ha az új kód belsőleg konzisztens stílust követ, és általában az iparági kódolási normákat követi.
it: Klipper non implementa una rigida "guida allo stile di codifica", ma le modifiche al codice esistente dovrebbero seguire il flusso di codice di alto livello, lo stile di indentazione del codice e il formato di quel codice esistente. Gli invii di nuovi moduli e sistemi hanno una maggiore flessibilità nello stile di codifica, ma è preferibile che il nuovo codice segua uno stile internamente coerente e generalmente segua le norme di codifica.

source: It is not a goal of a review to discuss "better implementations". However, if a reviewer struggles to understand the implementation of a submission, then they may ask for changes to make the implementation more transparent. In particular, if reviewers can not convince themselves that a submission is free of defects then changes may be necessary.
hu: A felülvizsgálat célja nem a "jobb megvalósítások" megvitatása. Ha azonban egy bírálónak nehézséget okoz egy beadott pályázat megvalósításának megértése, akkor kérhet változtatásokat a megvalósítás átláthatóbbá tétele érdekében. Különösen, ha a bírálók nem tudják meggyőzni magukat arról, hogy egy beadott pályázat hibátlan, akkor változtatásokra lehet szükség.
it: Non è un obiettivo di una revisione discutere di "migliori implementazioni". Tuttavia, se un revisore ha difficoltà a comprendere l'implementazione di un invio, può richiedere modifiche per rendere l'implementazione più trasparente. In particolare, se i revisori non riescono a convincersi che un contributo è privo di difetti, potrebbero essere necessarie modifiche.

source: As part of a review, a reviewer may create an alternate Pull Request for a topic. This may be done to avoid excessive "back and forth" on minor procedural items and thus streamline the submission process. It may also be done because the discussion inspires a reviewer to build an alternative implementation. Both situations are a normal result of a review and should not be considered criticism of the original submission.
hu: A felülvizsgálat részeként egy felülvizsgáló létrehozhat egy alternatív kérést egy témához. Ezt azért lehet megtenni, hogy elkerülhető legyen a túlzott "oda-vissza" a kisebb eljárási kérdésekben, és így egyszerűsödjön a benyújtási folyamat. Ez azért is megtörténhet, mert a vita arra ösztönzi a bírálót, hogy egy alternatív implementációt készítsen. Mindkét helyzet a felülvizsgálat normális eredménye, és nem tekinthető az eredeti beadvány kritikájának.
it: Come parte di una revisione, un revisore può creare una richiesta pull alternativa per un argomento. Questo può essere fatto per evitare eccessivi "avanti e indietro" su elementi procedurali minori e quindi snellire il processo di proposta. Può anche essere fatto perché la discussione ispira un revisore a costruire un'implementazione alternativa. Entrambe le situazioni sono il normale risultato di una revisione e non devono essere considerate critiche alla proposta originale.

source: Helping with reviews
hu: Segítség a felülvizsgálatokban
it: Aiutare con le revisioni

source: We appreciate help with reviews! It is not necessary to be a [listed reviewer](#reviewers) to perform a review. Submitters of GitHub Pull Requests are also encouraged to review their own submissions.
hu: Nagyra értékeljük a segítséget a véleményekkel kapcsolatban! Nem szükséges [listázott értékelőnek](#reviewers) lenni az értékelés elvégzéséhez. A GitHub kérelmek benyújtóit is arra ösztönözzük, hogy saját beadványaikat vizsgálják felül.
it: Apprezziamo l'aiuto con le recensioni! Non è necessario essere un [revisore elencato](#reviewers) per eseguire una revisione. I propositori di richieste pull di GitHub sono inoltre incoraggiati a rivedere i propri invii.

source: To help with a review, follow the steps outlined in [what to expect in a review](#what-to-expect-in-a-review) to verify the submission. After completing the review, add a comment to the GitHub Pull Request with your findings. If the submission passes the review then please state that explicitly in the comment - for example something like "I reviewed this change according to the steps in the CONTRIBUTING document and everything looks good to me". If unable to complete some steps in the review then please explicitly state which steps were reviewed and which steps were not reviewed - for example something like "I didn't check the code for defects, but I reviewed everything else in the CONTRIBUTING document and it looks good".
hu: A felülvizsgálat során segítsen, kövesse a [mire számíthat egy felülvizsgálat során](#what-to-expect-in-a-review) pontban leírt lépéseket a beküldés ellenőrzéséhez. A felülvizsgálat befejezése után adj hozzá egy megjegyzést a GitHub kérésekhez a megállapításokkal. Ha a benyújtás átmegy az ellenőrzésen, akkor kérjük, ezt kifejezetten jelezze a megjegyzésben. Például valami olyasmit, hogy "Átnéztem ezt a módosítást a CONTRIBUTING dokumentumban leírtak szerint, és minden jónak tűnik számomra". Ha nem tudta elvégezni a felülvizsgálat egyes lépéseit, akkor kérjük, kifejezetten jelezze, hogy mely lépéseket vizsgálta felül, és melyeket nem. Például valami olyasmit, mint: "Nem ellenőriztem a kódot hibák szempontjából, de minden mást átnéztem a CONTRIBUTING dokumentumban, és úgy tűnik, hogy minden rendben van".
it: Per aiutare con una revisione, segui i passaggi descritti in [cosa aspettarsi in una revisione](#what-to-expect-in-a-review) per verificare l'invio. Dopo aver completato la revisione, aggiungi un commento alla richiesta pull di GitHub con i tuoi risultati. Se l'invio supera la revisione, si prega di dichiararlo esplicitamente nel commento, ad esempio qualcosa del tipo "Ho esaminato questa modifica in base ai passaggi del documento CONTRIBUTING e tutto mi sembra a posto". Se non è possibile completare alcuni passaggi della revisione, indicare esplicitamente quali passaggi sono stati rivisti e quali non sono stati rivisti, ad esempio qualcosa del tipo "Non ho verificato la presenza di difetti nel codice, ma ho rivisto tutto il resto nel documento CONTRIBUTING e sembra buono".

source: We also appreciate testing of submissions. If the code was tested then please add a comment to the GitHub Pull Request with the results of your test - success or failure. Please explicitly state that the code was tested and the results - for example something like "I tested this code on my Acme900Z printer with a vase print and the results were good".
hu: A beadványok tesztelését is értékeljük. Ha a kódot teszteltük, kérjük írjon egy megjegyzést a GitHub kérésekhez a tesztelés eredményével - sikerrel vagy sikertelenséggel. Kérjük, kifejezetten jelezze, hogy a kódot tesztelték, és az eredményeket - például valami olyasmit, mint: "Leteszteltem ezt a kódot az Acme900Z nyomtatómon egy váza nyomtatásával, és az eredmények jók voltak".
it: Apprezziamo anche il test degli invii. Se il codice è stato testato, aggiungi un commento alla richiesta pull di GitHub con i risultati del tuo test: successo o fallimento. Si prega di affermare esplicitamente che il codice è stato testato e i risultati, ad esempio qualcosa del tipo "Ho testato questo codice sulla mia stampante Acme900Z con una stampa a vaso e i risultati sono stati buoni".

source: Reviewers
hu: Értékelők
it: Revisori

source: The Klipper "reviewers" are:
hu: A Klipper "értékelők" a következők:
it: I "revisori" di Klipper sono:

source: Name
hu: Név
it: Nome

source: GitHub Id
hu: GitHub azonosító

source: Areas of interest
hu: Érdeklődési körök
it: Aree di interesse

source: Input shaping, resonance testing, kinematics
hu: Bemenetformálás, rezonancia vizsgálat, kinematika
it: Input shaping, test di risonanza, cinematica

source: Bed leveling, MCU flashing
hu: Tárgyasztal szintezése, MCU égetés
it: Livellamento del piatto, flashing MCU

source: Core motion system, Micro-controller code
hu: Mag mozgási rendszer, mikrokontroller kód
it: Core motion system, codice microcontrollore

source: Configuration files, documentation
hu: Konfigurációs fájlok, dokumentáció
it: File di configurazione, documentazione

source: Please do not "ping" any of the reviewers and please do not direct submissions at them. All of the reviewers monitor the forums and PRs, and will take on reviews when they have time to.
hu: Kérjük, ne "pingelje" a bírálókat, és ne küldjön beadványokat nekik. Az összes bíráló figyelemmel kíséri a fórumokat és a PR-eket, és ha van idejük, akkor vállalják a bírálatokat.
it: Si prega di non eseguire il "ping" di nessuno dei revisori e di non indirizzare gli invii a loro. Tutti i revisori controllano i forum e le PR e si occuperanno delle revisioni quando ne avranno il tempo.

source: The Klipper "maintainers" are:
hu: A Klipper "karbantartók" a következők:
it: I "manutentori" di Klipper sono:

source: GitHub name
hu: GitHub név
it: nome GitHub

source: Format of commit messages
hu: A megbízási üzenetek formátuma
it: Formato dei messaggi di commit

source: Each commit should have a commit message formatted similar to the following:
hu: Minden megbízásnak a következőhöz hasonlóan formázott üzenetet kell tartalmaznia:
it: Ogni commit dovrebbe avere un messaggio di commit formattato in modo simile al seguente:

source: In the above example, `module` should be the name of a file or directory in the repository (without a file extension). For example, `clocksync: Fix typo in pause() call at connect time`. The purpose of specifying a module name in the commit message is to help provide context for the commit comments.
hu: A fenti példában `module` egy fájl vagy könyvtár neve kell, hogy legyen a tárolóban (fájlkiterjesztés nélkül). Például `clocksync: Javítsuk ki a pause() hívásban lévő elírást a csatlakozás idején`. A modulnév megadásának célja a kérelmi üzenetben az, hogy segítsen kontextust biztosítani a kérelmi megjegyzésekhez.
it: Nell'esempio sopra, `module` dovrebbe essere il nome di un file o di una directory nel repository (senza un'estensione di file). Ad esempio, `clocksync: fix di errore di battitura nella chiamata pause() al momento della connessione`. Lo scopo di specificare un nome di modulo nel messaggio di commit è di aiutare a fornire il contesto per i commenti di commit.

source: [Klipper-translations Project](https://github.com/Klipper3d/klipper-translations) is a project dedicated to translating Klipper to different languages. [Weblate](https://hosted.weblate.org/projects/klipper/) hosts all the Gettext strings for translating and reviewing. Locales can be displayed on [klipper3d.org](https://www.klipper3d.org) once they satisfy the following requirements:
hu: [Klipper-fordítási Projekt](https://github.com/Klipper3d/klipper-translations) egy olyan projekt, amely a Klipper különböző nyelvekre való fordítását tűzte ki célul. A [Weblate](https://hosted.weblate.org/projects/klipper/) az összes Gettext stringet tárolja a fordításhoz és felülvizsgálathoz. A [klipper3d.org](https://www.klipper3d.org) oldalon megjeleníthetők a helyi nyelvek, ha megfelelnek a következő követelményeknek:
it: [Klipper-translations Project](https://github.com/Klipper3d/klipper-translations) è un progetto dedicato alla traduzione di Klipper in diverse lingue. [Weblate](https://hosted.weblate.org/projects/klipper/) ospita tutte le stringhe Gettext per la traduzione e la revisione. Le impostazioni locali possono essere visualizzate su [klipper3d.org](https://www.klipper3d.org) una volta che soddisfano i seguenti requisiti:

source: All titles (H1) are translated
hu: Minden cím (H1) le van fordítva
it: Tutti i titoli (H1) sono tradotti

source: Once the requirements are met, you need to:
hu: Ha a követelmények teljesülnek, akkor:
it: Una volta soddisfatti i requisiti, è necessario:

source: update klipper-tranlations repository [active_translations](https://github.com/Klipper3d/klipper-translations/blob/translations/active_translations)
hu: klipper-fordítási adattár frissítése [active_translations](https://github.com/Klipper3d/klipper-translations/blob/translations/active_translations)
it: aggiorna il repository di klipper-translations [active_translations](https://github.com/Klipper3d/klipper-translations/blob/translations/active_translations)

source: Optional: add a manual-index.md file in klipper-translations repository's `docs\locals\<lang>` folder to replace the language specific index.md (generated index.md does not render correctly).
hu: Opcionális: adjunk hozzá egy manual-index.md fájlt a klipper-translations repository's `docs\locals\<lang>` mappába a nyelvspecifikus index.md helyett (a generált index.md nem renderelhető helyesen).
it: Opzionale: aggiungi un file manual-index.md nella cartella `docs\locals\<lang>` del repository klipper-translations per sostituire index.md specifico della lingua (il file index.md generato non viene visualizzato correttamente).

source: Known Issues:
hu: Ismert problémák:
it: Problemi noti:

source: Currently, there isn't a method for correctly translating pictures in the documentation
hu: Jelenleg a dokumentációban nincs módszer a képek helyes fordítására
it: Al momento, non esiste un metodo per tradurre correttamente le immagini nella documentazione

source: It is impossible to translate titles in mkdocs.yml.
hu: Az mkdocs.yml-ben nem lehet címeket fordítani.
it: È impossibile tradurre i titoli in mkdocs.yml.

source: When discussing benefits it is preferable to discuss "facts and measurements". In general, reviewers are not looking for responses of the form "someone may find option X useful", nor are they looking for responses of the form "this submission adds a feature that firmware X implements". Instead, it is generally preferable to discuss details on how the quality improvement was measured and what were the results of those measurements - for example, "tests on Acme X1000 printers show improved corners as seen in picture ...", or for example "print time of real-world object X on a Foomatic X900 printer went from 4 hours to 3.5 hours". It is understood that testing of this type can take significant time and effort. Some of Klipper's most notable features took months of discussion, rework, testing, and documentation prior to being merged into the master branch.
hu: Az előnyök megvitatásakor előnyösebb a "tények és mérések" megvitatása. Általában véve a bírálók nem a "valaki hasznosnak találhatja az X opciót", sem pedig a "ez a beadvány olyan funkciót ad hozzá, amelyet az X firmware valósít meg" formájú válaszokat keresik. Ehelyett általában előnyösebb, ha részletesen tárgyalják, hogy a minőségjavulást hogyan mérték, és milyen eredményeket hoztak ezek a mérések - például: "az Acme X1000 nyomtatókon végzett tesztek a ...képen látható javuló sarkokat mutatnak ", vagy például "az X valós tárgy nyomtatási ideje egy Foomatic X900 nyomtatón 4 óráról 3,5 órára csökkent". Magától értetődik, hogy az ilyen típusú tesztelés jelentős időt és erőfeszítést igényel. A Klipper legjelentősebb funkcióinak némelyike hónapokig tartott a megbeszélések, átdolgozások, tesztelések és dokumentációk során, mielőtt beolvadt a master ágba.
it: Quando si discute dei benefici è preferibile discutere di "fatti e misurazioni". In generale, i revisori non cercano risposte del modulo "qualcuno potrebbe trovare utile l'opzione X", né cercano risposte del modulo "questo invio aggiunge una funzionalità implementata dal firmware X". Invece, è generalmente preferibile discutere i dettagli su come è stato misurato il miglioramento della qualità e quali sono stati i risultati di tali misurazioni, ad esempio "i test sulle stampanti Acme X1000 mostrano angoli migliorati come si vede in figura...", o ad esempio " il tempo di stampa dell'oggetto reale X su una stampante Foomatic X900 è passato da 4 ore a 3,5 ore". Resta inteso che i test di questo tipo possono richiedere molto tempo e sforzi. Alcune delle caratteristiche più importanti di Klipper hanno richiesto mesi di discussioni, rielaborazioni, test e documentazione prima di essere fuse nel ramo principale.

source: When fixing a defect in the code, submitters should have a general understanding of the root cause of that defect, and the fix should target that root cause.
it: Quando si corregge un difetto nel codice, i submitters dovrebbero avere una comprensione generale della causa principale di tale difetto e la correzione dovrebbe mirare a tale causa principale.
