Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/CONTRIBUTING.po
Languages: hu, it

source: Contributing to Klipper
hu: Hozzájárulás a Klipperhez
it: Contribuire a Klipper

source: It is important to have a "Signed-off-by" line on each commit - it certifies that you agree to the [developer certificate of origin](developer-certificate-of-origin). It must contain your real name (sorry, no pseudonyms or anonymous contributions) and contain a current email address.
hu: Fontos, hogy minden kérésnél legyen egy "Signed-off-by" sor. Ez igazolja, hogy egyetértesz a [fejlesztői eredetigazolással](developer-certificate-of-origin). Tartalmaznia kell a valódi nevét (sajnálom, nincs álnév vagy névtelen hozzájárulás), és tartalmaznia kell egy aktuális e-mail címet.
it: È importante avere una riga "Signed-off-by" su ogni commit - certifica che accetti il [developer certificate of origin](developer-certificate-of-origin). Deve contenere il tuo vero nome (mi dispiace, niente pseudonimi o contributi anonimi) e contenere un indirizzo email corrente.

source: module: Capitalized, short (50 chars or less) summary More detailed explanatory text, if necessary. Wrap it to about 75 characters or so. In some contexts, the first line is treated as the subject of an email and the rest of the text as the body. The blank line separating the summary from the body is critical (unless you omit the body entirely); tools like rebase can get confused if you run the two together. Further paragraphs come after blank lines.. Signed-off-by: My Name <myemail@example.org>
hu: modul: Nagybetűs, rövid (legfeljebb 50 karakteres) összefoglaló. Szükség esetén részletesebb magyarázó szöveg. Körülbelül 75 karakter. Bizonyos kontextusokban az első sort úgy kezelik, mint a az e-mail tárgya, a szöveg többi részét pedig szövegtestként. Az üres sor, amely elválasztja az összefoglalót a szövegtesttől, kritikus (kivéve, ha kihagyja a a törzsszöveget teljesen); az olyan eszközök, mint a rebase, összezavarodhatnak, ha a a kettőt együtt futtatják. Az üres sorok után további bekezdések következnek.. Aláírás: Név <myemail@example.org>
it: modulo: Riepilogo breve (50 caratteri o meno) in maiuscolo Testo esplicativo più dettagliato, se necessario. Incolonna a circa 75 caratteri o giù di lì. In alcuni contesti, la prima riga è trattata come l'oggetto di un'e-mail e il resto del testo come corpo. La riga vuota che separa il riassunto dal corpo è critica (a meno che non si ometta del tutto il corpo); strumenti come rebase possono confondersi se li metti due insieme. Ulteriori paragrafi vengono dopo le righe vuote.. Firmato da: Il mio nome <myemail@example.org>

source: Contributing to Klipper Translations
hu: Hozzájárulás a Klipper Fordításokhoz
it: Contribuire a Traduzioni Klipper

source: 75% Total coverage
hu: 75% Teljes lefedettség
it: 75% Copertura totale

source: An updated navigation hierarchy PR in klipper-translations.
hu: Egy frissített navigációs hierarchia PR a klipper-fordításokban.
it: Una gerarchia di navigazione PR aggiornata nelle traduzioni klipper.

source: To reduce the frustration of translating domain-specific terms and gain awareness of the ongoing translations, you can submit a PR modifying the [Klipper-translations Project](https://github.com/Klipper3d/klipper-translations) `readme.md`. Once a translation is ready, the corresponding modification to the Klipper project can be made.
hu: A domain-specifikus kifejezések fordításával járó frusztráció csökkentése és a folyamatban lévő fordítások megismerése érdekében küldhet PR-t, amely módosítja a [Klipper-fordítási Projekt](https://github.com/Klipper3d/klipper-translations) `readme.md` fájlt. Amint a fordítás elkészült, a Klipper-projekt megfelelő módosítása elvégezhető.
it: Per ridurre la frustrazione di tradurre termini specifici del dominio e acquisire consapevolezza delle traduzioni in corso, puoi inviare un PR modificando il [Klipper-translations Project](https://github.com/Klipper3d/klipper-translations) `readme.md `. Una volta che una traduzione è pronta, è possibile apportare la modifica corrispondente al progetto Klipper.

source: If a translation already exists in the Klipper repository and no longer meets the checklist above, it will be marked out-of-date after a month without updates.
hu: Ha egy fordítás már létezik a Klipper adattárban, és már nem felel meg a fenti ellenőrző listának, akkor egy hónap után frissítés nélkül elavultnak lesz jelölve.
it: Se una traduzione esiste già nel repository Klipper e non soddisfa più l'elenco di controllo di cui sopra, verrà contrassegnata come obsoleta dopo un mese senza aggiornamenti.

source: Thank you for contributing to Klipper! This document describes the process for contributing changes to Klipper.
hu: Köszönjük, hogy hozzájárult a Klipperhez! Ez a dokumentum leírja a Klipper változtatásokhoz való hozzájárulás folyamatát.
it: Grazie per aver contribuito a Klipper! Questo documento descrive il processo per contribuire alle modifiche di Klipper.

source: Please see the [contact page](Contact.md) for information on reporting an issue or for details on contacting the developers.
hu: Kérjük, tekintsd meg a [kapcsolat oldalt](Contact.md) a probléma bejelentésével kapcsolatos információkért vagy a fejlesztőkkel való kapcsolatfelvételre vonatkozó részletekért.
it: Consulta la [contact page](Contact.md) per informazioni sulla segnalazione di un problema o per i dettagli su come contattare gli sviluppatori.

source: Overview of Contribution Process
hu: A hozzájárulási folyamat áttekintése
it: Panoramica del processo di contribuzione

source: Contributions to Klipper generally follow a high-level process:
hu: A Klipperhez való hozzájárulás általában egy magas szintű folyamatot követ:
it: I contributi a Klipper seguono generalmente un processo di alto livello:

source: A submitter starts by creating a [GitHub Pull Request](https://github.com/Klipper3d/klipper/pulls) when a submission is ready for widespread deployment.
hu: A benyújtó egy [GitHub Pull Request](https://github.com/Klipper3d/klipper/pulls) létrehozásával kezdi, amikor egy beadvány készen áll a széles körű telepítésre.
it: Inizia creando una [Richiesta pull GitHub](https://github.com/Klipper3d/klipper/pulls) quando un proposta è pronta per la diffusione.

source: When a [reviewer](#reviewers) is available to [review](#what-to-expect-in-a-review) the submission, they will assign themselves to the Pull Request on GitHub. The goal of the review is to look for defects and to check that the submission follows documented guidelines.
hu: Amikor egy [bíráló](#reviewers) elérhető a [review](#what-to-expect-in-a-review) benyújtásához, akkor hozzárendeli magát a Pull Requesthez a GitHubon. A felülvizsgálat célja a hibák keresése és annak ellenőrzése, hogy a beadvány követi-e a dokumentált irányelveket.
it: Quando un [reviewer](#reviewers) è disponibile per [review](#what-to-expect-in-a-review) l'invio, si assegnerà la richiesta pull su GitHub. L'obiettivo della revisione è cercare i difetti e verificare che la proposta segua linee guida documentate.

source: After a successful review, the reviewer will "approve the review" on GitHub and a [maintainer](#reviewers) will commit the change to the Klipper master branch.
hu: Sikeres felülvizsgálat után a felülvizsgáló "jóváhagyja a felülvizsgálatot" a GitHubon, és egy [karbantartó](#reviewers) átvezeti a módosítást a Klipper master ágába.
it: Dopo una revisione riuscita, il revisore "approverà la revisione" su GitHub e un [maintainer](#reviewers) eseguirà il commit della modifica al ramo principale di Klipper.

source: When working on enhancements, consider starting (or contributing to) a topic on [Klipper Discourse](Contact.md). An ongoing discussion on the forum can improve visibility of development work and may attract others interested in testing new work.
hu: Ha fejlesztéseken dolgozol, fontold meg egy téma indítását (vagy a témához való hozzájárulást) a [Klipper Discourse](Contact.md) oldalon. A fórumon folyó vita javíthatja a fejlesztési munka láthatóságát, és vonzhat másokat is, akik érdeklődnek az új munka tesztelése iránt.
it: Quando lavori sui miglioramenti, considera di iniziare (o contribuire a) un argomento su [Klipper Discourse](Contact.md). Una discussione in corso sul forum può migliorare la visibilità del lavoro di sviluppo e può attirare altri interessati a testare nuovi lavori.

source: What to expect in a review
hu: Mire számíthatunk egy felülvizsgálat során
it: Cosa aspettarsi da una revisione

source: Contributions to Klipper are reviewed before merging. The primary goal of the review process is to check for defects and to check that the submission follows guidelines specified in the Klipper documentation.
hu: A Klipperhez való hozzájárulásokat az egyesítés előtt felülvizsgálják. A felülvizsgálati folyamat elsődleges célja a hibák ellenőrzése, valamint annak ellenőrzése, hogy a beadvány megfelel-e a Klipper dokumentációjában meghatározott irányelveknek.
it: I contributi a Klipper vengono rivisti prima del merging. L'obiettivo principale del processo di revisione è verificare la presenza di difetti e verificare che la presentazione segua le linee guida specificate nella documentazione di Klipper.

source: It is understood that there are many ways to accomplish a task; it is not the intent of the review to discuss the "best" implementation. Where possible, review discussions focused on facts and measurements are preferable.
hu: Természetesen egy feladatot sokféleképpen lehet elvégezni; a felülvizsgálat célja nem az, hogy megvitassa a "legjobb" végrehajtást. Ahol lehetséges, a felülvizsgálati megbeszélések inkább a tényekre és a mérésekre összpontosítanak.
it: Resta inteso che ci sono molti modi per portare a termine un compito; non è intenzione della revisione discutere la "migliore" implementazione. Ove possibile, sono preferibili discussioni di revisione incentrate su fatti e misurazioni.

source: The majority of submissions will result in feedback from a review. Be prepared to obtain feedback, provide further details, and to update the submission if needed.
hu: A beadványok többsége visszajelzést eredményez egy felülvizsgálatról. Készüljön fel a visszajelzések beszerzésére, további részletek megadására és szükség esetén a beadvány frissítésére.
it: La maggior parte degli invii otterrà in feedback da una recensione. Preparati a ottenere feedback, fornire ulteriori dettagli e aggiornare l'invio, se necessario.

source: Common things a reviewer will look for:
hu: Gyakori dolgok, amiket a bíráló keres:
it: Cose comuni che un revisore cercherà:

source: Is the submission free of defects and is it ready to be widely deployed?
hu: Hibátlan-e a beadvány, és készen áll-e a széles körű bevezetésre?
it: L'invio è privo di difetti ed è pronto per essere diffuso?

source: Submitters are expected to test their changes prior to submission. The reviewers look for errors, but they don't, in general, test submissions. An accepted submission is often deployed to thousands of printers within a few weeks of acceptance. Quality of submissions is therefore considered a priority.
hu: A benyújtóknak a benyújtás előtt tesztelniük kell a változtatásokat. A bírálók keresik a hibákat, de általában nem tesztelik a beküldött anyagokat. Egy elfogadott beadványt gyakran az elfogadást követő néhány héten belül több ezer nyomtatóhoz juttatnak el. A beadványok minőségét ezért prioritásnak tekintik.
it: I realizzatori dei contributi sono tenuti a testare le loro modifiche prima dell'invio. I revisori cercano gli errori, ma in generale non testano gli invii. Un invio accettato viene spesso distribuito a migliaia di stampanti entro poche settimane dall'accettazione. La qualità degli invii è quindi considerata una priorità.

source: The main [Klipper3d/klipper](https://github.com/Klipper3d/klipper) GitHub repository does not accept experimental work. Submitters should perform experimentation, debugging, and testing in their own repositories. The [Klipper Discourse](Contact.md) server is a good place to raise awareness of new work and to find users interested in providing real-world feedback.
hu: A fő [Klipper3d/klipper](https://github.com/Klipper3d/klipper) GitHub tároló nem fogad el kísérleti munkát. A beküldőknek a kísérletezést, hibakeresést és tesztelést a saját tárolójukban kell elvégezniük. A [Klipper Discourse](Contact.md) szerver jó hely arra, hogy felhívjuk a figyelmet az új munkára, és megtaláljuk azokat a felhasználókat, akiket érdekel a valós visszajelzés.
it: Il repository GitHub principale [Klipper3d/klipper](https://github.com/Klipper3d/klipper) non accetta lavori sperimentali. I realizzatori di contributi devono eseguire la sperimentazione, il debug e il test nei propri repository. Il server [Klipper Discourse](Contact.md) è un buon posto per aumentare la consapevolezza del nuovo lavoro e per trovare utenti interessati a fornire feedback nel mondo reale.

source: Submissions must pass all [regression test cases](Debugging.md).
hu: A beadványoknak át kell menniük az összes [regressziós teszteseten](Debugging.md).
it: Gli invii devono superare tutti i [test di regressione](Debugging.md).

source: Code submissions should not contain excessive debugging code, debugging options, nor run-time debug logging.
hu: A beküldött kódok nem tartalmazhatnak túlzottan sok hibakeresési kódot, hibakeresési opciót vagy futásidejű hibakeresési naplózást.
it: Gli contributi di codice non devono contenere codice di debug eccessivo, opzioni di debug o registrazione del debug in fase di runtime.

source: Comments in code submissions should focus on enhancing code maintenance. Submissions should not contain "commented out code" nor excessive comments describing past implementations. There should not be excessive "todo" comments.
hu: A kódbeadványokhoz fűzött megjegyzéseknek a kód karbantartásának javítására kell összpontosítaniuk. A beadványok nem tartalmazhatnak "kikommentált kódot" vagy túlzottan sok, korábbi megvalósításokat leíró megjegyzést. Nem lehetnek túlzott mértékű "todo" megjegyzések.
it: I commenti negli invii di codice dovrebbero concentrarsi sul miglioramento della manutenzione del codice. Gli invii non devono contenere "codice commentato" né commenti eccessivi che descrivono implementazioni passate. Non dovrebbero esserci commenti "todo" eccessivi.

source: Updates to documentation should not declare that they are a "work in progress".
hu: A dokumentáció frissítései nem jelenthetik ki, hogy azok "folyamatban lévő munkák".
it: Gli aggiornamenti alla documentazione non devono dichiarare che si tratta di un "work in progress".

source: Is the copyright of the submission clear, non-gratuitous, and compatible?
hu: A beadvány szerzői joga egyértelmű, nem hálapénz és összeegyeztethető?
it: Il copyright dell'invio è chiaro, non gratuito e compatibile?

source: New C files and Python files should have an unambiguous copyright statement. See the existing files for the preferred format. Declaring a copyright on an existing file when making minor changes to that file is discouraged.
hu: Az új C és Python fájloknak egyértelmű szerzői jogi nyilatkozatot kell tartalmazniuk. Az előnyben részesített formátumot lásd a meglévő fájlokban. A meglévő fájl szerzői jogának deklarálása a fájl kisebb módosításai esetén elhanyagolható.
it: I nuovi file C e Python dovrebbero avere una dichiarazione di copyright univoca. Vedere i file esistenti per il formato preferito. È sconsigliato dichiarare un copyright su un file esistente quando si apportano modifiche minori a quel file.

source: Code taken from 3rd party sources must be compatible with the Klipper license (GNU GPLv3). Large 3rd party code additions should be added to the `lib/` directory (and follow the format described in [lib/README](../lib/README)).
hu: A harmadik féltől származó kódnak kompatibilisnek kell lennie a Klipper licenszel (GNU GPLv3). A nagyobb, harmadik féltől származó kódkiegészítéseket a `lib/` könyvtárba kell helyezni (és a [lib/README](../lib/README) könyvtárban leírt formátumot kell követni).
it: Il codice prelevato da fonti di terze parti deve essere compatibile con la licenza Klipper (GNU GPLv3). Grandi aggiunte di codice di terze parti dovrebbero essere aggiunte alla directory `lib/` (e seguire il formato descritto in [lib/README](../lib/README)).

source: Submitters must provide a [Signed-off-by line](#format-of-commit-messages) using their full real name. It indicates the submitter agrees with the [developer certificate of origin](developer-certificate-of-origin).
hu: A beküldőknek meg kell adniuk egy [Signed-off-by line](#format-of-commit-messages) sort a teljes valódi nevükkel. Ez azt jelzi, hogy a benyújtó egyetért a [fejlesztői származási igazolással](developer-certificate-of-origin).
it: I mittenti devono fornire una [Signed-off-line](#format-of-commit-messages) utilizzando il loro vero nome completo. Indica che il mittente è d'accordo con il [developer certificate of origin](developer-certificate-of-origin).

source: Does the submission follow guidelines specified in the Klipper documentation?
hu: A benyújtás követi a Klipper dokumentációban meghatározott irányelveket?
it: L'invio segue le linee guida specificate nella documentazione di Klipper?

source: In particular, code should follow the guidelines in <Code_Overview.md> and config files should follow the guidelines in <Example_Configs.md>.
hu: Különösen a kódnak a <Code_Overview.md>, a konfigurációs fájloknak pedig a <Example_Configs.md> című dokumentumban található irányelveket kell követniük.
it: In particolare, il codice deve seguire le linee guida in <Code_Overview.md> e i file di configurazione devono seguire le linee guida in <Example_Configs.md>.

source: Is the Klipper documentation updated to reflect new changes?
hu: A Klipper dokumentáció frissítve van az új változásoknak megfelelően?
it: La documentazione di Klipper è aggiornata per riflettere le nuove modifiche?

source: At a minimum, the reference documentation must be updated with corresponding changes to the code:
hu: Legalább a referenciadokumentációt kell frissíteni a kód megfelelő változtatásaival:
it: Come minimo, la documentazione di riferimento deve essere aggiornata con le relative modifiche al codice:

source: All commands and command parameters must be documented in <G-Codes.md>.
hu: Minden parancsot és parancsparamétert a <G-Codes.md> dokumentumban kell dokumentálni.
it: Tutti i comandi e i relativi parametri devono essere documentati in <G-Codes.md>.

source: All user facing modules and their config parameters must be documented in <Config_Reference.md>.
hu: Minden felhasználó előtt álló modult és azok konfigurációs paramétereit dokumentálni kell a <Config_Reference.md> fájlban.
it: Tutti i moduli rivolti all'utente e i relativi parametri di configurazione devono essere documentati in <Config_Reference.md>.

source: All exported "status variables" must be documented in <Status_Reference.md>.
hu: Minden exportált "állapotváltozót" dokumentálni kell <Status_Reference.md>.
it: Tutte le "variabili di stato" esportate devono essere documentate in <Status_Reference.md>.

source: All new "webhooks" and their parameters must be documented in <API_Server.md>.
hu: Minden új "webhooks" és paramétereiket dokumentálni kell <API_Server.md>.
it: Tutti i nuovi "webhook" e i relativi parametri devono essere documentati in <API_Server.md>.

source: Any change that makes a non-backwards compatible change to a command or config file setting must be documented in <Config_Changes.md>.
hu: Minden olyan módosítás, amely nem visszafelé kompatibilis módosítást hajt végre egy parancs vagy konfigurációs fájl beállításán, dokumentálni kell a <Config_Changes.md> dokumentumban.
it: Qualsiasi modifica che apporti una modifica non compatibile con le versioni precedenti a un comando o a un'impostazione del file di configurazione deve essere documentata in <Config_Changes.md>.

source: New documents should be added to <Overview.md> and be added to the website index [docs/_klipper3d/mkdocs.yml](../docs/_klipper3d/mkdocs.yml).
hu: Az új dokumentumokat hozzá kell adni az <Overview.md> fájlhoz, és hozzá kell adni a weboldal indexéhez [docs/_klipper3d/mkdocs.yml](../docs/_klipper3d/mkdocs.yml).
it: I nuovi documenti dovrebbero essere aggiunti a <Overview.md> e all'indice del sito web [docs/_klipper3d/mkdocs.yml](../docs/_klipper3d/mkdocs.yml).

source: Are commits well formed, address a single topic per commit, and independent?
hu: A véglegesítések jól megformáltak, véglegesítésként egyetlen témával foglalkoznak, és függetlenek?
it: I commit sono ben formati, affrontano un singolo argomento per commit e sono indipendenti?

source: Commit messages should follow the [preferred format](#format-of-commit-messages).
hu: A kérelmi üzeneteknek a [preferált formátumot](#format-of-commit-messages) kell követniük.
it: I messaggi di commit devono seguire il [formato preferito](#format-of-commit-messages).

source: Commits must not have a merge conflict. New additions to the Klipper master branch are always done via a "rebase" or "squash and rebase". It is generally not necessary for submitters to re-merge their submission on every update to the Klipper master repository. However, if there is a merge conflict, then submitters are recommended to use `git rebase` to address the conflict.
hu: A kérelmeknek nem lehet összeolvadási konfliktusuk. A Klipper master ágához való új hozzáadások mindig egy "rebase" vagy "squash and rebase" segítségével történnek. A benyújtóknak általában nem szükséges a Klipper főadattár minden egyes frissítésénél újra egyesíteniük a beadványukat. Ha azonban összeolvasztási konfliktus van, akkor a benyújtóknak ajánlott a `git rebase` használata a konfliktus megoldására.
it: I commit non devono avere un conflitto in fase di merge. Le nuove aggiunte al ramo principale di Klipper vengono sempre eseguite tramite un "rebase" o "squash and rebase". In genere non è necessario che i propositori uniscano nuovamente il loro invio ad ogni aggiornamento al repository principale di Klipper. Tuttavia, se c'è un conflitto in fase di merge, si consiglia ai mittenti di usare `git rebase` per risolvere il conflitto.

source: Each commit should address a single high-level change. Large changes should be broken up into multiple independent commits. Each commit should "stand on its own" so that tools like `git bisect` and `git revert` work reliably.
hu: Minden egyes kérelemnek egyetlen magas szintű változtatással kell foglalkoznia. A nagyobb változtatásokat több független kérelemre kell bontani. Minden commitnak "önállóan kell állnia", hogy az olyan eszközök, mint a `git bisect` és `git revert` megbízhatóan működjenek.
it: Ogni commit dovrebbe affrontare una singola modifica di alto livello. Le modifiche di grandi dimensioni dovrebbero essere suddivise in più commit indipendenti. Ogni commit dovrebbe "stare in piedi da solo" in modo che strumenti come `git bisect` e `git revert` funzionino in modo affidabile.

source: Whitespace changes should not be mixed with functional changes. In general, gratuitous whitespace changes are not accepted unless they are from the established "owner" of the code being modified.
hu: A fehérterületi változtatásokat nem szabad összekeverni a funkcionális változtatásokkal. Általánosságban elmondható, hogy az indokolatlan szóköz módosításokat nem fogadjuk el, kivéve, ha azok a módosítandó kód megállapított "tulajdonosától" származnak.
it: Le modifiche agli spazi bianchi non devono essere mescolate con le modifiche funzionali. In generale, le modifiche agli spazi bianchi gratuite non sono accettate a meno che non provengano dal "proprietario" stabilito del codice da modificare.
