Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Contact.po
Languages: fr, hu, it, ru, zh_hans

source: This document provides contact information for Klipper.
fr: Ce document fourni les informations de contact pour Klipper.
hu: Ez a dokumentum a Klipper csapatának elérhetőségét tartalmazza.
it: Questo documento fornisce informazioni di contatto per Klipper.
ru: В этом документе содержится контактная информация Klipper.
zh_hans: 本文档提供了关于 Klipper 的联系信息。

source: [Community Forum](#community-forum)
fr: [Forum de la Communauté](#community-forum)
hu: [Közösségi Fórum](#kozossegi-forum)
it: [Forum della comunità](#community-forum)
ru: [Форум сообщества](#community-forum)
zh_hans: [社区论坛](#community-forum)

source: [Discord Chat](#discord-chat)
fr: [Salon Discord](#discord-chat)
hu: [Discord Csevegés](#discord-cseveges)
it: [Chat Discord](#discord-chat)
ru: [Чат Discord](#discord-chat)
zh_hans: [Discord 聊天](#discord-chat)

source: [I have a question about Klipper](#i-have-a-question-about-klipper)
fr: [J'ai une question au sujet de Klipper](#i-have-a-question-about-klipper)
hu: [Kérdésem van a Klipperrel kapcsolatban](#kerdesem-van-a-klipperrel-kapcsolatban)
it: [Ho una domanda su Klipper](#i-have-a-question-about-klipper)
ru: [У меня есть вопрос о Klipper](#i-have-a-question-about-klipper)
zh_hans: [我有一个关于 Klipper 的问题](#i-have-a-question-about-klipper)

source: [I have a feature request](#i-have-a-feature-request)
fr: [J'ai une demande d'ajout de fonctionnalité](#i-have-a-feature-request)
hu: [Van egy funkciókérelmem](#van-egy-funkciokerelmem)
it: [Ho una richiesta per una funzionalità](#i-have-a-feature-request)
ru: [У меня есть запрос на функцию](#i-have-a-feature-request)
zh_hans: [我有一个功能请求](#i-have-a-feature-request)

source: [Help! It doesn't work!](#help-it-doesnt-work)
fr: [A l'aide ! Ca ne fonctionne pas !](#help-it-doesnt-work)
hu: [Segítség! Nem működik!](#segitseg-nem-mukodik)
it: [Aiuto! Non funziona!](#help-it-doesnt-work)
ru: [Помогите! Это не работает!](#help-it-doesnt-work)
zh_hans: [我需要帮助！它炸了！](#help-it-doesnt-work)

source: [I have diagnosed a defect in the Klipper software](#i-have-diagnosed-a-defect-in-the-klipper-software)
fr: [J'ai identifié un problème dans le logiciel Klipper](#i-have-diagnosed-a-defect-in-the-klipper-software)
it: [Ho diagnosticato un difetto nel software Klipper](#i-have-diagnosed-a-defect-in-the-klipper-software)
zh_hans: [我在 Klipper 中发现了一个缺陷](#i-have-diagnosed-a-defect-in-the-klipper-software)

source: [I am making changes that I'd like to include in Klipper](#i-am-making-changes-that-id-like-to-include-in-klipper)
fr: [J’apporte des modifications que j’aimerais inclure dans Klipper](#i-am-making-changes-that-id-like-to-include-in-klipper)
hu: [Változtatásokat végzek, amelyeket szeretnék a Klipperbe beépíteni](#valtoztatasokat-vegzek-amelyeket-szeretnek-a-klipperbe-beepiteni)
it: [Sto apportando modifiche che vorrei includere in Klipper](#i-am-making-changes-that-id-like-to-include-in-klipper)
ru: [Я вношу изменения, которые хотел бы включить в Klipper](#i-am-making-changes-that-id-like-to-include-in-klipper)
zh_hans: [我正在进行我想纳入 Klipper 的修改](#i-am-making-changes-that-id-like-to-include-in-klipper)

source: Community Forum
fr: Forum de la communauté
hu: Közösségi Fórum
it: Forum della Comunità
ru: форум сообщества
zh_hans: 社区论坛

source: There is a [Klipper Community Discourse server](https://community.klipper3d.org) for discussions on Klipper.
fr: Il y a un [Serveur Communautaire Discourse Klipper](https://community.klipper3d.org) pour les discussions sur Klipper.
hu: Van egy [Klipper Közösségi Társalgó szerver](https://community.klipper3d.org) a Klipperrel kapcsolatos beszélgetésekhez.
it: C'è un server [Klipper Community Discourse server](https://community.klipper3d.org) per discussioni su Klipper.
ru: Существует [Klipper Community Discourse server](https://community.klipper3d.org) для обсуждения Клиппера.
zh_hans: 有一个用来讨论 Klipper 的 [Klipper 社区 Discourse 服务器](https://community.klipper3d.org)。

source: Discord Chat
fr: Salon Discord
hu: Discord Csevegés
it: Chat Discord
ru: Чат Discord
zh_hans: Discord 聊天

source: There is a Discord server dedicated to Klipper at: [https://discord.klipper3d.org](https://discord.klipper3d.org).
fr: Voici le serveur Discord dédié à Klipper : [https://discord.klipper3d.org](https://discord.klipper3d.org).
zh_hans: 有一个专门用来讨论 Klipper 的 Discord 服务器，地址是：[https://discord.klipper3d.org](https://discord.klipper3d.org)。

source: This server is run by a community of Klipper enthusiasts dedicated to discussions on Klipper. It allows users to chat with other users in real-time.
fr: Ce serveur, géré par une communauté de passionnés de Klipper, est dédié aux discussions sur Klipper. Il permet aux utilisateurs de discuter en temps réel.
hu: Ezt a szervert egy Klipper-rajongókból álló közösség működteti, amely a Klipperrel kapcsolatos vitáknak szenteli magát. Lehetővé teszi a felhasználók számára, hogy valós időben csevegjenek más felhasználókkal.
it: Questo server è gestito da una comunità di appassionati di Klipper dediti alle discussioni su Klipper. Consente agli utenti di chattare con altri utenti in tempo reale.
ru: Этот сервер управляется сообществом энтузиастов Клиппера, посвященным обсуждениям Клиппера. Он позволяет пользователям общаться с другими пользователями в режиме реального времени.
zh_hans: 这个服务器是由 Klipper 爱好者社区运行，致力于讨论 Klipper。它允许进行用户间的实时聊天。

source: I have a question about Klipper
fr: J'ai une question sur Klipper
hu: Kérdésem van a Klipperrel kapcsolatban
it: Ho una domanda su Klipper
ru: У меня есть вопрос о Клиппере
zh_hans: 我有一个关于 Klipper 的问题

source: Many questions we receive are already answered in the [Klipper documentation](Overview.md). Please be sure to to read the documentation and follow the directions provided there.
fr: La plupart des questions que nous recevons ont déjà une réponse dans la [documentation de Klipper](Overview.md). Assurez-vous de bien la lire et de suivre les instructions qui y sont fournies.
hu: Sok kérdésre már választ kaptunk a [Klipper dokumentációban](Overview.md). Kérjük, mindenképpen olvasd el a dokumentációt és kövesd az ott megadott utasításokat.
it: Molte domande che riceviamo hanno già una risposta nella [Klipper documentation](Overview.md). Per favore assicurati di leggere la documentazione e di seguire le indicazioni fornite.
ru: Ответы на многие вопросы, которые мы получаем, уже есть в [документации Klipper](Overview.md). Пожалуйста, обязательно прочитайте документацию и следуйте приведенным в ней указаниям.
zh_hans: 我们收到的许多问题在 [Klipper 文档](Overview.md)中已经有了答案。请务必阅读该文档并遵循其中提供的指示。

source: It is also possible to search for similar questions in the [Klipper Community Forum](#community-forum).
fr: Il est également possible de rechercher des questions similaires sur le [Forum de la communauté Klipper](#community-forum).
hu: Lehetőség van hasonló kérdések keresésére a [Klipper Közösségi Fórum](#kozossegi-forum) oldalon is.
it: È anche possibile cercare domande simili nel [Klipper Community Forum](#community-forum).
ru: Также можно поискать похожие вопросы в [Форуме сообщества Klipper](#community-forum).
zh_hans: 也可以在[ Klipper 社区论坛](#community-forum)中搜索类似的问题。

source: If you are interested in sharing your knowledge and experience with other Klipper users then you can join the [Klipper Community Forum](#community-forum) or [Klipper Discord Chat](#discord-chat). Both are communities where Klipper users can discuss Klipper with other users.
fr: Si vous souhaitez partager vos connaissances et votre expérience avec d'autres utilisateurs de Klipper, vous pouvez rejoindre le [Forum de la communauté Klipper](#community-forum) ou encore le [Salon Discord Klipper](#discord-chat). Il s'agit de deux communautés où les utilisateurs de Klipper peuvent discuter du logiciel avec d'autres.
hu: Ha szeretnéd megosztani tudásodat és tapasztalataidat más Klipper felhasználókkal, akkor csatlakozhatsz a [Klipper Közösségi Fórum](#kozossegi-forum) vagy a [Discord Csevegés](#discord-cseveges)-hez. Mindkettő olyan közösség, ahol a Klipper felhasználók megvitathatják a Klippert más felhasználókkal.
it: Se sei interessato a condividere le tue conoscenze ed esperienze con altri utenti di Klipper, puoi unirti al [Klipper Community Forum](#community-forum) o [Klipper Discord Chat](#discord-chat). Entrambe sono comunità in cui gli utenti di Klipper possono discutere di Klipper con altri utenti.
ru: Если вы хотите поделиться своими знаниями и опытом с другими пользователями Klipper, то вы можете присоединиться к [Klipper Community Forum](#community-forum) или [Klipper Discord Chat](#discord-chat). Оба сообщества - это сообщества, где пользователи Klipper могут обсуждать Klipper с другими пользователями.
zh_hans: 如果你有兴趣与其他 Klipper 用户分享你的知识和经验，那么你可以加入[ Klipper 社区论坛](#community-forum)或[ Klipper Discord 聊天室](#discord-chat)。这两个社区都是 Klipper 用户间讨论 Klipper 的地方。

source: Many questions we receive are general 3d-printing questions that are not specific to Klipper. If you have a general question or are experiencing general printing problems, then you will likely get a better response by asking in a general 3d-printing forum or a forum dedicated to your printer hardware.
fr: De nombreuses questions que nous recevons sont relatives à l'impression 3D en général et ne sont pas spécifiques à Klipper. Si vous avez une question ou si vous rencontrez des problèmes d'impression en général, vous obtiendrez probablement une meilleure réponse en la posant sur un forum consacré à l'impression 3D dans la globalité ou bien sur un dédié au matériel de votre imprimante.
hu: Sok kérdés, amit kapunk, általános 3D-nyomtatással kapcsolatos, amely nem kifejezetten a Klipperre vonatkozik. Ha általános kérdésed van, vagy általános nyomtatási problémákkal küzdesz, akkor valószínűleg jobb választ kapsz, ha egy általános 3D-nyomtatási fórumon vagy a nyomtató hardverével foglalkozó fórumon teszed fel a kérdést.
it: Molte domande che riceviamo sono domande generiche sulla stampa 3D che non sono specifiche di Klipper. Se hai una domanda generica o stai riscontrando problemi di stampa generici, probabilmente otterrai una risposta migliore chiedendo in un forum generale sulla stampa 3D o in un forum dedicato all'hardware della tua stampante.
ru: Многие вопросы, которые мы получаем, являются общими вопросами 3d-печати, не относящимися к Klipper. Если у вас есть общий вопрос или вы испытываете общие проблемы с печатью, то, скорее всего, вы получите лучший ответ, задав вопрос на общем форуме по 3d-печати или на форуме, посвященном оборудованию вашего принтера.
zh_hans: 我们经常收到许多并不针对 Klipper 的常规3D打印疑问。如果你有常规的疑问或遇到了常规的打印问题，那么你可能会在一般的3D打印论坛或专门针对你的打印机硬件的论坛上得到更好的答案。

source: Do not open a Klipper github issue to ask a question.
fr: N'ouvrez pas d'Issue sur le dépôt GitHub de Klipper pour poser une question.
it: Non aprire un problema (issue) su Klipper github per porre una domanda.
zh_hans: 不要在 Klipper 的 Github 上创建议题来提问。

source: I have a feature request
fr: J'ai une demande d'ajout de fonctionnalité
hu: Van egy funkciókérelmem
it: Ho una richiesta per una funzionalità
ru: У меня есть просьба о возможности
zh_hans: 我有一个功能请求

source: All new features require someone interested and able to implement that feature. If you are interested in helping to implement or test a new feature, you can search for ongoing developments in the [Klipper Community Forum](#community-forum). There is also [Klipper Discord Chat](#discord-chat) for discussions between collaborators.
fr: Toute nouvelle fonctionnalité nécessite d'avoir une personne intéressée et en capacité de la mettre en oeuvre. Si vous souhaitez aider à implémenter ou tester une fonctionnalité, nous pouvez consulter les développements en cours sur le [Forum de la Communauté Klipper](#community-forum). Le [Salon Discord Klipper](#discord-chat) est également là pour les discussions entre contributeurs.
hu: Minden új funkcióhoz szükség van valakire, akit érdekel és képes az adott funkció megvalósítására. Ha szeretnél segíteni egy új funkció megvalósításában vagy tesztelésében, akkor a [Klipper Közösségi Fórum](#kozossegi-forum) oldalon keresheted a folyamatban lévő fejlesztéseket. A [Discord Csevegés](#discord-cseveges) is rendelkezésre áll a munkatársak közötti megbeszélésekhez.
it: Tutte le nuove funzionalità richiedono qualcuno interessato e in grado di implementare tale funzionalità. Se sei interessato ad aiutare a implementare o testare una nuova funzionalità, puoi cercare gli sviluppi coinvolti nel [Klipper Community Forum](#community-forum). C'è anche [Klipper Discord Chat](#discord-chat) per le discussioni tra i collaboratori.
ru: Для всех новых функций требуется кто-то заинтересованный и способный реализовать эту функцию. Если вы заинтересованы в помощи во внедрении или тестировании новой функции, вы можете ознакомиться с текущими разработками на [Форуме сообщества Klipper](#форум‐сообщества). Существует также [Klipper Discord Chat](#discord-чат) для обсуждений между сотрудниками.
zh_hans: 所有的新功能都需要有感兴趣并能够实现这些功能的人。如果你想帮助实现或测试一个新功能，你可以在[ Klipper 社区论坛](#community-forum)中搜索正在进行的开发进程。还有[Klipper Discord 聊天室](#discord-chat)供合作者之间讨论。

source: Do not open a Klipper github issue to request a feature.
fr: N'ouvrez pas d'issue GitHub pour demander une fonctionnalité.
it: Non aprire un problema (issue) in Klipper github per richiedere una funzionalità.
zh_hans: 不要在 Klipper 的 Github 上创建议题来请求功能。

source: Help! It doesn't work!
fr: A l'aide ! Ca ne fonctionne pas !
hu: Segítség! Nem működik!
it: Aiuto! Non funziona!
ru: Помогите! Не работает!
zh_hans: 我需要帮助！它炸了！

source: Unfortunately, we receive many more requests for help than we could possibly answer. Most problem reports we see are eventually tracked down to:
fr: Malheureusement, nous recevons beaucoup plus de demandes d'aide que nous ne pouvons en traiter. La majorité des rapports d'anomalie que nous recevons sont généralement liés à :
hu: Sajnos sokkal több segítségkérés érkezik hozzánk, mint amennyit meg tudnánk válaszolni. A legtöbb problémás bejelentés, amit látunk végül a következőkre vezethető vissza:
it: Sfortunatamente, riceviamo molte più richieste di aiuto di quante potremmo eventualmente rispondere. La maggior parte delle segnalazioni di problemi che vediamo vengono infine rintracciate in:
ru: К сожалению, мы получаем гораздо больше запросов о помощи, чем можем ответить. Большинство сообщений о проблемах, которые мы видим, в конечном итоге сводятся к следующему:
zh_hans: 不幸的是，我们收到的帮助请求往往比我们能够回答的要多。我们发现大多数问题报告的根本原因都是：

source: Subtle errors in the hardware, or
fr: Des erreurs subtiles dans le matériel, ou
hu: Finom hibák a hardverben, vagy
it: Piccoli nell'hardware, o
ru: Незначительные ошибки в оборудовании, или
zh_hans: 细微的硬件问题或

source: Not following all the steps described in the Klipper documentation.
fr: Ne pas avoir suivi toutes les étapes décrites dans la documentation de Klipper.
hu: Nem követi a Klipper dokumentációban leírt összes lépést.
it: Non seguendo tutti i passaggi descritti nella documentazione di Klipper.
ru: Невыполнение всех шагов, описанных в документации Klipper.
zh_hans: 未遵循 Klipper 文档中描述的所有步骤。

source: If you are experiencing problems we recommend you carefully read the [Klipper documentation](Overview.md) and double check that all steps were followed.
fr: Si vous rencontrez des soucis, nous vous recommandons de lire attentivement la [documentation de Klipper](Overview.md) et de vérifier que toutes les étapes ont été suivies.
hu: Ha problémákat tapasztalsz, javasoljuk, hogy figyelmesen olvasd el a [Klipper dokumentációt](Overview.md), és ellenőrizd, hogy minden lépést követtél-e.
it: In caso di problemi, ti consigliamo di leggere attentamente la [Klipper documentation](Overview.md) e di verificare che tutti i passaggi siano stati seguiti.
ru: Если у вас возникли проблемы, мы рекомендуем внимательно прочитать документацию [Klipper documentation](Overview.md) и еще раз проверить, все ли шаги были выполнены.
zh_hans: 如果您遇到了问题，我们建议您仔细阅读 [Klipper 文档](Overview.md) 并再次检查是否遵循了所有步骤。

source: If you are experiencing a printing problem, then we recommend carefully inspecting the printer hardware (all joints, wires, screws, etc.) and verify nothing is abnormal. We find most printing problems are not related to the Klipper software. If you do find a problem with the printer hardware then you will likely get a better response by searching in a general 3d-printing forum or in a forum dedicated to your printer hardware.
fr: Si vous rencontrez des soucis d'impression, nous vous recommandons d'inspecter minutieusement votre imprimante pour voir s'il n'y a pas d'anomalies (joints, vis, fils, etc). Nous avons remarqué que la plupart des anomalies ne sont pas spécifiquement liées à Klipper. Si vous avez un problème avec votre imprimante, vous obtiendrez sûrement une meilleure réponse en recherchant sur un forum dédié à l'impression 3D en général ou bien sur un consacré au matériel de votre imprimante.
hu: Ha nyomtatási problémát tapasztalsz, akkor javasoljuk, hogy alaposan vizsgáld meg a nyomtató hardverét (minden illesztést, vezetéket, csavart stb.), és győződj meg arról, hogy semmi rendellenes nincs. Úgy találjuk, hogy a legtöbb nyomtatási probléma nem a Klipper szoftverrel kapcsolatos. Ha a nyomtató hardverével kapcsolatos problémát találsz, akkor valószínűleg jobb választ kapsz, ha egy általános 3D-nyomtatási fórumon vagy egy, a nyomtató hardverével foglalkozó fórumon keresel.
it: Se si verifica un problema di stampa, si consiglia di ispezionare attentamente l'hardware della stampante (tutti i giunti, i cavi, le viti, ecc.) e verificare che non vi siano anomalie. Scopriamo che la maggior parte dei problemi di stampa non sono correlati al software Klipper. Se trovi un problema con l'hardware della stampante, probabilmente otterrai una risposta migliore cercando in un forum generale di stampa 3D o in un forum dedicato all'hardware della tua stampante.
ru: Если у вас возникли проблемы с печатью, мы рекомендуем внимательно осмотреть аппаратную часть принтера (все соединения, провода, винты и т.д.) и убедиться в отсутствии каких-либо отклонений от нормы. Мы обнаружили, что большинство проблем с печатью не связано с программным обеспечением Klipper. Если же проблема связана с аппаратной частью принтера, то, скорее всего, вы получите лучший ответ, обратившись на общий форум по 3d-печати или на форум, посвященный аппаратной части вашего принтера.
zh_hans: 如果你遇到了打印问题，我们建议仔细检查打印机的硬件（所有接头、电线、螺丝等），确认没有任何异常。我们发现大多数打印问题都与 Klipper 软件无关。如果你确实发现了打印机硬件的问题，在一般的3D打印论坛或专门针对你的打印机硬件的论坛上搜索通常可以得到更好的答复。

source: It is also possible to search for similar issues in the [Klipper Community Forum](#community-forum).
fr: Il est également possible de rechercher des questions similaires sur le [Forum de la communauté Klipper](#community-forum).
hu: A [Klipper Közösségi Fórumban](#kozossegi-forum) is kereshetsz hasonló kérdéseket.
it: È anche possibile cercare problemi simili in [Klipper Community Forum](#community-forum).
ru: Также можно поискать похожие вопросы в [Klipper Community Forum](#community-forum).
zh_hans: 也可以在[ Klipper 社区论坛](#community-forum)中查找类似的问题。

source: Do not open a Klipper github issue to request help.
fr: N'ouvrez pas d'Issue sur le dépôt GitHub de Klipper pour demander de l'aide.
it: Non aprire un problema (issue) in Klipper github per richiedere assistenza.
zh_hans: 不要在 Klipper 的 Github 上创建议题来求助。

source: I have diagnosed a defect in the Klipper software
fr: J'ai identifié un problème dans le logiciel Klipper
it: Ho diagnosticato un difetto nel software Klipper
zh_hans: 我在 Klipper 软件中诊断出了一个缺陷

source: Klipper is an open-source project and we appreciate when collaborators diagnose errors in the software.
fr: Klipper est un projet open-source et nous apprécions quand des contributeurs diagnostiquent des erreurs dans le logiciel.
hu: A Klipper egy nyílt forráskódú projekt, és nagyra értékeljük, ha a munkatársak diagnosztizálják a szoftver hibáit.
it: Klipper è un progetto open-source ed apprezziamo quando i collaboratori diagnosticano errori nel software.
ru: Klipper - это проект с открытым исходным кодом, и мы ценим, когда соавторы диагностируют ошибки в программном обеспечении.
zh_hans: Klipper 是一个开源项目，我们诚挚的感谢贡献者们在软件中诊断出错误。

source: There is important information that will be needed in order to fix a bug. Please follow these steps:
fr: Il y a des informations importantes qui sont nécessaires pour pouvoir corriger un bug. Veuillez suivre ces étapes :
hu: Fontos információkra lesz szükség a hiba kijavításához. Kérjük, kövesd az alábbi lépéseket:
it: Ci sono informazioni importanti che saranno necessarie per correggere un bug. Per favore segui questi passaggi:
ru: Для исправления ошибки потребуется важная информация. Пожалуйста, выполните следующие действия:
zh_hans: 修复bug需要提供一些重要的信息。请遵循以下步骤：

source: Be sure the bug is in the Klipper software. If you are thinking "there is a problem, I can't figure out why, and therefore it is a Klipper bug", then **do not** open a github issue. In that case, someone interested and able will need to first research and diagnose the root cause of the problem. If you would like to share the results of your research or check if other users are experiencing similar issues then you can search the [Klipper Community Forum](#community-forum).
fr: Assurez-vous que le bug se trouve bien dans le logiciel Klipper. Si vous pensez "il y a un problème, ne j'arrive pas à comprendre pourquoi, c'est donc un bug dans Klipper", alors veuillez **ne pas** ouvrir d'issue GitHub. Dans ce cas, une personne intéressée et capable devra d'abord rechercher et diagnostiquer la cause racine de l'anomalie. Si vous souhaitez partager les résultats de vos recherches ou vérifier si d'autres utilisateurs rencontrent des problèmes similaires, vous pouvez consulter le [Forum de la Communauté Klipper](#community-forum).
it: Assicurati che il bug sia nel software Klipper. Se stai pensando "c'è un problema, non riesco a capire perché, e quindi è un bug di Klipper", allora **non** aprire un problema (issue) con github. Nel caso qualcuno interessato e capace dovrà prima ricercare e diagnosticare la causa origine del problema. Se desideri condividere i risultati della tua ricerca o verificare se altri utenti stanno riscontrando problemi simili, puoi cercare in [Klipper Community Forum](#community-forum).
zh_hans: 首先要确定这个错误是在 Klipper 软件中。如果你在想 "我有一个问题，我无法找出原因，因此这是一个Klipper的错误"，那么**不要**创建一个 Github 议题。在这种情况下，有兴趣且有能力的人需要先找到问题的根源。如果你想分享你的研究结果或检查其他用户是否遇到类似的问题，那么你可以搜索 [Klipper 社区论坛](#community-forum)。

source: Make sure you are running unmodified code from [https://github.com/KevinOConnor/klipper](https://github.com/KevinOConnor/klipper). If the code has been modified or is obtained from another source, then you will need to reproduce the problem on the unmodified code from [https://github.com/KevinOConnor/klipper](https://github.com/KevinOConnor/klipper) prior to reporting an issue.
fr: Assurez-vous que vous exécutez bien un code non modifié en provenance de [https://github.com/KevinOConnor/klipper](https://github.com/KevinOConnor/klipper). Si le code a été modifié ou provient d'une autre source, vous devrez reproduire le problème sur le code source de [https://github.com/KevinOConnor/klipper](https://github.com/KevinOConnor/klipper) avant de le signaler.
zh_hans: 先确保你正在运行来自[https://github.com/KevinOConnor/klipper](https://github.com/KevinOConnor/klipper)的未修改的代码。如果代码已被修改或从其他来源获得，那么在报告问题之前，你需要在[https://github.com/KevinOConnor/klipper](https://github.com/KevinOConnor/klipper)的未修改的代码上重现这个问题。
