Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Contact.po
Languages: fr, hu, it, ru, zh_hans

source: If possible, run an `M112` command in the OctoPrint terminal window immediately after the undesirable event occurs. This causes Klipper to go into a "shutdown state" and it will cause additional debugging information to be written to the log file.
fr: Si possible, exécutez une commande `M112` dans la fenêtre du terminal OctoPrint immédiatement que l'anomalie s'est produite. Cela bascule Klipper dans un "état d'arrêt" et entraîne l'écriture d'informations de débogage supplémentaires dans le fichier journal.
it: Se possibile, esegui un comando `M112` nella finestra del terminale di OctoPrint subito dopo che si è verificato l'evento indesiderato. Ciò fa sì che Klipper entri in uno "stato di arresto - shutdown state" e provocherà la scrittura di ulteriori informazioni di debug nel file di registro.
zh_hans: 如果可能的话，在不期望的事件发生后，立即在 OctoPrint 终端窗口运行一个`M112`命令。这将使 Klipper 进入 "关闭"(shutdown)状态，并在日志文件中写入额外的调试信息。

source: Obtain the Klipper log file from the event. The log file has been engineered to answer common questions the Klipper developers have about the software and its environment (software version, hardware type, configuration, event timing, and hundreds of other questions).
fr: Récupérez l'événement depuis le fichier journal Klipper. Ce journal a été conçu pour répondre aux questions courantes que les développeurs de Klipper se posent sur le logiciel et son environnement (version du logiciel, type de matériel, configuration, à quel moment l'anomalie eu lieu, et des centaines d'autres questions).
hu: Szerezd be a Klipper naplófájlt az eseményből. A naplófájlt úgy alakították ki, hogy választ adjon a Klipper fejlesztőinek a szoftverrel és környezetével kapcsolatos gyakori kérdéseire (szoftver verzió, hardvertípus, konfiguráció, eseményidőzítés és több száz egyéb kérdés).
it: Ottieni il log file di Klipper dell'evento. Il file di registro è stato progettato per rispondere alle domande più comuni degli sviluppatori di Klipper sul software e sul suo ambiente (versione del software, tipo di hardware, configurazione, tempistica degli eventi e centinaia di altre domande).
ru: Получите файл журнала Klipper по данному событию. В журнале содержатся ответы на часто задаваемые разработчиками Klipper вопросы о программе и ее окружении (версия программы, тип оборудования, конфигурация, время наступления события и сотни других вопросов).
zh_hans: 获取事件发送时的 Klipper 日志文件。该日志文件已被设计用来给 Klipper 开发人员提供关于软件及其运行环境的常见问题（软件版本、硬件类型、配置、事件时间和数百个其他问题）。

source: The Klipper log file is located in `/tmp/klippy.log` on the Klipper "host" computer (the Raspberry Pi).
fr: Le fichier journal de Klipper est situé dans `/tmp/klippy.log` sur l'ordinateur "hôte" de Klipper (le Raspberry Pi).
hu: A Klipper naplófájlja a `/tmp/klippy.log` címen található a Klipper "gazdagépen" (vagyis a Raspberry Pi-n).
it: Il log file di Klipper si trova in `/tmp/klippy.log` sul computer "host" di Klipper (il Raspberry Pi).
ru: Файл журнала Klipper находится в папке `/tmp/klippy.log` на "хост"-компьютере Klipper (Raspberry Pi).
zh_hans: Klipper 日志文件位于 Klipper "主机"（树莓派）的`/tmp/klippy.log`文件中。

source: An "scp" or "sftp" utility is needed to copy this log file to your desktop computer. The "scp" utility comes standard with Linux and MacOS desktops. There are freely available scp utilities for other desktops (eg, WinSCP). If using a graphical scp utility that can not directly copy `/tmp/klippy.log` then repeatedly click on `..` or `parent folder` until you get to the root directory, click on the `tmp` folder, and then select the `klippy.log` file.
fr: Un utilitaire comme "scp" ou "sftp" est nécessaire pour copier ce fichier journal sur votre ordinateur. L'utilitaire "scp" est fourni en standard avec les systèmes Linux et MacOS. Il existe des utilitaires scp disponibles gratuitement pour d'autres systèmes (par exemple, WinSCP). Si vous utilisez un utilitaire scp graphique qui ne peut pas copier directement `/tmp/klippy.log`, cliquez plusieurs fois sur `...` ou `dossier parent` jusqu'à ce que vous arriviez au répertoire racine, cliquez ensuite sur le dossier `tmp`, puis sélectionnez le fichier `klippy.log`.
hu: Egy "SCP" vagy "SFTP" segédprogram szükséges a naplófájlnak az asztali számítógépre való másolásához. Az "SCP" segédprogram alapfelszereltségként jár a Linux és MacOS asztali számítógépekhez. Más asztali számítógépekhez szabadon elérhető SCP segédprogramok is léteznek (pl. WinSCP). Ha olyan grafikus SCP segédprogramot használsz, amely nem tudja közvetlenül másolni a `/tmp/klippy.log`, akkor kattints többször a `...` vagy `parent folder`, amíg el nem jutunk a gyökérkönyvtárba, kattintsunk a `tmp` mappára, majd válasszuk ki a `klippy.log` fájlt.
it: Un comando o utility "scp" o "sftp" è necessario per copiare questo file di registro sul computer desktop. L'utilità "scp" viene fornita di serie con i desktop Linux e MacOS. Ci sono utilità scp disponibili gratuitamente per altri desktop (ad es. WinSCP). Se si utilizza un'interfaccia grafica scp che non può copiare direttamente `/tmp/klippy.log`, fare clic ripetutamente su `..` o `cartella principale` fino ad arrivare alla directory principale, fare clic sulla cartella `tmp`, quindi seleziona il file `klippy.log`.
ru: Для копирования этого лог-файла на настольный компьютер необходима утилита "scp" или "sftp". Утилита "scp" входит в стандартный комплект поставки настольных компьютеров Linux и MacOS. Существуют свободно распространяемые утилиты scp для других настольных компьютеров (например, WinSCP). Если вы используете графическую утилиту scp, которая не может напрямую скопировать `/tmp/klippy.log`, то несколько раз щелкните на `...` или `parent folder`, пока не доберетесь до корневого каталога, щелкните на папке `tmp`, а затем выберите файл `klippy.log`.
zh_hans: 你需要用“scp”或“sftp”程序将此日志文件复制到您的计算机。 “scp”程序是 Linux 和 MacOS 系统的标准配置。其他系统也通常有可用的 scp 实用程序（例如 WinSCP）。如果使用图形界面的 scp 程序无法直接复制 `/tmp/klippy.log`，可以尝试重复点击 `..`或者`parent folder`（父文件夹）直到进入根目录，再点击`tmp`文件夹，然后选择`klippy.log`文件。

source: Copy the log file to your desktop so that it can be attached to an issue report.
fr: Copiez le fichier journal sur votre bureau afin de le joindre au rapport d'anomalie.
hu: Másold a naplófájlt az asztalára, hogy csatolni tudd egy problémajelentéshez.
it: Copia il lof file sul desktop in modo che possa essere allegato a una segnalazione di problema.
ru: Скопируйте файл журнала на рабочий стол, чтобы его можно было прикрепить к отчету о проблеме.
zh_hans: 将日志文件复制到你的电脑，以便将其上传到问题报告中。

source: Do not modify the log file in any way; do not provide a snippet of the log. Only the full unmodified log file provides the necessary information.
fr: Ne modifiez pas le fichier journal de quelque façon que ce soit ; ne fournissez pas un extrait non plus. Seul le fichier journal complet sans altération fournira les informations nécessaires.
hu: Ne módosítsd a naplófájlt semmilyen módon; ne adj meg egy részletet a naplóból. Csak a teljes, változatlan naplófájl nyújtja a szükséges információkat.
it: Non modificare in alcun modo il log file; non editare o ritagliare il log file. Solo il file di log completo non modificato fornisce le informazioni necessarie.
ru: Не модифицируйте файл журнала каким-либо образом; не предоставляйте фрагмент журнала. Только полный немодифицированный файл журнала содержит необходимую информацию.
zh_hans: 不要以任何方式修改日志文件；不要只提供日志的片段。只有完整的未修改的日志文件才能够提供必要的信息。

source: If the log file is very large (eg, greater than 2MB) then one may need to compress the log with zip or gzip.
fr: Si le fichier journal est très volumineux (par exemple, plus de 2 Mo), il peut être nécessaire de le compresser avec zip ou gzip.
it: Se il file di registro è molto grande (ad esempio, maggiore di 2 MB), potrebbe essere necessario comprimerlo con zip o gzip.
zh_hans: 如果日志文件非常大（例如，大于2MB），那么可能需要用 zip 或 gzip 来压缩日志。

source: Open a new github issue at [https://github.com/KevinOConnor/klipper/issues](https://github.com/KevinOConnor/klipper/issues) and provide a clear description of the problem. The Klipper developers need to understand what steps were taken, what the desired outcome was, and what outcome actually occurred. The Klipper log file **must be attached** to that ticket:
fr: Ouvrez un nouveau rapport d'anomalie github à l'adresse [https://github.com/KevinOConnor/klipper/issues](https://github.com/KevinOConnor/klipper/issues) et donnez une description claire du problème. Les développeurs de Klipper doivent comprendre quelles actions ont été faites, quel était le résultat souhaité et celui obtenu. Le fichier journal de Klipper **doit être joint ** à ce ticket :
zh_hans: 在[https://github.com/KevinOConnor/klipper/issues](https://github.com/KevinOConnor/klipper/issues)打开一个新的 Github 议题，并对问题进行清晰的描述。Klipper 开发者需要了解你采取了哪些步骤，预期的结果是什么，以及实际发生了什么。Klipper 的日志文件**必须被添加到议题附件**：

source: ![attach-issue](img/attach-issue.png)
zh_hans: ![议题附件](img/attach-issue.png)

source: I am making changes that I'd like to include in Klipper
fr: J’apporte des modifications que j’aimerais inclure dans Klipper
hu: Változtatásokat végzek, amelyeket szeretnék a Klipperbe beépíteni
it: Sto apportando modifiche che vorrei includere in Klipper
ru: Я вношу изменения, которые хотел бы включить в Klipper
zh_hans: 我正在进行一些我想添加到 Klipper 中的改进

source: Klipper is open-source software and we appreciate new contributions.
fr: Klipper est un logiciel libre et nous apprécions les nouvelles contributions.
hu: A Klipper nyílt forráskódú szoftver, és örömmel fogadjuk az új hozzájárulásokat.
it: Klipper è un software open-source e apprezziamo i nuovi contributi.
ru: Klipper - это программное обеспечение с открытым исходным кодом, и мы ценим новые вклады.
zh_hans: Klipper 是开源软件，我们非常感谢新的贡献。

source: New contributions (for both code and documentation) are submitted via Github Pull Requests. See the [CONTRIBUTING document](CONTRIBUTING.md) for important information.
fr: Les nouvelles contributions (que ce soit pour le code ou pour la documentation) sont soumises au moyen de Pull Requests Github. Référez-vous au document [CONTRIBUTION](CONTRIBUTION.md) pour connaître les informations importantes à ce sujet.
hu: Az új hozzájárulásokat (mind a kódot, mind a dokumentációt illetően) a GitHub Pull Requests-en keresztül küldheted be. Lásd a [CONTRIBUTING dokumentumot](CONTRIBUTING.md) a fontos információkért.
it: I nuovi contributi (sia per il codice che per la documentazione) vengono inviati tramite Github Pull Requests. Vedere [[CONTRIBUTING document](CONTRIBUTING.md) per informazioni importanti.
ru: Новые материалы (как код, так и документация) подаются через Github Pull Requests. Важную информацию см. в документе [CONTRIBUTING](CONTRIBUTING.md).
zh_hans: 新的贡献（包括代码和文档）需要通过拉取请求(PR)提交。重要信息请参见[贡献文档](CONTRIBUTING.md)。

source: There are several [documents for developers](Overview.md#developer-documentation). If you have questions on the code then you can also ask in the [Klipper Community Forum](#community-forum) or on the [Klipper Community Discord](#discord-chat). If you would like to provide an update on your current progress then you can open a Github issue with the location of your code, an overview of the changes, and a description of its current status.
fr: Il y a plusieurs [documentations pour les développeurs](Overview.md#developer-documentation). Si vous avez des questions sur le code, vous pouvez également les poser sur le [Forum de la communauté Klipper](#community-forum) ou sur le [Discord de la communauté Klipper](#discord-chat). Si vous souhaitez partager un état d'avancement, vous pouvez ouvrir une issue Github avec l'emplacement de votre code, un aperçu des modifications et une description de son état actuel.
it: Esistono diversi [documenti per sviluppatori](Overview.md#developer-documentation). Se hai domande sul codice, puoi anche chiedere nel [Klipper Community Forum](#community-forum) o nel [Klipper Community Discord](#discord-chat). Se desideri fornire un aggiornamento sui tuoi progressi attuali, puoi aprire un problema (issue) con Github con la posizione del tuo codice, una panoramica delle modifiche e una descrizione del suo stato attuale.
zh_hans: 有几个[开发人员文档](Overview.md#developer-documentation)。如果你对代码有疑问，那么你也可以在[Klipper社区论坛](#community-forum)或[Klipper社区 Discord](#discord-chat)上提问。如果你想提供你目前的进展情况，那么你可以在 Github 上开一个问题，写上你的代码的位置，修改的概述，以及对其目前状态的描述。

source: Contact
hu: Kapcsolat
it: Contatti
ru: контакт
zh_hans: 联系方式

source: There is a Discord server dedicated to Klipper at: <https://discord.klipper3d.org>.
hu: Van egy Klipper-nek szentelt Discord szerver a következő címen: <https://discord.klipper3d.org>.
it: C'è un serve Discord dedicato a Klipper a: <https://discord.klipper3d.org>.
ru: Существует сервер Discord, посвященный Клипперу, по адресу: <https://discord.klipper3d.org>.

source: Make sure you are running unmodified code from <https://github.com/Klipper3d/klipper>. If the code has been modified or is obtained from another source, then you will need to reproduce the problem on the unmodified code from <https://github.com/Klipper3d/klipper> prior to reporting an issue.
it: Assicurati di eseguire il codice non modificato da <https://github.com/Klipper3d/klipper>. Se il codice è stato modificato o è stato ottenuto da un'altra fonte, dovrai riprodurre il problema sul codice non modificato da <https://github.com/Klipper3d/klipper> prima di segnalare un problema.

source: Open a new github issue at <https://github.com/Klipper3d/klipper/issues> and provide a clear description of the problem. The Klipper developers need to understand what steps were taken, what the desired outcome was, and what outcome actually occurred. The Klipper log file **must be attached** to that ticket:
it: Apri un nuovo problema con github su <https://github.com/Klipper3d/klipper/issues> e fornisci una descrizione chiara del problema. Gli sviluppatori di Klipper devono capire quali passi sono stati intrapresi, quale era il risultato desiderato e quale risultato si è effettivamente verificato. Il file di registro di Klipper **deve essere allegato** al ticket:

source: [I found a bug in the Klipper software](#i-found-a-bug-in-the-klipper-software)
hu: [Találtam egy hibát a Klipper szoftverben](#i-found-a-bug-in-the-klipper-software)
ru: [Я нашел ошибку в программном обеспечении Klipper](#i-found-a-bug-in-the-klipper-software)

source: I found a bug in the Klipper software
hu: Találtam egy hibát a Klipper szoftverben
ru: Я нашел ошибку в программном обеспечении Klipper

source: Problems should be reported in the [Klipper Community Forum](#community-forum).
hu: A problémákat a [Klipper Közösségi Fórumban](#community-forum) kell jelenteni.
ru: О проблемах следует сообщать на [Форуме сообщества Klipper](#community-forum).

source: Make sure you are running unmodified code from <https://github.com/Klipper3d/klipper>. If the code has been modified or is obtained from another source, then you should reproduce the problem on the unmodified code from <https://github.com/Klipper3d/klipper> prior to reporting.
hu: Győződj meg róla, hogy a <https://github.com/Klipper3d/klipper> változatlan kódját futtatod. Ha a kódot módosították, vagy más forrásból származik, akkor a hiba bejelentése előtt reprodukálnod kell a problémát a <https://github.com/Klipper3d/klipper> nem módosított kóddal.
ru: Убедитесь, что вы выполняете немодифицированный код из <https://github.com/Klipper3d/klipper>. Если код был модифицирован или получен из другого источника, то перед сообщением о проблеме следует воспроизвести ее на немодифицированном коде из <https://github.com/Klipper3d/klipper>.

source: If possible, run an `M112` command immediately after the undesirable event occurs. This causes Klipper to go into a "shutdown state" and it will cause additional debugging information to be written to the log file.
hu: Ha lehetséges, futtass egy `M112` parancsot közvetlenül a nemkívánatos esemény bekövetkezése után. Ennek hatására a Klipper "leállási állapotba" kerül, és további hibakeresési információk íródnak a naplófájlba.
ru: Если есть возможность, сразу после наступления нежелательного события выполните команду `M112`. Это заставит Klipper перейти в "состояние выключения" и приведет к записи дополнительной отладочной информации в файл журнала.

source: It is a good idea to compress the log file with zip or gzip.
hu: Jó ötlet a naplófájlt zip vagy gzip segítségével tömöríteni.
ru: Неплохо сжать файл журнала с помощью zip или gzip.

source: Open a new topic on the [Klipper Community Forum](#community-forum) and provide a clear description of the problem. Other Klipper contributors will need to understand what steps were taken, what the desired outcome was, and what outcome actually occurred. The compressed Klipper log file should be attached to that topic.
hu: Nyiss egy új témát a [Klipper Közösségi Fórumon](#community-forum), és írd le a problémát. A többi Klipper hozzászólónak meg kell értenie, hogy milyen lépéseket tettek, mi volt a kívánt eredmény, és mi történt valójában. A tömörített Klipper naplófájlt csatolni kell a témához.
ru: Откройте новую тему на [Форуме сообщества Klipper](#community-forum) и дайте четкое описание проблемы. Другие участники Klipper должны понять, какие шаги были предприняты, каков был желаемый результат и какой результат произошел на самом деле. Сжатый файл журнала Klipper должен быть прикреплен к этой теме.

source: There are several [documents for developers](Overview.md#developer-documentation). If you have questions on the code then you can also ask in the [Klipper Community Forum](#community-forum) or on the [Klipper Community Discord](#discord-chat).
hu: Számos [dokumentum fejlesztőknek](Overview.md#developer-documentation). Ha kérdésed van a kóddal kapcsolatban, akkor a [Klipper Közösségi Fórum](#community-forum) vagy a [Klipper Közösségi Discord](#discord-chat) oldalon is felteheted.
ru: Существует несколько [документов для разработчиков](Overview.md#developer-documentation). Если у вас есть вопросы по коду, вы также можете задать их на [Форуме сообщества Klipper](#community-forum) или в [Дискорде сообщества Klipper](#discord-chat).

source: Klipper github may be used by contributors to share the status of their work to improve Klipper. It is expected that the person opening a github ticket is actively working on the given task and will be the one performing all the work necessary to accomplish it. The Klipper github is not used for requests, nor to report bugs, nor to ask questions. Use the [Klipper Community Forum](#community-forum) or the [Klipper Community Discord](#discord-chat) instead.
ru: Klipper github может использоваться соавторами для обмена информацией о состоянии их работы по улучшению Klipper. Предполагается, что человек, открывающий тикет на github, активно работает над поставленной задачей и будет выполнять всю необходимую для ее решения работу. На github Klipper не используется ни для заявок, ни для сообщений об ошибках, ни для вопросов. Вместо этого используйте [Klipper Community Forum](#community-forum) или [Klipper Community Discord](#discord-chat).
