Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Debugging.po
Languages: es

source: This document describes some of the Klipper debugging tools.
es: Este documento describe algunas de las herramientas de depuraci車n de Klipper.

source: Translating gcode files to micro-controller commands
es: Convertir archivos gcode en 車rdenes de microcontrolador

source: The Klippy host code can run in a batch mode to produce the low-level micro-controller commands associated with a gcode file. Inspecting these low-level commands is useful when trying to understand the actions of the low-level hardware. It can also be useful to compare the difference in micro-controller commands after a code change.
es: El c車digo anfitri車n de Klippy puede ejecutarse en modo por lotes para producir las 車rdenes de microcontrolador de bajo nivel asociadas con un archivo gcode. Resulta 迆til inspeccionar estas 車rdenes de bajo nivel para entender las acciones del h芍rdwer de bajo nivel. Tambi谷n puede ser provechoso para comparar la diferencia en las 車rdenes de microcontrolador tras efectuar una modificaci車n en el c車digo.

source: To run Klippy in this batch mode, there is a one time step necessary to generate the micro-controller "data dictionary". This is done by compiling the micro-controller code to obtain the **out/klipper.dict** file:
es: Para ejecutar Klippy en esta modalidad por lotes, existe un paso que debe llevarse a cabo una vez para generar el ?diccionario de datos? del microcontrolador. Este consiste en compilar el c車digo del microcontrolador para obtener el archivo **out/klipper.dict**:

source: Once the above is done it is possible to run Klipper in batch mode (see [installation](Installation.md) for the steps necessary to build the python virtual environment and a printer.cfg file):
es: Una vez se haya llevado a cabo lo anterior, ser芍 posible ejecutar Klipper en modo por lotes (en [Instalaci車n](Installation.md) encontrar芍 los pasos necesarios para compilar el entorno virtual de Python y un archivo printer.cfg):

source: The above will produce a file **test.serial** with the binary serial output. This output can be translated to readable text with:
es: Lo anterior producir芍 un archivo, **test.serial**, con la salida en serie binaria. Esta salida puede transformarse en texto legible mediante:

source: The resulting file **test.txt** contains a human readable list of micro-controller commands.
es: El archivo resultante, **test.txt**, contiene una lista legible por humanos de 車rdenes del microcontrolador.

source: The batch mode disables certain response / request commands in order to function. As a result, there will be some differences between actual commands and the above output. The generated data is useful for testing and inspection; it is not useful for sending to a real micro-controller.
es: El modo por lotes desactiva determinadas 車rdenes de respuesta/petici車n para poder funcionar. Por consiguiente, habr芍 algunas diferencias entre las 車rdenes reales y la salida anterior. Los datos generados son 迆tiles para efectuar pruebas e inspecciones; no lo son para su env赤o a un microcontrolador real.

source: Testing with simulavr
es: Puesta a prueba con simulavr

source: The [simulavr](http://www.nongnu.org/simulavr/) tool enables one to simulate an Atmel ATmega micro-controller. This section describes how one can run test gcode files through simulavr. It is recommended to run this on a desktop class machine (not a Raspberry Pi) as it does require significant cpu to run efficiently.
es: La herramienta [simulavr](http://www.nongnu.org/simulavr/) le permite simular un microcontrolador ATmega de Atmel. Esta secci車n describe el procedimiento para ejecutar archivos gcode de prueba a trav谷s de simulavr. Es recomendable ejecutar esto en un PC de escritorio de categor赤a (no un Raspberry Pi), puesto que necesitar芍 cuantiosos recursos de CPU para funcionar eficientemente.

source: To use simulavr, download the simulavr package and compile with python support:
es: Para utilizar simulavr, descargue el paquete de simulavr y comp赤lelo con compatibilidad con Python:

source: Note that the build system may need to have some packages (such as swig) installed in order to build the python module. Make sure the file **src/python/_pysimulavr.so** is present after the above compilation.
es: Observe que el sistema de generaci車n podr赤a necesitar que algunos paquetes (como swig) est谷n instalados para generar el m車dulo de Python. Aseg迆rese de que el archivo **src/python/_pysimulavr.so** exista luego de efectuar la compilaci車n anterior.

source: To compile Klipper for use in simulavr, run:
es: Para compilar Klipper para su uso en simulavr, ejecute:

source: and compile the micro-controller software for an AVR atmega644p, set the MCU frequency to 20Mhz, and select SIMULAVR software emulation support. Then one can compile Klipper (run `make`) and then start the simulation with:
es: y compile el programa del microcontrolador para un atmega644p de AVR, defina la frecuencia de MCU a 20?Mhz y seleccione la compatibilidad de emulaci車n del programa SIMULAVR. Ahora es posible compilar Klipper (ejecute `make`) e iniciar la simulaci車n con:

source: Then, with simulavr running in another window, one can run the following to read gcode from a file (eg, "test.gcode"), process it with Klippy, and send it to Klipper running in simulavr (see [installation](Installation.md) for the steps necessary to build the python virtual environment):
es: Acto seguido, teniendo simulavr en ejecuci車n en otra ventana, es posible ejecutar lo siguiente para leer gcode a partir de un archivo (p.?ej., ?test.gcode?), procesarlo con Klippy y enviarlo al Klipper que se ejecuta dentro de simulavr (vea [Instalaci車n](Installation.md) para obtener los pasos necesarios para generar el entorno virtual de Python):

source: Using simulavr with gtkwave
es: Utilizar simulavr con gtkwave

source: One useful feature of simulavr is its ability to create signal wave generation files with the exact timing of events. To do this, follow the directions above, but run avrsim.py with a command-line like the following:
es: Una prestaci車n 迆til de simulavr es su capacidad de crear archivos de generaci車n de ondas de se?al con la cadencia exacta de los sucesos. Para hacerlo, siga las instrucciones anteriores, pero ejecute avrsim.py con una l赤nea de 車rdenes como esta:

source: Manually sending commands to the micro-controller
es: Enviar 車rdenes al microcontrolador manualmente

source: See the "HELP" command within the tool for more information on its functionality.
es: Vea la orden ?HELP? de la herramienta para obtener informaci車n sobre sus funcionalidades.

source: Some command-line options are available. For more information run: `~/klippy-env/bin/python ./klippy/console.py --help`
es: Tiene a su disposici車n algunas opciones de l赤nea de 車rdenes. Para obtener m芍s informaci車n al respecto, ejecute: `~/klippy-env/bin/python ./klippy/console.py --help`

source: Generating load graphs
es: Generar gr芍ficos de carga

source: The Klippy log file (/tmp/klippy.log) stores statistics on bandwidth, micro-controller load, and host buffer load. It can be useful to graph these statistics after a print.
es: El archivo de registro de Klippy (/tmp/klippy.log) almacena estad赤sticas sobre anchura de banda, carga sobre el microcontrolador y carga sobre el b迆fer del anfitri車n. Puede resultar 迆til graficar estas estad赤sticas luego de mostrarlas.

source: To generate a graph, a one time step is necessary to install the "matplotlib" package:
es: Para generar un gr芍fico, hace falta efectuar una vez este paso para instalar el paquete ?matplotlib?:

source: Then graphs can be produced with:
es: Ahora, ser芍 posible generar gr芍ficos con:

source: One can then view the resulting **loadgraph.png** file.
es: Tras lo anterior, ser芍 posible visualizar el archivo resultante, **loadgraph.png**.

source: Different graphs can be produced. For more information run: `~/klipper/scripts/graphstats.py --help`
es: Es posible producir diferentes gr芍ficos. Para m芍s informaci車n, ejecute: `~/klipper/scripts/graphstats.py --help`

source: Extracting information from the klippy.log file
es: Extraer informaci車n desde el archivo klippy.log

source: The Klippy log file (/tmp/klippy.log) also contains debugging information. There is a logextract.py script that may be useful when analyzing a micro-controller shutdown or similar problem. It is typically run with something like:
es: El archivo de registro de Klippy (/tmp/klippy.log) contiene adem芍s informaci車n para la depuraci車n. Hay una secuencia de 車rdenes, logextract.py, que puede resultar 迆til al momento de analizar problemas de apagado del microcontrolador o similares. Normalmente se ejecuta con algo como:

source: The script will extract the printer config file and will extract MCU shutdown information. The information dumps from an MCU shutdown (if present) will be reordered by timestamp to assist in diagnosing cause and effect scenarios.
es: La secuencia de 車rdenes extraer芍 el archivo de configuraci車n de la impresora y los datos de apagado de MCU. Los volcados de informaci車n de un apagado de MCU (si existen) se reordenar芍n por fecha y hora para ayudar a diagnosticar escenarios de causa y efecto.

source: Running the regression tests
es: Ejecutar las pruebas antirregresiones

source: The main Klipper GitHub repository uses "github actions" to run a series of regression tests. It can be useful to run some of these tests locally.
es: El repositorio principal de Klipper en GitHub utiliza ?acciones de GitHub? para ejecutar una serie de pruebas antirregresiones. Puede ser provechoso ejecutar algunas de estas pruebas de manera local.

source: The source code "whitespace check" can be run with:
es: La ?comprobaci車n de espacios en blanco? del c車digo fuente puede ejecutarse de esta manera:

source: The Klippy regression test suite requires "data dictionaries" from many platforms. The easiest way to obtain them is to [download them from github](https://github.com/KevinOConnor/klipper/issues/1438). Once the data dictionaries are downloaded, use the following to run the regression suite:
es: El conjunto de pruebas antirregresiones de Klippy requiere ?diccionarios de datos? provenientes de muchas plataformas. La manera m芍s sencilla de obtenerlos consiste en [descargarlos de GitHub](https://github.com/KevinOConnor/klipper/issues/1438). Luego de descargar los diccionarios de datos, siga este procedimiento para ejecutar el conjunto de pruebas:
