Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Delta_Calibrate.po
Languages: fr, hu, it, zh_hans

source: Print the test object and wait for it to fully cool. The commands described below must be run with the same printer settings used to print the calibration object (don't run DELTA_CALIBRATE between printing and measuring, or do something that would otherwise change the printer configuration).
fr: Imprimez l'objet à tester et attendez qu'il refroidisse complètement. Les commandes décrites ci-dessous doivent être exécutées avec les mêmes paramètres d'imprimante que ceux utilisés pour imprimer l'objet de calibrage (ne pas exécuter DELTA_CALIBRATE entre l'impression et la mesure, ou faire quelque chose d'autre qui changerait la configuration de l'imprimante).
hu: Nyomtasd ki a tesztobjektumot, és várja meg, amíg teljesen kihűl. Az alább leírt parancsokat ugyanazokkal a nyomtatóbeállításokkal kell futtatni, mint amelyekkel a kalibrációs tárgyat nyomtatta (ne futtassa a DELTA_CALIBRATE parancsot a nyomtatás és a mérés között, vagy ne tegyen olyat, ami egyébként megváltoztatná a nyomtató konfigurációját).
it: Stampa l'oggetto di prova e attendi che si raffreddi completamente. I comandi descritti di seguito devono essere eseguiti con le stesse impostazioni della stampante utilizzate per stampare l'oggetto di calibrazione (non eseguire DELTA_CALIBRATE tra la stampa e la misurazione, o fare qualcosa che altrimenti modificherebbe la configurazione della stampante).
zh_hans: 打印测试模型并等待其完全冷却。打印机设置和校准模型必须一一对应（即，在打印校准模型后，不要再进行DELTA_CALIBRATE或修改打印机参数，否则模型测量无效），再执行下面的命令。

source: If possible, perform the measurements described below while the object is still attached to the print bed, but don't worry if the part detaches from the bed - just try to avoid bending the object when performing the measurements.
fr: Si possible, effectuez les mesures décrites ci-dessous pendant que l'objet est toujours attaché au lit d'impression, mais ne vous inquiétez pas si la pièce se détache du lit - essayez simplement d'éviter de tordre l'objet lors de l'exécution des mesures.
hu: Ha lehetséges, az alábbiakban leírt méréseket akkor végezd el, amikor a tárgy még mindig a nyomtató tárgyasztalhoz van rögzítve, de ne aggódjon, ha az alkatrész leválik a tárgyasztalról. Csak próbáld meg elkerülni a tárgy meghajlását a mérések elvégzésekor.
it: Se possibile, esegui le misurazioni descritte di seguito mentre l'oggetto è ancora attaccato al piano di stampa, ma non preoccuparti se la parte si stacca dal letto: cerca solo di evitare di piegare l'oggetto durante l'esecuzione delle misurazioni.
zh_hans: 如可能，在模型黏着在床上进行测量，但若模型脱离热床也没有关系——这步骤只是为了减少模型的弯曲。

source: Start by measuring the distance between the center pillar and the pillar next to the "A" label (which should also be pointing towards the "A" tower).
fr: Commencez par mesurer la distance entre le pilier central et le pilier à côté de l'étiquette "A" (qui doit également pointer vers la tour "A").
hu: Kezd a középső oszlop és az "A" felirat melletti oszlop közötti távolság mérésével (amelynek szintén az "A" torony felé kell mutatnia).
it: Inizia misurando la distanza tra il pilastro centrale e il pilastro accanto all'etichetta "A" (che dovrebbe anche puntare verso la torre "A").
zh_hans: 首先测量中心柱到印有“A”标志的柱的距离（即中心到A柱方向的距离）。

source: Then go counterclockwise and measure the distances between the center pillar and the other pillars (distance from center to pillar across from C label, distance from center to pillar with B label, etc.).
fr: Ensuite, allez dans le sens inverse des aiguilles d'une montre et mesurez les distances entre le pilier central et les autres piliers (distance du centre au pilier en face de l'étiquette C, distance du centre au pilier avec l'étiquette B, etc.).
hu: Ezután menjen az óramutató járásával ellentétes irányba, és mérd meg a középső oszlop és a többi oszlop közötti távolságokat (a középsőtől a "C" feliratú oszlopig terjedő távolság, a középsőtől a "B" feliratú oszlopig terjedő távolság stb.).
it: Quindi procedere in senso antiorario e misurare le distanze tra il pilastro centrale e gli altri pilastri (distanza dal centro al pilastro attraverso l'etichetta C, distanza dal centro al pilastro con l'etichetta B, ecc.).
zh_hans: 之后，按照逆时针方向逐一测量中心柱到边沿柱的距离（中心到C标签柱的距离，中心到B标签柱的距离等）。

source: Enter these parameters into Klipper with a comma separated list of floating point numbers:
fr: Entrez ces paramètres dans Klipper avec une liste de nombres réels (/!\ utilisez le point comme séparateur décimal) séparés par des virgules :
hu: Add meg ezeket a paramétereket a Klipperbe lebegőpontos számok vesszővel elválasztott listájával:
it: Inserisci questi parametri in Klipper con un elenco separato da virgole di numeri in virgola mobile:
zh_hans: 以 逗号分隔的浮点数 的形式将数据输入到Klipper：

source: Provide the values without spaces between them.
fr: Fournissez les valeurs sans espaces entre chaque valeurs.
hu: Az értékeket szóközök nélkül add meg.
it: Fornisci i valori senza spazi tra di loro.
zh_hans: 数据之间不要插入 空格 。

source: Then measure the distance between the A pillar and the pillar across from the C label.
fr: Mesurez ensuite la distance entre le pilier A et le pilier en face de l'étiquette C.
hu: Ezután mérd meg a távolságot az "A" oszlop és a "C" címkével szemben lévő oszlop között.
it: Quindi misurare la distanza tra il montante A e il montante di fronte all'etichetta C.
zh_hans: 之后测量A柱和C柱之间的距离。

source: Then go counterclockwise and measure the distance between the pillar across from C to the B pillar, the distance between the B pillar and the pillar across from A, and so on.
fr: Ensuite, dans le sens antihoraire, mesurez la distance entre le pilier en face de C et le pilier B, la distance entre le pilier B et le pilier en face de A, et ainsi de suite.
hu: Ezután menjünk az óramutató járásával ellentétes irányba, és mérjük meg a távolságot a "C" oszlop és a "B" oszlop között, majd a "B" oszlop és az "A" oszlop között, és így tovább.
it: Quindi andare in senso antiorario e misurare la distanza tra il pilastro di fronte a C e il pilastro B, la distanza tra il pilastro B e il pilastro di fronte a A, e così via.
zh_hans: 之后测量C柱和B柱，以及B柱和A柱之间的距离等。

source: Enter these parameters into Klipper:
fr: Saisissez ces paramètres dans Klipper :
hu: Add meg ezeket a paramétereket a Klippernek:
it: Inserisci questi parametri in Klipper:
zh_hans: 将参数输入到Klipper：

source: At this point it is okay to remove the object from the bed. The final measurements are of the pillars themselves. Measure the size of the center pillar along the A spoke, then the B spoke, and then the C spoke.
fr: À ce stade, vous pouvez retirer l'objet du lit. Les mesures finales concernent les piliers eux-mêmes. Mesurez la taille du pilier central le long du rayon A, puis du rayon B, puis du rayon C.
hu: Ezen a ponton nyugodtan leveheti a tárgyat a tárgyasztalról. A végső mérések magukra az oszlopokra vonatkoznak. Mérd meg a középső oszlop méretét az "A" küllők mentén, majd a "B" küllők mentén, végül a "C" küllők mentén.
it: A questo punto va bene rimuovere l'oggetto dal letto. Le misure finali sono dei pilastri stessi. Misurare la dimensione del pilastro centrale lungo il raggio A, poi il raggio B e poi il raggio C.
zh_hans: 此时可以拆除床上的模型。最后要测量的是柱子的尺寸。首先测量中心柱在A柱方向上，B柱方向上以及C柱方向上的尺寸。

source: Enter them into Klipper:
fr: Saisissez-les dans Klipper :
hu: Add meg őket a Klippernek:
it: Inseriscili in Klipper:
zh_hans: 将结果输入Klipper：

source: The final measurements are of the outer pillars. Start by measuring the distance of the A pillar along the line from A to the pillar across from C.
fr: Les mesures finales concernent les piliers extérieurs. Commencez par mesurer la distance du pilier A le long de la ligne allant de A au pilier en face de C.
hu: A végső mérések a külső küllőkről szólnak. Kezdjük azzal, hogy megmérjük az "A" küllő távolságát az "A" küllőtől a "C" küllővel szemben lévő küllőig tartó vonal mentén.
it: Le misure finali sono dei pilastri esterni. Inizia misurando la distanza del pilastro A lungo la linea da A al pilastro di fronte a C.
zh_hans: 然后侧向外侧柱子的尺寸。首先测量A柱朝向C柱内侧的面之间的尺寸（见下图）。

source: Then go counterclockwise and measure the remaining outer pillars (pillar across from C along the line to B, B pillar along the line to pillar across from A, etc.).
fr: Ensuite, dans le sens antihoraire, mesurez les piliers extérieurs restants (pilier en face de C le long de la ligne vers B, pilier B le long de la ligne vers le pilier en face de A, etc.).
hu: Ezután az óramutató járásával ellentétes irányban mérjük meg a többi külső oszlopot (a "C" küllővel szemben lévő oszlop a "B" küllővel szembeni vonal mentén, a "B" küllő a "B" küllővel szembeni vonal mentén az "A" küllővel szemben lévő oszlopig stb.).
it: Quindi andare in senso antiorario e misurare i restanti pilastri esterni (pilastro di fronte a C lungo la linea a B, pilastro B lungo la linea a pilastro di fronte ad A, ecc.).
zh_hans: 之后逆时针逐一测量外则柱子的尺寸（测量C柱朝向B柱内侧的面之间的尺寸，测量B柱朝向A柱内侧的面之间的尺寸等）。

source: And enter them into Klipper:
fr: Et entrez-les dans Klipper :
hu: És add meg őket a Klippernek:
it: E inseriscili in Klipper:
zh_hans: 并将参数输入Klipper：

source: If the object was scaled to a smaller or larger size then provide the scale factor that was used when slicing the object:
fr: Si l'objet a été mis à l'échelle à une taille plus petite ou plus grande, indiquez le facteur d'échelle utilisé lors du découpage de l'objet :
hu: Ha az objektumot kisebb vagy nagyobb méretre méretezték, akkor add meg az objektum szeletelésekor használt méretezési tényezőt:
it: Se l'oggetto è stato ridimensionato a una dimensione inferiore o superiore, fornire il fattore di scala utilizzato durante il taglio dell'oggetto:
zh_hans: 如果模型经过了缩放，则输入切片时使用的缩放系数：

source: (A scale value of 2.0 would mean the object is twice its original size, 0.5 would be half its original size.)
fr: (Une valeur d'échelle de 2,0 signifierait que l'objet est deux fois sa taille d'origine, 0,5 serait la moitié de sa taille d'origine.)
hu: (A 2,0-ás méretarány azt jelenti, hogy az objektum kétszer akkora, mint az eredeti mérete, 0,5 pedig az eredeti méret fele.)
it: (Un valore di scala di 2,0 significherebbe che l'oggetto è il doppio della sua dimensione originale, 0,5 sarebbe la metà della sua dimensione originale.)
zh_hans: （输入系数2.0则模型被放大一倍，输入系数0.5则模型被缩小至一半。）

source: Finally, perform the enhanced delta calibration by running:
fr: Enfin, effectuez l'étalonnage delta amélioré en exécutant :
hu: Végezd el végül a továbbfejlesztett delta-kalibrálást a következő futtatásával:
it: Infine, esegui la calibrazione delta avanzata eseguendo:
zh_hans: 最后输入下列面命令进行三角校准：

source: This command can take several minutes to complete. After completion it will calculate updated delta parameters (delta radius, tower angles, endstop positions, and arm lengths). Use the SAVE_CONFIG command to save and apply the settings:
fr: Cette commande peut prendre plusieurs minutes. Une fois terminé, elle calculera les paramètres delta mis à jour (rayon delta, angles de tour, positions de butée et longueurs de bras). Utilisez la commande SAVE_CONFIG pour enregistrer et appliquer les paramètres :
hu: Ez a parancs több percig is eltarthat. A parancs befejezése után kiszámítja a frissített delta paramétereket (delta sugár, toronyszögek, végállások és karok hossza). A SAVE_CONFIG paranccsal mentsd el és alkalmazd a beállításokat:
it: Il completamento di questo comando può richiedere diversi minuti. Dopo il completamento, calcolerà i parametri delta aggiornati (raggio delta, angoli della torre, posizioni dei finecorsa e lunghezze dei bracci). Utilizzare il comando SAVE_CONFIG per salvare e applicare le impostazioni:
zh_hans: 该命令将进行数分钟的计算。计算将给出三角洲参数（三角半径，柱夹角，限位位置，臂长）。之后使用SAVE_CONFIG 保存并应用结果：

source: The SAVE_CONFIG command will save both the updated delta parameters and information from the distance measurements. Future DELTA_CALIBRATE commands will also utilize this distance information. Do not attempt to reenter the raw distance measurements after running SAVE_CONFIG, as this command changes the printer configuration and the raw measurements no longer apply.
fr: La commande SAVE_CONFIG enregistre à la fois les paramètres delta mis à jour et les informations des mesures de distance. Les futures commandes DELTA_CALIBRATE utiliseront également ces informations de distance. N'essayez pas de ressaisir les mesures de distance brutes après avoir exécuté SAVE_CONFIG, car cette commande modifie la configuration de l'imprimante et les mesures brutes ne s'appliquent plus.
hu: A SAVE_CONFIG parancs mind a frissített delta paramétereket, mind a távolságmérésekből származó információkat elmenti. A jövőbeni DELTA_CALIBRATE parancsok ezeket a távolságinformációkat is felhasználják. A SAVE_CONFIG parancs futtatása után ne próbáld meg újra megadni a nyers távolságméréseket, mivel ez a parancs megváltoztatja a nyomtató konfigurációját, és a nyers mérések már nem érvényesek.
it: Il comando SAVE_CONFIG salverà sia i parametri delta aggiornati che le informazioni dalle misurazioni della distanza. Anche i futuri comandi DELTA_CALIBRATE utilizzeranno queste informazioni sulla distanza. Non tentare di reinserire le misurazioni grezze della distanza dopo aver eseguito SAVE_CONFIG, poiché questo comando modifica la configurazione della stampante e le misurazioni grezze non vengono più applicate.
zh_hans: SAVE_CONFIG 会保存计算并更新后的三角参数。之后的DELTA_CALIBRATE 命令也会给予进阶计算的结果。请勿在SAVE_CONFIG 重新输入原始测量数据，因为此时原始测量数据已不会应用至三角参数上。

source: Additional notes
fr: Notes complémentaires
hu: További megjegyzések
it: Note aggiuntive
zh_hans: 额外要点

source: If the delta printer has good dimensional accuracy then the distance between any two pillars should be around 74mm and the width of every pillar should be around 9mm. (Specifically, the goal is for the distance between any two pillars minus the width of one of the pillars to be exactly 65mm.) Should there be a dimensional inaccuracy in the part then the DELTA_ANALYZE routine will calculate new delta parameters using both the distance measurements and the previous height measurements from the last DELTA_CALIBRATE command.
fr: Si l'imprimante Delta a une bonne précision dimensionnelle, la distance entre deux piliers doit être d'environ 74 mm et la largeur de chaque pilier doit être d'environ 9 mm. (Plus précisément, l'objectif est que la distance entre deux piliers moins la largeur de l'un des piliers soit exactement de 65 mm.) S'il y a une inexactitude dimensionnelle dans la pièce, la routine DELTA_ANALYZE calculera de nouveaux paramètres delta en utilisant à la fois les mesures de distance et les mesures de hauteur précédentes de la dernière commande DELTA_CALIBRATE.
hu: Ha a delta nyomtató jó méretpontossággal rendelkezik, akkor a két oszlop közötti távolságnak körülbelül 74 mm-nek kell lennie, és minden oszlop szélességének körülbelül 9 mm-nek kell lennie. (Pontosabban, a cél az, hogy a két oszlop közötti távolság mínusz az egyik oszlop szélessége pontosan 65 mm legyen.) Ha az alkatrészben méretpontatlanság van, akkor a DELTA_ANALYZE rutin új delta paramétereket számol ki a távolságmérések és a legutóbbi DELTA_CALIBRATE parancsból származó korábbi magasságmérések felhasználásával.
it: Se la stampante delta ha una buona precisione dimensionale, la distanza tra due pilastri qualsiasi dovrebbe essere di circa 74 mm e la larghezza di ogni pilastro dovrebbe essere di circa 9 mm. (In particolare, l'obiettivo è che la distanza tra due pilastri qualsiasi meno la larghezza di uno dei pilastri sia esattamente 65 mm.) In caso di imprecisione dimensionale nella parte, la routine DELTA_ANALYZE calcolerà nuovi parametri delta utilizzando entrambe le misurazioni della distanza e le misurazioni dell'altezza precedenti dall'ultimo comando DELTA_CALIBRATE.
zh_hans: 如果三角洲打印机的尺寸相当准确，则两柱间的距离应该在74mm附近，并各个柱子的尺寸应为9mm（即目标为柱子面向另一柱子的一侧到所向柱子的统一面的距离为65mm）。如果尺寸不准确，则可以通过DELTA_ANALYZE ，基于之前DELTA_CALIBRATE 获得的高度测量数据和距离测量数据生成新的三角参数。

source: DELTA_ANALYZE may produce delta parameters that are surprising. For example, it may suggest arm lengths that do not match the printer's actual arm lengths. Despite this, testing has shown that DELTA_ANALYZE often produces superior results. It is believed that the calculated delta parameters are able to account for slight errors elsewhere in the hardware. For example, small differences in arm length may result in a tilt to the effector and some of that tilt may be accounted for by adjusting the arm length parameters.
fr: DELTA_ANALYZE peut génerer des paramètres delta surprenants. Par exemple, il peut suggérer des longueurs de bras qui ne correspondent pas aux longueurs de bras réelles de l'imprimante. Malgré cela, les tests ont montré que DELTA_ANALYZE produit souvent de bons résultats. Les paramètres delta calculés sont capables de tenir compte de légères erreurs ailleurs dans le matériel. Par exemple, de petites différences de longueur de bras peuvent entraîner une inclinaison de l'effecteur et une partie de cette inclinaison peut être prise en compte en ajustant les paramètres de longueur de bras.
hu: A DELTA_ANALYZE meglepő delta paramétereket eredményezhet. Például olyan karhosszúságokat javasolhat, amelyek nem egyeznek a nyomtató tényleges karhosszúságával. Ennek ellenére a tesztek azt mutatták, hogy a DELTA_ANALYZE gyakran jobb eredményeket ad. Úgy véljük, hogy a kiszámított delta paraméterek képesek figyelembe venni a hardver máshol előforduló kisebb hibáit. Például a karhossz kis eltérései az effektor dőlését eredményezhetik, és ennek a dőlésnek egy része a karhossz paraméterek beállításával figyelembe vehető.
it: DELTA_ANALYZE può produrre parametri delta sorprendenti. Ad esempio, può suggerire lunghezze dei bracci che non corrispondono alle lunghezze effettive dei bracci della stampante. Nonostante ciò, i test hanno dimostrato che DELTA_ANALYZE produce spesso risultati superiori. Si ritiene che i parametri delta calcolati siano in grado di tenere conto di lievi errori in altre parti dell'hardware. Ad esempio, piccole differenze nella lunghezza del braccio possono comportare un'inclinazione dell'effettore e parte di tale inclinazione può essere spiegata regolando i parametri della lunghezza del braccio.
zh_hans: DELTA_ANALYZE 的结果可能不符合逻辑。比如，它计算出的臂长可能于打印机的实际臂长不符。尽管如此，测试结果表明 DELTA_ANALYZE 总能给出出色的打印结果。推测这是因为计算三角参数的时候将其他未知的影响参数也纳入到计算考虑。例如，臂长的细微差异会使效应器倾斜，而通过调节臂长的计算基准可以补偿这种差异。

source: Using Bed Mesh on a Delta
fr: Utilisation d'un maillage du lit sur une Delta
hu: Tárgyasztal háló használata a Deltán
it: Utilizzo della mesh del piatto su un delta
zh_hans: 在三角洲打印机上使用床网

source: It is possible to use [bed mesh](Bed_Mesh.md) on a delta. However, it is important to obtain good delta calibration prior to enabling a bed mesh. Running bed mesh with poor delta calibration will result in confusing and poor results.
fr: Il est possible d'utiliser le [maillage du lit](Bed_Mesh.md) sur une Delta. Cependant, il est important d'obtenir un bon étalonnage Delta avant d'activer un maillage du lit. L'exécution d'un maillage du lit avec un mauvais calibrage delta entraînera des résultats médiocres.
hu: Lehetőség van [tárgyasztal háló](Bed_Mesh.md) használatára egy delta esetében. Fontos azonban, hogy jó deltakalibrációt érj el, mielőtt engedélyeznéd a tárgyasztal hálót. A bed mesh futtatása rossz delta-kalibrációval zavaros és rossz eredményeket fog eredményezni.
it: È possibile utilizzare [bed mesh](Bed_Mesh.md) su un delta. Tuttavia, è importante ottenere una buona calibrazione delta prima di abilitare una mesh del letto. L'esecuzione della mesh del letto con una scarsa calibrazione delta comporterà risultati confusi e scarsi.
zh_hans: 三角洲打印机上也能使用[床网](Bed_Mesh.md)。但是应在开启床网之前对打印机进行三角校准。在未校准的打印机上使用床网会得出奇怪的结果。

source: Note that performing delta calibration will invalidate any previously obtained bed mesh. After performing a new delta calibration be sure to rerun BED_MESH_CALIBRATE.
fr: Notez que l'exécution de l'étalonnage delta invalidera tout maillage de lit précédemment obtenu. Après avoir effectué un nouvel étalonnage delta, assurez-vous de relancer BED_MESH_CALIBRATE.
hu: Vedd figyelembe, hogy a delta-kalibrálás végrehajtása érvényteleníti a korábban kapott tárgyasztal hálót. Az új delta-kalibrálás elvégzése után feltétlenül futtassa újra a BED_MESH_CALIBRATE programot.
it: Si noti che l'esecuzione della calibrazione delta invaliderà qualsiasi mesh del piatto precedentemente ottenuto. Dopo aver eseguito una nuova calibrazione delta, assicurati di eseguire nuovamente BED_MESH_CALIBRATE.
zh_hans: 注意进行三角校正会使之前获得的床网数据无效。应在进行三角校正后重新运行BED_MESH_CALIBRATE。

source: Delta calibration
fr: Étalonnage Delta
hu: Delta kalibrálás
it: Calibrazione delta
zh_hans: 三角校正

source: Prior to running an enhanced delta calibration one must run the basic delta calibration (via the DELTA_CALIBRATE command) and save the results (via the SAVE_CONFIG command). Make sure there hasn't been any notable change to the printer configuration nor hardware since last performing a basic delta calibration (if unsure, rerun the [basic delta calibration](#basic-delta-calibration), including SAVE_CONFIG, just prior to printing the test object described below.)
fr: Avant d'exécuter un étalonnage delta avancé, il faut exécuter l'étalonnage delta de base (via la commande DELTA_CALIBRATE) et enregistrer les résultats (via la commande SAVE_CONFIG). Assurez-vous qu'il n'y a eu aucun changement notable dans la configuration de l'imprimante ni dans le matériel depuis le dernier étalonnage delta de base (en cas de doute, réexécutez l'[étalonnage delta de base](#basic-delta-calibration), y compris SAVE_CONFIG, juste avant l'impression l'objet de test décrit ci-dessous.)
hu: A kibővített delta-kalibrálás futtatása előtt le kell futtatni az alap delta-kalibrálást (a DELTA_CALIBRATE paranccsal) és el kell menteni az eredményeket (a SAVE_CONFIG paranccsal). Győződj meg róla, hogy a nyomtató konfigurációjában és hardverében nem történt semmilyen jelentős változás az alap delta-kalibrálás legutóbbi végrehajtása óta (ha nem biztos benne, futtassa le újra az [alap delta-kalibrálás](#basic-delta-calibration) parancsot, beleértve a SAVE_CONFIG parancsot is, közvetlenül az alább leírt tesztobjektum nyomtatása előtt.)
it: Prima di eseguire una calibrazione delta avanzata, è necessario eseguire la calibrazione delta di base (tramite il comando DELTA_CALIBRATE) e salvare i risultati (tramite il comando SAVE_CONFIG). Assicurati che non siano state apportate modifiche degne di nota alla configurazione della stampante né all'hardware dall'ultima esecuzione di una calibrazione delta di base (se non sei sicuro, esegui nuovamente la [calibrazione delta di base](#basic-delta-calibration), incluso SAVE_CONFIG, appena prima della stampa l'oggetto di prova descritto di seguito.)

source: Prior to running an enhanced delta calibration one must run the basic delta calibration (via the DELTA_CALIBRATE command) and save the results (via the SAVE_CONFIG command).
zh_hans: 在进行进阶三角洲校准时，必须先完成三角洲校准（通过DELTA_CALIBRATE命令）并保存结果（通过SAVE_CONFIG 命令）。
