Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Delta_Calibrate.po
Languages: fr, hu, it, zh_hans

source: This document describes Klipper's automatic calibration system for "delta" style printers.
fr: Ce document décrit le système de calibration automatique de Klipper pour les imprimantes de type "delta".
hu: Ez a dokumentum a Klipper "delta" stílusú nyomtatók automatikus kalibrációs rendszerét írja le.
it: Questo documento descrive il sistema di calibrazione automatica di Klipper per stampanti "delta".
zh_hans: 本文将介绍在Klipper中对“三角洲”运动模式的打印机进行自动校准的操作。

source: Delta calibration involves finding the tower endstop positions, tower angles, delta radius, and delta arm lengths. These settings control printer motion on a delta printer. Each one of these parameters has a non-obvious and non-linear impact and it is difficult to calibrate them manually. In contrast, the software calibration code can provide excellent results with just a few minutes of time. No special probing hardware is necessary.
fr: L'étalonnage Delta consiste à trouver les positions pour les butées de tours, les angles des tours, le rayon et les longueurs de bras. Ces paramètres contrôlent le mouvement d'une imprimante Delta. Chacun de ces paramètres a un impact non trivial et non linéaire et il est difficile de les calibrer manuellement. En revanche, le code d'étalonnage logiciel peut fournir d'excellents résultats en quelques minutes seulement. Aucun matériel de mesure n'est nécessaire.
hu: A deltakalibrálás magában foglalja a torony végállásának, a torony szögének, a deltasugárnak és a deltakarok hosszának meghatározását. Ezek a beállítások szabályozzák a nyomtató mozgását a delta nyomtatónál. E paraméterek mindegyike nem nyilvánvaló és nem lineáris hatással bír, és manuálisan nehéz kalibrálni őket. Ezzel szemben a szoftver kalibrációs kódja néhány perc ráfordítással kiváló eredményt adhat. Nincs szükség speciális szintező hardverre.
it: La calibrazione delta implica la ricerca delle posizioni dei finecorsa della torre, degli angoli della torre, del raggio delta e delle lunghezze del braccio delta. Queste impostazioni controllano il movimento della stampante su una stampante delta. Ognuno di questi parametri ha un impatto non evidente e non lineare ed è difficile calibrarli manualmente. Al contrario, il codice di calibrazione del software può fornire risultati eccellenti in pochi minuti di tempo. Non è necessario alcun hardware di rilevamento speciale.
zh_hans: 三角洲校准包含确定柱限位开关位置（tower endstop positions），柱夹角（ tower angles），三角半径（delta radius）和悬臂长度四个参数（delta arm lengths）。上述参数将用于三角洲打印机的运动控制。然而，由于每个的影响并非显而易见或其影响具有非线性，因此难以通过手工校正。相对而言，软件校正在数分钟的时间后就可以达到极佳的效果。自动校正无需增加探针。

source: Ultimately, the delta calibration is dependent on the precision of the tower endstop switches. If one is using Trinamic stepper motor drivers then consider enabling [endstop phase](Endstop_Phase.md) detection to improve the accuracy of those switches.
fr: L'étalonnage Delta dépend de la précision des interrupteurs de fin de course de chaque tour. Si l'on utilise des pilotes de moteur pas à pas Trinamic, envisagez d'activer la détection de [phase d'arrêt](Endstop_Phase.md) pour améliorer la précision de ces commutateurs.
hu: A delta-kalibrálás végső soron a torony végálláskapcsolóinak pontosságától függ. Ha valaki Trinamic léptetőmotor-meghajtókat használ, akkor fontolja meg a [végállási fázis](Endstop_Phase.md) érzékelés engedélyezését, hogy javítsa a kapcsolók pontosságát.
it: In definitiva, la calibrazione delta dipende dalla precisione degli interruttori di fine corsa della torre. Se si utilizzano i driver per motori passo-passo Trinamic, considerare l'abilitazione del rilevamento [fase endstop](Endstop_Phase.md) per migliorare la precisione di tali interruttori.
zh_hans: 归根到底，三角洲校准依赖于各柱的限位开关精度。如果使用Trinamic 步进电机驱动，则可考虑使用[无限位功能](Endstop_Phase.md)以提高检测的准确度。

source: Automatic vs manual probing
fr: Sondage automatique vs manuel
hu: Automatikus vagy kézi szintezés
it: Sonda automatica vs manuale
zh_hans: 自动校准 vs 手动校准

source: Klipper supports calibrating the delta parameters via a manual probing method or via an automatic Z probe.
fr: Klipper prend en charge l'étalonnage des paramètres delta via une méthode de sondage manuelle ou via une sonde Z automatique.
hu: A Klipper támogatja a delta paraméterek kalibrálását kézi szintezéssel vagy automatikus Z-szondával.
it: Klipper supporta la calibrazione dei parametri delta tramite un metodo di sonda manuale o tramite una sonda Z automatica.
zh_hans: Klipper支持使用手动探高或自动z探针的方法进行三角洲参数校准。

source: A number of delta printer kits come with automatic Z probes that are not sufficiently accurate (specifically, small differences in arm length can cause effector tilt which can skew an automatic probe). If using an automatic probe then first [calibrate the probe](Probe_Calibrate.md) and then check for a [probe location bias](Probe_Calibrate.md#location-bias-check). If the automatic probe has a bias of more than 25 microns (.025mm) then use manual probing instead. Manual probing only takes a few minutes and it eliminates error introduced by the probe.
fr: Un certain nombre de kits d'imprimantes delta sont livrés avec des sondes Z automatiques qui ne sont pas suffisamment précises (en particulier, de petites différences sur la longueur des bras peuvent provoquer une inclinaison de la sonde qui peut fausser les mesures). Si vous utilisez une sonde automatique, [étalonnez d'abord la sonde](Probe_Calibrate.md), puis recherchez [le biais d'emplacement de la sonde](Probe_Calibrate.md#location-bias-check). Si la sonde automatique a un biais de plus de 25 microns (0,025 mm), utilisez plutôt le palpage manuel. Le palpage manuel ne prend que quelques minutes et élimine les erreurs introduites par la sonde.
hu: Számos delta nyomtató készlethez automatikus Z-szondák tartoznak, amelyek nem elég pontosak (különösen a karok hosszának kis különbségei okozhatnak effektor dőlést, ami elferdítheti az automatikus szondát). Ha automatikus szondát használsz, akkor először [kalibráld a szondát](Probe_Calibrate.md), majd ellenőrizd a [szonda helyének torzítását](Probe_Calibrate.md#location-bias-check). Ha az automatikus szonda torzítása több mint 25 mikron (0.025mm), akkor helyette használj kézi szintezést. A kézi szintezés csak néhány percet vesz igénybe, és kiküszöböli a szonda által okozott hibát.
it: Numerosi kit di stampanti delta sono dotati di sonde Z automatiche che non sono sufficientemente accurate (in particolare, piccole differenze nella lunghezza del braccio possono causare l'inclinazione dell'effettore che può distorcere una sonda automatica). Se si utilizza una sonda automatica, prima [calibrare la sonda](Probe_Calibrate.md) e quindi verificare la presenza di un [bias posizione sonda](Probe_Calibrate.md#location-bias-check). Se la sonda automatica ha una polarizzazione superiore a 25 micron (0,025 mm), utilizzare invece la sonda manuale. Il probing manuale richiede solo pochi minuti ed elimina l'errore introdotto dalla sonda.
zh_hans: 市面上众多的三角洲打印机附带了自动Z探针，但这些探针的精度不足。特别对于三角洲，臂长的细微差异会导致效应器倾斜，导致打印效果一塌糊涂。如果使用自动探针，则先进行[探针校准](Probe_Calibrate.md)，然后检查[探针位置漂移](Probe_Calibrate.md#location-bias-check)。如果探针的偏差大于25微米（0.025mm），则应使用手动探高。手动探高只需要数分钟的时间，并能摒弃探针带来的误差。

source: If using a probe that is mounted on the side of the hotend (that is, it has an X or Y offset) then note that performing delta calibration will invalidate the results of probe calibration. These types of probes are rarely suitable for use on a delta (because minor effector tilt will result in a probe location bias). If using the probe anyway, then be sure to rerun probe calibration after any delta calibration.
fr: Si vous utilisez une sonde montée sur le côté de la tête (c'est-à-dire qu'elle a un décalage X ou Y par rapport à l'axe de la buse), notez que l'étalonnage delta invalidera les résultats de l'étalonnage de la sonde. Ces types de sondes sont rarement adaptés à une utilisation sur une delta (car une inclinaison mineure de l'effecteur entraînera un biais de localisation de la sonde). Si vous utilisez quand même la sonde, assurez-vous de relancer l'étalonnage de la sonde après tout étalonnage delta.
hu: Ha olyan szondát használsz, amely a fűtőberendezés oldalára van szerelve (azaz X vagy Y eltolással rendelkezik), akkor vedd figyelembe, hogy a delta-kalibrálás végrehajtása érvényteleníti a szonda kalibrálásának eredményeit. Az ilyen típusú szondák ritkán alkalmasak a delta használatára (mivel a kisebb effektor dőlés a szonda helyének torzítását eredményezi). Ha mégis használod a szondát, akkor a delta-kalibrálás után mindenképpen végezd el újra a szonda kalibrálását.
it: Se si utilizza una sonda montata sul lato dell'hotend (ovvero ha un offset X o Y), tenere presente che l'esecuzione della calibrazione delta invaliderà i risultati della calibrazione della sonda. Questi tipi di sonde sono raramente adatti per l'uso su un delta (poiché una minore inclinazione dell'effettore risulterà in una distorsione della posizione della sonda). Se si utilizza comunque la sonda, assicurarsi di eseguire nuovamente la calibrazione della sonda dopo qualsiasi calibrazione delta.
zh_hans: 如果使用的探针是安装在喷嘴的一侧（即，探针对喷嘴存在xy偏移），需注意在进行过三角洲校准之后会使探针校准的结果无效。该类型的探针并不适用于三角洲打印机（因为效应器倾斜会差生探针位置漂移）。如果仍使用上述的探针，则需在三角洲校准校准后再进行一次探针校准。

source: Basic delta calibration
fr: Étalonnage Delta de base
hu: Alapvető delta kalibrálás
it: Calibrazione delta di base
zh_hans: 简单三角洲校准

source: Klipper has a DELTA_CALIBRATE command that can perform basic delta calibration. This command probes seven different points on the bed and calculates new values for the tower angles, tower endstops, and delta radius.
fr: Klipper a une commande DELTA_CALIBRATE qui peut effectuer un étalonnage Delta de base. Cette commande sonde sept points différents sur le lit et calcule de nouvelles valeurs pour les angles de la tour, les butées de la tour et le rayon delta.
hu: A Klipper rendelkezik egy DELTA_CALIBRATE paranccsal, amely alapvető delta-kalibrálást végezhet. Ez a parancs a tárgyasztal hét különböző pontját vizsgálja, és új értékeket számol ki a toronyszögek, a toronyvégállások és a delta-sugár számára.
it: Klipper ha un comando DELTA_CALIBRATE che può eseguire la calibrazione delta di base. Questo comando sonda sette diversi punti sul letto e calcola nuovi valori per gli angoli della torre, i punti terminali della torre e il raggio delta.
zh_hans: 通过DELTA_CALIBRATE 命令可以在Klipper中进行简单三角洲校准。该命令会对热床上的7个不同的位置进行探高，并计算除柱夹角，柱限位位置和三角半径。

source: In order to perform this calibration the initial delta parameters (arm lengths, radius, and endstop positions) must be provided and they should have an accuracy to within a few millimeters. Most delta printer kits will provide these parameters - configure the printer with these initial defaults and then go on to run the DELTA_CALIBRATE command as described below. If no defaults are available then search online for a delta calibration guide that can provide a basic starting point.
fr: Afin d'effectuer cet étalonnage, les paramètres delta initiaux (longueurs de bras, rayon et positions des fin de course) doivent être fournis et ils doivent avoir une précision de quelques millimètres. La plupart des kits d'imprimante delta fournissent ces paramètres - configurez l'imprimante avec ces valeurs par défaut, puis exécutez la commande DELTA_CALIBRATE comme décrit ci-dessous. Si aucune valeur par défaut n'est disponible, recherchez en ligne un guide d'étalonnage delta qui pourra vous fournir un point de départ de base.
hu: A kalibrálás elvégzéséhez meg kell adni a kiindulási delta paramétereket (karhossz, sugár és végállások), amelyeknek néhány milliméteres pontossággal kell rendelkezniük. A legtöbb delta nyomtató készlet biztosítja ezeket a paramétereket. Konfiguráld a nyomtatót ezekkel a kezdeti alapbeállításokkal, majd futtasd a DELTA_CALIBRATE parancsot az alábbiakban leírtak szerint. Ha nem állnak rendelkezésre alapértelmezett értékek, akkor keress az interneten egy delta-kalibrálási útmutatót, amely alapvető kiindulópontot adhat.
it: Per eseguire questa calibrazione devono essere forniti i parametri delta iniziali (lunghezze dei bracci, raggio e posizioni dei finecorsa) e devono avere una precisione di pochi millimetri. La maggior parte dei kit della stampante delta fornisce questi parametri: configurare la stampante con queste impostazioni predefinite iniziali e quindi eseguire il comando DELTA_CALIBRATE come descritto di seguito. Se non sono disponibili impostazioni predefinite, cercare online una guida alla calibrazione delta che possa fornire un punto di partenza di base.
zh_hans: 要进行校准，需要先提供柱夹角，柱限位位置和三角半径的初始值，这些值应与实际值只有几毫米的偏差。大多三角洲打印机套件会提供这些值，在配置文件中输入这些值作为初始配置，然后按照下述步骤运行DELTA_CALIBRATE 。如果无法找到初始值，则可以通过搜索 三角洲校准 教程，作为测量的依据。

source: During the delta calibration process it may be necessary for the printer to probe below what would otherwise be considered the plane of the bed. It is typical to permit this during calibration by updating the config so that the printer's `minimum_z_position=-5`. (Once calibration completes, one can remove this setting from the config.)
fr: Au cours du processus d'étalonnage Delta, il peut être nécessaire que l'imprimante sonde 'en dessous' de ce qui serait autrement considéré comme le plan du lit. Il est courant d'autoriser cela lors de l'étalonnage en mettant à jour la configuration de sorte que la position `minimum_z_position=-5` de l'imprimante. (Une fois l'étalonnage terminé, on peut supprimer ce paramètre de la configuration.)
hu: A delta-kalibrálás során előfordulhat, hogy a nyomtatónak a tárgyasztal síkja alatt kell szinteznie, amit egyébként a tárgyasztal síkjának tekinthetnénk. Jellemzően ezt a kalibrálás során a konfiguráció frissítésével engedélyezzük a `minimum_z_position=-5` értékkel. (A kalibrálás befejezése után ez a beállítás eltávolítható a konfigurációból.)
it: Durante il processo di calibrazione delta potrebbe essere necessario che la stampante sondi al di sotto di quello che altrimenti sarebbe considerato il piano del piatto. È tipico consentire ciò durante la calibrazione aggiornando la configurazione in modo che `minimum_z_position=-5` della stampante. (Una volta completata la calibrazione, è possibile rimuovere questa impostazione dalla configurazione.)
zh_hans: 校准期间，打印机需要对热床外的底板进行探高。通常可以通过修改设置中的 `minimum_z_position=-5` 以实现床外探高。（校准后可以在设置中移除该项。）

source: There are two ways to perform the probing - manual probing (`DELTA_CALIBRATE METHOD=manual`) and automatic probing (`DELTA_CALIBRATE`). The manual probing method will move the head near the bed and then wait for the user to follow the steps described at ["the paper test"](Bed_Level.md#the-paper-test) to determine the actual distance between the nozzle and bed at the given location.
fr: Il existe deux façons d'effectuer le sondage : le sondage manuel (`DELTA_CALIBRATE METHOD=manual`) et le sondage automatique (`DELTA_CALIBRATE`). La méthode de sondage manuel déplacera la tête près du lit, puis attendra que l'utilisateur suive les étapes décrites dans ["le test du papier"](Bed_Level.md#the-paper-test) pour déterminer la distance réelle entre la buse et lit à l'endroit indiqué.
hu: A szintezést kétféleképpen lehet elvégezni: kézi szintezés (`DELTA_CALIBRATE METHOD=manual`) és automatikus szintezés (`DELTA_CALIBRATE`). A kézi szintezési módszer a fejet a tárgyasztal közelébe mozgatja, majd megvárja, hogy a felhasználó kövesse a ["a papírteszt"](Bed_Level.md#the-paper-test) pontban leírt lépéseket, hogy meghatározza a fúvóka és a tárgyasztal közötti tényleges távolságot az adott helyen.
it: Ci sono due modi per eseguire la procedura: probing manuale (`DELTA_CALIBRATE METHOD=manual`) e automatica (`DELTA_CALIBRATE`). Il metodo di rilevamento manuale sposterà la testa vicino al piatto e quindi attenderà che l'utente segua i passaggi descritti in ["test della carta"](Bed_Level.md#the-paper-test) per determinare la distanza effettiva tra l'ugello e letto nel luogo indicato.
zh_hans: 探高的方式有两种：手动探高(`DELTA_CALIBRATE METHOD=manual`)和自动探高(`DELTA_CALIBRATE`)。手动探高模式下，打印头将会移近热床，然后等候用户使用 ["纸测法"](Bed_Level.md#the-paper-test) 测量特定位置上的喷嘴和热床的之间的偏差值。

source: To perform the basic probe, make sure the config has a [delta_calibrate] section defined and then run the tool:
fr: Pour effectuer le sondage initial, assurez-vous que la configuration a une section [delta_calibrate] définie, puis exécutez l'outil :
hu: Az alapvető mérés elvégzéséhez győződj meg arról, hogy a konfigurációban van-e definiálva egy [delta_calibrate] szakasz, majd futtasd az eszközt:
it: Per eseguire la misura di base, assicurati che la configurazione abbia una sezione [delta_calibrate] definita e quindi esegui lo strumento:
zh_hans: 进行简单校准，请确保在配置文件中定义了[delta_calibrate]，然后运行工具：

source: After probing the seven points new delta parameters will be calculated. Save and apply these parameters by running:
fr: Après avoir sondé les sept points, de nouveaux paramètres Delta seront calculés. Enregistrez et appliquez ces paramètres en exécutant :
hu: A hét pont szintezése után új delta paraméterek kerülnek kiszámításra. Mentsd el és alkalmazd ezeket a paramétereket a következőt futtatva:
it: Dopo aver sondato i sette punti verranno calcolati i nuovi parametri delta. Salva e applica questi parametri eseguendo:
zh_hans: 在测量了7个点，并计算得出新三角洲参数后，运行下面的命令来保存参数：

source: The basic calibration should provide delta parameters that are accurate enough for basic printing. If this is a new printer, this is a good time to print some basic objects and verify general functionality.
fr: L'étalonnage initial doit fournir des paramètres Delta suffisamment précis pour une impression. S'il s'agit d'une nouvelle imprimante, c'est le bon moment pour imprimer certains objets simples et vérifier son bon fonctionnement.
hu: Az alapkalibrációnak olyan delta paramétereket kell biztosítania, amelyek elég pontosak az alapvető nyomtatáshoz. Ha ez egy új nyomtató, ez egy jó alkalom néhány alapvető objektum nyomtatására és az általános működés ellenőrzésére.
it: La calibrazione di base dovrebbe fornire parametri delta sufficientemente accurati per la stampa di base. Se si tratta di una nuova stampante, questo è un buon momento per stampare alcuni oggetti di base e verificarne la funzionalità generale.
zh_hans: 简单校准获得的参数，其准确性可以满足日常打印的需求。对于新打印机，可以尝试打印几个简单模型，确定功能正常。

source: Enhanced delta calibration
fr: Étalonnage Delta avancé
hu: Továbbfejlesztett delta kalibrálás
it: Calibrazione delta migliorata
zh_hans: 进阶三角洲校准

source: The basic delta calibration generally does a good job of calculating delta parameters such that the nozzle is the correct distance from the bed. However, it does not attempt to calibrate X and Y dimensional accuracy. It's a good idea to perform an enhanced delta calibration to verify dimensional accuracy.
fr: L'étalonnage Delta de base fait généralement un bon travail de calcul des paramètres delta de sorte que la buse soit à la bonne distance du lit. Cependant, il n'essaye pas de calibrer la précision dimensionnelle X et Y. L'étalonnage delta amélioré permet de vérifier la précision dimensionnelle.
hu: Az alap delta-kalibrálás általában jó munkát végez a delta paraméterek kiszámításában, hogy a fúvóka a megfelelő távolságra legyen a tárgyasztaltól. Nem próbálja azonban kalibrálni az X és Y dimenzió pontosságát. A méretpontosság ellenőrzésére érdemes egy kibővített delta-kalibrációt elvégezni.
it: La calibrazione delta di base generalmente fa un buon lavoro nel calcolo dei parametri delta in modo tale che l'ugello sia alla distanza corretta dal letto. Tuttavia, non tenta di calibrare la precisione dimensionale X e Y. È una buona idea eseguire una calibrazione delta avanzata per verificare l'accuratezza dimensionale.
zh_hans: 简单三角洲校准获得的三角洲参数可以很好地修正喷嘴距离之类问题。然而，该模式不能校准X，Y轴上的准确度。而进阶三角洲校准则是针对维度准确性地问题。

source: This calibration procedure requires printing a test object and measuring parts of that test object with digital calipers.
fr: Cette procédure d'étalonnage nécessite l'impression d'un objet de test et la mesure de parties de cet objet de test avec un pied à coulisse.
hu: Ehhez a kalibrálási eljáráshoz ki kell nyomtatni egy tesztobjektumot, és a tesztobjektum egyes részeit digitális tolómérővel kell megmérni.
it: Questa procedura di calibrazione richiede la stampa di un oggetto di prova e la misurazione di parti di tale oggetto di prova con un calibro digitale.
zh_hans: 校准流程需要打印一个测试模型并用游标卡尺测量模型的尺寸。

source: Use a slicer to generate G-Code from the [docs/prints/calibrate_size.stl](prints/calibrate_size.stl) file. Slice the object using a slow speed (eg, 40mm/s). If possible, use a stiff plastic (such as PLA) for the object. The object has a diameter of 140mm. If this is too large for the printer then one can scale it down (but be sure to uniformly scale both the X and Y axes). If the printer supports significantly larger prints then this object can also be increased in size. A larger size can improve the measurement accuracy, but good print adhesion is more important than a larger print size.
fr: Utilisez un trancheur pour générer le G-Code à partir du fichier [docs/prints/calibrate_size.stl](prints/calibrate_size.stl). Tranchez l'objet en utilisant une vitesse lente (par exemple, 40 mm/s). Si possible, utilisez un plastique rigide (comme le PLA) pour l'objet. L'objet a un diamètre de 140 mm. Si c'est trop grand pour l'imprimante, il est possible de le réduire (mais assurez-vous de mettre uniformément à l'échelle les axes X et Y). Si l'imprimante prend en charge des impressions beaucoup plus grandes, cet objet peut également être agrandi. Une taille plus grande peut améliorer la précision de la mesure, mais une bonne adhérence de l'impression est plus importante qu'une taille d'impression plus grande.
hu: Használj szeletelőt a [docs/prints/calibrate_size.stl](prints/calibrate_size.stl) fájlból G-kód generálásához. Szeletelje az objektumot lassú sebességgel (pl. 40mm/s). Ha lehetséges, használj merev műanyagot (pl. PLA) a tárgyhoz. A tárgy átmérője 140 mm. Ha ez túl nagy a nyomtató számára, akkor át lehet méretezni (de ügyelj arra, hogy mind az X, és az Y tengelyt egyenletesen méretezze). Ha a nyomtató jelentősen nagyobb nyomatokat támogat, akkor a tárgy is megnövelhető. A nagyobb méret javíthatja a mérési pontosságot, de a jó tapadás fontosabb, mint a nagyobb nyomtatási méret.
it: Usa uno slicer per generare il G-code dal file [docs/prints/calibrate_size.stl](prints/calibrate_size.stl). Estrudere l'oggetto a bassa velocità (ad es. 40 mm/s). Se possibile, usa una plastica rigida (come il PLA) per l'oggetto. L'oggetto ha un diametro di 140 mm. Se questo è troppo grande per la stampante, è possibile ridimensionarlo (ma assicurati di ridimensionare uniformemente entrambi gli assi X e Y). Se la stampante supporta stampe significativamente più grandi, è anche possibile aumentare le dimensioni di questo oggetto. Un formato più grande può migliorare la precisione della misurazione, ma una buona adesione di stampa è più importante di un formato di stampa più grande.
zh_hans: 用切片器对[docs/prints/calibrate_size.stl](prints/calibrate_size.stl)的模型进行切片，生成G-Code。速度设置使用低速（例如 40mm/s）。如可能使用刚性塑料（如PLA）。模型的外径为140mm。如果尺寸太大则按照热床大小进行缩小（但应注意X和Y应按比例进行缩放）。如果打印机的热床足够大，也可以放大该模型。大尺寸可以提高测量的准确性，但是模型的床附着对测量准确性影响更大。
