Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Endstop_Phase.po
Languages: da, hu, ru

source: This document describes Klipper's stepper phase adjusted endstop system. This functionality can improve the accuracy of traditional endstop switches. It is most useful when using a Trinamic stepper motor driver that has run-time configuration.
da: Dette dokument beskriver Klippers Stepper fase endestop system. Denne funktionalitet kan forbedre præcisionen af traditionelle endestop-kontakter. Det er mest brugbart ved brug af Trinamic stepper motor drivere der tillader "run-time" konfiguration.
hu: Ez a dokumentum a Klipper léptetőfázis-beállított végütköző rendszerét írja le. Ez a funkció javíthatja a hagyományos végálláskapcsolók pontosságát. Ez a leghasznosabb olyan Trinamic léptetőmotor-illesztőprogram használatakor, amely futásidejű konfigurációval rendelkezik.
ru: В этом документе описывается система концевого упора Klipper с регулировкой ступенчатой фазы. Эта функциональность может повысить точность традиционных конечных выключателей. Это наиболее полезно при использовании драйвера шагового двигателя Trinamic, который имеет конфигурацию во время выполнения.

source: A typical endstop switch has an accuracy of around 100 microns. (Each time an axis is homed the switch may trigger slightly earlier or slightly later.) Although this is a relatively small error, it can result in unwanted artifacts. In particular, this positional deviation may be noticeable when printing the first layer of an object. In contrast, typical stepper motors can obtain significantly higher precision.
da: En typisk endestop-kontakt har en præcision på ca 100µ. (Hver gang en akse nulstilles kan kontakten aktiveres lidt tidligere eller lidt senere end sidste aktivering). Selvom dette er en relativt lille forskel, kan det resultere i uønskede artefakter. I særdeleshed kan denne afvigelse vise sig ved print af det første lag af et objekt. De fleste stepper motorer kan opnå en markant højere præcision.
hu: Egy tipikus végálláskapcsoló pontossága körülbelül 100 mikron. (A tengely minden egyes indításakor a kapcsoló valamivel korábban vagy valamivel később léphet működésbe). Bár ez viszonylag kis hiba, nem kívánt nyomtatványokat eredményezhet. Különösen a tárgy első rétegének nyomtatásakor lehet észrevehető ez a pozícióeltérés. Ezzel szemben a tipikus léptetőmotorokkal lényegesen nagyobb pontosság érhető el.
ru: Типичный концевой выключатель имеет точность около 100 микрон. (Каждый раз, когда ось устанавливается на место, переключатель может срабатывать немного раньше или немного позже.) Хотя это относительно небольшая ошибка, она может привести к нежелательным артефактам. В частности, это позиционное отклонение может быть заметно при печати первого слоя объекта. В отличие от этого, обычные шаговые двигатели могут обеспечить значительно более высокую точность.

source: The stepper phase adjusted endstop mechanism can use the precision of the stepper motors to improve the precision of the endstop switches. A stepper motor moves by cycling through a series of phases until in completes four "full steps". So, a stepper motor using 16 micro-steps would have 64 phases and when moving in a positive direction it would cycle through phases: 0, 1, 2, ... 61, 62, 63, 0, 1, 2, etc. Crucially, when the stepper motor is at a particular position on a linear rail it should always be at the same stepper phase. Thus, when a carriage triggers the endstop switch the stepper controlling that carriage should always be at the same stepper motor phase. Klipper's endstop phase system combines the stepper phase with the endstop trigger to improve the accuracy of the endstop.
da: Fase justeret endestop kan bruge stepper motorerens precision til at øge endestop-kontaktens præcision. En stepper motor bevæger sig ved at gennemføre en cyklus gennem faser indtil den har udført fire "fulde steps". Så hvis en stepper motor bruger 16 mikro-steps, vil den have 64 faser, og ved bevægelse i positiv retning vil den gennemgå disse faser således: 0, 1, 2, ... 61, 62,63, 0, 1, 2 osv. Derfor bør en stepper motor være ved en bestemt fase, på et bestemt punkt på sin akse. Så når slæden aktiverer endestop-kontakten, bør stepperen altid være på samme fase. Klippers endestop fase system kombinerer stepper motorens fase med endestop-kontakten for at øge præcisionen.
hu: A lépcsős fázisú végállás mechanizmus a lépcsős motorok pontosságát használhatja a végálláskapcsolók pontosságának javítására. A léptetőmotor egy sor fázison keresztül ciklikusan mozog, amíg négy "teljes lépést" nem teljesít. Tehát egy 16 mikrolépést használó léptetőmotornak 64 fázisa lenne, és pozitív irányba történő mozgáskor a fázisok között ciklikusan haladna: 0, 1, 2, ... 61, 62, 63, 0, 1, 2, stb. Lényeges, hogy amikor a léptetőmotor egy adott pozícióban van a lineáris sínen, mindig ugyanabban a léptetőfázisban kell lennie. Így amikor egy kocsi a végálláskapcsolót aktiválja, az adott kocsit vezérlő léptetőnek mindig ugyanabban a léptetőmotor fázisban kell lennie. A Klipper'végállás fázis rendszere a végállás pontosságának javítása érdekében kombinálja a léptető fázist a végállás kioldójával.
ru: Механизм концевого выключателя с регулируемой фазой шага может использовать точность шаговых двигателей для повышения точности концевых выключателей. Шаговый двигатель движется циклически через ряд фаз, пока не завершит четыре "полных шага". Таким образом, шаговый двигатель, использующий 16 микрошагов, будет иметь 64 фазы, и при движении в положительном направлении он будет циклически проходить через фазы: 0, 1, 2, ... 61, 62, 63, 0, 1, 2, и т.д. Важно отметить, что когда шаговый двигатель находится в определенном положении на линейном рельсе, он всегда должен находиться в одной и той же фазе шага. Таким образом, когда каретка приводит в действие концевой выключатель, шаговый двигатель, управляющий этой кареткой, всегда должен находиться в одной и той же фазе шагового двигателя. Система endstop phase от Klipper сочетает в себе шаговую фазу с триггером endstop для повышения точности endstop.

source: In order to use this functionality it is necessary to be able to identify the phase of the stepper motor. If one is using Trinamic TMC2130, TMC2208, TMC2224 or TMC2660 drivers in run-time configuration mode (ie, not stand-alone mode) then Klipper can query the stepper phase from the driver. (It is also possible to use this system on traditional stepper drivers if one can reliably reset the stepper drivers - see below for details.)
da: For at bruge denne funktion er det nødvendigt at identificere fasen op stepper motoren. Hvis du bruger Trinamic TMC2130, TMC2208, TMC2224 eller TMC2660 drivere i "run-time"konfiguration (altså ikke i "stand-alone") så kan Klipper anmode om stepper motorens fase fra driveren. (Det er også muligt at bruge dette system med traditionelle driverem hvis disse kan nulstilles stabilt. Se nedenfor for yderligere detaljer.)
hu: Ahhoz, hogy ezt a funkciót használni lehessen, azonosítani kell a léptetőmotor fázisát. Ha a Trinamic TMC2130, TMC2208, TMC2224 vagy TMC2660 meghajtókat futásidejű konfigurációs módban használja (azaz nem önálló módban), akkor a Klipper le tudja kérdezni a léptetőmotor fázisát a meghajtóból. (Ez a rendszer hagyományos léptető meghajtókon is használható, ha megbízhatóan vissza lehet állítani a léptető meghajtókat - a részleteket lásd alább.)
ru: Для того, чтобы использовать эту функциональность, необходимо иметь возможность идентифицировать фазу шагового двигателя. Если кто-то использует драйверы Trinamic TMC2130, TMC2208, TMC2224 или TMC2660 в режиме конфигурации во время выполнения (т.Е. не в автономном режиме), то Klipper может запросить шаговую фазу у драйвера. (Также возможно использовать эту систему на традиционных шаговых драйверах, если можно надежно сбросить шаговые драйверы - подробности см. Ниже.)

source: Calibrating endstop phases
da: Kalibrering af endestop faser
hu: Végállási fázisok kalibrálása
ru: Калибровка фаз конечного останова

source: If using Trinamic stepper motor drivers with run-time configuration then one can calibrate the endstop phases using the ENDSTOP_PHASE_CALIBRATE command. Start by adding the following to the config file:
da: Hvis du bruger Trinamic stepper drivere med "run-time" konfiguration kan du kalibrere endestop fasen ved brug af ENDSTOP_PHASE_CALIBRATE kommandoen. Start med at tilføje følgende til konfigurationsfilen:
hu: Ha Trinamic léptetőmotor-meghajtókat használunk futásidejű konfigurációval, akkor az ENDSTOP_PHASE_CALIBRATE paranccsal kalibrálhatjuk a végállási fázisokat. Kezdje a következők hozzáadásával a konfigurációs fájlhoz:
ru: При использовании драйверов шаговых двигателей Trinamic с конфигурацией во время выполнения можно откалибровать фазы конечного останова с помощью команды ENDSTOP_PHASE_CALIBRATE. Начните с добавления в файл конфигурации следующих параметров:

source: Then RESTART the printer and run a `G28` command followed by an `ENDSTOP_PHASE_CALIBRATE` command. Then move the toolhead to a new location and run `G28` again. Try moving the toolhead to several different locations and rerun `G28` from each position. Run at least five `G28` commands.
da: Genstart derefter printeren og kør `G28` kommandoen efterfulgt af `ENDSTOP_PHASE_CALIBRATE` kommandoen. Flyt derefter aksen til en ny position og kør `G28` igen. Gør dette minimum 5 gange.
hu: Ezután indítsa újra a nyomtatót, és futtasson egy `G28` parancsot, amelyet egy `ENDSTOP_PHASE_CALIBRATE` parancs követ. Ezután mozgassa a szerszámfejet egy új helyre, és futtassa újra a `G28` parancsot. Próbálja meg a szerszámfejet több különböző helyre mozgatni, és minden egyes pozícióból futtassa újra a `G28` parancsot. Futtasson legalább öt `G28` parancsot.
ru: Затем перезагрузите принтер и выполните команду `G28`, а затем команду `ENDSTOP_PHASE_CALIBRATE`. Затем переместите головку инструмента в другое место и снова выполните команду `G28`. Попробуйте переместить головку инструмента в несколько разных мест и повторно запустить `G28` из каждого положения. Выполните не менее пяти команд `G28`.

source: After performing the above, the `ENDSTOP_PHASE_CALIBRATE` command will often report the same (or nearly the same) phase for the stepper. This phase can be saved in the config file so that all future G28 commands use that phase. (So, in future homing operations, Klipper will obtain the same position even if the endstop triggers a little earlier or a little later.)
da: Efter at have udført ovenstående, `ENDSTOP_PHASE_CALIBRATE` kommandoen bør vise den samme, eller tæt på, fase for stepper motoren. Denne fase kan gemmes i konfigurationsfilen så alle senere G28 kommandoer bruger denne fase. (På den måde vil Klipper fremover bruge samme postition/fase uanset om endestop-kontakten aktiveres lidt før eller efter.)
hu: A fentiek elvégzése után a `ENDSTOP_PHASE_CALIBRATE` parancs gyakran ugyanazt (vagy közel ugyanazt) a fázist fogja jelenteni a léptető számára. Ezt a fázist el lehet menteni a konfigurációs fájlban, hogy a jövőben minden G28 parancs ezt a fázist használja. (Így a jövőbeni kezdőpont kérési műveletek során a Klipper ugyanazt a pozíciót fogja elérni, még akkor is, ha a végállás egy kicsit korábban vagy egy kicsit később lép működésbe.)
ru: После выполнения вышеуказанных действий команда `ENDSTOP_PHASE_CALIBRATE` часто сообщает о той же (или почти той же) фазе для степпера. Эту фазу можно сохранить в конфигурационном файле, чтобы все последующие команды G28 использовали эту фазу. (Таким образом, при последующих операциях самонаведения клипер будет занимать одно и то же положение, даже если конечная остановка сработает немного раньше или немного позже.)

source: To save the endstop phase for a particular stepper motor, run something like the following:
da: For at gemme endestop fasen for en specifik stepper motor, køres en kommando som denne:
hu: Egy adott léptetőmotor végállási fázisának elmentéséhez futtasson valami hasonlót, mint a következő:
ru: Чтобы сохранить фазу остановки для конкретного шагового двигателя, выполните примерно следующее:

source: Run the above for all the steppers one wishes to save. Typically, one would use this on stepper_z for cartesian and corexy printers, and for stepper_a, stepper_b, and stepper_c on delta printers. Finally, run the following to update the configuration file with the data:
da: Kør ovenstående kommando for alle ønskede steppere/akser. Typisk vil man bruge dette på stepper_z for Kartesiske og CoreXY printere, og på stepper_a, stepper_b og stepper_c for Delta printere. Til sidst køres følgende for at opdatere konfigurationsfilen med de nye data:
hu: Futtassa a fenti lépéseket az összes menteni kívánt léptetőre. Általában ezt a stepper_z-nél használjuk cartesian és corexy-nyomtatókhoz, illetve stepper_a, stepper_b és stepper_c-hez delta nyomtatókhoz. Végül futtassa a következőt a konfigurációs fájl frissítéséhez az adatokkal:
ru: Выполните описанные выше действия для всех степперов, которые вы хотите сохранить. Обычно это используется для степпера_z для картезианских и корексиальных принтеров и для степпера_a, степпера_b и степпера_c для дельта-принтеров. Наконец, выполните следующую команду, чтобы обновить конфигурационный файл с данными:

source: Additional notes
da: Yderligere noter
hu: További megjegyzések
ru: Дополнительные примечания

source: This feature is most useful on delta printers and on the Z endstop of cartesian/corexy printers. It is possible to use this feature on the XY endstops of cartesian printers, but that isn't particularly useful as a minor error in X/Y endstop position is unlikely to impact print quality. It is not valid to use this feature on the XY endstops of corexy printers (as the XY position is not determined by a single stepper on corexy kinematics). It is not valid to use this feature on a printer using a "probe:z_virtual_endstop" Z endstop (as the stepper phase is only stable if the endstop is at a static location on a rail).
da: Denne funktion er mest brugbar på Delta printere og på z-aksen på kartesiske og corexy printere. Det ER muligt at bruge denne funktion på X/Y akserne, men det vil ikke have stor effekt, da en så lille forskel sjældent vil have indflydelse på slutresultatet. Funktionen kan IKKE bruges på X/Y akserne på corexy printere, da disse positioner afhænger af 2 stepper motorers positioner. Den kan heller IKKE bruges på printere der bruger "probe:z_virtual_endstop" da stepperens fase kun kan bruges når endestop kontakten er monteret fast på aksen.
hu: Ez a funkció a leghasznosabb a delta nyomtatókon és a cartesian/corexy nyomtatók Z végpontján. A funkciót a cartesian nyomtatók XY végállásainál is lehet használni, de ez nem túl hasznos, mivel az X/Y végállás pozíciójának kisebb hibája valószínűleg nem befolyásolja a nyomtatás minőségét. Nem érvényes ezt a funkciót a corexy nyomtatók XY végállásainál használni (mivel az XY pozíciót nem egyetlen léptető határozza meg a corexy kinematikánál). Nem érvényes ezt a funkciót olyan nyomtatókon használni, amelyek "probe:z_virtual_endstop" Z végállást használnak (mivel a léptetőfázis csak akkor stabil, ha a végállás egy sín statikus helyén van).
ru: Эта функция наиболее полезна на дельта-принтерах и на концевых упорах Z на картезианских/корексиальных принтерах. Можно использовать эту функцию на концевых упорах XY картриджного принтера, но это не особенно полезно, поскольку незначительная ошибка в положении концевого упора X/Y вряд ли повлияет на качество печати. Недопустимо использовать эту функцию для концевых упоров XY принтеров с корексией (так как положение XY не определяется одним шагом при корексиальной кинематике). Недопустимо использовать эту функцию на принтере, использующем концевой упор Z "probe:z_virtual_endstop" (так как фаза шага стабильна, только если концевой упор находится в статичном положении на рельсе).

source: After calibrating the endstop phase, if the endstop is later moved or adjusted then it will be necessary to recalibrate the endstop. Remove the calibration data from the config file and rerun the steps above.
da: Efter kalibrering af endestop faser, hvis kontakten senere flyttes eller justeres, vil det være nødvendigt at kalibrere endestoppene igen. Fjerne kalibrerings dataene fra konfigurationsfilen og gennemgå trinene ovenfor igen.
hu: A végállásfázis kalibrálása után, ha a végállást később elmozdítják vagy beállítják, akkor a végállást újra kell kalibrálni. Távolítsa el a kalibrálási adatokat a konfigurációs fájlból, és futtassa újra a fenti lépéseket.
ru: После калибровки фазы концевого упора, если впоследствии концевой упор будет перемещен или отрегулирован, необходимо будет повторно откалибровать концевой упор. Удалите данные калибровки из файла конфигурации и повторно выполните описанные выше действия.

source: In order to use this system the endstop must be accurate enough to identify the stepper position within two "full steps". So, for example, if a stepper is using 16 micro-steps with a step distance of 0.005mm then the endstop must have an accuracy of at least 0.160mm. If one gets "Endstop stepper_z incorrect phase" type error messages than in may be due to an endstop that is not sufficiently accurate. If recalibration does not help then disable endstop phase adjustments by removing them from the config file.
da: For at bruge dette system skal endestoppet være præcist nok til at aktivere inden for 2 "fulde steps". For eksempel, hvis stepperen bruger 16 mikro-steps med en distance per step på 0.005mm, så skal endestoppet være præcist ned til minimum 0.160mm. Hvis fejlen "Endstop stepper_z incorrect phase" vises, kan det være fordi at endestoppet ikke er præcist nok. Hvis rekalibrering ikke afhjælper fejlen, skal du deaktivere endestop fase systemet ved at fjerne dataene fra konfigurationsfilen.
hu: A rendszer használatához a végállásnak elég pontosnak kell lennie ahhoz, hogy a léptető pozícióját két "teljes lépésen" belül azonosítsa. Így például, ha egy léptető 16 mikrolépést használ 0,005 mm-es lépésközzel, akkor a végállásnak legalább 0,160 mm-es pontossággal kell rendelkeznie. Ha a "Endstop stepper_z incorrect phase" típusú hibaüzeneteket kapunk, akkor ez egy nem kellően pontos végállás miatt lehet. Ha az újrakalibrálás nem segít, akkor tiltsa le az endstop fázisbeállítását a konfigurációs fájlból való eltávolítással.
ru: Для использования этой системы концевой упор должен быть достаточно точным, чтобы определить положение шагового механизма в пределах двух "полных шагов". Так, например, если шаговик использует 16 микрошагов с шаговым расстоянием 0,005 мм, то концевой упор должен иметь точность не менее 0,160 мм. Если появляются сообщения об ошибке типа "Endstop stepper_z incorrect phase", это может быть связано с недостаточно точным концевым упором. Если повторная калибровка не помогает, отключите регулировку фазы концевого ограничителя, удалив ее из файла конфигурации.

source: If one is using a traditional stepper controlled Z axis (as on a cartesian or corexy printer) along with traditional bed leveling screws then it is also possible to use this system to arrange for each print layer to be performed on a "full step" boundary. To enable this feature be sure the G-Code slicer is configured with a layer height that is a multiple of a "full step", manually enable the endstop_align_zero option in the endstop_phase config section (see [config reference](Config_Reference.md#endstop_phase) for further details), and then re-level the bed screws.
da: Hvis der bruges traditionelle stepper styrede z_akser (som på kartesiske og corexy printere) sammen med traditionel byggeplade skrue-nivellering, så kan dette system også bruges til at arrangere at hvert lag printes på en "fuldt step" grænse. For at aktivere denne funktion skal du sikre dig at slicer-softwaren er konfigureret med en laghøjde der er delelig med højden på et "fuldt step", manueltaktivere "endstop_align_zero" funktionen i "endstop_phase" sektionen af konfigurationsfilen. Se [Konfigurationsreference](Config_Reference.md#endstop_phase) for yderligere detaljer, og juster derefter byggepladens skruer.
hu: Ha valaki hagyományos léptető vezérlésű Z tengelyt használ (mint egy cartesian vagy corexy nyomtatón) hagyományos ágykiegyenlítő csavarokkal együtt, akkor az is lehetséges, hogy ezt a rendszert úgy használja, hogy minden egyes nyomtatási réteget egy "teljes lépés" határon végezzen el. Ennek a funkciónak az engedélyezéséhez győződjön meg arról, hogy a G-kód szeletelő olyan rétegmagassággal van konfigurálva, amely a "teljes lépés" többszöröse, manuálisan engedélyezze az endstop_align_zero opciót az endstop_phase config szakaszban (további részletekért lásd [config reference](Config_Reference.md#endstop_phase)), majd szintezze újra az ágy csavarjait.
ru: Если используется традиционная ось Z с шаговым управлением (как на картезианском или корекси принтере) вместе с традиционными винтами для выравнивания ложа, то можно также использовать эту систему для организации выполнения каждого слоя печати на границе "полного шага". Чтобы включить эту функцию, убедитесь, что слайсер G-Code настроен на высоту слоя, кратную "полному шагу", вручную включите опцию endstop_align_zero в разделе конфигурации endstop_phase (подробности см. в [config reference](Config_Reference.md#endstop_phase)), а затем снова выровняйте винты станины.
