Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Endstop_Phase.po
Languages: da, hu, ru

source: It is possible to use this system with traditional (non-Trinamic) stepper motor drivers. However, doing this requires making sure that the stepper motor drivers are reset every time the micro-controller is reset. (If the two are always reset together then Klipper can determine the stepper phase by tracking the total number of steps it has commanded the stepper to move.) Currently, the only way to do this reliably is if both the micro-controller and stepper motor drivers are powered solely from USB and that USB power is provided from a host running on a Raspberry Pi. In this situation one can specify an mcu config with "restart_method: rpi_usb" - that option will arrange for the micro-controller to always be reset via a USB power reset, which would arrange for both the micro-controller and stepper motor drivers to be reset together. If using this mechanism, one would then need to manually configure the "trigger_phase" config sections (see [config reference](Config_Reference.md#endstop_phase) for the details).
da: Det er muligt at bruge dette system med traditionelle (ikke Trinamic) stepper motor drivere. Dog kræver dette at det sikres at stepper motor driverne bliver nulstillet hver gang mcu'en nulstilles. Hvis disse altid nulstilles sammen, kan Klipper bestemme stepperens fasen ved at logge det totale antal af steps stepper motoren er blevet bedt om at bevæge sig. I øjeblikket er den eneste pålidelige måde at gøre dette på, hvis både stepper motor driver og mcu begge får strøm via USB, samt at denne USB styres af en vært på en Raspberry Pi. I denne situation kan man indstille mcu konfigurationen til "restartmethod:rpi_usb" - Dette vil sørge for at mcu'en altid nulstilles ved genstart af USB strømtilførslen, Hvilket vil sørge for at både stepper motor drivere og mcu nulstilles på samme tid. Ved brug af denne funktion skal "trigger_phase" sektionen konfigureres, se [Konfigurationsreference](Config_Reference.md#endstop_phase) for yderligere detaljer.
hu: Ez a rendszer hagyományos (nem Trinamic) léptetőmotor-meghajtókkal is használható. Ehhez azonban gondoskodni kell arról, hogy a léptetőmotor-meghajtók a mikrokontroller minden egyes resetelésekor újrainduljanak. (Ha a kettő mindig együtt van resetelve, akkor a Klipper a léptető fázisát úgy tudja meghatározni, hogy nyomon követi a léptetőnek adott parancsok teljes lépésszámát). Jelenleg ez csak akkor lehetséges megbízhatóan, ha mind a mikrokontroller, mind a léptetőmotor-meghajtók kizárólag USB-ről kapnak áramot, és az USB-ről egy Raspberry Pi-n futó hostról kapjuk az áramot. Ebben a helyzetben meg lehet adni egy MCU konfigurációt a "restart_method: rpi_usb" - ez az opció gondoskodik arról, hogy a mikrokontrollert mindig USB tápellátás-visszaállítással állítsák vissza, ami gondoskodik arról, hogy a mikrokontroller és a léptetőmotor-illesztőprogramok együtt álljanak vissza. Ha ezt a mechanizmust használjuk, akkor manuálisan kell konfigurálni a "trigger_phase" konfigurációs szakaszokat (a részleteket lásd [config reference](Config_Reference.md#endstop_phase)).
ru: Можно использовать эту систему с традиционными (нетринамическими) драйверами шаговых двигателей. Однако для этого необходимо убедиться, что драйверы шаговых двигателей сбрасываются каждый раз, когда сбрасывается микроконтроллер. (Если эти два устройства всегда сбрасываются вместе, то Klipper может определить фазу шагового двигателя, отслеживая общее количество шагов, на которое он дал команду шаговому двигателю). В настоящее время единственный способ сделать это надежно - если и микроконтроллер, и драйверы шаговых двигателей питаются исключительно от USB, а питание USB обеспечивается от хоста, работающего на Raspberry Pi. В такой ситуации можно указать в конфигурации mcu параметр "restart_method: rpi_usb" - этот параметр обеспечит сброс микроконтроллера через USB-питание, что позволит сбросить и микроконтроллер, и драйверы шагового двигателя вместе. При использовании этого механизма необходимо вручную настроить секции конфигурации "trigger_phase" (подробности см. в [config reference](Config_Reference.md#endstop_phase)).

source: Endstop phase
da: Endestop fase
hu: Végállás szakasz
ru: Фаза Endstop
