Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Example_Configs.po
Languages: hu, zh_hans

source: This document contains guidelines for contributing an example Klipper configuration to the Klipper github repository (located in the [config directory](../config/)).
hu: Ez a dokumentum a Klipper github tárhoz (a [config könyvtárban](../config/) található) egy Klipper példakonfigurációhoz való hozzájáruláshoz tartalmaz útmutatást.
zh_hans: 本文档包含向 Klipper Github 仓库（位于[config directory](../config/)）贡献 Klipper 配置示例的指南。

source: Note that the [Klipper Community Discourse server](https://community.klipper3d.org) is also a useful resource for finding and sharing config files.
hu: Ne feledd, hogy a [Klipper Community Discourse szerver](https://community.klipper3d.org) szintén hasznos forrás a konfigurációs fájlok kereséséhez és megosztásához.
zh_hans: 请注意 [Klipper Community Discourse server](https://community.klipper3d.org)也是非常有用的寻找和分享配置文件的地方。

source: Guidelines
hu: Irányelvek
zh_hans: 准则

source: The `generic` prefix is used for a 3d printer board that may be used in many different types of printers.
hu: Az `általános` előtagot olyan 3D nyomtató alaplapra használják, amely számos különböző típusú nyomtatóban használható.
zh_hans: `generic`前缀用于3D打印机主板，可用于许多不同类型的打印机。

source: The `kit` prefix is for 3d printers that are assembled according to a widely used specification. These "kit" printers are generally distinct from normal "printers" in that they are not sold by a manufacturer.
hu: A `kit` előtag olyan 3D nyomtatókra vonatkozik, amelyeket egy széles körben használt specifikáció szerint állítanak össze. Ezek a "kit" nyomtatók általában abban különböznek a normál "nyomtatóktól", hogy nem egy gyártó értékesíti őket.
zh_hans: `kit`的前缀是指按照广泛使用的规范组装的3d打印机。这些 "套件 "打印机通常与普通的 "打印机 "不同，因为它们不是由制造商出售的。

source: The `sample` prefix is used for config "snippets" that one may copy-and-paste into the main config file.
hu: A `sample` előtagot a konfigurációs "snippetek" számára használjuk, amelyeket másolva beilleszthetünk a fő konfigurációs fájlba.
zh_hans: `sample`前缀用于配置 "片段"可以被复制到主的配置文件中。

source: The `example` prefix is used to describe printer kinematics. This type of config is typically only added along with code for a new type of printer kinematics.
hu: A `példa` előtag a nyomtató kinematikájának leírására szolgál. Az ilyen típusú konfiguráció jellemzően csak a nyomtató kinematikájának új típusához tartozó kóddal együtt kerül hozzáadásra.
zh_hans: `example`前缀是用来描述打印机运动学。这种类型的配置通常只与新类型的打印机运动学的代码一起添加。

source: Klipper must be able to start `printer`, `generic`, and `kit` example config file without error. These config files should be added to the [test/klippy/printers.test](../test/klippy/printers.test) regression test case. Add new config files to that test case in the appropriate section and in alphabetical order within that section.
hu: A Klippernek hiba nélkül el kell tudnia indítani a `printer`, `generic` és `kit` példa konfigurációs fájlt. Ezeket a konfigurációs fájlokat hozzá kell adni a [test/klippy/printers.test](../test/klippy/printers.test) regressziós tesztesethez. Add hozzá az új konfigurációs fájlokat ehhez a tesztesethez a megfelelő szakaszban és a szakaszon belül ábécé sorrendben.
zh_hans: `printer`, `generic`, 和 `kit` 示例配置文件必须保证 Klipper 能够正常启动而不出错。这些配置文件应该被添加到 [test/klippy/printers.test](../test/klippy/printers.test) 回归测试用例中。将新的配置文件添加到该测试用例的适当部分，并按该部分的字母顺序排列。

source: The example configuration should be for the "stock" configuration of the printer. (There are too many "customized" configurations to track in the main Klipper repository.) Similarly, we only add example config files for printers, kits, and boards that have mainstream popularity (eg, there should be at least a 100 of them in active use). Consider using the [Klipper Community Discourse server](https://community.klipper3d.org) for other configs.
hu: A példakonfigurációnak a nyomtató "stock" konfigurációjára kell vonatkoznia. (Túl sok "testreszabott" konfiguráció van ahhoz, hogy a Klipper fő tárolójában nyomon lehessen követni.) Hasonlóképpen, csak olyan nyomtatók, készletek és kártyák példakonfigurációs fájljait adjuk hozzá, amelyek népszerűek (pl. legalább 100 darabnak kell lennie belőlük aktív használatban). Fontold meg a [Klipper Közösségi Csevegő szerver](https://community.klipper3d.org) használatát más konfigurációkhoz.
zh_hans: 该配置示例应该是打印机的 "stock "配置。(在klipper的仓库中有太多定制的配置。)同样地，我们只为具有主流流行性的打印机、套件和板子添加配置文件的例子（至少应该有100个正在使用中）。考虑使用[Klipper Community Discourse server](https://community.klipper3d.org)进行其他配置。

source: Only specify those devices present on the given printer or board. Do not specify settings specific to your particular setup.For `generic` config files, only those devices on the mainboard should be described. For example, it would not make sense to add a display config section to a "generic" config as there is no way to know if the board will be attached to that type of display. If the board has a specific hardware port to facilitate an optional peripheral (eg, a bltouch port) then one can add a "commented out" config section for the given device.
hu: Csak azokat az eszközöket add meg, amelyek az adott nyomtatón vagy lapon jelen vannak. Ne add meg az adott beállításra jellemző beállításokat. A `generikus` konfigurációs fájlok esetében csak az alaplapon lévő eszközöket kell leírni. Például nem lenne értelme egy "általános" konfigurációhoz kijelző-konfig rész hozzáadásának, mivel nem lehet tudni, hogy a kártyához az adott típusú kijelzőt csatlakoztatják-e. Ha a kártya rendelkezik egy speciális hardverporttal egy opcionális periféria megkönnyítésére (pl. bltouch port), akkor hozzáadhatunk egy "kommentált" config szekciót az adott eszközhöz.
zh_hans: 只指定给定打印机或板卡上的那些设备。对于`generic`配置文件，应该只描述主板上的那些设备。例如，在一个 "generic"的配置文件中添加一个显示配置部分是没有意义的，因为没有办法知道该板是否会连接到那种类型的显示器。如果板子上有一个特定的硬件端口，以方便一个可选的外围设备（bltouch端口），那么可以为给定的设备添加一个 "注释出来 "的配置部分。

source: Do not specify `pressure_advance` in an example config, as that value is specific to the filament, not the printer hardware. Similarly, do not specify `max_extrude_only_velocity` nor `max_extrude_only_accel` settings.
hu: Ne add meg a `pressure_advance` értéket egy példakonfigurációban, mivel ez az érték a szálra, nem pedig a nyomtató hardverére jellemző. Hasonlóképpen ne adj meg `max_extrude_only_velocity` és `max_extrude_only_accel` beállításokat.
zh_hans: 不要在配置示例中指定`pressure_advance`，因为该值是针对耗材的，而不是打印机硬件。同样，不要指定`max_extrude_only_velocity`或`max_extrude_only_accel`设置。

source: Do not specify a config section containing a host path or host hardware. For example, do not specify `[virtual_sdcard]` nor `[temperature_host]` config sections.
hu: Ne adj meg olyan konfigurációs részt, amely állomás elérési útvonalat vagy állomáshardvert tartalmaz. Például ne adj meg `[virtual_sdcard]` és `[temperature_host]` konfigurációs szakaszokat.
zh_hans: 不要指定一个包含主机路径或主机硬件的配置部分。例如，不要指定`[virtual_sdcard]`或`[temperature_host]`配置部分。

source: Only define macros that utilize functionality specific to the given printer or to define g-codes that are commonly emitted by slicers configured for the given printer.
hu: Csak olyan makrókat definiáljon, amelyek az adott nyomtatóra jellemző funkciókat használják, vagy olyan g-kódokat definiáljon, amelyeket az adott nyomtatóhoz konfigurált szeletelők általában kiadnak.
zh_hans: 只为利用特定打印机功能，或特定打印机配置的切片软件通常发出的G代码定义宏。

source: Where possible, it is best to use the same wording, phrasing, indentation, and section ordering as the existing config files.The top of each config file should list the type of micro-controller the user should select during "make menuconfig". It should also have a reference to "docs/Config_Reference.md".
hu: Ahol lehetséges, a legjobb, ha ugyanazt a szövegrendezést, megfogalmazást, behúzást és szakaszok sorrendjét használjuk, mint a meglévő konfigurációs fájlok. Minden konfigurációs fájl tetején fel kell sorolni a mikrokontroller típusát, amelyet a felhasználónak a "make menuconfig" során ki kell választania. A fájlnak tartalmaznia kell egy hivatkozást a "docs/Config_Reference.md" fájlra.
zh_hans: 在可能的情况下，最好使用与现有配置文件相同的措辞、短语、缩进和章节顺序。每个配置文件的顶部应该列出用户在 "make menuconfig "时应该选择的微控制器的类型。它还应该有一个对 "docs/Config_Reference.md "的引用。

source: Do not copy the field documentation into the example config files. (Doing so creates a maintenance burden as an update to the documentation would then require changing it in many places.)
hu: Ne másold be a mező dokumentációját a példakonfigurációs fájlokba. (Ez karbantartási terhet jelent, mivel a dokumentáció frissítése sok helyen változtatást igényelne.)
zh_hans: 不要将字段文档复制到示例配置文件中。（这样做会造成维护方面的负担，因为对文档的更新需要在很多地方进行修改。）

source: Example config files should not contain a "SAVE_CONFIG" section. If necessary, copy the relevant fields from the SAVE_CONFIG section to the appropriate section in the main config area.
hu: A példa konfigurációs fájlok nem tartalmazhatnak "SAVE_CONFIG" részt. Ha szükséges, másold át a SAVE_CONFIG szakaszból a megfelelő mezőket a fő konfigurációs terület megfelelő szakaszába.
zh_hans: 配置文件的例子不应包含 "SAVE_CONFIG "部分。如果有必要，把SAVE_CONFIG部分的相关字段复制到主配置区的适当部分。

source: Use `field: value` syntax instead of `field=value`.
hu: Használd a `field: value` szintaxist a `field=value` helyett.
zh_hans: 使用`field: value`的语法，而不要使用`field=value`。

source: Avoid defining field values that are set to their default value. For example, one should not specify `min_extrude_temp: 170` as that is already the default value.
hu: Kerülje az alapértelmezett értékre beállított mezőértékek meghatározását. Például nem szabad megadni `min_extrude_temp: 170`, mivel ez már az alapértelmezett érték.
zh_hans: 避免定义那些被设置为默认值的字段值。例如，不应该指定`min_extrude_temp: 170`，因为这已经是默认值。

source: Where possible, lines should not exceed 80 columns.
hu: Ahol lehetséges, a sorok száma nem haladhatja meg a 80 oszlopot.
zh_hans: 在可能的情况下，行数不应超过80列。

source: Avoid adding attribution or revision messages to the config files. (For example, avoid adding lines like "this file was created by ...".) Place attribution and change history in the git commit message.
hu: Kerülje el az attribúciós vagy revíziós üzenetek hozzáadását a konfigurációs fájlokhoz. (Például kerülje az olyan sorok hozzáadását, mint a "this file was created by ..."). Helyezd el az attribúciót és a változtatási előzményeket a git commit üzenetben.
zh_hans: 避免在配置文件中添加归属或修订信息。例如，避免添加类似 "此文件由......创建 "的行。）将归属和修改历史放在git提交信息中。

source: Do not disable a default safety system in an example config file. For example, a config should not specify a custom `max_extrude_cross_section`. Do not enable debugging features. For example there should not be a `force_move` config section.
hu: Ne tiltson le egy alapértelmezett biztonsági rendszert egy példakonfig-fájlban. Például egy konfiguráció nem adhat meg egy egyéni `max_extrude_cross_section` értéket. Ne engedélyezd a hibakeresési funkciókat. Például ne legyen `force_move` config szakasz.
zh_hans: 不要在示例配置文件中禁用默认安全系统。例如，一个配置不应该指定一个自定义的 `max_extrude_cross_section`。不要启用调试功能。例如，不应该有一个 `force_move` 配置部分。

source: Example config files are submitted by creating a github "pull request". Please also follow the directions in the [contributing document](CONTRIBUTING.md).
hu: A példa konfigurációs fájlok elküldése egy github "pull request" létrehozásával történik. Kérjük, kövesse a [közreműködő dokumentum](CONTRIBUTING.md) utasításait is.
zh_hans: 通过创建github "pull request "来提交配置文件示例。也请遵循[contribution document](CONTRIBUTING.md)中的指示。

source: The `printer` prefix is used for stock printers sold by a mainstream manufacturer.
hu: A `printer` előtagot az általános gyártó által értékesített nyomtatókra használják.
zh_hans: `printer`前缀用于主流制造商出售的打印机。

source: Example configurations
hu: Példa konfigurációk

source: Select the appropriate config filename prefix:
hu: Válaszd ki a megfelelő konfigurációs fájlnév előtagot:

source: All configuration files must end in a `.cfg` suffix. The `printer` config files must end in a year followed by `.cfg` (eg, `-2019.cfg`). In this case, the year is an approximate year the given printer was sold.
hu: Minden konfigurációs fájlnak `.cfg` végződéssel kell végződnie. A `printer` konfigurációs fájloknak egy évszámmal kell végződniük, amelyet a `.cfg` végződés követ (pl. `-2019.cfg`). Ebben az esetben az évszám az adott nyomtató eladásának hozzávetőleges éve.

source: Do not use spaces or special characters in the config filename. The filename should contain only characters `A-Z`, `a-z`, `0-9`, `-`, and `.`.
hu: Ne használj szóközöket vagy speciális karaktereket a konfigurációs fájlnévben. A fájlnév csak a `A-Z`, `a-z`, `0-9`, `-` és ` karaktereket tartalmazhatja.`.

source: Do not use any deprecated features in the example config file.
hu: Ne használj semmilyen elavult funkciót a példakonfigurációs fájlban.

source: When adding an extruder `rotation_distance` it is preferable to specify a `gear_ratio` if the extruder has a gearing mechanism. We expect the rotation_distance in the example configs to correlate with the circumference of the hobbed gear in the extruder - it is normally in the range of 20 to 35mm. When specifying a `gear_ratio` it is preferable to specify the actual gears on the mechanism (eg, prefer `gear_ratio: 80:20` over `gear_ratio: 4:1`). See the [rotation distance document](Rotation_Distance.md#using-a-gear_ratio) for more information.
hu: Extruder `rotation_distance` hozzáadásakor célszerű megadni a `gear_ratio` értéket, ha az extruder fogaskerékkel rendelkezik. A példakonfigurációkban szereplő rotation_distance értéktől azt várjuk, hogy korreláljon az extruderben lévő fogaskerék kerületével. Ez általában 20 és 35 mm közötti tartományban van. A `gear_ratio` megadásakor előnyösebb a mechanizmuson lévő tényleges fogaskerekek fogszámának megadása (pl. inkább `gear_ratio: 80:20`, mint `gear_ratio: 4:1`). További információkért lásd a [forgatási távolság dokumentumot](Rotation_Distance.md#using-a-gear_ratio).

source: All known boards that Klipper supports can use the default serial baud rate of 250000. Do not recommend a different baud rate in an example config file.
hu: A Klipper által támogatott összes ismert kártya az alapértelmezett 250000-es soros adatátvitelt tudja használni. Ne javasoljon eltérő adatátvitel beállítását egy példa konfigurációs fájlban.

source: Use the appropriate filename suffix. The `printer` config files must end in a year followed by `.cfg` (eg, `-2019.cfg`). In this case, the year is an approximate year the given printer was sold. All example configuration files must end in `.cfg`.
zh_hans: 使用适当的文件名后缀。`printer`配置文件必须以年份结尾，后面是`.cfg`（例如，`-2019.cfg`）。在这种情况下，年份是给定打印机出售的大致年份。所有实例配置文件必须以`.cfg`结尾。

source: When adding an extruder `rotation_distance` it is preferable to specify a `gear_ratio` if the extruder has a gearing mechanism. We expect the rotation_distance in the example configs to correlate with the circumference of the hobbed gear in the extruder - it is normally in the range of 20 to 35mm. When specifying a `gear_ratio` it is preferable to specify the actual gears on the mechanism (eg, prefer `gear_ratio: 80:20` over `gear_ratio: 4:1`).
zh_hans: 当添加一个挤出机的`rotation_distance`时，如果挤出机有一个齿轮机构，最好是指定一个`rotation_distance`。我们希望示例配置中的旋转距离与挤出机中滚齿的周长相关--它通常在20到35毫米之间。当指定`gear_ratio`时，最好是指定机构上的实际齿轮（例如，最好是`gear_ratio: 80:20`而不是`gear_ratio: 4:1`）。

source: Do not use any deprecated features in the example config file. The `step_distance` and `pin_map` parameters are deprecated and should not be in any example config file.
zh_hans: 不要在示例配置文件中使用任何已废弃的功能。`step_distance`和`pin_map`参数已被废弃，不应出现在任何实例配置文件中。

source: Select the appropriate config filename prefix.
zh_hans: 选择适当的配置文件名前缀。
