Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Exclude_Object.po
Languages: hu, it

source: Exclude Objects
hu: Objektumok kizárása
it: Escludi oggetti

source: The `[exclude_object]` module allows Klipper to exclude objects while a print is in progress. To enable this feature include an [exclude_object config section](Config_Reference.md#exclude_object) (also see the [command reference](G-Codes.md#exclude-object) and [sample-macros.cfg](../config/sample-macros.cfg) file for a Marlin/RepRapFirmware compatible M486 G-Code macro.)
hu: Az `[exclude_object]` modul lehetővé teszi, hogy a Klipper kizárja az objektumokat a nyomtatás közben. Ennek a funkciónak az engedélyezéséhez adjon egy [exclude_object konfigurációs szakaszt](Config_Reference.md#exclude_object) (lásd még a [parancs hivatkozást](G-Codes.md#exclude-object) és [sample-macros.cfg](../config/sample-macros.cfg) fájlt egy Marlin/RepRapFirmware kompatibilis M486 G-kód makróhoz.)
it: Il modulo`[exclude_object]` consente a Klipper di escludere oggetti mentre è in corso una stampa. Per abilitare questa funzione, includere una [exclude_object config section](Config_Reference.md#exclude_object) (consulta anche il [command reference](G-Codes.md#exclude-object) e [sample-macros.cfg](../config/sample-macros.cfg) per una macro M486 G-Code compatibile con firmware Marlin/RepRap.)

source: Unlike other 3D printer firmware options, a printer running Klipper utilizes a suite of components and users have many options to choose from. Therefore, in order to provide a a consistent user experience, the `[exclude_object]` module will establish a contract or API of sorts. The contract covers the contents of the gcode file, how the internal state of the module is controlled, and how that state is provided to clients.
hu: Más 3D nyomtatók firmware opcióitól eltérően a Klippert futtató nyomtató komponenscsomagot használ, és a felhasználók számos lehetőség közül választhatnak. Ezért az egységes felhasználói élmény biztosítása érdekében az `[exclude_object]` modul egyfajta szerződést vagy API-t hoz létre. A szerződés tartalmazza a gcode fájl tartalmát, a modul belső állapotának vezérlését, és azt, hogy ez az állapot hogyan kerül a kliensek rendelkezésre bocsátásra.
it: A differenza di altre opzioni del firmware della stampante 3D, una stampante che esegue Klipper utilizza una suite di componenti e gli utenti hanno molte opzioni tra cui scegliere. Pertanto, al fine di fornire un'esperienza utente coerente, il modulo `[exclude_object]` stabilirà un contratto o una sorta di API. Il contratto copre il contenuto del file gcode, come viene controllato lo stato interno del modulo e come tale stato viene fornito ai client.

source: Workflow Overview
hu: Munkafolyamat áttekintése
it: Panoramica del flusso di lavoro

source: A typical workflow for printing a file might look like this:
hu: Egy tipikus munkafolyamat egy fájl nyomtatásához így nézhet ki:
it: Un tipico flusso di lavoro per la stampa di un file potrebbe essere simile a:

source: Slicing is completed and the file is uploaded for printing. During the upload, the file is processed and `[exclude_object]` markers are added to the file. Alternately, slicers may be configured to prepare object exclusion markers natively, or in it's own pre-processing step.
hu: A szeletelés befejeződik, és a fájl feltöltésre kerül nyomtatásra. A feltöltés során a fájl feldolgozása megtörténik, és `[exclude_object]` jelölések kerülnek a fájlhoz. A szeletelőket úgy is be lehet állítani, hogy az objektumkizáró jelöléseket natívan vagy saját előfeldolgozási lépésben készítsék el.
it: Lo slicing è completato e il file viene caricato per la stampa. Durante il caricamento, il file viene elaborato e gli indicatori `[exclude_object]` vengono aggiunti al file. In alternativa, i filtri dei dati possono essere configurati per preparare i marcatori di esclusione degli oggetti in modo nativo o nella propria fase di pre-elaborazione.

source: When printing starts, Klipper will reset the `[exclude_object]` [status](Status_Reference.md#exclude_object).
hu: A nyomtatás megkezdésekor a Klipper visszaállítja az `[exclude_object]` [státuszt](Status_Reference.md#exclude_object).
it: All'avvio della stampa, Klipper ripristinerà `[exclude_object]` [status](Status_Reference.md#exclude_object).

source: When Klipper processes the `EXCLUDE_OBJECT_DEFINE` block, it will update the status with the known objects and pass it on to clients.
hu: Amikor a Klipper feldolgozza az `EXCLUDE_OBJECT_DEFINE` blokkot, frissíti a státuszt az ismert objektumokkal, és továbbítja azt az ügyfeleknek.
it: Quando Klipper elabora il blocco `EXCLUDE_OBJECT_DEFINE`, aggiornerà lo stato con gli oggetti conosciuti e lo passerà ai client.

source: The client may use that information to present a UI to the user so that progress can be tracked. Klipper will update the status to include the currently printing object which the client can use for display purposes.
hu: Az ügyfél felhasználhatja ezeket az információkat arra, hogy egy felhasználói felületet jelenítsen meg a felhasználónak, hogy nyomon követhesse az előrehaladást. A Klipper frissíti az állapotot, hogy tartalmazza az aktuálisan nyomtatott objektumot, amelyet az ügyfél megjelenítési célokra használhat.
it: Il client può utilizzare tali informazioni per presentare un'interfaccia all'utente in modo che sia possibile tenere traccia dei progressi. Klipper aggiornerà lo stato per includere l'oggetto attualmente in stampa che il client può utilizzare per scopi di visualizzazione.

source: If the user requests that an object be cancelled, the client will issue an `EXCLUDE_OBJECT NAME=<name>` command to Klipper.
hu: Ha a felhasználó egy objektum törlését kéri, a kliens egy `EXCLUDE_OBJECT NAME=<name>` parancsot ad a Klippernek.
it: Se l'utente richiede la cancellazione di un oggetto, il client invierà un comando `EXCLUDE_OBJECT NAME=<nome>` a Klipper.

source: When Klipper process the command, it will add the object to the list of excluded objects and update the status for the client.
hu: Amikor a Klipper feldolgozza a parancsot, hozzáadja az objektumot a kizárt objektumok listájához, és frissíti állapotát az ügyfél felé.
it: Quando Klipper elabora il comando, aggiungerà l'oggetto all'elenco degli oggetti esclusi e aggiornerà lo stato per i client.

source: The client will receive the updated status from Klipper and can use that information to reflect the object's status in the UI.
hu: Az ügyfél megkapja a Klipper frissített állapotát, és ezt az információt felhasználhatja az objektum állapotának megjelenítéséhez a felhasználói felületen.
it: Il client riceverà lo stato aggiornato da Klipper e potrà utilizzare tali informazioni per aggiornare lo stato dell'oggetto nell'interfaccia utente.

source: When printing finishes, the `[exclude_object]` status will continue to be available until another action resets it.
hu: A nyomtatás befejezésekor az `[exclude_object]` állapot továbbra is elérhető marad, amíg egy másik művelet vissza nem állítja.
it: Al termine della stampa, lo stato `[exclude_object]` continuerà a essere disponibile fino a quando un'altra azione non lo reimposta.

source: The GCode File
hu: A GCode fájl
it: Il file GCode

source: The specialized gcode processing needed to support excluding objects does not fit into Klipper's core design goals. Therefore, this module requires that the file is processed before being sent to Klipper for printing. Using a post-process script in the slicer or having middleware process the file on upload are two possibilities for preparing the file for Klipper. A reference post-processing script is available both as an executable and a python library, see [cancelobject-preprocessor](https://github.com/kageurufu/cancelobject-preprocessor).
hu: Az objektumok kizárásához szükséges speciális G-kód feldolgozás nem illeszkedik a Klipper alapvető tervezési céljaihoz. Ezért ez a modul megköveteli a fájl feldolgozását, mielőtt a Klippernek nyomtatásra elküldi. A fájl Klipper számára történő előkészítésére két lehetőség egy utófeldolgozó szkript használata a szeletelőben, vagy a fájl feltöltéskor történő feldolgozása a middleware segítségével. Egy referencia utófeldolgozó szkript elérhető futtatható és python könyvtárként is, lásd [az objektum előfeldolgozó törlése](https://github.com/kageurufu/cancelobject-preprocessor).
it: L'elaborazione specializzata del gcode necessaria per supportare l'esclusione di oggetti non rientra negli obiettivi di progettazione principali di Klipper. Pertanto, questo modulo richiede che il file venga elaborato prima di essere inviato a Klipper per la stampa. L'utilizzo di uno script di post-elaborazione nello slicer o il middleware che elabora il file durante il caricamento sono due possibilità per preparare il file per Klipper. Uno script di post-elaborazione di riferimento è disponibile sia come eseguibile che come libreria Python, vedere [cancelobject-preprocessor](https://github.com/kageurufu/cancelobject-preprocessor).

source: Object Definitions
hu: Objektum meghatározások
it: Definizioni di oggetti

source: The `EXCLUDE_OBJECT_DEFINE` command is used to provide a summary of each object in the gcode file to be printed. Provides a summary of an object in the file. Objects don't need to be defined in order to be referenced by other commands. The primary purpose of this command is to provide information to the UI without needing to parse the entire gcode file.
hu: Az `EXCLUDE_OBJECT_DEFINE` parancsot arra használjuk, hogy a G-kód fájlban lévő minden egyes objektumról összefoglalót adjunk a nyomtatáshoz. A fájlban lévő objektumok összefoglalóját adja meg. Az objektumokat nem kell definiálni ahhoz, hogy más parancsok hivatkozhassanak rájuk. Ennek a parancsnak az elsődleges célja, hogy információt szolgáltasson a felhasználói felületnek anélkül, hogy a teljes G-kód fájlt elemeznie kellene.
it: Il comando `EXCLUDE_OBJECT_DEFINE` viene utilizzato per fornire un riepilogo di ogni oggetto nel file gcode da stampare. Fornisce un riepilogo di un oggetto nel file. Gli oggetti non hanno bisogno di essere definiti per essere referenziati da altri comandi. Lo scopo principale di questo comando è fornire informazioni all'interfaccia utente senza dover analizzare l'intero file gcode.

source: Object definitions are named, to allow users to easily select an object to be excluded, and additional metadata may be provided to allow for graphical cancellation displays. Currently defined metadata includes a `CENTER` X,Y coordinate, and a `POLYGON` list of X,Y points representing a minimal outline of the object. This could be a simple bounding box, or a complicated hull for showing more detailed visualizations of the printed objects. Especially when gcode files include multiple parts with overlapping bounding regions, center points become hard to visually distinguish. `POLYGONS` must be a json-compatible array of point `[X,Y]` tuples without whitespace. Additional parameters will be saved as strings in the object definition and provided in status updates.
hu: Az objektumdefiníciókat elnevezik, hogy a felhasználók könnyen kiválaszthassák a kizárandó objektumot, és további metaadatokat is megadhatnak a grafikus törlésmegjelenítéshez. A jelenleg definiált metaadatok közé tartozik egy `CENTER` X,Y koordináta, valamint egy `POLYGON` X,Y pontok listája, amely az objektum minimális körvonalát ábrázolja. Ez lehet egy egyszerű határoló doboz, vagy egy bonyolult burkolat a nyomtatott objektumok részletesebb megjelenítéséhez. Különösen akkor, ha a G-kód fájlok több, egymást átfedő határoló régiókkal rendelkező alkatrészt tartalmaznak, a középpontok vizuálisan nehezen megkülönböztethetők. `POLYGONS` pontokból álló json-kompatibilis tömbnek kell lennie `[X,Y]` szóközök nélkül. A további paraméterek karakterláncokként kerülnek elmentésre az objektumdefinícióban, és állapotfrissítésekben lesznek megadva.
it: Le definizioni degli oggetti sono denominate per consentire agli utenti di selezionare facilmente un oggetto da escludere e possono essere forniti metadati aggiuntivi per consentire la visualizzazione grafica dell'annullamento. I metadati attualmente definiti includono una coordinata X,Y "CENTRO" e un elenco "POLYGON" di punti X,Y che rappresentano un contorno minimo dell'oggetto. Potrebbe trattarsi di un semplice riquadro di delimitazione o di uno guscio complicato per mostrare visualizzazioni più dettagliate degli oggetti stampati. Soprattutto quando i file gcode includono più parti con regioni di delimitazione sovrapposte, i punti centrali diventano difficili da distinguere visivamente. `POLYGONS` deve essere un array compatibile con json di tuple punto `[X,Y]` senza spazi. Ulteriori parametri verranno salvati come stringhe nella definizione dell'oggetto e forniti negli aggiornamenti di stato.

source: All available G-Code commands are documented in the [G-Code Reference](./G-Codes.md#excludeobject)
hu: Az összes elérhető G-kód parancsot dokumentálja a [G-kód referencia](./G-Codes.md#excludeobject)
it: Tutti i comandi G-Code disponibili sono documentati in [G-Code Reference](./G-Codes.md#excludeobject)

source: Status Information
hu: Állapotinformáció
it: Informazioni sullo stato

source: The state of this module is provided to clients by the [exclude_object status](Status_Reference.md#exclude_object).
hu: A modul állapotát az [exclude_object státusz](Status_Reference.md#exclude_object) biztosítja az ügyfelek számára.
it: Lo stato di questo modulo è fornito ai client da [exclude_object status](Status_Reference.md#exclude_object).

source: The status is reset when:
hu: Az állapot visszaáll, amikor:
it: Lo stato viene ripristinato quando:

source: The Klipper firmware is restarted.
hu: A Klipper firmware újraindul.
it: Il firmware di Klipper viene riavviato.

source: There is a reset of the `[virtual_sdcard]`. Notably, this is reset by Klipper at the start of a print.
hu: A `[virtual_sdcard]` visszaállítása megtörtént. Figyelemre méltó, hogy ezt a Klipper a nyomtatás kezdetén visszaállítja.
it: C'è un reset della `[virtual_sdcard]`. In particolare, questo viene ripristinato da Klipper all'inizio di una stampa.

source: When an `EXCLUDE_OBJECT_DEFINE RESET=1` command is issued.
hu: Amikor egy `EXCLUDE_OBJECT_DEFINE RESET=1` parancsot adunk ki.
it: Quando viene emesso un comando `EXCLUDE_OBJECT_DEFINE RESET=1`.

source: The list of defined objects is represented in the `exclude_object.objects` status field. In a well defined gcode file, this will be done with `EXCLUDE_OBJECT_DEFINE` commands at the beginning of the file. This will provide clients with object names and coordinates so the UI can provide a graphical representation of the objects if desired.
hu: A meghatározott objektumok listája az `exclude_object.objects` állapotmezőben jelenik meg. Egy jól definiált G-kód fájlban ez a fájl elején található `EXCLUDE_OBJECT_DEFINE` parancsokkal történik. Ez biztosítja a kliensek számára az objektumok nevét és koordinátáit, így a felhasználói felület kívánság szerint grafikusan is megjelenítheti az objektumokat.
it: L'elenco degli oggetti definiti è rappresentato nel campo di stato `exclude_object.objects`. In un file gcode ben definito, questo sarà fatto con i comandi `EXCLUDE_OBJECT_DEFINE` all'inizio del file. Ciò fornirà ai client i nomi e le coordinate degli oggetti in modo che l'interfaccia utente possa fornire una rappresentazione grafica degli oggetti, se lo si desidera.

source: As the print progresses, the `exclude_object.current_object` status field will be updated as Klipper processes `EXCLUDE_OBJECT_START` and `EXCLUDE_OBJECT_END` commands. The `current_object` field will be set even if the object has been excluded. Undefined objects marked with a `EXCLUDE_OBJECT_START` will be added to the known objects to assist in UI hinting, without any additional metadata.
hu: A nyomtatás előrehaladtával az `exclude_object.current_object` állapotmező frissül, ahogy a Klipper feldolgozza az `EXCLUDE_OBJECT_START` és `EXCLUDE_OBJECT_END` parancsokat. A `current_object` mező akkor is be lesz állítva, ha az objektumot kizárták. Az `EXCLUDE_OBJECT_START` mezővel jelölt nem definiált objektumok hozzá lesznek adva az ismert objektumokhoz, hogy segítsék a felhasználói felületre való utalásukat, minden további metaadat nélkül.
it: Man mano che la stampa procede, il campo di stato `exclude_object.current_object` verrà aggiornato mentre Klipper elabora i comandi `EXCLUDE_OBJECT_START` e `EXCLUDE_OBJECT_END`. Il campo `oggetto_corrente` sarà impostato anche se l'oggetto è stato escluso. Gli oggetti non definiti contrassegnati con un `EXCLUDE_OBJECT_START` verranno aggiunti agli oggetti conosciuti per facilitare i suggerimenti dell'interfaccia utente, senza metadati aggiuntivi.

source: As `EXCLUDE_OBJECT` commands are issued, the list of excluded objects is provided in the `exclude_object.excluded_objects` array. Since Klipper looks ahead to process upcoming gcode, there may be a delay between when the command is issued and when the status is updated.
hu: Az `EXCLUDE_OBJECT` parancsok kiadásakor a kizárt objektumok listáját az `exclude_object.excluded_objects` tömb tartalmazza. Mivel a Klipper előre tekint, hogy feldolgozza a közelgő G-kódot, a parancs kiadása és az állapot frissítése között késés lehet.
it: Quando vengono emessi i comandi `EXCLUDE_OBJECT`, l'elenco degli oggetti esclusi viene fornito nell'array `exclude_object.excluded_objects`. Poiché Klipper guarda avanti per elaborare il prossimo gcode, potrebbe esserci un ritardo tra l'emissione del comando e l'aggiornamento dello stato.
