Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/FAQ.po
Languages: fr, hu, it, ko, zh_hant

source: The workaround is to use a restart_method other than "command" or to flash an updated bootloader to the AVR device. Flashing a new bootloader is a one time step that typically requires an external programmer - see [Bootloaders](Bootloaders.md) for further details.
fr: La solution est d'utiliser un restart_method autre que "command" ou de flasher un bootloader récent sur le dispositif AVR. Le flashage d'un nouveau bootloader est une étape particulière qui nécessite généralement un programmateur externe - voir [Bootloaders](Bootloaders.md) pour plus de détails.
hu: A megoldás a "command" -tól eltérő restart_method használata, vagy egy frissített bootloader égetése az AVR eszközre. Egy új bootloader égetése egy egyszeri lépés, amelyhez általában külső programozóra van szükség - további részletekért lásd [Bootloaderek](Bootloaders.md) dokumentumot.
it: La soluzione alternativa è utilizzare un restart_method diverso da "command" o eseguire il flashing di un bootloader aggiornato sul dispositivo AVR. Il flashing di un nuovo bootloader è un passaggio che in genere richiede un programmatore esterno: vedere [Bootloaders](Bootloaders.md) per ulteriori dettagli.
ko: 해결 방법은 "command" 이외의 restart_method를 사용하거나 업데이트된 부트로더를 AVR 장치에 플래시하는 것입니다. 새 부트로더를 플래싱하는 것은 일반적으로 외부 프로그래머가 필요한 일회성 단계입니다. 자세한 내용은 [Bootloaders](Bootloaders.md)를 참조하십시오.
zh_hant: 解決辦法是使用 "command "以外的重啟方法，或者在AVR裝置上刷寫一個新的載入程式。刷寫一個新的載入程式是一個一次性的步驟，通常需要一個外部程式設計器--更多細節請參見[Bootloaders](Bootloaders.md)。

source: Will the heaters be left on if the Raspberry Pi crashes?
fr: Est-ce que les éléments chauffants restent allumés si le Raspberry Pi plante?
hu: A fűtőelemek bekapcsolva maradnak, ha a Raspberry Pi összeomlik?
it: I riscaldatori verranno lasciati accesi se il Raspberry Pi si arresta in modo anomalo?
ko: Raspberry Pi가 비정상 종료하면 히터가 켜져 있습니까?
zh_hant: 如果 Raspberry Pi 崩潰了，加熱器會一直加熱嗎？

source: The software has been designed to prevent that. Once the host enables a heater, the host software needs to confirm that enablement every 5 seconds. If the micro-controller does not receive a confirmation every 5 seconds it goes into a "shutdown" state which is designed to turn off all heaters and stepper motors.
fr: Le logiciel a été conçu pour éviter cela. Une fois que l'hôte a activé un élément chauffant, le logiciel hôte doit confirmer cette activation toutes les 5 secondes. Si le microcontrôleur ne reçoit pas de confirmation toutes les 5 secondes, il passe dans un status "arrêté" conçu pour éteindre tous les éléments chauffants et les moteurs pas à pas.
hu: A szoftvert úgy tervezték, hogy ezt megakadályozza. Ha a gazdagép egyszer engedélyezi a fűtőberendezést, a szoftverének 5 másodpercenként meg kell erősítenie az engedélyezést. Ha a mikrokontroller nem kap 5 másodpercenként megerősítést, akkor "leállítás" állapotba kerül, amelynek célja, hogy kikapcsolja az összes fűtőberendezést és léptetőmotort.
it: Il software è stato progettato per impedirlo. Una volta che l'host abilita un riscaldatore, il software host deve confermare tale abilitazione ogni 5 secondi. Se il microcontrollore non riceve una conferma ogni 5 secondi, entra in uno stato di "spegnimento" progettato per spegnere tutti i riscaldatori e i motori passo-passo.
ko: 호스트 소프트웨어는 이를 방지하도록 설계되었습니다. 호스트가 히터를 활성화하면 소프트웨어는 5초마다 활성화를 확인해야 합니다. 마이크로 컨트롤러가 5초마다 확인 메시지를 받지 못하면 모든 히터와 스테퍼 모터를 끄도록 설계된 "종료" 상태가 됩니다.
zh_hant: Klipper 的設計防止了這種情況。一旦主機啟用了一個加熱器，主機軟體需要每 5 秒鐘確認一次啟用狀態。如果微控制器沒有收到每 5 秒的確認，它就會進入"關閉"狀態，該狀態會關閉所有加熱器和步進電機。

source: See the "config_digital_out" command in the [MCU commands](MCU_Commands.md) document for further details.
fr: Voir la commande "config_digital_out" dans le documentation des [commandes MCU](MCU_Commands.md) pour plus de détails.
hu: További részletekért lásd az [MCU-parancsok](MCU_Commands.md) dokumentumban található "config_digital_out" parancsot.
it: Per ulteriori dettagli, vedere il comando "config_digital_out" nel documento [Comandi MCU](MCU_Commands.md).
ko: 자세한 내용은 [MCU commands](MCU_Commands.md)의 "config_digital_out" 명령을 참조하십시오.
zh_hant: 詳情請見[MCU 命令](MCU_Commands.md)文件中的 "config_digital_out" 命令。

source: In addition, the micro-controller software is configured with a minimum and maximum temperature range for each heater at startup (see the min_temp and max_temp parameters in the [config reference](Config_Reference.md#extruder) for details). If the micro-controller detects that the temperature is outside of that range then it will also enter a "shutdown" state.
fr: En outre, le logiciel du microcontrôleur est configuré avec une plage de température minimale et maximale pour chaque élément chauffant au démarrage (voir les paramètres min_temp et max_temp dans le document de [références des configurations](Config_Reference.md#extruder) pour plus de détails). Si le microcontrôleur détecte que la température est en dehors de cette plage, il passe également au status "arrêté".
hu: Ezenkívül a mikrovezérlő szoftver indításkor minden fűtőberendezéshez be van állítva egy minimális és maximális hőmérséklettartomány (a részletekért lásd a [konfigurációs hivatkozásban](Config_Reference.md#extruder) található min_temp és max_temp paramétereket). Ha a mikrokontroller azt érzékeli, hogy a hőmérséklet e tartományon kívül esik, akkor szintén "leállítás" állapotba lép.
it: Inoltre, il software del microcontrollore è configurato con un intervallo di temperatura minimo e massimo per ciascun riscaldatore all'avvio (consultare i parametri min_temp e max_temp in [config reference](Config_Reference.md#extruder) per i dettagli). Se il microcontrollore rileva che la temperatura è al di fuori di tale intervallo, entrerà anche in uno stato di "spegnimento".
ko: 또한 마이크로 컨트롤러 소프트웨어는 시작 시 각 히터의 최소 및 최대 온도 범위로 제한됩니다 (자세한 내용은 [config reference](Config_Reference.md#extruder)의 min_temp 및 max_temp 매개변수 참조). 마이크로 컨트롤러가 온도가 해당 범위를 벗어난 것을 감지하면 "종료" 상태로 됩니다.
zh_hant: 此外，微控制器軟體在啟動時為每個加熱器配置了最低和最高溫度範圍（詳見[配置參考](Config_Reference.md#extruder)中的min_temp和max_temp參數）。如果微控制器檢測到溫度超出了該範圍，那麼它也將進入 "關機 "狀態。

source: Separately, the host software also implements code to check that heaters and temperature sensors are functioning correctly. See the [config reference](Config_Reference.md#verify_heater) for further details.
fr: Séparément, le logiciel hôte implémente également un code pour vérifier que les éléments chauffants et les capteurs de température fonctionnent correctement. Voir le document de [référence des configurations](Config_Reference.md#verify_heater) pour plus de détails.
hu: A gazdaszoftver külön kódot is tartalmaz a fűtőelemek és a hőmérséklet-érzékelők helyes működésének ellenőrzésére. További részletekért lásd a [konfigurációs hivatkozás](Config_Reference.md#verify_heater) dokumentumot.
it: Separatamente, il software host implementa anche il codice per verificare che i riscaldatori e i sensori di temperatura funzionino correttamente. Vedere il [riferimento di configurazione](Config_Reference.md#verify_heater) per ulteriori dettagli.
ko: 이와 별도로 호스트 소프트웨어는 히터와 온도 센서가 올바르게 작동하는지 확인하는 코드도 구현합니다. 자세한 내용은 [config reference](Config_Reference.md#verify_heater)를 참조하세요.
zh_hant: 另外，主機軟體還實現了檢查加熱器和溫度感測器是否正常工作的程式碼。詳情見[配置參考](Config_Reference.md#verify_heater) 。

source: How do I convert a Marlin pin number to a Klipper pin name?
fr: Comment puis-je convertir des noms broches de Marlin à Klipper?
hu: Hogyan alakíthatok át egy Marlin tű számot Klipper tű névre?
it: Come posso convertire un numero di pin Marlin in un nome pin di Klipper?
ko: Marlin 핀 번호를 Klipper 핀 이름으로 어떻게 변환합니까?
zh_hant: 如何將 Marlin 引腳編號轉換為 Klipper 引腳名稱？

source: Short answer: A mapping is available in the [sample-aliases.cfg](../config/sample-aliases.cfg) file. Use that file as a guide to finding the actual micro-controller pin names. (It is also possible to copy the relevant [board_pins](Config_Reference.md#board_pins) config section into your config file and use the aliases in your config, but it is preferable to translate and use the actual micro-controller pin names.) Note that the sample-aliases.cfg file uses pin names that start with the prefix "ar" instead of "D" (eg, Arduino pin `D23` is Klipper alias `ar23`) and the prefix "analog" instead of "A" (eg, Arduino pin `A14` is Klipper alias `analog14`).
fr: Réponse courte : un mappage est disponible dans le fichier [sample-aliases.cfg](../config/sample-aliases.cfg). Utilisez ce fichier comme guide pour trouver les noms des broches du microcontrôleur. (Il est également possible de copier la section de configuration [board_pins](Config_Reference.md#board_pins) correspondante dans votre fichier de configuration et d'utiliser les alias dans votre configuration, mais il est préférable de traduire et d'utiliser les noms réels des broches du microcontrôleur). Notez que le fichier sample-aliases.cfg utilise des noms de broches qui commencent par le préfixe "ar" au lieu de "D" (par exemple, la broche Arduino `D23` est l'alias Klipper `ar23`) et le préfixe "analog" au lieu de "A" (par exemple, la broche Arduino `A14` est l'alias Klipper `analog14`).
hu: Rövid válasz: [sample-aliases.cfg](../config/sample-aliases.cfg) fájlban található leképezés. Használja ezt a fájlt útmutatóként a tényleges mikrokontroller tű nevek megtalálásához. (Az is lehetséges, hogy a vonatkozó [board_pins](Config_Reference.md#board_pins) config szakaszt átmásolja a config fájljába, és használja az álneveket a configban, de előnyösebb a tényleges mikrokontroller tű nevek lefordítása és használata.) Vegye figyelembe, hogy a sample-aliases.cfg fájl olyan tű neveket használ, amelyek "ar" előtaggal kezdődnek "D" helyett (pl. az Arduino tű `D23` a Klipper álnév `ar23`) és az "analog" helyett "A" (pl. az Arduino tű `A14` a Klipper álnév `analog14`).
it: Risposta breve: una mappatura è disponibile nel file [sample-aliases.cfg](../config/sample-aliases.cfg). Usa quel file come guida per trovare i nomi effettivi dei pin del microcontrollorei. (È anche possibile copiare la relativa sezione di configurazione [board_pins](Config_Reference.md#board_pins) nel file di configurazione e utilizzare gli alias nella configurazione, ma è preferibile tradurre e utilizzare i nomi dei pin del microcontrollore effettivi.) Nota che il file sample-aliases.cfg usa nomi di pin che iniziano con il prefisso "ar" invece di "D" (ad esempio, il pin Arduino `D23` è alias Klipper `ar23`) e il prefisso "analog" invece di "A " (ad esempio, il pin Arduino `A14` è alias di Klipper `analog14`).
ko: 긴 대답: [sample-aliases.cfg](../config/sample-aliases.cfg) 파일에서 매핑을 사용할 수 있습니다. 이 파일을 실제 마이크로 컨트롤러 핀 이름을 찾는 가이드로 사용하십시오. (관련 [board_pins](Config_Reference.md#board_pins) config 섹션을 파일에 복사하고 config의 별칭을 사용할 수도 있지만 실제 마이크로 컨트롤러 핀 이름을 번역하여 사용하는 것이 좋습니다.) sample-aliases.cfg 파일에 유의하십시오. "D" 대신 접두사 "ar"로 시작하는 핀 이름을 사용하고 (예: Arduino 핀 D23은 Klipper 별칭 ar23임) "A" 대신 접두사 "analog"를 사용합니다(예: Arduino 핀 A14는 Klipper 별칭 analog14임).
zh_hant: 簡要回答：在[sample-aliases.cfg](../config/sample-aliases.cfg)檔案中有一個對映。使用該檔案作為指引來尋找實際的微控制器引腳名稱。(也可以將相關的[board_pins](Config_Reference.md#board_pins)配置部分複製到你的配置檔案中，在你的配置中使用別名，但最好是翻譯並使用實際的微控制器引腳名稱。) 請注意，sample-aliases.cfg檔案使用以 "ar "開頭的引腳名稱替換 "D"（例如，Arduino引腳`D23`是Klipper別名`ar23`）和以 "analog "開頭的引腳名稱替換 "A"（例如，Arduino引腳`A14`是Klipper別名`analog14`）。

source: Long answer: Klipper uses the standard pin names defined by the micro-controller. On the Atmega chips these hardware pins have names like `PA4`, `PC7`, or `PD2`.
fr: Réponse longue : Klipper utilise les noms de broches standard définis par le microcontrôleur. Sur les puces Atmega, ces broches matérielles ont des noms tels que `PA4`, `PC7`, ou `PD2`.
hu: Hosszú válasz: Klipper a mikrokontroller által meghatározott szabványos tű neveket használja. Az Atmega chipeken ezek a hardveres tűk olyan neveket viselnek, mint `PA4`, `PC7`, vagy `PD2`.
it: Risposta lunga: Klipper utilizza i nomi dei pin standard definiti dal microcontrollore. Sui chip Atmega questi pin hardware hanno nomi come `PA4`, `PC7` o `PD2`.
ko: 짧은 대답: Klipper는 마이크로 컨트롤러에서 정의한 표준 핀 이름을 사용합니다. Atmega 칩에서 이러한 하드웨어 핀은 PA4, PC7 또는 PD2와 같은 이름을 갖습니다.
zh_hant: 詳細答案：Klipper使用微控制器定義的標準引腳名稱。在 Atmega 晶片上，這些硬體引腳的名稱類似於`PA4`、`PC7`或`PD2`。

source: Long ago, the Arduino project decided to avoid using the standard hardware names in favor of their own pin names based on incrementing numbers - these Arduino names generally look like `D23` or `A14`. This was an unfortunate choice that has lead to a great deal of confusion. In particular the Arduino pin numbers frequently don't translate to the same hardware names. For example, `D21` is `PD0` on one common Arduino board, but is `PC7` on another common Arduino board.
fr: Il y a longtemps, le projet Arduino a décidé d'éviter d'utiliser les noms standards du matériel en faveur de leurs propres noms de broches basés sur des nombres incrémentés - ces noms Arduino ressemblent généralement à `D23` ou `A14`. Il s'agit d'un choix malheureux qui peut prêter à confusion. En particulier parce que les numéros de broches Arduino ne correspondent pas systématiquement aux mêmes noms matériels. Par exemple, `D21` correspond à `PD0` sur certaines cartes Arduino et à `PC7` sur d'autres.
hu: Régen az Arduino projekt úgy döntött, hogy nem használja a szabványos hardverneveket, hanem saját, növekvő számokon alapuló tű neveket használ. Ezek az Arduino nevek általában úgy néznek ki, mint `D23` vagy `A14`. Ez egy szerencsétlen választás volt, amely sok zavart okozott. Különösen az Arduino tű-számok gyakran nem fordítják le ugyanazokat a hardveres neveket. Például a `D21` az `PD0` egy közös Arduino lapon, de `PC7` egy másik közös Arduino lapon.
it: Tempo fa, il progetto Arduino ha deciso di evitare di utilizzare i nomi hardware standard a favore dei propri nomi pin basati su numeri incrementali: questi nomi Arduino generalmente assomigliano a "D23" o "A14". Questa è stata una scelta sfortunata che ha portato a una grande confusione. In particolare, i numeri dei pin di Arduino spesso non si traducono negli stessi nomi hardware. Ad esempio, `D21` è `PD0` su una comune scheda Arduino, ma è `PC7` su un'altra comune scheda Arduino.
ko: 오래 전에 Arduino 프로젝트는 증가하는 숫자를 기반으로 하는 고유한 핀 이름을 위해 표준 하드웨어 이름을 사용하지 않기로 결정했습니다. 이러한 Arduino 이름은 일반적으로 D23 또는 A14처럼 보입니다. 이것은 큰 혼란을 가져온 불행한 선택이었습니다. 특히 Arduino 핀 번호는 종종 동일한 하드웨어 이름으로 변환되지 않습니다. 예를 들어, D21은 어떤 Arduino 보드에서 PD0이지만 다른 Arduino 보드에서는 PC7입니다.
zh_hant: 很久以前，Arduino專案決定避免使用標準的硬體名稱，而採用他們自己的基於遞增數字的引腳名稱--這些Arduino名稱一般看起來像`D23`或`A14`。這是一個不幸的選擇，導致了大量的混亂。特別是Arduino的引腳號碼經常不能轉換為相同的硬體名稱。例如，`D21`在一個常見的Arduino板上是`PD0`，但在另一個常見的Arduino板上是`PC7`。

source: To avoid this confusion, the core Klipper code uses the standard pin names defined by the micro-controller.
fr: Pour éviter cette confusion, le code source de Klipper utilise les noms de broches standard définis par le microcontrôleur.
hu: A zavar elkerülése érdekében a Klipper alapkódja a mikrokontroller által meghatározott szabványos tű neveket használja.
it: Per evitare questa confusione, il codice di base di Klipper utilizza i nomi dei pin standard definiti dal microcontrollore.
ko: 이러한 혼동을 피하기 위해 Klipper 코어 코드는 마이크로 컨트롤러에서 정의한 표준 핀 이름을 사용합니다.
zh_hant: 爲了避免這種混淆，Klipper 核心程式碼使用微控制器定義的標準引腳名稱。

source: Do I have to wire my device to a specific type of micro-controller pin?
fr: Dois-je connecter mon appareil à un type spécifique de broche de microcontrôleur?
hu: Az eszközömet egy adott típusú mikrokontroller tűhöz kell csatlakoztatnom?
it: Devo collegare il mio dispositivo a un tipo specifico di pin del microcontrollore?
ko: 내 장치를 특정 유형의 마이크로 컨트롤러 핀에 연결해야 합니까?
zh_hant: 我必須將裝置連線到特定型別的微控制器引腳嗎？

source: It depends on the type of device and type of pin:
fr: Cela dépend du type d'appareil et du type de broche:
hu: Ez az eszköz típusától és a tű típusától függ:
it: Dipende dal tipo di dispositivo e dal tipo di pin:
ko: 장치 유형 및 핀 유형에 따라 다릅니다:
zh_hant: 這取決於裝置和引腳的型別：

source: ADC pins (or Analog pins): For thermistors and similar "analog" sensors, the device must be wired to an "analog" or "ADC" capable pin on the micro-controller. If you configure Klipper to use a pin that is not analog capable, Klipper will report a "Not a valid ADC pin" error.
fr: Broches ADC (ou broches analogiques) : pour les thermistances et autres capteurs "analogiques", l'élément doit être câblé à une broche "analogique" ou "ADC" du microcontrôleur. Si vous configurez Klipper pour utiliser une broche qui n'est pas capable de fonctionner en analogique, Klipper signalera une erreur "Not a valid ADC pin".
hu: ADC tűk (vagy analóg tűk): Termisztorok és hasonló "analóg" érzékelők esetén az eszközt a mikrokontroller egy "analóg" vagy "ADC" -képes tűjére kell csatlakoztatni. Ha a Klippert olyan tű használatára konfigurálja, amely nem analóg képes, a Klipper egy "Nem érvényes ADC tű" hibát fog jelenteni.
it: Pin ADC (o pin analogici): per termistori e sensori "analogici" simili, il dispositivo deve essere collegato a un pin compatibile con "analogico" o "ADC" sul microcontrollore. Se configuri Klipper per utilizzare un pin che non è compatibile con l'analogico, Klipper segnalerà un errore "Non un pin ADC valido".
ko: ADC 핀(또는 아날로그 핀): 서미스터 및 유사한 "아날로그" 센서의 경우 장치를 마이크로 컨트롤러의 "아날로그" 또는 "ADC" 가능 핀에 연결해야 합니다. 아날로그를 사용할 수 없는 핀을 사용하도록 Klipper를 구성하면 Klipper는 "유효하지 않은 ADC 핀" 오류를 보고합니다.
zh_hant: ADC 引腳（或模擬引腳）：熱敏電阻和類似的「模擬」感測器必須連線到微控制器上具有「模擬」或「ADC」功能的引腳。如果您在 Klipper 上為一個模擬感測器配置為使用不具備模擬功能的引腳，Klipper 將報告「Not a valid ADC pin」錯誤。

source: PWM pins (or Timer pins): Klipper does not use hardware PWM by default for any device. So, in general, one may wire heaters, fans, and similar devices to any general purpose IO pin. However, fans and output_pin devices may be optionally configured to use `hardware_pwm: True`, in which case the micro-controller must support hardware PWM on the pin (otherwise, Klipper will report a "Not a valid PWM pin" error).
fr: Broches PWM (ou broches de timer) : Klipper n'utilise pas de PWM matériel par défaut pour aucun élément. Donc on peut câbler des éléments chauffants, des ventilateurs et des dispositifs similaires à n'importe quelle broche d'E/S d'usage général. Cependant, les ventilateurs et les éléments paramétrés en output_pin peuvent être éventuellement configurés pour utiliser `hardware_pwm : True`, auquel cas le micro-contrôleur doit supporter le PWM matériel sur la broche (sinon, Klipper signalera une erreur "Not a valid PWM pin").
hu: PWM tűk (vagy időzítő tűk): A Klipper alapértelmezés szerint nem használ hardveres PWM-et egyetlen eszköz esetében sem. Tehát általában a fűtőtesteket, ventilátorokat és hasonló eszközöket bármelyik általános célú IO tűre lehet vezetékezni. A ventilátorok és az output_pin eszközök azonban opcionálisan úgy konfigurálhatók, hogy `hardware_pwm: True` értéket használnak, amely esetben a mikrokontrollernek támogatnia kell a hardveres PWM-et a tűn (ellenkező esetben a Klipper egy "Not a valid PWM pin" hibát fog jelezni).
it: Pin PWM (o pin Timer): Klipper non utilizza PWM hardware per impostazione predefinita per nessun dispositivo. Quindi, in generale, è possibile collegare riscaldatori, ventole e dispositivi simili a qualsiasi pin IO generico. Tuttavia, le ventole e i dispositivi output_pin possono essere opzionalmente configurati per utilizzare `hardware_pwm: True`, nel qual caso il microcontrollore deve supportare PWM hardware sul pin (altrimenti, Klipper segnalerà un errore "pin PWM non valido").
ko: PWM 핀(또는 타이머 핀): Klipper는 기본적으로 모든 장치에 대해 하드웨어 PWM을 사용하지 않습니다. 따라서 일반적으로 히터, 팬 및 유사한 장치를 범용 IO 핀에 연결할 수 있습니다. 그러나 팬 및 output_pin 장치는 선택적으로 hardware_pwm: True 를 사용하도록 구성할 수 있습니다. 이 경우 마이크로 컨트롤러는 핀에서 하드웨어 PWM을 지원해야 합니다(그렇지 않으면 Klipper는 "유효한 PWM 핀이 아닙니다" 오류를 보고합니다).
zh_hant: PWM引腳（或定時器引腳）。Klipper預設不在任何裝置上使用硬體PWM。因此，一般來說，可以將熱端、風扇和類似的裝置連線到任何的通用IO引腳。然而，風扇和output_pin裝置可以選擇配置為使用`hardware_pwm: True`，在這種情況下，微控制器在這個引腳上必須支援硬體PWM（否則，Klipper將報告 "不是有效的PWM引腳 "錯誤）。

source: IRQ pins (or Interrupt pins): Klipper does not use hardware interrupts on IO pins, so it is never necessary to wire a device to one of these micro-controller pins.
fr: Broches IRQ (ou broches d'interruption) : Klipper n'utilise pas d'interruptions matérielles sur les broches d'E/S, il n'est donc jamais nécessaire de connecter un périphérique à l'une de ces broches du microcontrôleur.
hu: IRQ-tűk (vagy megszakítási tűk): A Klipper nem használ hardveres megszakításokat az IO tűkön, ezért soha nem szükséges egy eszközt ezen mikrokontroller tűk egyikére vezetni.
it: Pin IRQ (o pin di interrupt): Klipper non utilizza gli interrupt hardware sui pin IO, quindi non è mai necessario collegare un dispositivo a uno di questi pin del microcontrollore.
ko: IRQ 핀(또는 인터럽트 핀): Klipper는 IO 핀에서 하드웨어 인터럽트를 사용하지 않으므로 장치를 이러한 마이크로 컨트롤러 핀 중 하나에 연결할 필요가 없습니다.
zh_hant: IRQ引腳（或中斷引腳）。Klipper不使用IO引腳上的硬體中斷，所以沒有必要將裝置連線到這些微控制器引腳上。

source: SPI pins: When using hardware SPI it is necessary to wire the pins to the micro-controller's SPI capable pins. However, most devices can be configured to use "software SPI", in which case any general purpose IO pins may be used.
fr: Broches SPI : Lors de l'utilisation du SPI matériel, il est nécessaire de connecter l’élément aux broches SPI du micro-contrôleur. Toutefois, la plupart des éléments peuvent être configurés pour utiliser le "SPI logiciel", auquel cas n'importe quelle broche d'E/S d'usage général peut être utilisée.
hu: SPI-tűk: A hardveres SPI használatakor a tűket a mikrokontroller SPI-képes tűihez kell csatlakoztatni. A legtöbb eszköz azonban konfigurálható a "szoftveres SPI" használatára, amely esetben bármely általános célú IO-tű használható.
it: Pin SPI: quando si utilizza l'SPI hardware, è necessario collegare i pin ai pin SPI del microcontrollore. Tuttavia, la maggior parte dei dispositivi può essere configurata per utilizzare "SPI software", nel qual caso è possibile utilizzare qualsiasi pin IO generico.
ko: SPI 핀: 하드웨어 SPI를 사용할 때 핀을 마이크로 컨트롤러의 SPI 가능 핀에 연결해야 합니다. 그러나 대부분의 장치는 "소프트웨어 SPI"를 사용하도록 구성할 수 있으며, 이 경우 모든 범용 IO 핀을 사용할 수 있습니다.
zh_hant: SPI 引腳：使用硬體 SPI 時，需要將引腳連線到微控制器的 SPI 引腳。但是，大多數裝置都可以配置為使用「軟體 SPI」，在這種情況下，可以使用任何通用 IO 引腳。

source: I2C pins: When using I2C it is necessary to wire the pins to the micro-controller's I2C capable pins.
hu: I2C tűk: I2C használatakor a tűket a mikrokontroller I2C-képes tűihez kell csatlakoztatni.
it: Pin I2C: quando si utilizza I2C è necessario collegare i pin ai pin compatibili con I2C del microcontrollore.
ko: I2C 핀: I2C를 사용할 때 핀을 마이크로 컨트롤러의 I2C 가능 핀에 연결해야 합니다.
zh_hant: I2C 引腳：使用 I2C 時，必須將引腳連線到微控制器支援 I2C 的引腳。

source: Other devices may be wired to any general purpose IO pin. For example, steppers, heaters, fans, Z probes, servos, LEDs, common hd44780/st7920 LCD displays, the Trinamic UART control line may be wired to any general purpose IO pin.
fr: D’autres éléments peuvent être câblés à n’importe quelle broche d’E/S à usage général. Par exemple, les steppers, les éléments chauffants, les ventilateurs, les sondes Z, les servos, les LED, les écrans LCD hd44780 /st7920 courants, le câble de communication UART des pilotes Trinamic peut être raccordé à n’importe quelle broche d'E/S.
hu: Más eszközök bármelyik általános célú IO tűre csatlakoztathatók. Például léptetők, fűtők, ventilátorok, Z-szondák, szervók, LED-ek, közös hd44780/st7920 LCD-kijelzők, a Trinamic UART vezérlővonal bármely általános célú IO-tűhöz csatlakoztatható.
it: Altri dispositivi possono essere collegati a qualsiasi pin IO generico. Ad esempio, stepper, riscaldatori, ventole, sonde Z, servocomandi, LED, comuni display LCD hd44780/st7920, la linea di controllo Trinamic UART può essere collegata a qualsiasi pin IO generico.
ko: 다른 장치는 범용 IO 핀에 연결할 수 있습니다. 예를 들어, 스테퍼, 히터, 팬, Z 프로브, 서보, LED, 일반 hd44780/st7920 LCD 디스플레이, Trinamic UART 제어 라인은 모든 범용 IO 핀에 배선될 수 있습니다.
zh_hant: 其他裝置可以連線到任何通用的IO引腳。例如，步進電機、加熱器、風扇、Z探頭、舵機、LED、通用的hd44780/st7920液晶顯示器和Trinamic UART控制線都可以連線到任何通用的IO引腳。
