Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/FAQ.po
Languages: fr, hu, it, ko, zh_hant

source: How do I cancel an M109/M190 "wait for temperature" request?
fr: Comment annuler une commande M109/M190 « attendre la température » ?
hu: Hogyan tudom törölni az M109/M190 "hőmérsékletre várni" kérést?
it: Come posso annullare una richiesta di "attesa temperatura" M109/M190?
ko: M109/M190 "wait for temperature" 요청을 어떻게 취소합니까?
zh_hant: 如何取消 M109/M190 "等待達到目標溫度"的請求？

source: Navigate to the OctoPrint terminal tab and issue an M112 command in the terminal box. The M112 command will cause Klipper to enter into a "shutdown" state, and it will cause OctoPrint to disconnect from Klipper. Navigate to the OctoPrint connection area and click on "Connect" to cause OctoPrint to reconnect. Navigate back to the terminal tab and issue a FIRMWARE_RESTART command to clear the Klipper error state. After completing this sequence, the previous heating request will be canceled and a new print may be started.
fr: Allez dans l'onglet terminal d'OctoPrint et envoyez une commande M112 dans la console. La commande M112 fera entrer Klipper dans un état "d'arrêt" et déconnectera OctoPrint de Klipper. Dans le bloc de connexion d'OctoPrint, cliquez sur "Connecter" pour que OctoPrint se reconnecte. Revenez à l'onglet du terminal et lancez une commande FIRMWARE_RESTART pour effacer le status en erreur de Klipper. Après avoir effectué cette séquence, la demande de chauffage précédente sera annulée et une nouvelle impression pourra être lancée.
hu: Navigáljon az OctoPrint terminál fülre, és adjon ki egy M112 parancsot a terminálmezőben. Az M112 parancs hatására a Klipper "leállítás" állapotba kerül, és az OctoPrint megszakítja a kapcsolatot a Klipperrel. Navigáljon az OctoPrint csatlakozási területére, és kattintson a "Connect" gombra, hogy az OctoPrint újra csatlakozzon. Navigáljon vissza a terminál fülre, és adjon ki egy FIRMWARE_RESTART parancsot a Klipper hibaállapotának törléséhez. E műveletsor befejezése után az előző fűtéskérés törlődik, és új nyomtatás indítható.
it: Passare alla scheda del terminale OctoPrint ed emettere un comando M112 nel terminale. Il comando M112 farà entrare Klipper in uno stato di "arresto" e causerà la disconnessione di OctoPrint da Klipper. Passare all'area di connessione di OctoPrint e fare clic su "Connetti" per fare in modo che OctoPrint si riconnetta. Torna alla scheda del terminale ed emetti un comando FIRMWARE_RESTART per cancellare lo stato di errore di Klipper. Dopo aver completato questa sequenza, la precedente richiesta di riscaldamento verrà annullata e potrebbe essere avviata una nuova stampa.
ko: OctoPrint 터미널 탭으로 이동하여 터미널 상자에서 M112 명령을 실행합니다. M112 명령은 Klipper를 "종료" 상태로 만들고 OctoPrint와 Klipper의 연결을 끊습니다. OctoPrint 연결 영역으로 이동하고 "연결"을 클릭하여 OctoPrint가 다시 연결되도록 합니다. 터미널 탭으로 돌아가 FIRMWARE_RESTART 명령을 실행하여 Klipper 오류 상태를 지웁니다. 이 순서를 완료한 후 이전 가열 요청이 취소되고 새 인쇄가 시작될 수 있습니다.
zh_hant: 導航到OctoPrint終端標籤頁，在終端框中輸入M112命令。M112命令將使Klipper進入 "關機 "狀態，它將使OctoPrint從Klipper斷開。導航到OctoPrint連線區，點選 "連線"，使OctoPrint重新連線。導航回到終端標籤頁，輸入FIRMWARE_RESTART命令以清除Klipper的錯誤狀態。完成這一系列操作將取消先前的加熱請求，可以開始新的列印。

source: Can I find out whether the printer has lost steps?
fr: Comment savoir si l'imprimante a perdu des pas?
hu: Meg tudom állapítani, hogy a nyomtató vesztett-e lépéseket?
it: Posso scoprire se la stampante ha perso dei passaggi?
ko: 프린터 탈조를 어떻게 알 수 있습니까?
zh_hant: 怎麼檢查印表機是否發生了丟步?

source: In a way, yes. Home the printer, issue a `GET_POSITION` command, run your print, home again and issue another `GET_POSITION`. Then compare the values in the `mcu:` line.
fr: D'une certaine manière, oui. Effectuez la prise d'origine (homing), lancez la commande `GET_POSITION`, démarrez votre impression, refaite la prise d'origine et lancez à nouveau la commande `GET_POSITION`. Comparez ensuite les valeurs de la ligne `mcu :`.
hu: Bizonyos értelemben igen. Indítsa el a nyomtatót, adjon ki egy `GET_POSITION` parancsot, indítsa el a nyomtatást, indítsa el újra, és adjon ki egy újabb `GET_POSITION` parancsot. Ezután hasonlítsa össze az `mcu:` sorban szereplő értékeket.
it: In un certo senso sì. Avviare la stampante, emettere un comando `GET_POSITION`, eseguire la stampa, tornare a casa ed emettere un altro `GET_POSITION`. Quindi confronta i valori nella riga `mcu:`.
ko: 이렇게 하면 가능합니다. 프린터를 홈으로 이동하고 `GET_POSITION` 명령을 실행하고 인쇄를 실행하고 다시 홈으로 이동하고 또 다른 `GET_POSITION`을 실행합니다. 그런 다음 `mcu:` 행의 값을 비교합니다.
zh_hant: 在某種程度上，是的。將印表機歸位，發出 `GET_POSITION `命令，執行列印，再次歸位，再發出 `GET_POSITION`。然後比較 `mcu: `行中的值。

source: This might be helpful to tune settings like stepper motor currents, accelerations and speeds without needing to actually print something and waste filament: just run some high-speed moves in between the `GET_POSITION` commands.
fr: Cela peut être utile pour régler des paramètres tels que les courants, les accélérations et les vitesses des moteurs pas à pas sans avoir besoin d'imprimer quelque chose et de gaspiller du filament : il suffit d'exécuter quelques mouvements à grande vitesse entre des commandes `GET_POSITION`.
hu: Ez hasznos lehet a beállítások, például a léptetőmotorok áramának, gyorsulásának és sebességének beállításához anélkül, hogy ténylegesen nyomtatnod kellene valamit és pazarolnod kellene a szálakat: csak futtass néhány nagy sebességű mozgást a `GET_POSITION` parancsok között.
it: Questo potrebbe essere utile per regolare impostazioni come correnti, accelerazioni e velocità del motore passo-passo senza dover effettivamente stampare qualcosa e sprecare il filamento: basta eseguire alcuni movimenti ad alta velocità tra i comandi `GET_POSITION`.
ko: 이것은 실제로 무언가를 인쇄하고 필라멘트를 낭비할 필요 없이 스테퍼 모터 전류, 가속도 및 속도와 같은 설정을 조정하는 데 도움이 될 수 있습니다. `GET_POSITION` 명령 사이에 고속 이동을 실행하기만 하면 됩니다.
zh_hant: 這可能有助於調整步進電機電流、加速度和速度等設定，而不需要實際列印東西和浪費材料：只要在 `GET_POSITION `命令之間執行一些高速移動。

source: Note that endstop switches themselves tend to trigger at slightly different positions, so a difference of a couple of microsteps is likely the result of endstop inaccuracies. A stepper motor itself can only lose steps in increments of 4 full steps. (So, if one is using 16 microsteps, then a lost step on the stepper would result in the "mcu:" step counter being off by a multiple of 64 microsteps.)
fr: Notez que les interrupteurs de fin de course eux-mêmes ont tendance à se déclencher à des positions légèrement différentes, de sorte qu'une différence de quelques micro-pas est probablement causé par l'imprécision de la fin de course. Un moteur pas à pas ne peut perdre des pas que par incréments de 4 pas complets. (Ainsi, si l'on utilise 16 micropas, un pas réellement perdu par le moteur se traduirait par une différence multiple de 64 micropas avec le compteur de pas "mcu :")
hu: Vegye figyelembe, hogy a végálláskapcsolók maguk is hajlamosak kissé eltérő pozícióban kioldani, így a néhány mikrolépésnyi különbség valószínűleg a végállás pontatlanságának eredménye. Maga a léptetőmotor csak 4 teljes lépésenként képes lépéseket veszíteni. (Tehát, ha 16 mikrolépést használunk, akkor a léptető egy elvesztett lépése azt eredményezi, hogy az "mcu:" lépésszámláló 64 mikrolépés többszörösével téved.)
it: Si noti che gli stessi interruttori di fine corsa tendono a attivarsi in posizioni leggermente diverse, quindi una differenza di un paio di micropassi è probabilmente il risultato di imprecisioni di fine corsa. Un motore passo-passo stesso può perdere passi solo con incrementi di 4 passi completi. (Quindi, se si utilizzano 16 micropassi, un passo perso sullo stepper comporterebbe lo spegnimento del contatore di passi "mcu:" di un multiplo di 64 micropassi.)
ko: 엔드스톱 스위치 자체는 약간 다른 위치에서 트리거되는 경향이 있으므로 몇 가지 마이크로스텝의 차이는 엔드스톱 부정확성의 결과일 수 있습니다. 스테퍼 모터 자체는 4 full step 의 배수로 탈조 될 수 있습니다. (따라서 16개의 마이크로스텝을 사용하는 경우 스테퍼에서 손실된 스텝은 "mcu:" 스텝 카운터가 64개의 마이크로스텝의 배수만큼 떨어져 있는 결과를 낳습니다.)
zh_hant: 請注意，限位開關本身的觸發位置略有不同，所以導致限位開關觸發結果可能有幾個微步的誤差。步進電機本身只能以4個整步為增量損失步數。(因此，如果使用16個微步，那麼步進器電機上的失步將導致 "MCU: "步進計數器偏離64微步的倍數。）

source: Why does Klipper report errors? I lost my print!
fr: Pourquoi Klipper signale-t-il des erreurs? J’ai raté mon impression!
hu: Miért jelent hibát a Klipper? Elrontotta a nyomtatásomat!
it: Perché Klipper segnala errori? Ho perso la mia stampa!
ko: Klipper가 "I lost my print" 오류를 보고하는 이유는 무엇입니까!
zh_hant: 為什麼 Klipper 會報錯？我收了一盤面條（我又打廢了）！

source: Short answer: We want to know if our printers detect a problem so that the underlying issue can be fixed and we can obtain great quality prints. We definitely do not want our printers to silently produce low quality prints.
fr: Réponse courte : Nous voulons savoir si nos imprimantes rencontre un problème afin qu'il puisse être résolu et que nous puissions obtenir des impressions de grande qualité. Nous ne voulons surtout pas que nos imprimantes produisent sans le signaler, des impressions de mauvaise qualité.
hu: Rövid válasz: A nyomtatóink problémákat észlelnek, hogy a mögöttes problémát orvosolni lehessen, és kiváló minőségű nyomatokat kaphassunk. Semmiképpen sem szeretnénk, ha a nyomtatóink csendben rossz minőségű nyomatokat készítenének.
it: Risposta breve: vogliamo sapere se le nostre stampanti rilevano un problema in modo che il problema sottostante possa essere risolto e possiamo ottenere stampe di ottima qualità. Non vogliamo assolutamente che le nostre stampanti producano in silenzio stampe di bassa qualità.
ko: 간단한 답변: 우리는 프린터가 문제를 감지하여 근본적인 문제를 수정하고 우수한 품질의 인쇄물을 얻을 수 있는지 알고 싶습니다. 프린터가 저품질 인쇄물을 조용히 생산하는 것을 원하지 않습니다.
zh_hant: 簡短的回答：我們想知道印表機是否檢測到問題，這樣就可以解決潛在的問題，就可以獲得高質量的列印件。我們絕對不希望印表機默默地生產低質量的列印件。

source: Long answer: Klipper has been engineered to automatically workaround many transient problems. For example, it automatically detects communication errors and will retransmit; it schedules actions in advance and buffers commands at multiple layers to enable precise timing even with intermittent interference. However, should the software detect an error that it can not recover from, if it is commanded to take an invalid action, or if it detects it is hopelessly unable to perform its commanded task, then Klipper will report an error. In these situations there is a high risk of producing a low-quality print (or worse). It is hoped that alerting the user will empower them to fix the underlying issue and improve the overall quality of their prints.
fr: Réponse longue : Klipper a été conçu pour contourner automatiquement de nombreux problèmes passagers. Par exemple, il détecte automatiquement les erreurs de communication et retransmet les données ; il planifie les actions à l'avance et met en mémoire tampon les commandes à plusieurs niveaux pour permettre une synchronisation précise, même en cas d'interférences intermittentes. Toutefois, si le logiciel détecte une erreur dont il ne peut corriger, s'il reçoit l'ordre d'effectuer une action non valide ou s'il constate qu'il est désespérément incapable d'exécuter la tâche qui lui est demandée, Klipper signalera une erreur. Dans ces situations, le risque est grand de produire une impression de mauvaise qualité (ou pire). Nous espérons que le fait d'alerter l'utilisateur lui permettra de résoudre le problème sous-jacent et d'améliorer la qualité globale de ses impressions.
hu: Hosszú válasz: A Klipper úgy lett megtervezve, hogy automatikusan megoldjon számos átmeneti problémát. Például automatikusan észleli a kommunikációs hibákat, és újratovábbítja azokat; előre ütemezi a műveleteket, és több rétegben puffereli a parancsokat, hogy még időszakos interferencia esetén is pontos időzítést tegyen lehetővé. Ha azonban a szoftver olyan hibát észlel, amelyből nem tud helyreállni, ha érvénytelen műveletre kap parancsot, vagy ha azt észleli, hogy reménytelenül képtelen végrehajtani a parancsolt feladatot, akkor a Klipper hibát jelent. Ezekben a helyzetekben nagy a kockázata annak, hogy rossz minőségű nyomtatás készül (vagy rosszabb). Reméljük, hogy a felhasználó figyelmeztetése lehetővé teszi számára, hogy megoldja a kiváltó problémát, és javítsa a nyomatok általános minőségét.
it: Risposta lunga: Klipper è stato progettato per risolvere automaticamente molti problemi transitori. Ad esempio, rileva automaticamente gli errori di comunicazione e li ritrasmette; pianifica le azioni in anticipo e bufferizza i comandi su più livelli per consentire tempi precisi anche con interferenze intermittenti. Tuttavia, se il software rileva un errore dal quale non può essere ripristinato, se gli viene ordinato di eseguire un'azione non valida o se rileva che è irrimediabilmente incapace di eseguire l'attività comandata, Klipper segnalerà un errore. In queste situazioni c'è un alto rischio di produrre una stampa di bassa qualità (o peggio). Si spera che avvisare gli utenti consentirà loro di risolvere il problema sottostante e migliorare la qualità complessiva delle loro stampe.
ko: 긴 답변: Klipper는 많은 일시적인 문제를 자동으로 해결하도록 설계되었습니다. 예를 들어, 자동으로 통신 오류를 감지하고 재전송합니다. 사전에 작업을 예약하고 여러 계층에서 명령을 버퍼링하여 간헐적인 간섭이 있는 경우에도 정확한 타이밍을 가능하게 합니다. 그러나 소프트웨어가 복구할 수 없는 오류를 감지하거나 잘못된 조치를 취하도록 명령을 받았거나 명령받은 작업을 절망적으로 수행할 수 없음을 감지한 경우Klipper는 오류를 보고합니다. 이러한 상황에서는 낮은 품질(또는 그 이상)의 인쇄물을 생성할 위험이 높습니다. 사용자에게 경고하면 근본적인 문제를 해결하고 인쇄물의 전반적인 품질을 개선할 수 있기를 바랍니다.
zh_hant: 詳細答案：Klipper被設計成能夠自動解決許多瞬時問題。例如，它自動檢測到通訊錯誤，並會重新傳輸；它提前安排行動，並在多層緩衝命令，以便即使有間歇性干擾也能精確控制時序。然而，如果軟體檢測到它無法恢復的錯誤，或者它被命令採取無效的行動，或者它檢測到它無法執行其被命令的任務，那麼Klipper將報告錯誤。在這些情況下，產生低質量印刷件（或更糟）的風險很大。我們希望通過提醒使用者，使他們有能力解決潛在的問題，提高列印的整體質量。

source: There are some related questions: Why doesn't Klipper pause the print instead? Report a warning instead? Check for errors before the print? Ignore errors in user typed commands? etc? Currently Klipper reads commands using the G-Code protocol, and unfortunately the G-Code command protocol is not flexible enough to make these alternatives practical today. There is developer interest in improving the user experience during abnormal events, but it is expected that will require notable infrastructure work (including a shift away from G-Code).
fr: Il y a quelques questions connexes: Pourquoi Klipper ne met-il pas plutôt l'impression en pause? Ne signale-t-il pas plutôt un avertissement? Ne vérifie-t-il pas les erreurs avant l'impression? N'ignore-t-il pas les erreurs dans les commandes saisies par l'utilisateur? etc. Actuellement, Klipper lit les commandes en utilisant le protocole G-Code, et malheureusement le protocole de commande G-Code n'est pas assez flexible pour rendre ces alternatives praticables aujourd'hui. Il y a un intérêt certain à améliorer l'expérience utilisateur pour la gestion de ces évènements anormaux mais cela nécessite un travail notable sur l'infrastructure (incluant de détourner le G-Code).
hu: Van néhány kapcsolódó kérdés: Miért nem szünetelteti a Klipper a nyomtatást? Nem jelent figyelmeztetést helyette? A nyomtatás előtt nem ellenőrzi a hibákat? Figyelmen kívül hagyja a hibákat a felhasználó által begépelt parancsokban? stb. Jelenleg a Klipper a G-kód protokollt használva olvassa a parancsokat, és sajnos a G-kód parancsprotokoll nem elég rugalmas ahhoz, hogy ezek az alternatívák ma már praktikusak legyenek. A fejlesztők érdeklődnek a felhasználói élmény javítása iránt a rendellenes események során, de ez várhatóan jelentős infrastrukturális munkát igényel (beleértve a G-kódtól való eltávolodást).
it: Ci sono alcune domande correlate: perché Klipper non mette invece in pausa la stampa? Segnalare invece un avviso? Verificare la presenza di errori prima della stampa? Ignorare gli errori nei comandi digitati dall'utente? eccetera? Attualmente Klipper legge i comandi utilizzando il protocollo G-Code e sfortunatamente il protocollo di comando G-Code non è sufficientemente flessibile per rendere pratiche queste alternative oggi. C'è l'interesse degli sviluppatori nel migliorare l'esperienza dell'utente durante eventi anomali, ma si prevede che ciò richiederà un notevole lavoro infrastrutturale (incluso un passaggio dal G-Code).
ko: 몇 가지 관련 질문이 있습니다. Klipper가 대신 인쇄를 일시 중지하지 않는 이유는 무엇입니까? 대신 경고를 보고하시겠습니까? 인쇄하기 전에 오류를 확인하시겠습니까? 사용자가 입력한 명령의 오류를 무시하시겠습니까? 등? 현재 Klipper는 gcode 프로토콜을 사용하여 명령을 읽지만 불행히도 gcode 명령 프로토콜은 오늘날 이러한 대안을 실용적으로 만들 만큼 유연하지 않습니다. 비정상적인 이벤트 발생시 사용자 경험을 개선하는 데 개발자의 관심이 있지만 많은 인프라 작업 (gcode에서 전환 포함)이 필요할 것으로 예상됩니다.
zh_hant: 有一些相關的問題。為什麼Klipper不暫停列印？為什麼不先警告？為什麼不在列印前檢查錯誤？為什麼不忽略使用者輸入的命令中的錯誤？等等？目前，Klipper使用G-Code協議讀取命令，不幸的是，G-Code命令協議不夠靈活，導致現在並不能使用這些替代方案。開發者對改善異常事件中的使用者體驗很感興趣，但預計這將需要大量的底層工作（包括從G-Code的遷移到別的方式）。

source: How do I upgrade to the latest software?
fr: Comment mettre à jour vers la dernière version du logiciel?
hu: Hogyan frissíthetek a legújabb szoftverre?
it: Come si esegue l'aggiornamento al software più recente?
ko: 최신 소프트웨어로 업그레이드하려면 어떻게 합니까?
zh_hant: 我怎樣才能升級到最新的軟體？

source: The first step to upgrading the software is to review the latest [config changes](Config_Changes.md) document. On occasion, changes are made to the software that require users to update their settings as part of a software upgrade. It is a good idea to review this document prior to upgrading.
fr: La première étape de la mise à jour du logiciel consiste à consulter le document le plus récent des [changements de configuration](Config_Changes.md). Il arrive que des modifications soient apportées au logiciel et que les utilisateurs doivent mettre à jour leurs paramètres dans le cadre d'une mise à niveau logicielle. Il est conseillé de consulter ce document avant de procéder à la mise à niveau.
hu: A szoftver frissítésének első lépése a legfrissebb [konfigurációs változások](Config_Changes.md) dokumentum áttekintése. Alkalmanként olyan változások történnek a szoftverben, amelyek miatt a felhasználóknak frissíteniük kell a beállításaikat a szoftverfrissítés részeként. A frissítés előtt érdemes átnézni ezt a dokumentumot.
it: Il primo passaggio per l'aggiornamento del software consiste nell'esaminare l'ultimo documento [config changes](Config_Changes.md). A volte, vengono apportate modifiche al software che richiedono agli utenti di aggiornare le proprie impostazioni come parte di un aggiornamento del software. È una buona idea rivedere questo documento prima dell'aggiornamento.
ko: 소프트웨어 업그레이드의 첫 번째 단계는 최신 [config changes](Config_Changes.md) 를 검토하는 것입니다. 업그레이드하기 전에 이 문서를 검토하는 것이 좋습니다.
zh_hant: 升級軟體的第一步是檢視最新的[配置變更](Config_Changes.md)檔案。作為軟體升級的一部分，偶爾有時候軟體會有一些變化需要使用者更新他們的設定。在升級前最好檢視該檔案。

source: When ready to upgrade, the general method is to ssh into the Raspberry Pi and run:
hu: Ha készen áll a frissítésre, az általános módszer az, hogy SSH-t használunk a Raspberry Pi-n, és futtatjuk:
it: Quando sei pronto per l'aggiornamento, il metodo generale è quello di entrare in Raspberry Pi ed eseguire:
ko: 업그레이드할 준비가 되면 일반적인 방법은 Raspberry Pi에 ssh 로 접속하고 다음을 실행하는 것입니다:
zh_hant: 當準備升級時，一般的方法是ssh進入樹莓派並執行：

source: Then one can recompile and flash the micro-controller code. For example:
hu: Ezután újrafordíthatjuk és égethetjük a mikrokontroller kódját. Például:
it: Quindi si può ricompilare e flashare il codice del microcontrollore. Per esempio:
ko: 그런 다음 마이크로 컨트롤러 코드를 다시 컴파일하고 펌웨어 업로드 할 수 있습니다. 예를 들어:
zh_hant: 然後可以重新編譯和刷寫微控制器的程式碼。例如：

source: However, it's often the case that only the host software changes. In this case, one can update and restart just the host software with:
hu: Azonban gyakran előfordul, hogy csak a gazdaszoftver változik. Ebben az esetben csak a gazdaszoftvert frissíthetjük és indíthatjuk újra:
it: Tuttavia, capita spesso che cambi solo il software host. In questo caso è possibile aggiornare e riavviare solo il software host con:
ko: 그러나 호스트 소프트웨어만 변경되는 경우가 많습니다. 이 경우 다음을 사용하여 호스트 소프트웨어만 업데이트하고 다시 시작할 수 있습니다:
zh_hant: 然而，通常是隻有主機軟體發生變化。這時可以只更新和重新啟動主機軟體：

source: If after using this shortcut the software warns about needing to reflash the micro-controller or some other unusual error occurs, then follow the full upgrade steps outlined above.
fr: Si, après avoir utilisé ce raccourci, le logiciel vous avertit qu'il faut reflasher le microcontrôleur ou qu'une autre erreur inhabituelle se produit, suivez les étapes complètes de mise à jour décrites ci-dessus.
hu: Ha e parancs használata után a szoftver arra figyelmeztet, hogy a mikrokontrollert újra kell égetni, vagy más szokatlan hiba lép fel, akkor kövesse a fent leírt teljes frissítési lépéseket.
it: Se dopo aver utilizzato questo collegamento il software avverte della necessità di eseguire il reflash del microcontrollore o si verifica qualche altro errore insolito, seguire i passaggi completi di aggiornamento descritti sopra.
ko: 만약에 이렇게 했는데도 마이크로 컨트롤러를 다시 펌업 해야 한다고 경고하거나 기타 비정상적인 오류가 발생하면 위에 설명된 전체 업그레이드 단계를 따르십시오.
zh_hant: 如果在使用這個快速方式后，軟體警告說需要重新刷寫微控制器或出現其他不常見的錯誤，那麼請按照上面所述的完整升級步驟進行。

source: If any errors persist then double check the [config changes](Config_Changes.md) document, as you may need to modify the printer configuration.
fr: Si des erreurs persistent, vérifiez le document [modifications de configuration](Config_Changes.md), car vous devrez peut-être modifier la configuration de l’imprimante.
hu: Ha továbbra is fennállnak a hibák, akkor ellenőrizze a [konfigurációs változások](Config_Changes.md) dokumentumot, mivel lehet, hogy módosítani kell a nyomtató konfigurációját.
it: Se gli errori persistono, ricontrolla il documento [config changes](Config_Changes.md), poiché potrebbe essere necessario modificare la configurazione della stampante.
ko: 오류가 지속되면 프린터 config 를 수정해야 할 수 있으므로 [config changes](Config_Changes.md)를 다시 확인하십시오.
zh_hant: 如果任何錯誤持續存在，那麼請仔細檢查[config changes](Config_Changes.md)檔案，因為可能需要修改印表機配置。

source: Note that the RESTART and FIRMWARE_RESTART g-code commands do not load new software - the above "sudo service klipper restart" and "make flash" commands are needed for a software change to take effect.
fr: Notez que les commandes G-Code RESTART et FIRMWARE_RESTART ne rechargent pas le logiciel - les commandes "sudo service klipper restart" et "make flash" ci-dessus sont nécessaires pour que les modifications du logiciel prennent effet.
hu: Ne feledje, hogy a RESTART és FIRMWARE_RESTART G-kód parancsok nem töltenek be új szoftvert a fenti "sudo service klipper restart" és "make flash" parancsok szükségesek a szoftverváltás érvénybe lépéséhez.
it: Si noti che i comandi g-code RESTART e FIRMWARE_RESTART non caricano il nuovo software: i comandi "sudo service klipper restart" e "make flash" di cui sopra sono necessari affinché una modifica del software abbia effetto.
ko: RESTART 및 FIRMWARE_RESTART gcode 명령은 새 호스트 소프트웨어를 로드하지 않습니다. 호스트 소프트웨어 변경 사항을 적용하려면 위의 "sudo service klipper restart" 및 "make flash" 명령이 필요합니다.
zh_hant: 請注意，RESTART和FIRMWARE_RESTART g-code命令不會載入新的軟體--需要使用上述 "sudo service klipper restart "和 "make flash "命令才能使軟體變化生效。

source: How do I uninstall Klipper?
fr: Comment désinstaller Klipper?
hu: Hogyan tudom eltávolítani a Klippert?
it: Come faccio a disinstallare Klipper?
ko: Klipper를 어떻게 제거합니까?
zh_hant: 如何解除安裝Klipper？

source: On the firmware end, nothing special needs to happen. Just follow the flashing directions for the new firmware.
hu: A firmware oldalon semmi különösnek nem kell történnie. Csak kövesse az új firmware égetési utasításait.
it: Dal alto del firmware, non deve succedere nulla di speciale. Basta seguire le indicazioni per il flashing del nuovo firmware.
ko: 펌웨어 쪽에서는 특별히 해 줄 일이 없습니다. 그냥 새로 사용할 펌웨어 업로드 가이드를 따라서 업로드 하세요.
zh_hant: 在韌體端，沒有什麼特別需要做的。只要刷寫新韌體就可以了。

source: On the raspberry pi end, an uninstall script is available in [scripts/klipper-uninstall.sh](../scripts/klipper-uninstall.sh). For example:
hu: A Raspberry Pi oldalon egy eltávolító szkript elérhető a [scripts/klipper-uninstall.sh](../scripts/klipper-uninstall.sh) alatt. Például:
it: Dal lato del raspberry pi, uno script di disinstallazione è disponibile in [scripts/klipper-uninstall.sh](../scripts/klipper-uninstall.sh). Per esempio:
ko: 라즈베리 파이 쪽에서 제거 스크립트는 [scripts/klipper-uninstall.sh](../scripts/klipper-uninstall.sh) 를 사용할 수 있습니다. 예를 들어:
zh_hant: 在樹莓派上，解除安裝指令碼在這裡[scripts/klipper-uninstall.sh](../scripts/klipper-uninstall.sh)。例如：
