Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/FAQ.po
Languages: fr, hu, it, ko, zh_hant

source: However, if "make flash" just doesn't work for your board, then you will need to manually flash. See if there is a config file in the [config directory](../config) with specific instructions for flashing the device. Also, check the board manufacturer's documentation to see if it describes how to flash the device. Finally, it may be possible to manually flash the device using tools such as "avrdude" or "bossac" - see the [bootloader document](Bootloaders.md) for additional information.
fr: Toutefois si "make flash" ne fonctionne pas pour votre carte, vous devrez flasher manuellement. Vérifiez s'il existe un fichier de configuration dans le [répertoire config](../config) avec des instructions spécifiques pour flasher la carte. Vérifiez également la documentation du fabricant de la carte pour voir si elle décrit comment la flasher. Enfin, il peut être possible de flasher manuellement la carte en utilisant des outils tels que "avrdude" ou "bossac" - voir le [document sur les booloaders](Bootloaders.md) pour plus d'informations.
hu: Ha azonban a "make flash" egyszerűen nem működik az alaplapján, akkor manuálisan kell égetnie. Nézze meg, hogy van-e a [config könyvtárban](../config) egy config fájl, amely konkrét utasításokat tartalmaz az eszköz égetésére. Ellenőrizze a kártya gyártójának dokumentációját is, hogy leírja-e, hogyan kell égetni az eszközt. Végül, lehetséges lehet, hogy manuálisan égessük az eszközt olyan eszközökkel, mint az "avrdude" vagy a "bossac" - további információkért lásd a [bootloader dokumentumot](Bootloaders.md).
it: Tuttavia, se "make flash" non funziona per la tua scheda, dovrai eseguire il flashing manualmente. Verificare se nella [config directory](../config) è presente un file di configurazione con istruzioni specifiche per il flashing del dispositivo. Inoltre, controlla la documentazione del produttore della scheda per vedere se descrive come eseguire il flashing del dispositivo. Infine, potrebbe essere possibile eseguire manualmente il flashing del dispositivo utilizzando strumenti come "avrdude" o "bossac" - vedere il [bootloader document](Bootloaders.md) per ulteriori informazioni.
ko: 그러나 "make flash"가 보드에서 작동하지 않으면 수동으로 플래시해야 합니다. 펌웨어 업로드에 대한 특정 명령어가 포함된 구성 파일이 config 디렉토리에 있는지 확인하십시오. 또한 보드 제조업체의 설명서에 장치에 펌웨어 업로드 하는 방법이 설명되어 있는지 확인하십시오. 마지막으로 "avrdude" 또는 "bossac"과 같은 도구를 사용하여 장치에 수동으로 펌웨어 업로드 할 수 있습니다. 추가 정보는 [bootloader document](Bootloaders.md)를 참조하십시오.
zh_hant: 但是，如果「make flash」對您的電路板不起作用，那麼您將需要手動刷寫。 檢視 [config directory](../config) 中是否有一個配置檔案，裡面有刷機的具體說明。 此外，請檢視電路板製造商的文件，看看它是否描述瞭如何刷寫裝置。 最後，可以使用諸如「avrdude」或「bossac」之類的工具手動刷寫裝置——有關更多資訊，請參閱[引導載入程式文件](Bootloaders.md)。

source: How do I change the serial baud rate?
fr: Comment changer le baud rate (taux bit/s) du port série?
hu: Hogyan változtathatom meg a soros port sebességét?
it: Come posso modificare la velocità di trasmissione seriale?
ko: 시리얼 포트 전송 속도는 어떻게 변경합니까?
zh_hant: 如何更改序列波特率？

source: The recommended baud rate for Klipper is 250000. This baud rate works well on all micro-controller boards that Klipper supports. If you've found an online guide recommending a different baud rate, then ignore that part of the guide and continue with the default value of 250000.
fr: Le baud rate (taux bit/s) recommandé pour Klipper est de 250000. Ce baud rate fonctionne bien sur toutes les cartes microcontrôleurs que Klipper prend en charge. Si vous avez trouvé un guide en ligne recommandant un baud rate différent, ignorez cette partie du guide et continuez avec la valeur par défaut de 250000.
hu: A Klipper ajánlott átviteli sebessége 250000. Ez az átviteli ráta jól működik minden olyan mikrokontroller kártyán, amelyet a Klipper támogat. Ha talált egy online útmutatót, amely más átviteli sebességet javasol, akkor hagyja figyelmen kívül az útmutatónak ezt a részét, és folytassa az alapértelmezett 250000 értékkel.
it: Il baud rate consigliato per Klipper è 250000. Questo baud rate funziona bene su tutte le schede di microcontrollore supportate da Klipper. Se hai trovato una guida online che consiglia una velocità di trasmissione diversa, ignora quella parte della guida e continua con il valore predefinito di 250000.
ko: Klipper의 권장 전송 속도는 250000입니다. 이 전송 속도는 Klipper가 지원하는 모든 마이크로 컨트롤러 보드에서 잘 작동합니다. 다른 전송 속도를 권장하는 온라인 가이드를 찾은 경우 가이드의 해당 부분을 무시하고 기본값 250000을 계속 사용하십시오.
zh_hant: Klipper的推薦波特率是 250000。這個波特率在 Klipper 支援的所有微控制器板上都很好用。如果你發現網上的指南推薦了一個不同的波特率，那麼請忽略這部分指南，繼續使用預設值 250000。

source: If you want to change the baud rate anyway, then the new rate will need to be configured in the micro-controller (during **make menuconfig**) and that updated code will need to be compiled and flashed to the micro-controller. The Klipper printer.cfg file will also need to be updated to match that baud rate (see the [config reference](Config_Reference.md#mcu) for details). For example:
fr: Si vous voulez quand même changer le baud rate, le nouveau taux devra être configurée dans le microcontrôleur (pendant **make menuconfig**) et ce code mis à jour devra être compilé et flashé dans le microcontrôleur. Le fichier printer.cfg de Klipper devra également être mis à jour pour correspondre à ce baud rate (voir le document de [référence des configurations](Config_Reference.md#mcu) pour plus de détails). Par exemple :
hu: Ha mindenképpen meg akarja változtatni az átviteli sebességet, akkor az új sebességet a mikrokontrollerben kell beállítani (a **make menuconfig** alatt), és a frissített kódot le kell fordítani és be kell égetni a mikrokontrollerbe. A Klipper printer.cfg fájlt is frissíteni kell, hogy megfeleljen ennek az átviteli sebességnek (lásd a [konfigurációs hivatkozást](Config_Reference.md#mcu) a részleteket). Például:
it: Se si desidera comunque modificare il baud rate, sarà necessario configurare la nuova velocità nel microcontrollore (durante **make menuconfig**) e il codice aggiornato dovrà essere compilato e flashato sul microcontrollore. Anche il file Klipper printer.cfg dovrà essere aggiornato in modo che corrisponda a tale velocità di trasmissione (consultare il [config reference](Config_Reference.md#mcu) per i dettagli). Per esempio:
ko: 어쨌든 전송 속도를 변경하려면 마이크로 컨트롤러에서 새 속도를 구성해야 하고 (**make menuconfig**를 통해서) 업데이트된 코드를 컴파일하고 마이크로 컨트롤러에 펌웨어 업로드 해야 합니다. Klipper printer.cfg 파일도 해당 전송 속도와 일치하도록 업데이트해야 합니다. (자세한 내용은 [config reference](Config_Reference.md#mcu) 참조). 예를 들어:
zh_hant: 如果你還是想改變波特率，那麼需要重新配置微控制器為新的波特率（在**make menuconfig**過程中），然後將更新的程式碼編譯並刷寫到微控制器中。Klipper 的 printer.cfg 檔案也需要更新以匹配該波特率（詳見[配置參考](Config_Reference.md#mcu）)。例如：

source: The baud rate shown on the OctoPrint web page has no impact on the internal Klipper micro-controller baud rate. Always set the OctoPrint baud rate to 250000 when using Klipper.
fr: Le baud rate (taux bit/s) indiqué sur la page Web d'OctoPrint n'a aucun impact sur la vitesse de transmission du microcontrôleur interne de Klipper. Réglez toujours le taux de bit/s d'OctoPrint sur 250000 lorsque vous utilisez Klipper.
hu: Az OctoPrint weboldalon feltüntetett átviteli sebesség nincs hatással a Klipper mikrokontroller belső átviteli sebességére. Klipper használatakor az OctoPrint átviteli sebességét mindig 250000-re állítsa be.
it: La velocità di trasmissione mostrata sulla pagina Web di OctoPrint non ha alcun impatto sulla velocità di trasmissione interna del microcontrollore Klipper. Impostare sempre la velocità di trasmissione OctoPrint su 250000 quando si utilizza Klipper.
ko: OctoPrint 웹 페이지에 표시된 전송 속도는 내부 Klipper 마이크로 컨트롤러 전송 속도에 영향을 미치지 않습니다. Klipper를 사용할 때는 항상 OctoPrint 전송 속도를 250000 으로 설정하십시오.
zh_hant: OctoPrint 網頁上顯示的波特率對內部 Klipper 微控制器的波特率沒有影響。使用 Klipper 時，始終將 OctoPrint 的波特率設定為250000。

source: The Klipper micro-controller baud rate is not related to the baud rate of the micro-controller's bootloader. See the [bootloader document](Bootloaders.md) for additional information on bootloaders.
fr: Le baud rate utilisé avec Klipper n'est pas liée au baud rate du bootloader du microcontrôleur. Voir le [document sur les bootloaders](Bootloaders.md) pour plus d'informations sur les bootloaders.
hu: A Klipper mikrovezérlő átviteli sebessége nem függ a mikrovezérlő bootloader átviteli sebességétől. A [bootloader dokumentum](Bootloaders.md) további információkat tartalmaz a bootloaderekkel kapcsolatban.
it: La velocità in baud del microcontrollore Klipper non è correlata alla velocità in baud del bootloader del microcontrollore. Vedere il [bootloader document](Bootloaders.md) per ulteriori informazioni sui bootloader.
ko: Klipper 마이크로 컨트롤러 전송 속도는 마이크로 컨트롤러 부트로더의 전송 속도와 관련이 없습니다. 부트로더에 대한 추가 정보는 [bootloader document](Bootloaders.md)를 참조하십시오.
zh_hant: Klipper 微控制器的波特率與微控制器啟動載入程式的波特率無關。有關啟動載入程式的額外資訊請參閱[啟動載入程式文件](Bootloaders.md)。

source: Can I run Klipper on something other than a Raspberry Pi 3?
fr: Puis-je faire fonctionner Klipper sur quelque chose d'autre qu'un Raspberry Pi 3?
hu: Futtathatom a Klippert a Raspberry Pi 3-on kívül máson is?
it: Posso eseguire Klipper su qualcosa di diverso da un Raspberry Pi 3?
ko: Raspberry Pi 3 이외의 다른 기기에서 Klipper를 실행할 수 있습니까?
zh_hant: 我可以在 Raspberry Pi 3 以外的其他裝置上執行 Klipper 嗎？

source: The recommended hardware is a Raspberry Pi 2, Raspberry Pi 3, or Raspberry Pi 4.
hu: Az ajánlott hardver egy Raspberry Pi 2, Raspberry Pi 3 vagy Raspberry Pi 4.
it: L'hardware consigliato è un Raspberry Pi 2, Raspberry Pi 3 o Raspberry Pi 4.
ko: 권장 하드웨어는 Raspberry Pi 2, Raspberry Pi 3 또는 Raspberry Pi 4입니다.
zh_hant: 推薦的硬體是 Raspberry Pi 2、Raspberry Pi 3 或 Raspberry Pi 4。

source: Klipper will run on a Raspberry Pi 1 and on the Raspberry Pi Zero, but these boards don't have enough processing power to run OctoPrint well. It is common for print stalls to occur on these slower machines when printing directly from OctoPrint. (The printer may move faster than OctoPrint can send movement commands.) If you wish to run on one one of these slower boards anyway, consider using the "virtual_sdcard" feature when printing (see [config reference](Config_Reference.md#virtual_sdcard) for details).
fr: Klipper fonctionne sur un Raspberry Pi 1 et sur le Raspberry Pi Zero, mais ces cartes n'ont pas assez de puissance de traitement pour faire fonctionner OctoPrint correctement. Il est fréquent que l'impression se fasse par à-coup avec ces machines plus lentes lorsqu'on imprime directement depuis OctoPrint. (L'imprimante peut chercher à imprimer plus rapidement que la vitesse à laquelle OctoPrint peut envoyer les commandes de mouvement.) Si vous souhaitez quand même utiliser une de ces cartes plus lentes, pensez à utiliser la fonctionnalité "virtual_sdcard" lors de l'impression (voir le document de [référence des configurations](Config_Reference.md#virtual_sdcard) pour plus de détails).
hu: A Klipper fut a Raspberry Pi 1-en és a Raspberry Pi Zero-n, de ezek a lapok nem tartalmaznak elegendő feldolgozási teljesítményt az OctoPrint jó futtatásához. Gyakori, hogy ezeken a lassabb gépeken a nyomtatás akadozik, amikor közvetlenül az OctoPrintből nyomtat. (Előfordulhat, hogy a nyomtató gyorsabban mozog, mint ahogy az OctoPrint a mozgásparancsokat el tudja küldeni.) Ha mindenképpen ezek közül a lassabb lapok közül valamelyiken szeretne futni, fontolja meg a "virtual_sdcard" funkció használatát nyomtatáskor (a részletekért lásd [konfigurációs hivatkozást](Config_Reference.md#virtual_sdcard)).
it: Klipper funzionerà su un Raspberry Pi 1 e su Raspberry Pi Zero, ma queste schede non hanno una potenza di elaborazione sufficiente per eseguire bene OctoPrint. È normale che si verifichino interruzioni di stampa su queste macchine più lente quando si stampa direttamente da OctoPrint. (La stampante potrebbe muoversi più velocemente di quanto OctoPrint possa inviare comandi di movimento.) Se desideri comunque eseguire su una di queste schede più lente, considera l'utilizzo della funzione "virtual_sdcard" durante la stampa (consulta [config reference](Config_Reference.md#virtual_sdcard) per dettagli).
ko: Klipper는 Raspberry Pi 1 및 Raspberry Pi Zero에서 실행되지만 이러한 보드에는 OctoPrint를 제대로 실행하기에 충분한 처리 능력이 없습니다. OctoPrint에서 직접 인쇄할 때 이러한 느린 시스템에서 인쇄 중단이 발생하는 것은 일반적입니다. (프린터는 OctoPrint가 이동 명령을 보낼 수 있는 것보다 더 빠르게 움직일 수 있습니다.) 어쨌든 이러한 느린 보드 중 하나에서 실행하려면 인쇄할 때 "virtual_sdcard" 기능을 사용하는 것을 고려하십시오 (자세한 내용은 [config reference](Config_Reference.md#virtual_sdcard) 참조).
zh_hant: Klipper 可以在 Raspberry Pi 1和Raspberry Pi Zero上執行，但這些板子沒有足夠的處理能力來執行 OctoPrint。在這些較慢的機器上直接從 OctoPrint 列印時，經常會出現列印停滯。(印表機的移動速度可能比 OctoPrint 發送移動命令的速度快。)如果你希望在這些較慢的板子上執行，請考慮在列印時使用 "virtual_sdcard "功能(詳情請參見[配置參考](Config_Reference.md#virtual_sdcard))。

source: Klipper has been run on other machines. The Klipper host software only requires Python running on a Linux (or similar) computer. However, if you wish to run it on a different machine you will need Linux admin knowledge to install the system prerequisites for that particular machine. See the [install-octopi.sh](../scripts/install-octopi.sh) script for further information on the necessary Linux admin steps.
hu: A Klipper más gépeken is futott. A Klipper gazdagép szoftverhez csak Python szükséges, amely Linux (vagy hasonló) számítógépen fut. Ha azonban más gépen szeretné futtatni, akkor Linux adminisztrátori ismeretekre lesz szüksége az adott gép rendszerkövetelményeinek telepítéséhez. A szükséges Linux-adminisztrátori lépésekről további információt az [install-octopi.sh](../scripts/install-octopi.sh) szkriptben talál.
it: Klipper è stato eseguito su altre macchine. Il software host Klipper richiede solo Python in esecuzione su un computer Linux (o simile). Tuttavia, se desideri eseguirlo su una macchina diversa, avrai bisogno della conoscenza dell'amministratore Linux per installare i prerequisiti di sistema per quella particolare macchina. Consulta lo script [install-octopi.sh](../scripts/install-octopi.sh) per ulteriori informazioni sui passaggi necessari.
ko: Klipper는 다양한 컴퓨터에서 실행될 수 있습니다. Klipper 호스트 소프트웨어에는 Linux(또는 이와 유사한) 컴퓨터에서 실행되는 Python만 있으면 됩니다. 그러나 다른 시스템에서 실행하려면 기본적으로 필요한 소프트웨어를 설치하기 위해 Linux 관리자 지식이 필요합니다. 필요한 Linux 관리자에 대한 추가 정보는 [install-octopi.sh](../scripts/install-octopi.sh) 를 참조하십시오.
zh_hant: Klipper 可以在其他計算機上執行。Klipper 主機軟體只需要在Linux（或類似）系統的計算機上執行 Python。然而，如果你想在其他計算機上執行它，你將需要一些 Linux 管理知識來安裝該計算機上系統的依賴包。參見 [install-octopi.sh](..../scripts/install-octopi.sh) 指令碼，以進一步瞭解必要的 Linux 安裝方法。

source: If you are looking to run the Klipper host software on a low-end chip, then be aware that, at a minimum, a machine with "double precision floating point" hardware is required.
hu: Ha a Klipper gazdagép szoftvert egy low-end chipen szeretné futtatni, akkor vegye figyelembe, hogy legalább egy "dupla pontosságú lebegőpontos" hardverrel rendelkező gépre van szükség.
it: Se stai cercando di eseguire il software host Klipper su un chip di fascia bassa, tieni presente che, come minimo, è necessaria una macchina con hardware a "virgola mobile a doppia precisione".
ko: 저가형 칩에서 Klipper 호스트 소프트웨어를 실행하려는 경우 최소한 "double precision floating point" 하드웨어가 있는 시스템이 필요하다는 점에 유의하십시오.
zh_hant: 如果你想在低端處理器上執行 Klipper 主機軟體，請注意，你至少需要一臺具有 "雙精度浮點 "運算硬體的計算機。

source: If you are looking to run the Klipper host software on a shared general-purpose desktop or server class machine, then note that Klipper has some real-time scheduling requirements. If, during a print, the host computer also performs an intensive general-purpose computing task (such as defragmenting a hard drive, 3d rendering, heavy swapping, etc.), then it may cause Klipper to report print errors.
hu: Ha a Klipper gazdagép szoftvert egy megosztott általános célú asztali vagy szerver osztályú gépen szeretné futtatni, akkor vegye figyelembe, hogy a Klippernek vannak bizonyos valós idejű ütemezési követelményei. Ha a nyomtatás során a gazdaszámítógép egyidejűleg intenzív általános célú számítási feladatot is végez (például merevlemez defragmentálása, 3D renderelés, nagymértékű swapolás stb.), akkor a Klipper nyomtatási hibákat jelenthet.
it: Se stai cercando di eseguire il software host Klipper su un desktop generico condiviso o una macchina di classe server, tieni presente che Klipper ha alcuni requisiti di scheduling in tempo reale. Se, durante una stampa, il computer host esegue anche un'intensa attività di elaborazione generica (come deframmentazione di un disco rigido, rendering 3D, scambi pesanti e così via), Klipper potrebbe segnalare errori di stampa.
ko: 만약 일반 컴퓨터 또는 서버 시스템에서 Klipper 호스트 소프트웨어를 실행하려는 경우 Klipper에는 몇 가지 'real-time scheduling' 에 대한 요구 사항이 있습니다. 인쇄 중에 호스트 컴퓨터가 계산에 부하가 걸리는 컴퓨팅 작업(예: 하드 드라이브 조각 모음, 3d 렌더링, 대량 스와핑 등)을 수행하는 경우 Klipper가 출력 중 오류를 낼 수 있습니다.
zh_hant: 如果你想在共享的通用計算機或伺服器上執行 Klipper 主機程式，請注意 Klipper 有一些實時排程要求。如果在列印過程中，主機也在執行密集型的通用計算任務（如硬碟碎片整理、3D渲染、大量swapping （虛擬記憶體交換）等），可能會導致 Klipper 報告列印錯誤。

source: Note: If you are not using an OctoPi image, be aware that several Linux distributions enable a "ModemManager" (or similar) package that can disrupt serial communication. (Which can cause Klipper to report seemingly random "Lost communication with MCU" errors.) If you install Klipper on one of these distributions you may need to disable that package.
hu: Megjegyzés: Ha nem OctoPi-képet használsz, vedd figyelembe, hogy számos Linux-disztribúció engedélyez egy "ModemManager" (vagy hasonló) csomagot, amely megzavarhatja a soros kommunikációt. (Ami miatt a Klipper véletlenszerűnek tűnő "Elveszett a kommunikáció az MCU-val" hibákat jelenthet.) Ha a Klippert ilyen disztribúcióra telepíti, akkor lehet, hogy le kell tiltania ezt a csomagot.
it: Nota: se non stai utilizzando un'immagine OctoPi, tieni presente che diverse distribuzioni Linux abilitano un pacchetto "ModemManager" (o simile) che può interrompere la comunicazione seriale. (Il che può far sì che Klipper riporti errori apparentemente casuali "Comunicazione persa con MCU".) Se installi Klipper su una di queste distribuzioni potresti dover disabilitare quel pacchetto.
ko: 참고: OctoPi 이미지를 사용하지 않는 경우 여러 Linux 배포판에서 직렬 통신을 방해할 수 있는 "ModemManager"(또는 유사한) 패키지를 활성화한다는 점에 유의하십시오. (이로 인해 Klipper가 무작위로 보이는 "MCU와의 통신 끊김" 오류를 보고할 수 있습니다.) 이러한 배포판 중 하나에 Klipper를 설치하는 경우 해당 패키지를 비활성화해야 할 수 있습니다.
zh_hant: 注意：如果你沒有使用 OctoPi 映象，一些Linux發行版啟用了一個 "ModemManager"（或類似的）軟體包，它干擾序列通訊。(這可能導致 Klipper 報告看似隨機的 "與MCU失去通訊 "錯誤）。如果你在這些發行版上安裝Klipper，你可能需要禁用該軟體包。

source: Can I run multiple instances of Klipper on the same host machine?
hu: Futtathatom a Klipper több példányát ugyanazon a gépen?
it: Posso eseguire più istanze di Klipper sulla stessa macchina host?
ko: 동일한 호스트 시스템에서 여러 Klipper 인스턴스를 실행할 수 있습니까?
zh_hant: 我可以在同一臺主機上執行多個 Klipper 實例嗎？

source: It is possible to run multiple instances of the Klipper host software, but doing so requires Linux admin knowledge. The Klipper installation scripts ultimately cause the following Unix command to be run:
hu: Lehetséges a Klipper gazdagép szoftver több példányának futtatása, de ehhez Linux adminisztrátori ismeretekre van szükség. A Klipper telepítési szkriptek végül a következő Unix parancs futtatását eredményezik:
it: È possibile eseguire più istanze del software host Klipper, ma per farlo è necessaria la conoscenza dell'amministratore Linux. Gli script di installazione di Klipper determinano l'esecuzione del seguente comando Unix:
ko: Klipper 호스트 소프트웨어의 여러 인스턴스를 실행할 수 있지만 그렇게 하려면 Linux 관리자 지식이 필요합니다. Klipper 설치 스크립트는 궁극적으로 다음 Unix 명령이 실행되도록 합니다:
zh_hant: 可以執行 Klipper 主機軟體的多個實例，但這樣做需要一定的 Linux 知識。 Klipper 安裝指令碼最終會導致執行以下 Unix 命令：

source: One can run multiple instances of the above command as long as each instance has its own printer config file, its own log file, and its own pseudo-tty. For example:
hu: A fenti parancs több példányban is futtatható, amennyiben minden példánynak saját nyomtató-konfigurációs fájlja, saját naplófájlja és saját pszeudo-tty-je van. Például:
it: È possibile eseguire più istanze del comando precedente purché ogni istanza abbia il proprio file di configurazione della stampante, il proprio file di registro e il proprio pseudo-tty. Per esempio:
ko: 각 인스턴스에 자체 프린터 구성 파일, 자체 로그 파일 및 전용 tty가 있는 한 위 명령의 여러 인스턴스를 실행할 수 있습니다. 예를 들어:
zh_hant: 只要每個實例都有自己的印表機配置檔案、自己的日誌檔案和自己的偽 tty，就可以執行上述命令的多個實例。 例如：

source: If you choose to do this, you will need to implement the necessary start, stop, and installation scripts (if any). The [install-octopi.sh](../scripts/install-octopi.sh) script and the [klipper-start.sh](../scripts/klipper-start.sh) script may be useful as examples.
hu: Ha ezt választja, akkor a szükséges indítási, leállítási és telepítési parancsfájlokat (ha vannak ilyenek) kell végrehajtania. Az [install-octopi.sh](../scripts/install-octopi.sh) szkript és a [klipper-start.sh](../scripts/klipper-start.sh) szkript hasznos lehet példaként.
it: Se scegli di farlo, dovrai implementare gli script di avvio, arresto e installazione necessari (se presenti). Lo script [install-octopi.sh](../scripts/install-octopi.sh) e lo script [klipper-start.sh](../scripts/klipper-start.sh) possono essere utili come esempi.
ko: 만약 이런 방식으로 여러 개의 Klipper 를 사용하기를 선택하였다면 시작, 중지 및 설치 스크립트(있는 경우)를 구현해야 합니다. [install-octopi.sh](../scripts/install-octopi.sh) 스크립트와 [klipper-start.sh](../scripts/klipper-start.sh) 스크립트가 예제가 유용할 수 있습니다.
zh_hant: 如果你選擇這樣做，你將需要實現必要的啟動、停止和安裝指令碼。[install-octopi.sh](..../scripts/install-octopi.sh)和[klipper-start.sh](..../scripts/klipper-start.sh)指令碼提供了一些例子。

source: Do I have to use OctoPrint?
fr: Suis-je obligé d'utiliser Octoprint?
hu: Muszáj az OctoPrintet használnom?
it: Devo usare OctoPrint?
ko: OctoPrint를 사용해야 합니까?
zh_hant: 我必須使用 OctoPrint 嗎？

source: The Klipper software is not dependent on OctoPrint. It is possible to use alternative software to send commands to Klipper, but doing so requires Linux admin knowledge.
hu: A Klipper szoftver nem függ az OctoPrint-től. Lehetséges alternatív szoftvereket használni a Klipper parancsok küldésére, de ehhez Linux adminisztrátori ismeretekre van szükség.
it: Il software Klipper non dipende da OctoPrint. È possibile utilizzare un software alternativo per inviare comandi a Klipper, ma ciò richiede la conoscenza dell'amministratore Linux.
ko: Klipper 소프트웨어는 OctoPrint에 의존하지 않습니다. 대체 소프트웨어를 사용하여 Klipper에 명령을 보낼 수 있지만 그렇게 하려면 Linux 관리자 지식이 필요합니다.
zh_hant: Klipper 不依賴 OctoPrint。其他軟體也可以向 Klipper 發送命令，但這樣做可能需要一些 Linux 管理知識。

source: Klipper creates a "virtual serial port" via the "/tmp/printer" file, and it emulates a classic 3d-printer serial interface via that file. In general, alternative software may work with Klipper as long as it can be configured to use "/tmp/printer" for the printer serial port.
hu: A Klipper létrehoz egy "virtuális soros portot" a "/tmp/printer" fájlon keresztül, és ezen keresztül emulál egy klasszikus 3D nyomtató soros interfészt. Általánosságban elmondható, hogy alternatív szoftverek is működhetnek a Klipperrel, amennyiben konfigurálhatóak úgy, hogy a "/tmp/printer" -t használják a nyomtató soros portjaként.
it: Klipper crea una "porta seriale virtuale" tramite il file "/tmp/printer" ed emula una classica interfaccia seriale per stampante 3D tramite quel file. In generale, un software alternativo può funzionare con Klipper purché possa essere configurato per utilizzare "/tmp/printer" per la porta seriale della stampante.
ko: Klipper는 "/tmp/printer" 파일을 통해 "가상 직렬 포트"를 생성하고 해당 파일을 통해 고전적인 3d 프린터 직렬 인터페이스를 에뮬레이션 합니다. 일반적으로 프린터 직렬 포트에 "/tmp/printer"를 사용하도록 구성할 수 있는 한 대체 소프트웨어가 Klipper와 함께 작동할 수 있습니다.
zh_hant: Klipper 通過 「/tmp/printer」 檔案建立了一個「虛擬串列埠」，該檔案模擬了一個標準的3D印表機串列埠。理論上任何能配置並使用 「/tmp/printer」 作為印表機串列埠的軟體都可以與Klipper一起工作。

source: Why can't I move the stepper before homing the printer?
fr: Pourquoi ne puis-je pas commander un déplacement avant de prendre l'origine?
hu: Miért nem tudom mozgatni a léptetőmotort a nyomtató beállítása előtt?
it: Perché non riesco a spostare lo stepper prima di riposizionare la stampante?
ko: 프린터를 원점으로 이동하기 전에 스테퍼를 이동할 수 없는 이유는 무엇입니까?
zh_hant: 為什麼在歸位印表機之前我不能移動步進器？
