Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/FAQ.po
Languages: fr, hu, it, ko, zh_hant

source: Frequently Asked Questions
hu: Gyakran ismételt kérdések
it: Domande frequenti
ko: 자주 묻는 질문
zh_hant: 常見問題

source: Thanks. Kevin has a Patreon page at: <https://www.patreon.com/koconnor>
hu: Köszönöm. Kevinnek van egy Patreon oldala: <https://www.patreon.com/koconnor>
zh_hant: 謝謝。Kevin有一個PATREON頁面，地址是：<https://www.patreon.com/koconnor>

source: For running on the Beaglebone, see the [Beaglebone specific installation instructions](Beaglebone.md).
hu: A Beaglebone-on való futtatáshoz lásd a [Beaglebone-specifikus telepítési utasításokat](Beaglebone.md).
it: Per l'esecuzione su Beaglebone, vedere le [Istruzioni di installazione specifiche di Beaglebone](Beaglebone.md).
zh_hant: 要在Beaglebone上執行，請參閱[Beaglebone特別安裝說明](Beaglebone.md)。

source: If using a Raspberry Pi, use a [good quality power supply](https://www.raspberrypi.com/documentation/computers/raspberry-pi.html#power-supply) for the Raspberry Pi and use a [good quality USB cable](https://forums.raspberrypi.com/viewtopic.php?p=589877#p589877) to connect that power supply to the Pi. If you get "under voltage" warnings from OctoPrint, this is related to the power supply and it must be fixed.
hu: Ha Raspberry Pi-t használ, használjon [jó minőségű tápegységet](https://www.raspberrypi.com/documentation/computers/raspberry-pi.html#power-supply) a Raspberry Pi számára, és egy [jó minőségű USB-kábellel](https://forums.raspberrypi.com/viewtopic.php?p=589877#p589877) csatlakoztassa a tápegységet a Pihez. Ha az OctoPrint "feszültség alatt" figyelmeztetéseket kap, az a tápegységgel függ össze, és ezt meg kell javítani.
it: Se si utilizza un Raspberry Pi, utilizzare un [alimentatore di buona qualità](https://www.raspberrypi.com/documentation/computers/raspberry-pi.html#power-supply) per il Raspberry Pi e utilizzare un [cavo USB di buona qualità](https://forums.raspberrypi.com/viewtopic.php?p=589877#p589877) per collegare quell'alimentatore al Pi. Se ricevi avvisi di "sottotensione" da OctoPrint, questo è correlato all'alimentatore e deve essere risolto.
zh_hant: 如果使用樹莓派，請為樹莓派使用[優質電源](https://www.raspberrypi.com/documentation/computers/raspberry-pi.html#power-supply)，並使用[優質USB電纜](https://forums.raspberrypi.com/viewtopic.php?p=589877#p589877)將該電源與Pi連線。如果你從OctoPrint得到 "電壓不足 "的警告，這也與電源有關，必須解決。

source: [When I set `restart_method=command` my AVR device just hangs on a restart](#when-i-set-restart_methodcommand-my-avr-device-just-hangs-on-a-restart)
hu: [Amikor beállítom `restart_method=command`-ot az AVR készülékem újraindításkor csak lefagy](#when-i-set-restart_methodcommand-my-avr-device-just-hangs-on-a-restart)
zh_hant: [當我設定`restart_method=command`時，我的 AVR 裝置在重啟時掛起](#when-i-set-restart_methodcommand-my-avr-device-just-hangs-on-a-restart)

source: When I set `restart_method=command` my AVR device just hangs on a restart
hu: Amikor beállítom a `restart_method=command` az AVR készülékem újraindításkor egyszerűen lefagy
it: Quando imposto `restart_method=command` il mio dispositivo AVR si blocca al riavvio
zh_hant: 當設定`restart_method=command`時， AVR 裝置在重啟時就會宕機

source: [When I set "restart_method=command" my AVR device just hangs on a restart](#when-i-set-restart_methodcommand-my-avr-device-just-hangs-on-a-restart)
fr: [Lorsque je définis « restart_method=command » mon microcontrôleur AVR bloque pendant le redémarrage](#when-i-set-restart_methodcommand-my-avr-device-just-hangs-on-a-restart)
ko: ["restart_method=command"를 설정하면 AVR 장치가 다시 시작할 때 멈춥니다](#restart_method=command를-설정하면-AVR-장치가-다시-시작할-때-멈춥니다)

source: If using a Raspberry Pi, use a [good quality power supply](https://www.raspberrypi.org/documentation/hardware/raspberrypi/power/README.md) for the Raspberry Pi and use a [good quality USB cable](https://www.raspberrypi.org/forums/viewtopic.php?p=589877#p589877) to connect that power supply to the Pi. If you get "under voltage" warnings from OctoPrint, this is related to the power supply and it must be fixed.
ko: Raspberry Pi를 사용하는 경우 Raspberry Pi에 [good quality power supply](https://www.raspberrypi.org/documentation/hardware/raspberrypi/power/README.md) 를 사용하고 [good quality USB cable](https://www.raspberrypi.org/forums/viewtopic.php?p=589877#p589877)을 사용하여 해당 전원 공급 장치를 Pi에 연결합니다. OctoPrint에서 "전압 부족" 경고가 표시되면 이는 전원 공급 장치와 관련된 것이며 수정해야 합니다.

source: When I set "restart_method=command" my AVR device just hangs on a restart
fr: Lorsque je définis « restart_method=command » mon microcontrôleur AVR bloque pendant le redémarrage
ko: "restart_method=command"를 설정하면 AVR 장치가 다시 시작할 때 멈춥니다

source: Thank you for your support. See the [Sponsors page](Sponsors.md) for information.
it: Grazie per il vostro sostegno. Per informazioni, vedere la [Pagina degli sponsor](Sponsor.md).
