Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/FAQ.po
Languages: fr, hu, it, ko, zh_hant

source: [How can I donate to the project?](#how-can-i-donate-to-the-project)
fr: [Comment puis-je faire un don?](#how-can-i-donate-to-the-project)
hu: [Hogyan adományozhatok a projektnek?](#how-can-i-donate-to-the-project)
ko: [어떻게 프로젝트에 기부할수 있나요?](#어떻게-프로젝트에-기부할수-있나요)
zh_hant: [我怎樣才能支援專案？](#how-can-i-donate-to-the-project)

source: [How do I calculate the rotation_distance config parameter?](#how-do-i-calculate-the-rotation_distance-config-parameter)
fr: [Comment calculer le paramètre rotation_distance?](#how-do-i-calculate-the-rotation_distance-config-parameter)
hu: [Hogyan számíthatom ki a rotation_distance konfigurációs paramétert?](#how-do-i-calculate-the-rotation_distance-config-parameter)
ko: [rotation_distance는 어떻게 계산합니까?](#rotation_distance는-어떻게-계산합니까)
zh_hant: [如何計算rotation_distance配置參數？](#how-do-i-calculate-the-rotation_distance-config-parameter)

source: [Where's my serial port?](#wheres-my-serial-port)
fr: [Où est mon port série?](#wheres-my-serial-port)
hu: [Hol van a soros portom?](#wheres-my-serial-port)
ko: [내 시리얼 포트는 어디에 있습니까?](#내-시리얼-포트는-어디에-있습니까)
zh_hant: [我的串列埠在哪裡找？](#wheres-my-serial-port)

source: [When the micro-controller restarts the device changes to /dev/ttyUSB1](#when-the-micro-controller-restarts-the-device-changes-to-devttyusb1)
fr: [Quand le microcontrôleur redémarre le port du périphérique change pour /dev/ttyUSB1](#when-the-micro-controller-restarts-the-device-changes-to-devttyusb1)
hu: [Amikor a mikrokontroller újraindítja az eszközt /dev/ttyUSB1-re változik](#when-the-micro-controller-restarts-the-device-changes-to-devttyusb1)
ko: [마이크로 컨트롤러가 다시 시작되면 장치가 /dev/ttyUSB1 로 변경됩니다](#마이크로-컨트롤러가-다시-시작되면-장치가-devttyUSB1-로-변경됩니다)
zh_hant: [當微控制器重啟裝置更改為/dev/ttyUSB1](#when-the-micro-controller-restarts-the-device-changes-to-devttyusb1)

source: [The "make flash" command doesn't work](#the-make-flash-command-doesnt-work)
fr: [La commande "make flash" ne fonctionne pas](#the-make-flash-command-doesnt-work)
hu: [A "make flash" parancs nem működik](#the-make-flash-command-doesnt-work)
ko: ["make flash" 가 동작하지 않습니다](#make-flash-가-동작하지-않습니다)
zh_hant: [「make flash」命令不起作用](#the-make-flash-command-doesnt-work)

source: [How do I change the serial baud rate?](#how-do-i-change-the-serial-baud-rate)
fr: [Comment changer le baud rate (taux bit/s) du port série?](#how-do-i-change-the-serial-baud-rate)
hu: [Hogyan változtathatom meg a soros port átviteli sebességét?](#how-do-i-change-the-serial-baud-rate)
ko: [시리얼 포트 전송 속도는 어떻게 변경합니까?](#시리얼-포트-전송-속도는-어떻게-변경합니까)
zh_hant: [如何更改串列埠波特率？](#how-do-i-change-the-serial-baud-rate)

source: [Can I run Klipper on something other than a Raspberry Pi 3?](#can-i-run-klipper-on-something-other-than-a-raspberry-pi-3)
fr: [Puis-je faire fonctionner Klipper sur quelque chose d'autre qu'un Raspberry Pi 3?](#can-i-run-klipper-on-something-other-than-a-raspberry-pi-3)
hu: [Futtathatom a Klippert máson is, mint egy Raspberry Pi 3?](#can-i-run-klipper-on-something-other-than-a-raspberry-pi-3)
ko: [Raspberry Pi 3 이외의 다른 기기에서 Klipper를 실행할 수 있습니까?](#Raspberry-Pi-3-이외의-다른-기기에서-Klipper를-실행할-수-있습니까)
zh_hant: [我可以在 Raspberry Pi 3 以外的其他裝置上執行 Klipper 嗎？](#can-i-run-klipper-on-something-other-than-a-raspberry-pi-3)

source: [Can I run multiple instances of Klipper on the same host machine?](#can-i-run-multiple-instances-of-klipper-on-the-same-host-machine)
hu: [Futtathatom a Klipper több példányát ugyanazon a gépen?](#can-i-run-multiple-instances-of-klipper-on-the-same-host-machine)
ko: [동일한 호스트 시스템에서 여러 Klipper 인스턴스를 실행할 수 있습니까?](#동일한-호스트-시스템에서-여러-Klipper-인스턴스를-실행할-수-있습니까)
zh_hant: [我可以在同一臺主機上執行多個 Klipper 實例嗎？](#can-i-run-multiple-instances-of-klipper-on-the-same-host-machine)

source: [Do I have to use OctoPrint?](#do-i-have-to-use-octoprint)
fr: [Suis-je obligé d'utiliser OctoPrint?](#do-i-have-to-use-octoprint)
hu: [Muszáj az OctoPrintet használnom?](#do-i-have-to-use-octoprint)
ko: [OctoPrint를 사용해야 합니까?](#OctoPrint를-사용해야-합니까)
zh_hant: [我必須使用 OctoPrint 嗎？](#do-i-have-to-use-octoprint)

source: [Why can't I move the stepper before homing the printer?](#why-cant-i-move-the-stepper-before-homing-the-printer)
fr: [Pourquoi ne puis-je pas commander un déplacement avant de prendre l'origine?](#why-cant-i-move-the-stepper-before-homing-the-printer)
hu: [Miért nem tudom mozgatni a léptetőt a nyomtató indítása előtt?](#why-cant-i-move-the-stepper-before-homing-the-printer)
ko: [프린터를 원점으로 이동하기 전에 스테퍼를 이동할 수 없는 이유는 무엇입니까?](#프린터를-원점으로-이동하기-전에-스테퍼를-이동할-수-없는-이유는-무엇입니까)
zh_hant: [為什麼我不能在歸位印表機之前移動步進器？](#why-cant-i-move-the-stepper-before-homing-the-printer)

source: [Why is the Z position_endstop set to 0.5 in the default configs?](#why-is-the-z-position_endstop-set-to-05-in-the-default-configs)
fr: [Pourquoi le paramètre position_endstop Z est-il défini à 0.5 dans la configuration par défaut?](#why-is-the-z-position_endstop-set-to-05-in-the-default-configs)
hu: [Miért van a Z position_endstop 0.5-re állítva az alapértelmezett konfigurációban?](#why-is-the-z-position_endstop-set-to-05-in-the-default-configs)
ko: [기본 설정에서 Z position_endstop이 0.5로 설정된 이유는 무엇입니까?](#기본-설정에서-Z-position_endstop이-0.5로-설정된-이유는-무엇입니까)
zh_hant: [為什麼預設配置中的 Z position_endstop 設定為 0.5？](#why-is-the-z-position_endstop-set-to-05-in-the-default-configs)

source: [I converted my config from Marlin and the X/Y axes work fine, but I just get a screeching noise when homing the Z axis](#i-converted-my-config-from-marlin-and-the-xy-axes-work-fine-but-i-just-get-a-screeching-noise-when-homing-the-z-axis)
fr: [J'ai converti ma configuration à partir de Marlin et les axes X/Y fonctionnent correctement mais j'ai un bruit strident lors de la prise d'origine de l'axe Z](#i-converted-my-config-from-marlin-and-the-xy-axes-work-fine-but-i-just-get-a-screeching-noise-when-homing-the-z-axis)
hu: [Áthoztam a konfigurációmat Marlinból, és az X/Y tengelyek jól működnek, de a Z tengely kezdőpont felvételekor csak egy csikorgó zajt hallok](#i-converted-my-config-from-marlin-and-the-xy-axes-work-fine-but-i-just-get-a-screeching-noise-when-homing-the-z-axis)
ko: [Marlin에서 설정을 가져왔는데 X/Y 축은 잘 작동하지만 Z 축을 원점 복귀할 때 삐걱거리는 소리가 납니다](#Marlin에서-설정을-가져왔는데-XY-축은-잘-작동하지만-Z-축을-원점-복귀할-때-삐걱거리는-소리가-납니다)
zh_hant: [我從 Marlin 轉換了我的配置，X/Y 軸工作正常，但在 Z 軸歸位時我只會聽到刺耳的噪音](#i-converted-my-config-from-marlin-and-the-xy-axes-work-fine-but-i-just-get-a-screeching-noise-when-homing-the-z-axis)

source: [My TMC motor driver turns off in the middle of a print](#my-tmc-motor-driver-turns-off-in-the-middle-of-a-print)
fr: [Mes pilotes de moteur TMC s'arrêtent en plein milieu d'une impression](#my-tmc-motor-driver-turns-off-in-the-middle-of-a-print)
hu: [A TMC motorvezérlő kikapcsol a nyomtatás közepén](#my-tmc-motor-driver-turns-off-in-the-middle-of-a-print)
ko: [TMC 모터 드라이버가 인쇄 도중에 꺼집니다](#TMC-모터-드라이버가-인쇄-도중에-꺼집니다)
zh_hant: [我的 TMC 電機驅動程式在列印過程中關閉](#my-tmc-motor-driver-turns-off-in-the-middle-of-a-print)

source: [I keep getting random "Lost communication with MCU" errors](#i-keep-getting-random-lost-communication-with-mcu-errors)
fr: [J'ai des erreurs aléatoires "Lost communication with MCU" \(communication perdue avec le microcontrôleur)] (#i-keep-getting-random-lost-communication-with-mcu-errors)
hu: [Véletlenszerű "Elveszett a kommunikáció az MCU-val" hibák](#i-keep-getting-random-lost-communication-with-mcu-errors)
ko: [랜덤하게 "MCU와의 통신 끊김" 오류가 계속 발생합니다](#랜덤하게-MCU와의-통신-끊김-오류가-계속-발생합니다)
zh_hant: [我不斷收到隨機的「與 MCU 失去通訊」錯誤](#i-keep-getting-random-lost-communication-with-mcu-errors)

source: [My Raspberry Pi keeps rebooting during prints](#my-raspberry-pi-keeps-rebooting-during-prints)
fr: [Mon Raspberry Pi redémarre pendant les impressions](#my-raspberry-pi-keeps-rebooting-during-prints)
hu: [A Raspberry Pi újraindul nyomtatás közben](#my-raspberry-pi-keeps-rebooting-during-prints)
ko: [Raspberry Pi가 인쇄 중에 계속 재부팅됩니다](#Raspberry-Pi가-인쇄-중에-계속-재부팅됩니다.)
zh_hant: [我的樹莓派在列印過程中不斷重啟](#my-raspberry-pi-keeps-rebooting-during-prints)

source: [Will the heaters be left on if the Raspberry Pi crashes?](#will-the-heaters-be-left-on-if-the-raspberry-pi-crashes)
fr: [Est-ce que les éléments chauffants restent allumés si le Raspberry Pi plante?](#will-the-heaters-be-left-on-if-the-raspberry-pi-crashes)
hu: [A fűtőelemek bekapcsolva maradnak, ha a Raspberry Pi összeomlik?](#will-the-heaters-be-left-on-if-the-raspberry-pi-crashes)
ko: [Raspberry Pi가 비정상 종료하면 히터가 켜져 있습니까?](#Raspberry-Pi가-비정상-종료하면-히터가-켜져-있습니까)
zh_hant: [如果 Raspberry Pi 崩潰，加熱器會繼續打開嗎？](#will-the-heaters-be-left-on-if-the-raspberry-pi-crashes)

source: [How do I convert a Marlin pin number to a Klipper pin name?](#how-do-i-convert-a-marlin-pin-number-to-a-klipper-pin-name)
fr: [Comment puis-je convertir des noms broches de Marlin à Klipper?](#how-do-i-convert-a-marlin-pin-number-to-a-klipper-pin-name)
hu: [Hogyan konvertálhatok egy Marlin tűszámot egy Klipper tűnévre?](#hogyan-alakithatok-at-egy-marlin-tu-szamot-klipper-tu-nevre)
ko: [Marlin 핀 번호를 Klipper 핀 이름으로 어떻게 변환합니까?](#Marlin-핀-번호를-Klipper-핀-이름으로-어떻게-변환합니까)
zh_hant: [如何將 Marlin 引腳編號轉換為 Klipper 引腳名稱？](#how-do-i-convert-a-marlin-pin-number-to-a-klipper-pin-name)

source: [Do I have to wire my device to a specific type of micro-controller pin?](#do-i-have-to-wire-my-device-to-a-specific-type-of-micro-controller-pin)
fr: [Dois-je connecter mon appareil à un type spécifique de broche de microcontrôleur?](#do-i-have-to-wire-my-device-to-a-specific-type-of-micro-controller-pin)
hu: [Az eszközömet egy adott típusú mikrokontroller tűhöz kell csatlakoztatnom?](#az-eszkozomet-egy-adott-tipusu-mikrokontroller-tuhoz-kell-csatlakoztatnom)
ko: [내 장치를 특정 유형의 마이크로 컨트롤러 핀에 연결해야 합니까?](#내-장치를-특정-유형의-마이크로-컨트롤러-핀에-연결해야-합니까)
zh_hant: [我必須將我的裝置連線到特定型別的微控制器引腳嗎？](#do-i-have-to-wire-my-device-to-a-specific-type-of-micro-controller-pin )

source: [How do I cancel an M109/M190 "wait for temperature" request?](#how-do-i-cancel-an-m109m190-wait-for-temperature-request)
fr: [Comment annuler une commande M109/M190 « attendre la température » ?](#how-do-i-cancel-an-m109m190-wait-for-temperature-request)
hu: [Hogyan tudom törölni az M109/M190 "várakozás a hőmérsékletre" kérést?](#hogyan-tudom-torolni-az-m109m190-homersekletre-varni-kerest)
ko: [M109/M190 "wait for temperature" 요청을 어떻게 취소합니까?](#M109/M190-wait-for-temperature-요청을-어떻게-취소합니까)
zh_hant: [我如何取消 M109/M190「等待溫度」請求？](#how-do-i-cancel-an-m109m190-wait-for-temperature-request)

source: [Can I find out whether the printer has lost steps?](#can-i-find-out-whether-the-printer-has-lost-steps)
fr: [Comment savoir si l'imprimante a perdu des pas?](#can-i-find-out-whether-the-printer-has-lost-steps)
hu: [Megtudhatom, hogy a nyomtató vesztett-e lépéseket?](#meg-tudom-allapitani-hogy-a-nyomtato-vesztett-e-lepeseket)
ko: [프린터 탈조를 어떻게 알 수 있습니까?](#프린터-탈조를-어떻게-알-수-있습니까)
zh_hant: [可以查一下印表機是否丟步嗎？](#can-i-find-out-whether-the-printer-has-lost-steps)

source: [Why does Klipper report errors? I lost my print!](#why-does-klipper-report-errors-i-lost-my-print)
fr: [Pourquoi Klipper signale-t-il des erreurs? J’ai raté mon impression!](#why-does-klipper-report-errors-i-lost-my-print)
hu: [Miért jelent hibát a Klipper? Elrontotta a nyomtatásomat!](#miert-jelent-hibat-a-klipper-elrontotta-a-nyomtatasomat)
ko: [Klipper가 "I lost my print" 오류를 보고하는 이유는 무엇입니까?](#Klipper가-I-lost-my-print-오류를-보고하는-이유는-무엇입니까)
zh_hant: [為什麼Klipper會報錯？ 我列印的檔案丟了！](#why-does-klipper-report-errors-i-lost-my-print)

source: [How do I upgrade to the latest software?](#how-do-i-upgrade-to-the-latest-software)
fr: [Comment mettre à jour vers la dernière version du logiciel?](#how-do-i-upgrade-to-the-latest-software)
hu: [Hogyan frissíthetek a legújabb szoftverre?](#hogyan-frissithetek-a-legujabb-szoftverre)
ko: [최신 소프트웨어로 업그레이드하려면 어떻게 합니까?](#최신-소프트웨어로-업그레이드하려면-어떻게-합니까)
zh_hant: [如何升級到最新軟體？](#how-do-i-upgrade-to-the-latest-software)

source: [How do I uninstall klipper?](#how-do-i-uninstall-klipper)
fr: [Comment désinstaller klipper?](#how-do-i-uninstall-klipper)
hu: [Hogyan távolítsam el a klippert?](#hogyan-tudom-eltavolitani-a-klippert)
ko: [Klipper를 어떻게 제거합니까?](#Klipper를-어떻게-제거합니까)
zh_hant: [如何解除安裝 klipper？](#how-do-i-uninstall-klipper)

source: How can I donate to the project?
fr: Comment puis-je faire un don au projet?
hu: Hogyan adományozhatok a projektnek?
it: Come posso donare al progetto?
ko: 어떻게 프로젝트에 기부할수 있나요?
zh_hant: 我如何向專案捐款？

source: How do I calculate the rotation_distance config parameter?
fr: Comment calculer le paramètre de configuration rotation_distance?
hu: Hogyan számítom ki a rotation_distance konfigurációs paramétert?
it: Come faccio a calcolare il parametro di configurazione rotation_distance?
ko: rotation_distance는 어떻게 계산합니까?
zh_hant: 如何計算 rotation_distance 配置參數？

source: See the [rotation distance document](Rotation_Distance.md).
hu: Lásd a [forgási távolság dokumentumot](Rotation_Distance.md).
it: Vedere il [rotation distance document](Rotation_Distance.md).
ko: 이 문서를 [rotation distance document](Rotation_Distance.md) 보세요.
zh_hant: 參見[旋轉距離文件](Rotation_Distance.md)。

source: Where's my serial port?
fr: Où est mon port série?
hu: Hol van a soros portom?
it: Dov'è la mia porta seriale?
ko: 내 시리얼 포트는 어디에 있습니까?
zh_hant: 我的串列埠在哪裡找？

source: The general way to find a USB serial port is to run `ls /dev/serial/by-id/*` from an ssh terminal on the host machine. It will likely produce output similar to the following:
fr: De manière générale, on exécute la commande `ls /dev/serial/by-id/*` à partir d'un terminal ssh sur la machine hôte pour trouver un port série USB. Cette commande produira sûrement un résultat similaire à celui-ci:
hu: Az USB soros port megtalálásának általános módja az `ls /dev/serial/by-id/*` futtatása a gazdaszámítógép SSH termináljáról. Valószínűleg a következőhöz hasonló kimenetet fog eredményezni:
it: Il modo generico per trovare una porta seriale USB è eseguire `ls /dev/serial/by-id/*` da un terminale ssh sulla macchina host. Probabilmente produrrà un output simile al seguente:
ko: USB 직렬 포트를 찾는 일반적인 방법은 호스트 시스템의 ssh 터미널에서 다음의 명령을 실행하면 됩니다. `ls /dev/serial/by-id/*`. 그럼 다음과 같이 나옵니다:
zh_hant: 查詢 USB 串列埠的一般方法是從主機上的 ssh 終端執行 `ls /dev/serial/by-id/*`。 它可能會產生類似於以下內容的輸出：

source: The name found in the above command is stable and it is possible to use it in the config file and while flashing the micro-controller code. For example, a flash command might look similar to:
fr: Le nom retourné par la commande ci-dessus est constant et il est possible de l'utiliser dans le fichier de configuration et lors du flashage du microcontrôleur. Par exemple, une commande de flash peur ressembler à:
hu: A fenti parancsban található név stabil, és használható a konfigurációs fájlban és a mikrokontroller kódjának égetése során. Egy égetés parancs például így nézhet ki:
it: Il nome trovato nel comando precedente è stabile ed è possibile utilizzarlo nel file di configurazione e durante il flashing del codice del microcontrollore. Ad esempio, un comando flash potrebbe essere simile a:
ko: 위 명령에서 찾은 이름을 사용해서 config 파일에 적을 수도 있고 마이크로 컨트롤러에 펌웨어 업로드 할때도 사용됩니다. 예를 들어 flash 명령은 다음과 같이 사용할 수 있습니다:
zh_hant: 在上述命令中找到的名稱是穩定的，可以在配置檔案中使用它，同時可用於刷寫微控制器的程式碼。 例如，一個 flash 命令：

source: and the updated config might look like:
fr: Et la configuration mise à jour devrait ressembler à:
hu: és a frissített konfiguráció így nézhet ki:
it: e la configurazione aggiornata potrebbe essere simile a:
ko: 그리고 config 파일을 보면 아래와 같이 mcu 항목이 작성되어 있습니다:
zh_hant: 更新后的配置可能如下所示：

source: Be sure to copy-and-paste the name from the "ls" command that you ran above as the name will be different for each printer.
fr: Veillez à copier-coller le nom retourné par la commande "ls" que vous avez exécutée ci-avant, car le nom sera différent pour chaque imprimante.
hu: Ügyeljen arra, hogy a fent lefuttatott "ls" parancsból másolja be a nevet, mivel a név minden nyomtatónál más lesz.
it: Assicurati di copiare e incollare il nome dal comando "ls" che hai eseguito sopra poiché il nome sarà diverso per ciascuna stampante.
ko: 그곳에 ls 명령어로 찾은 시리얼 내용을 복사하여 넣으십시오. 내용은 프린터에 따라 다를 수 있습니다.
zh_hant: 請務必從上面執行的「ls」命令中複製並貼上名稱，因為每個印表機的名稱都不同。

source: If you are using multiple micro-controllers and they do not have unique ids (common on boards with a CH340 USB chip) then follow the directions above using the command `ls /dev/serial/by-path/*` instead.
fr: Si vous utilisez plusieurs microcontrôleurs et qu'ils n'ont pas d'identifiant unique (fréquent avec les cartes utilisant une puce USB CH340), suivez les instructions ci-dessus en utilisant la commande `ls /dev/serial/by-path/*` à la place.
hu: Ha több mikrovezérlőt használsz, és ezek nem rendelkeznek egyedi azonosítóval (ez gyakori a CH340 USB-chippel ellátott lapokon), akkor kövesd a fenti utasításokat a `ls /dev/serial/by-path/*` parancs használatával.
it: Se stai usando più microcontrollori e non hanno ID univoci (comune sulle schede con un chip USB CH340), segui invece le indicazioni sopra usando il comando `ls /dev/serial/by-path/*`.
ko: 여러 개의 마이크로컨트롤러를 사용하고 있는데 마이크로컨트롤러의 고유 ID(`ls '/dev/serial/by-id/`)가 없는 경우에는 대신 `ls /dev/serial/by-path/*` 명령을 사용하여 위의 지침을 따르십시오.
zh_hant: 如果您使用多個微控制器並且它們沒有唯一的 ID（在帶有 CH340 USB 晶片的板上很常見），那麼請按照上面的說明使用命令 `ls /dev/serial/by-path/*` 代替。

source: When the micro-controller restarts the device changes to /dev/ttyUSB1
fr: Lorsque le microcontrôleur redémarre, le périphérique passe à /dev/ttyUSB1
hu: A mikrokontroller újraindításakor az eszköz /dev/ttyUSB1-re változik
it: Quando il microcontrollore si riavvia, il dispositivo cambia in /dev/ttyUSB1
ko: 마이크로 컨트롤러가 다시 시작되면 장치가 /dev/ttyUSB1 로 변경됩니다
zh_hant: 當微控制器重新啟動裝置更改為/dev/ttyUSB1

source: Follow the directions in the "[Where's my serial port?](#wheres-my-serial-port)" section to prevent this from occurring.
hu: Kövesse a "[Hol van a soros portom?](#hol-van-a-soros-portom)" szakaszban található utasításokat, hogy ezt megakadályozza.
it: egui le istruzioni nella sezione "[Where's my serial port?](#wheres-my-serial-port)" per evitare che ciò accada.
ko: 링크의 지침을 따르면 "[내 시리얼 포트는 어디에 있습니까?](#내-시리얼-포트는-어디에-있습니까)" 문제 해결이 가능합니다.
zh_hant: 按照「[我的串列埠在哪裡找？](#wheres-my-serial-port)」部分中的說明來防止這種情況發生。

source: The "make flash" command doesn't work
hu: A "make flash" parancs nem működik
it: Il comando "make flash" non funziona
ko: "make flash" 가 동작하지 않습니다
zh_hant: 「make flash」命令不起作用

source: The code attempts to flash the device using the most common method for each platform. Unfortunately, there is a lot of variance in flashing methods, so the "make flash" command may not work on all boards.
hu: A kód megpróbálja az eszközt az egyes platformok esetében legelterjedtebb módszerrel égetni. Sajnos az égetési módszerek között nagy eltérések vannak, így a "make flash" parancs nem biztos, hogy minden lapon működik.
it: Il codice tenta di eseguire il flashing del dispositivo utilizzando il metodo più comune per ciascuna piattaforma. Sfortunatamente, c'è molta variabilità nei metodi di flashing, quindi il comando "make flash" potrebbe non funzionare su tutte le schede.
ko: "make flash" 명령어는 가장 일반적인 방법을 사용하여 펌웨어 업로드를 시도합니다. 불행히도 각 플랫폼마다 펌웨어 업로드하는 방법에는 많은 차이가 있습니다. 따라서 "make flash" 명령이 모든 보드에서 작동하지 않을 수 있습니다.
zh_hant: 該程式碼嘗試使用每個平臺最常用的方法來刷寫裝置。 不幸的是，刷寫方法存在很多差異，因此「make flash」命令可能不適用于所有主板。

source: If you're having an intermittent failure or you do have a standard setup, then double check that Klipper isn't running when flashing (sudo service klipper stop), make sure OctoPrint isn't trying to connect directly to the device (open the Connection tab in the web page and click Disconnect if the Serial Port is set to the device), and make sure FLASH_DEVICE is set correctly for your board (see the [question above](#wheres-my-serial-port)).
fr: Si vous rencontrez une erreur intermittente ou si votre configuration est standard, vérifiez que Klipper est arrêté pendant le flashage (sudo service klipper stop), assurez-vous qu'OctoPrint n'essaye pas de se connecter directement à l'appareil (ouvrez l'onglet Connexion de la page web et cliquez sur Déconnecter si le port série de la carte est sélectionné), et assurez-vous que FLASH_DEVICE est correctement défini pour votre carte (voir la [question ci-dessus](#wheres-my-serial-port)).
hu: Ha időszakos hiba van, vagy szabványos beállításod van, akkor ellenőrizd, hogy a Klipper nem fut-e égetés közben (sudo service klipper stop), győződj meg róla, hogy az OctoPrint nem próbál közvetlenül az eszközhöz csatlakozni (nyisd meg a weblapon a Kapcsolat lapot, és kattints a Kapcsolat megszakítása gombra, ha a soros port az eszközhöz van beállítva), és győződj meg róla, hogy a FLASH_DEVICE helyesen van beállítva a lapodhoz (lásd a fenti [kérdést](#hol-van-a-soros-portom)).
it: Se si verifica un errore intermittente o si dispone di una configurazione standard, ricontrolla che Klipper non sia in esecuzione durante il flashing (sudo service klipper stop), assicurati che OctoPrint non stia tentando di connettersi direttamente al dispositivo (apri il scheda Connessione nella pagina Web e fare clic su Disconnetti se la porta seriale è impostata sul dispositivo) e assicurarsi che FLASH_DEVICE sia impostato correttamente per la scheda (consultare la [question above](#wheres-my-serial-port).
ko: 만약 간헐적인 오류가 발생하거나 표준 설정을 잘 따르고 있다면, 펌웨어 업로드는 하는 동안 Klipper가 실행되고 있지 않은지 다시 확인하십시오 (sudo service klipper stop), 또한 OctoPrint가 실행되고 있는지도 확인하십시오 (Octoprint 프린터 연결 해제를 클릭합니다), 그리고 나서 FLASH_DEVICE가 보드에 대해 올바르게 설정되어 있는지 확인하십시오. (참조 [위 질문](#내-시리얼-포트는-어디에-있습니까)).
zh_hant: 如果您遇到間歇性故障或您確實有標準設定，請仔細檢查刷寫時 Klipper 是否未執行（sudo service klipper stop），確保 OctoPrint 未嘗試直接連線到裝置（打開 網頁中的連線選項卡，如果串列埠設定為裝置，則單擊斷開連線），並確保為您的電路板正確設定了 FLASH_DEVICE（請參閱[上面的問題](#wheres-my-serial-port)）。
