Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/FAQ.po
Languages: fr, hu, it, ko, zh_hant

source: The code does this to reduce the chance of accidentally commanding the head into the bed or a wall. Once the printer is homed the software attempts to verify each move is within the position_min/max defined in the config file. If the motors are disabled (via an M84 or M18 command) then the motors will need to be homed again prior to movement.
fr: Le code fait cela pour réduire le risque de déplacer accidentellement la tête dans le lit ou dans un mur. Une fois que la prise d'origine est effectuée, le logiciel vérifie que chaque mouvement se situe dans les limites de position_min/max définies dans le fichier de configuration. Si les moteurs sont désactivés (via une commande M84 ou M18), les moteurs devront reprendre l'origine avant tout mouvement.
hu: A kód ezt azért teszi, hogy csökkentse annak esélyét, hogy a fejet véletlenül az ágyba vagy a falba ütköztesse. Miután a nyomtató kezdőponthoz ért, a szoftver megpróbálja ellenőrizni, hogy minden egyes mozgás a konfigurációs fájlban meghatározott position_min/max értéken belül van-e. Ha a motorok ki vannak kapcsolva (M84 vagy M18 parancs segítségével), akkor a motorokat a mozgás előtt újra be kell állítani.
it: Il codice fa questo per ridurre la possibilità di comandare accidentalmente la testa nel piatto o altri limiti. Una volta che la stampante è stata localizzata, il software tenta di verificare che ogni mossa rientri nella posizione_min/max definita nel file di configurazione. Se i motori sono disabilitati (tramite un comando M84 o M18), i motori dovranno essere nuovamente riposizionati prima del movimento.
ko: 이 기능은 실수로 익스트루더를 BED 나 벽에 부딪힐 가능성을 줄이기 위함입니다. 프린터가 홈으로 이동하면 소프트웨어는 각 이동이 구성 파일에 정의된 position_min/max 내에 있는지 확인하려고 시도합니다. 모터가 비활성화된 경우 (M84 또는 M18 명령을 통해)도 모터는 이동하기 전에 다시 원점 복귀해야 합니다.
zh_hant: 程式碼這樣做是爲了減少意外將頭撞到床或墻壁的機會。 印表機歸位后，軟體會嘗試驗證每個移動是否在配置檔案中定義的 position_min/max 範圍內。 如果電機被禁用（通過 M84 或 M18 命令），那麼電機將需要在運動前再次歸位。

source: If you want to move the head after canceling a print via OctoPrint, consider changing the OctoPrint cancel sequence to do that for you. It's configured in OctoPrint via a web browser under: Settings->GCODE Scripts
fr: Si vous souhaitez déplacer la tête après avoir annulé une impression via OctoPrint, pensez à modifier la séquence d'annulation d'OctoPrint pour qu'elle le fasse pour vous. Depuis un navigateur web, elle est configurée dans OctoPrint sous : Paramètres->Scripts GCODE
hu: Ha a fejet az OctoPrint segítségével történő nyomtatás törlése után szeretné elmozdítani, fontolja meg az OctoPrint törlési sorrendjének módosítását, hogy ezt megtegye Ön helyett. Ez az OctoPrintben a webböngészőn keresztül konfigurálható a következő menüpont alatt: Beállítások->GCODE szkriptek
it: Se desideri spostare la testina dopo aver annullato una stampa tramite OctoPrint, considera di modificare la sequenza di annullamento di OctoPrint per farlo per te. È configurato in OctoPrint tramite un browser web in: Impostazioni-> Script GCODE | Settings->GCODE Scripts
ko: OctoPrint를 통해 인쇄를 취소한 후 헤드를 이동하려면 OctoPrint 취소 순서를 변경하는 것이 좋습니다. 설정->GCODE 스크립트 아래의 웹 브라우저를 통해 OctoPrint에서 구성됩니다
zh_hant: 如果您想在通過 OctoPrint 取消列印后移動列印頭，請考慮更改 OctoPrint 取消順序來為您執行此操作。 它是通過 Web 瀏覽器在 OctoPrint 中配置的：設定-> GCODE 指令碼

source: If you want to move the head after a print finishes, consider adding the desired movement to the "custom g-code" section of your slicer.
fr: Si vous souhaitez déplacer la tête après la fin d'une impression, pensez à ajouter le mouvement souhaité à la section "G-Code personnalisé" de votre slicer.
hu: Ha a nyomtatás befejezése után szeretné mozgatni a fejet, fontolja meg a kívánt mozgás hozzáadását a szeletelő "custom g-code" szakaszához.
it: Se desideri spostare la testina al termine di una stampa, considera di aggiungere il movimento desiderato alla sezione "G-code personalizzato" del tuo slicer.
ko: 인쇄가 완료된 후 헤드를 이동하려면 슬라이서의 "custom g-code" 섹션에 원하는 이동을 추가하는 것이 좋습니다.
zh_hant: 如果您想在列印完成後移動頭部，請考慮將所需的移動新增到切片機的「自定義 g 程式碼」部分。

source: If the printer requires some additional movement as part of the homing process itself (or fundamentally does not have a homing process) then consider using a safe_z_home or homing_override section in the config file. If you need to move a stepper for diagnostic or debugging purposes then consider adding a force_move section to the config file. See [config reference](Config_Reference.md#customized_homing) for further details on these options.
hu: Ha a nyomtatónak szüksége van további mozgatásra a kezdőpont felvételi folyamat részeként (vagy alapvetően nincs kezdőpont felvételi folyamat), akkor fontolja meg a safe_z_home vagy homing_override szakasz használatát a konfigurációs fájlban. Ha diagnosztikai vagy hibakeresési célokra kell mozgatni egy léptetőmotort, akkor fontolja meg egy force_move szakasz hozzáadását a konfigurációs fájlhoz. Lásd [konfigurációs hivatkozást](Config_Reference.md#testreszabott-kezdopont-felvetel) az ezen opciókkal kapcsolatos további részletekért.
it: Se la stampante richiede un movimento aggiuntivo come parte del processo stesso di homing (o fondamentalmente non ha un processo di homing), considera l'utilizzo di una sezione safe_z_home o homing_override nel file di configurazione. Se è necessario spostare uno stepper per scopi diagnostici o di debug, considerare l'aggiunta di una sezione force_move al file di configurazione. Vedere [config reference](Config_Reference.md#customized_homing) per ulteriori dettagli su queste opzioni.
ko: 만일 프린터가 오토홈을 할때 추가적인 작업이 필요한 경우 (또는 근본적으로 오토홈 프로세스가 없는 경우) config 파일에서 safe_z_home 또는 homing_override 섹션 사용을 고려하십시오. 진단 또는 디버깅 목적으로 스테퍼를 이동해야 하는 경우 config 파일에 force_move 섹션을 추가하는 것을 고려하십시오. 이러한 옵션에 대한 자세한 내용은 [config reference](Config_Reference.md#customized_homing)을 참조를 참조하세요.
zh_hant: 如果印表機歸位過程中需要一些額外的移動（或者根本上沒有歸位運動），那麼可以在配置檔案中定義safe_z_home或 homing_override分段。如果你需要為診斷或除錯目的移動一個步進，可以在配置檔案中新增一個 force_move 分段。參見[配置參考](Config_Reference.md#customized_homing)以瞭解關於這些選項的詳情。

source: Why is the Z position_endstop set to 0.5 in the default configs?
fr: Pourquoi le paramètre position_endstop Z est-il défini à 0.5 dans la configuration par défaut?
hu: Miért van a Z position_endstop 0,5-re állítva az alapértelmezett konfigurációban?
it: Perché Z position_endstop è impostato su 0.5 nelle configurazioni predefinite?
ko: 기본 설정에서 Z position_endstop이 0.5로 설정된 이유는 무엇입니까?
zh_hant: 為什麼 Z position_endstop 在預設配置中設定為 0.5？

source: For cartesian style printers the Z position_endstop specifies how far the nozzle is from the bed when the endstop triggers. If possible, it is recommended to use a Z-max endstop and home away from the bed (as this reduces the potential for bed collisions). However, if one must home towards the bed then it is recommended to position the endstop so it triggers when the nozzle is still a small distance away from the bed. This way, when homing the axis, it will stop before the nozzle touches the bed. See the [bed level document](Bed_Level.md) for more information.
hu: A cartesian stílusú nyomtatók esetében a Z position_endstop megadja, hogy a fúvóka milyen messze van az ágytól, amikor a végállás működésbe lép. Ha lehetséges, ajánlott Z-max végállást használni, és az ágytól távolabb elhelyezni (mivel ez csökkenti az ágy ütközés lehetőségét). Ha azonban az ágy felé kell elindulni, akkor a végállást úgy kell beállítani, hogy akkor lépjen működésbe, amikor a fúvóka még mindig kis távolságra van az ágytól. Így a tengely homingolásakor a fúvóka még azelőtt megáll, hogy a fúvóka hozzáérne az ágyhoz. További információért lásd az [ágy szintezés dokumentumot](Bed_Level.md).
it: Per le stampanti cartesiane Z position_endstop specifica la distanza dell'ugello dal piatto quando si attiva ilfinecorsa. Se possibile, si consiglia di utilizzare un finecorsa Z-max e di tornare a casa lontano dal piatto (in quanto ciò riduce il rischio di collisioni con il piatto). Tuttavia, se ci si deve avvicinare al piatto, si consiglia di posizionare il finecorsa in modo che si attivi quando la bocchetta è ancora a una piccola distanza dal piatto. In questo modo, durante l'homing dell'asse, si fermerà prima che l'ugello tocchi il letto. Per ulteriori informazioni, vedere il [bed level document](Bed_Level.md).
ko: 직교 스타일 프린터의 경우 Z position_endstop은 엔드스톱이 트리거될 때 노즐이 BED에서 얼마나 멀리 떨어져 있는지 지정합니다. 가능하면 Z-max 엔드스톱을 사용하고 BED에서 멀리 떨어져 있는 것이 좋습니다 (이렇게 하면 BED에 충돌 가능성이 줄어듭니다). 그러나 BED를 향해 오토홈 해야 하는 경우 노즐이 BED에서 여전히 가까운 거리에 있을 때 트리거되도록 엔드스톱을 배치하는 것이 좋습니다. 이렇게 하면 축을 원점 복귀시킬 때 노즐이 BED에 닿기 전에 멈춥니다. 자세한 [bed level document](Bed_Level.md) 를 참조하십시오.
zh_hant: 對於笛卡爾式印表機，Z position_endstop 定義了當限位觸發時噴嘴離床的距離。如果可能的話，建議使用 Z-max 限位使歸位時列印頭遠離床（因為這可以減少碰撞的發生）。如果必須朝向床歸位，那麼建議將限位固定在噴嘴距離床還有一小段距離時觸發。這樣，當歸位 Z 軸時，噴嘴會在接觸床之前停止。有關詳細資訊，請參閱 [列印床調平文件](Bed_Level.md)。

source: I converted my config from Marlin and the X/Y axes work fine, but I just get a screeching noise when homing the Z axis
hu: Átkonvertáltam a Marlinból származó konfigurációmat, és az X/Y tengelyek jól működnek, de a Z tengely kezdőpont fílvételekor csikorgó hangot hallok
it: Ho convertito la mia configurazione da Marlin e gli assi X/Y funzionano bene, ma ottengo solo un rumore stridente durante homing dell'asse Z
ko: Marlin에서 설정을 가져왔는데 X/Y 축은 잘 작동하지만 Z 축을 원점 복귀할 때 삐걱거리는 소리가 납니다
zh_hant: 我從 Marlin 轉換了我的配置並且 X/Y 軸工作正常，但是在歸位 Z 軸時我只聽到刺耳的噪音且印表機不動

source: Short answer: First, make sure you have verified the stepper configuration as described in the [config check document](Config_checks.md). If the problem persists, try reducing the max_z_velocity setting in the printer config.
hu: Rövid válasz: Először is ellenőrizze, hogy a [config check dokumentumban](Config_checks.md) leírtak szerint ellenőrizte-e a léptető konfigurációját. Ha a probléma továbbra is fennáll, próbálja meg csökkenteni a max_z_velocity értéket a nyomtató konfigurációjában.
it: Risposta breve: in primo luogo, assicurati di aver verificato la configurazione dello stepper come descritto nel [config check document](Config_checks.md). Se il problema persiste, provare a ridurre l'impostazione max_z_velocity nella configurazione della stampante.
ko: 짧은 대답: 먼저 [config check document](Config_checks.md)에 설명된 대로 스테퍼 구성을 확인했는지 확인합니다. 문제가 지속되면 프린터 구성에서 max_z_velocity 설정을 줄여 보십시오.
zh_hant: 長話短說：首先，請確保您已按照 [配置檢查文件](Config_checks.md) 中描述的步驟驗證了步進驅動配置。如果問題仍然存在，請嘗試降低印表機配置中的 max_z_velocity 設定。

source: Long answer: In practice Marlin can typically only step at a rate of around 10000 steps per second. If it is requested to move at a speed that would require a higher step rate then Marlin will generally just step as fast as it can. Klipper is able to achieve much higher step rates, but the stepper motor may not have sufficient torque to move at a higher speed. So, for a Z axis with a high gearing ratio or high microsteps setting the actual obtainable max_z_velocity may be smaller than what is configured in Marlin.
hu: Hosszú válasz: A gyakorlatban a Marlin jellemzően csak körülbelül 10000 lépés/másodperc sebességgel tud lépni. Ha olyan sebességgel kell mozognia, amely nagyobb lépésszámot igényel, akkor a Marlin általában csak olyan gyorsan lép, amilyen gyorsan csak tud. A Klipper sokkal nagyobb lépésszámot képes elérni, de a léptetőmotornak nem biztos, hogy elegendő nyomatéka van a nagyobb sebességű mozgáshoz. Tehát egy nagy áttételszámú vagy nagy mikrolépésszámú Z tengely esetében a ténylegesen elérhető max_z_sebesség kisebb lehet, mint ami a Marlinban be van állítva.
it: Risposta lunga: in pratica Marlin può in genere fare solo un passo a una velocità di circa 10000 passi al secondo. Se gli viene richiesto di muoversi a una velocità che richiederebbe una velocità di passo più alta, Marlin generalmente farà un passo più veloce possibile. Klipper è in grado di raggiungere velocità di passo molto più elevate, ma il motore passo-passo potrebbe non avere una coppia sufficiente per muoversi a una velocità più elevata. Quindi, per un asse Z con un rapporto di trasmissione elevato o un'impostazione di micropassi elevata, l'effettiva velocità max_z_ottenibile potrebbe essere inferiore a quella configurata in Marlin.
ko: 긴 대답: 실제로 Marlin 은 일반적으로 초당 약 10000 step 의 속도로만 움직일 수 있습니다. 더 높은 속도로 이동하도록 요청되면 Marlin은 일반적으로 최대한 가능한 정도만 수행합니다. Klipper는 훨씬 더 높은 속도를 달성할 수 있지만 스테퍼 모터는 더 높은 속도로 이동하기에 충분한 토크가 없을 수 있습니다. 따라서 높은 기어비 또는 높은 마이크로스텝이 있는 Z축의 경우 실제 얻을 수 있는 max_z_velocity 를 설정하는 것이 Marlin에서 구성된 것보다 작을 수 있습니다.
zh_hant: 具體原理：在實踐中，Marlin 通常只能以每秒 10000 步左右的速度發送步進。如果要求它以需要更高的步進率的速度移動，那麼 Marlin 會盡可能快地步進。Klipper 能夠實現更高的步進率，但步進電機可能沒有足夠的扭矩以更高的速度移動。因此，對於一個具有高傳動比或高微步設定的 Z 軸，實際的最大速度可能小於 Marlin 中配置的值。

source: My TMC motor driver turns off in the middle of a print
fr: Mes pilotes de moteur TMC s'arrêtent en plein milieu d'une impression
hu: A TMC motorvezérlő kikapcsol a nyomtatás közben
it: Il mio driver TMC del motore si spegne nel mezzo di una stampa
ko: TMC 모터 드라이버가 인쇄 도중에 꺼집니다
zh_hant: 我的 TMC 電機驅動在列印過程中關閉了

source: If using the TMC2208 (or TMC2224) driver in "standalone mode" then make sure to use the [latest version of Klipper](#how-do-i-upgrade-to-the-latest-software). A workaround for a TMC2208 "stealthchop" driver problem was added to Klipper in mid-March of 2020.
fr: Si vous utilisez le pilote TMC2208 (ou TMC2224) en "mode autonome", assurez-vous d'utiliser la [dernière version de Klipper](#how-do-i-upgrade-to-the-latest-software). Une solution de contournement pour un problème avec les pilotes TMC2208 "stealthchop" a été ajoutée à Klipper à la mi-mars 2020.
hu: Ha a TMC2208 (vagy TMC2224) motorvezérlőt "standalone módban" használja, akkor győződjön meg róla, hogy a [Klipper legújabb verzióját](#hogyan-frissithetek-a-legujabb-szoftverre) használja. A TMC2208 "stealthchop" motorvezérlő problémájának megoldása 2020 március közepén került hozzá a Klipperhez.
it: Se si utilizza il driver TMC2208 (o TMC2224) in "modalità standalone", assicurarsi di utilizzare l'[latest version of Klipper](#how-do-i-upgrade-to-the-latest-software). Una soluzione alternativa per un problema del driver "stealthchop" TMC2208 è stata aggiunta a Klipper a metà marzo del 2020.
ko: "standalone mode"에서 TMC2208(또는 TMC2224) 드라이버를 사용하는 경우 최신 버전의 Klipper를 사용해야 합니다. TMC2208 "stealthchop" 드라이버 문제에 대한 해결 방법이 2020년 3월 중순에 Klipper에 추가되었습니다.
zh_hant: 如果在「獨立模式」中使用 TMC2208（或 TMC2224）驅動，那麼請確保您正在使用[最新版本的 Klipper](#how-do-i-upgrade-to-the-latest-software)。2020年3月中旬，Klipper 中修復了 TMC2208 「StealthChop」 驅動的問題。

source: I keep getting random "Lost communication with MCU" errors
fr: J'ai des erreurs aléatoires "Lost communication with MCU" (communication perdue avec le microcontrôleur)
hu: Folyamatosan kapok "Elveszett a kommunikáció az MCU-val" hibákat
it: Continuo a ricevere errori casuali "Comunicazione persa con MCU" |"Lost communication with MCU"
ko: 랜덤하게 "MCU와의 통신 끊김" 오류가 계속 발생합니다
zh_hant: 我不斷收到隨機的"與MCU失去通訊"錯誤

source: This is commonly caused by hardware errors on the USB connection between the host machine and the micro-controller. Things to look for:
hu: Ezt általában a gazdagép és a mikrokontroller közötti USB-kapcsolat hardverhibái okozzák. Amit keresni kell:
it: Ciò è comunemente causato da errori hardware sulla connessione USB tra la macchina host e il microcontrollore. Cose da cercare:
ko: 이것은 일반적으로 호스트 시스템과 마이크로 컨트롤러 간의 USB 연결에 대한 하드웨어 오류로 인해 발생합니다. 아래 사항을 점검하세요:
zh_hant: 這通常是由主機和微控制器之間的 USB 連線中硬體錯誤引起的。注意這些問題：

source: Use a good quality USB cable between the host machine and micro-controller. Make sure the plugs are secure.
hu: Használjon jó minőségű USB-kábelt a gazdagép és a mikrokontroller között. Győződjön meg róla, hogy a csatlakozók biztonságosan csatlakoznak.
it: Utilizzare un cavo USB di buona qualità tra la macchina host e il microcontrollore. Assicurati che i connettori siano ben saldi.
ko: 호스트 머신과 마이크로 컨트롤러 사이에 좋은 품질의 USB 케이블을 사용하십시오. 플러그가 안전한지 확인하십시오.
zh_hant: 在主機和微控制器之間應該使用高質量USB線，並確保插頭牢固。

source: Make sure the printer's power supply is not being overloaded. (Power fluctuations to the micro-controller's USB chip may result in resets of that chip.)
hu: Győződjön meg róla, hogy a nyomtató áramellátása nincs túlterhelve. (A mikrovezérlő USB-chip áramellátásának ingadozása a chip újraindítását eredményezheti.)
it: Assicurarsi che l'alimentazione della stampante non sia sovraccarica. (Le fluttuazioni di alimentazione del chip USB del microcontrollore possono comportare il reset di quel chip.)
ko: 프린터의 전원 공급 장치에 과부하가 걸리지 않았는지 확인하십시오. (마이크로 컨트롤러의 USB 칩에 대한 전력 변동으로 인해 해당 칩이 재설정될 수 있습니다.)
zh_hant: 請確保印表機的電源沒有過載。(微控制器 USB 晶片的電壓波動可能會導致該晶片欠壓復位。)

source: Verify stepper, heater, and other printer wires are not crimped or frayed. (Printer movement may place stress on a faulty wire causing it to lose contact, briefly short, or generate excessive noise.)
hu: Ellenőrizze, hogy a léptető, fűtő és egyéb nyomtatóvezetékek nem szakadtak vagy rongálódtak. (A nyomtató mozgása megterhelheti a hibás vezetéket, ami érintkezési hibákhoz, rövidzárlathoz vagy túlzott zajkeltéshez vezethet.)
it: Verificare che i cavi dello stepper, del riscaldatore e di altri cavi della stampante non siano arricciati o sfilacciati. (Il movimento della stampante può sollecitare un cavo difettoso causandone la perdita di contatto, un cortocircuito breve o la generazione di rumore eccessivo.)
ko: 스테퍼 모터, 히터 및 기타 프린터 와이어가 구겨지거나 닳지 않았는지 확인합니다. (프린터가 움직이면 결함이 있는 전선에 스트레스가 가해져 접촉이 끊어지거나 잠시 단락되거나 과도한 소음이 발생할 수 있습니다.)
zh_hant: 確認步進電機、加熱器和其他印表機電線沒有被壓壞或磨損。（印表機移動時可能對故障的電線施加壓力，導致其失去接觸、短暫短路或產生過多的噪音。）

source: There have been reports of high USB noise when both the printer's power supply and the host's 5V power supply are mixed. (If you find that the micro-controller powers on when either the printer's power supply is on or the USB cable is plugged in, then it indicates the 5V power supplies are being mixed.) It may help to configure the micro-controller to use power from only one source. (Alternatively, if the micro-controller board can not configure its power source, one may modify a USB cable so that it does not carry 5V power between the host and micro-controller.)
hu: Jelentéseket kaptunk magas USB-zajról, amikor a nyomtató, és a gazdagép 5V-os tápellátása keveredik. (Ha azt tapasztalja, hogy a mikrokontroller bekapcsol, amikor a gazdagép tápellátása be van kapcsolva, vagy az USB-kábel be van dugva, akkor ez azt jelzi, hogy az 5V-os tápegységek keverednek.) Segíthet, ha úgy konfigurálja a mikrokontrollert, hogy csak az egyik forrásból származó áramot használja. (Alternatív megoldásként, ha a mikrokontroller lapja nem tudja konfigurálni az áramforrását, módosíthatunk egy USB-kábelt úgy, hogy az ne szállítson 5V-os áramot a gazdagép és a mikrokontroller között.)
it: Sono stati segnalati rumori USB elevati quando sia l'alimentazione della stampante che l'alimentazione a 5 V dell'host sono mescolate. (Se si scopre che il microcontrollore si accende quando l'alimentazione della stampante è accesa o il cavo USB è collegato, significa che gli alimentatori da 5 V vengono mescolati.) Può essere utile configurare il microcontrollore da utilizzare alimentazione da una sola fonte. (In alternativa, se la scheda del microcontrollore non è in grado di configurare la sua fonte di alimentazione, è possibile modificare un cavo USB in modo che non trasmetta alimentazione a 5V tra l'host e il microcontrollore.)
ko: 프린터의 전원 공급 장치와 호스트의 5V 전원 공급 장치가 혼합되어 있을 때 USB 노이즈가 높다는 보고가 있었습니다. (프린터의 전원 공급 장치가 켜져 있거나 USB 케이블이 꽂혀 있을 때 마이크로 컨트롤러의 전원이 켜지면 5V 전원 공급 장치가 혼합되고 있음을 나타냅니다.) 단 하나의 소스에서 전력을 공급하는 것이 좋습니다. (또는 마이크로 컨트롤러 보드가 전원을 구성할 수 없는 경우 호스트와 마이크로 컨트롤러 간에 5V 전원을 전달하지 않도록 USB 케이블을 수정할 수 있습니다.)
zh_hant: 有報告稱，當印表機的電源和主機的5V電源混合時，USB噪音很大。(如果你發現當印表機的電源打開或USB電纜插入時，微控制器會通電，那麼這表明5V電源被混用了）。配置微控制器，使其只使用一個電源可能會有幫助。(另外，如果微控制器主板不能配置其供電來源，也可以修改USB電纜，使其主機和微控制器之間不共享5V電源。）

source: My Raspberry Pi keeps rebooting during prints
fr: Mon Raspberry Pi redémarre pendant les impressions
hu: A Raspberry Pi folyamatosan újraindul nyomtatás közben
it: Il mio Raspberry Pi continua a riavviarsi durante le stampe
ko: Raspberry Pi가 인쇄 중에 계속 재부팅됩니다
zh_hant: 我的樹莓派在列印時不斷重啟

source: This is most likely do to voltage fluctuations. Follow the same troubleshooting steps for a ["Lost communication with MCU"](#i-keep-getting-random-lost-communication-with-mcu-errors) error.
fr: Cela est très probablement dû à des fluctuations de tension. Suivez les mêmes étapes de dépannage que pour une erreur [« Communication perdue avec le MCU »](#i-keep-getting-random-lost-communication-with-mcu-errors).
hu: Ez valószínűleg a feszültségingadozások miatt van. Kövesse ugyanazokat a hibaelhárítási lépéseket az ["Elveszett kommunikáció az MCU-val"](#folyamatosan-kapok-elveszett-a-kommunikacio-az-mcu-val-hibakat) hiba esetén.
it: Questo è molto probabilmente dovuto alle fluttuazioni di tensione. Segui gli stessi passaggi per la risoluzione dei problemi per un errore ["Comunicazione persa con MCU"](#i-keep-getting-random-lost-communication-with-mcu-errors).
ko: 이것은 대부분 전압 변동이 원인일 가능성이 있습니다. 문제를 해결하려면 ["MCU와의 통신 끊김"](#랜덤하게-MCU와의-통신-끊김-오류가-계속-발생합니다)를 따르십시오.
zh_hant: 這很可能是由於電壓波動引起的。請遵循["與MCU失去通訊"](#i-keep-getting-random-lost-communication-with-mcu-errors)錯誤同樣的故障排除步驟。

source: Some old versions of the AVR bootloader have a known bug in watchdog event handling. This typically manifests when the printer.cfg file has restart_method set to "command". When the bug occurs, the AVR device will be unresponsive until power is removed and reapplied to the device (the power or status LEDs may also blink repeatedly until the power is removed).
fr: Certaines anciennes versions du bootloader AVR ont un bogue connu dans la gestion des événements de chien de garde. Cela se manifeste typiquement lorsque le paramètre restart_method est défini sur "command" dans le fichier printer.cfg. Lorsque le bogue se produit, le dispositif AVR ne répond pas jusqu'à ce que l'alimentation de la carte soit coupée puis remise (les DEL d'alimentation ou d'état peuvent également clignoter de manière répétée jusqu'à ce que l'alimentation soit retirée).
hu: Az AVR bootloader néhány régi verziójának ismert hibája van a watchdog esemény kezelésében. Ez általában akkor jelentkezik, ha a printer.cfg fájlban a restart_method beállítása "command". Amikor a hiba előfordul, az AVR eszköz nem reagál, amíg a tápellátást el nem veszik és újra be nem kapcsolják az eszközbe (a tápellátás vagy az állapotjelző LED-ek is többször villoghatnak, amíg a tápellátást el nem veszik).
it: Alcune vecchie versioni del bootloader AVR hanno un bug noto nella gestione degli eventi di watchdog. Questo in genere si manifesta quando il file printer.cfg ha restart_method impostato su "command". Quando si verifica il bug, il dispositivo AVR non risponderà fino a quando l'alimentazione non viene rimossa e ricollegata al dispositivo (anche i LED di alimentazione o di stato potrebbero lampeggiare ripetutamente fino a quando l'alimentazione non viene rimossa).
ko: AVR 부트로더의 일부 이전 버전에는 워치독 이벤트 처리에 알려진 버그가 있습니다. 이것은 일반적으로 printer.cfg 파일에 restart_method가 "command"로 설정되어 있을 때 나타납니다. 버그가 발생하면 전원이 제거되고 장치에 다시 공급될 때까지 AVR 장치가 응답하지 않습니다 (전원이 제거될 때까지 전원 또는 상태 LED도 반복적으로 깜박일 수 있음).
zh_hant: 一些舊版本的AVR載入程式在看門狗事件處理方面有一個已知的錯誤。這通常表現在printer.cfg檔案中的restart_method設定為 "command"的時候。當這個錯誤發生時，AVR裝置會宕機直到電源被移除並重新上電（電源或狀態LED也可能不停的閃爍直到斷電）。
