Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Hall_Filament_Width_Sensor.po
Languages: da, hu

source: Hall filament width sensor
da: Hall filament-bredde sensor
hu: Hall nyomtatószál szélesség érzékelő

source: How does it work?
da: Hvordan virker det?
hu: Hogyan működik?

source: Template for menu variables
da: Skabelon for menu variabler
hu: Menüváltozók sablonja

source: Calibration procedure
da: Kalibrerings procedure
hu: Kalibrálási eljárás

source: Insert first calibration rod (1.5 mm size) get first raw sensor value
da: Indsæt først kalibrerings del (1,5mm) for at få første sensor værdi
hu: Helyezd be az első kalibráló rudat (1,5 mm-es méret), hogy megkapd az első nyers szenzorértéket

source: Insert second calibration rod (2.0 mm size) get second raw sensor value
da: Indsæt anden kalibrerings del (2,0mm) for at få anden sensor værdi
hu: Helyezd be a második kalibráló rudat (2,0 mm-es méret), hogy megkapd a második nyers szenzorértéket

source: Save raw sensor values in config parameter `Raw_dia1` and `Raw_dia2`
da: Gem sensor værdier i konfigurationsfilen `Raw_dia1` og `Raw_dia2`
hu: Mentsd a nyers szenzorértékeket a `Raw_dia1` és a `Raw_dia2` konfigurációs paraméterekbe

source: How to enable sensor
da: Sådan aktiveres sensoren
hu: Az érzékelő engedélyezése

source: By default, the sensor is disabled at power-on.
da: Som standard er sensoren deaktiveret ved opstart.
hu: Alapértelmezés szerint az érzékelő le van tiltva bekapcsoláskor.

source: Logging
da: Logning
hu: Naplózás

source: By default, diameter logging is disabled at power-on.
da: Som standard er diameter logning deaktiveret ved opstart.
hu: Alapértelmezés szerint az átmérő naplózása bekapcsoláskor le van tiltva.

source: Issue **ENABLE_FILAMENT_WIDTH_LOG** command to start logging and issue **DISABLE_FILAMENT_WIDTH_LOG** command to stop logging. To enable logging at power-on, set the `logging` parameter to `true`.
da: Send **ENABLE_FILAMENT_WIDTH_LOG** kommandoen for at starte logning, og send **DISABLE_FILAMENT_WIDTH_LOG** kommandoen for at stoppe. For at aktivere ved opstart som standard, set parameteren: `logging` til `true`.
hu: Add ki az **ENABLE_FILAMENT_WIDTH_LOG** parancsot a naplózás elindításához, és add ki a **DISABLE_FILAMENT_WIDTH_LOG** parancsot a naplózás leállításához. A bekapcsoláskor történő naplózás engedélyezéséhez állítsd a `logging paramétert `true` értékre.

source: Filament diameter is logged on every measurement interval (10 mm by default).
da: Filamentets diameter registreres ved hvert måle interval (10mm som standard).
hu: A nyomtatószál átmérője minden mérési intervallumban naplózásra kerül (alapértelmezés szerint 10 mm).

source: You can find designs at [Thingiverse](https://www.thingiverse.com/thing:4138933), an assembly video is also available on [Youtube](https://www.youtube.com/watch?v=TDO9tME8vp4)
da: Du kan finde design på [Thingiverse](https://www.thingiverse.com/thing:4138933), en monteringsvideo er også tilgængelig på [Youtube](https://www.youtube.com/watch?v=TDO9tME8vp4)
hu: Terveket a [Thingiverse] oldalon találod (https://www.thingiverse.com/thing:4138933), az összeszerelési videó a [Youtube]-on is elérhető (https://www.youtube.com/watch?v=TDO9tME8vp4 )

source: To get raw sensor value you can use menu item or **QUERY_RAW_FILAMENT_WIDTH** command in terminal.
da: For at få de rå parametere kan du bruge menuen eller sende **QUERY_RAW_FILAMENT_WIDTH** kommandoen i Terminalen.
hu: Az érzékelő nyers értékének meghatározásához használhatod a menüelemet vagy a **QUERY_RAW_FILAMENT_WIDTH** parancsot a terminálban.

source: To use Hall filament width sensor, read [Config Reference](Config_Reference.md#hall_filament_width_sensor) and [G-Code documentation](G-Codes.md#hall_filament_width_sensor).
da: For at bruge en Hall filament-bredde sensor, kan du læse [Konfigurationsreference](Config_Reference.md#hall_filament_width_sensor) og [G-kode dokumentationen](G-Codes.md#hall_filament_width_sensor).
hu: A Hall nyomtatószál szélesség érzékelő használatához olvasd el a [Konfigurációs hivatkozás](Config_Reference.md#hall_filament_width_sensor) és a [G-kód dokumentáció](G-Codes.md#hall_filament_width_sensor) részt.

source: To enable the sensor, issue **ENABLE_FILAMENT_WIDTH_SENSOR** command or set the `enable` parameter to `true`.
da: For at aktivere sensoren kan du sende **ENABLE_FILAMENT_WIDTH_SENSOR** kommandoen, eller indstil `enable` parameteren til `true`.
hu: Az érzékelő engedélyezéséhez add ki az **ENABLE_FILAMENT_WIDTH_SENSOR** parancsot, vagy állítsd az `enable` paramétert `true` értékre.

source: This document describes Filament Width Sensor host module. Hardware used for developing this host module is based on two Hall linear sensors (ss49e for example). Sensors in the body are located on opposite sides. Principle of operation: two hall sensors work in differential mode, temperature drift same for sensor. Special temperature compensation not needed.
da: Dette dokument beskriver Filament bredde sensor værts modulet. Hardwaren brugt til udvikling af dette modul er 2 stk. Hall Linære sensorer (ss49e for eksempel). Sensorer i modulet er monteret overfor hinanden. Derved arbejder de ud fra differentialet, med temperatur afvigelser der er ens for begge sensorer. Derfor skal der ikke tages højde for temperatur afvigelserne.
hu: Ez a dokumentum a szálszélesség-érzékelő gazdamodult ismerteti. A gazdamodul fejlesztéséhez használt hardver két Hall lineáris érzékelőn alapul (például ss49e). A testben lévő érzékelők ellentétes oldalakon helyezkednek el. Működési elv: a két Hall-érzékelő differenciális üzemmódban működik, a hőmérséklet-drift azonos az érzékelőnél. Speciális hőmérséklet-kompenzációra nincs szükség.

source: Sensor generates two analog output based on calculated filament width. Sum of output voltage always equals to detected filament width. Host module monitors voltage changes and adjusts extrusion multiplier. I use the aux2 connector on a ramps-like board with the analog11 and analog12 pins. You can use different pins and different boards.
da: Sensorerne genererer 2 analoge outputs baseret på den beregnede filament bredde. Summen af signalets styrke vil altid matche den målte filament bredde. Værts modulet overvåger signalet, og justerer ekstrusionen tilsvarende. Jeg har brugt aux2 stikket på et RAMPS-kort via analog11 og analog12 pins. Du kan bruge andre kort og andre pins.
hu: Az érzékelő két analóg kimenetet generál a számított szálszélesség alapján. A kimeneti feszültség összege mindig megegyezik az érzékelt nyomtatószál szélességgel. A gazdamodul figyeli a feszültségváltozásokat és beállítja az extrudálási szorzót. Az aux2 csatlakozót egy RAMPS lapon használom az analóg11 és analóg12 tűkkel. Használhatsz más tűket és más lapokat is.
