Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Installation.po
Languages: de, hu, ko, ru, zh_hans

source: If no configuration file for the printer can be found, but the type of printer control board is known, then look for an appropriate [config file](../config/) starting with a "generic-" prefix. These example printer board files should allow one to successfully complete the initial installation, but will require some customization to obtain full printer functionality.
de: Wenn keine Konfigurationsdatei für den Drucker gefunden werden kann, aber der Typ der Druckerplatine bekannt ist, dann suchen Sie nach einer entsprechenden [config-Datei](../config/), die mit einem "generic-"-Präfix beginnt. Mit diesen Beispieldateien für die Druckerkarte sollte die Erstinstallation erfolgreich abgeschlossen werden können, es sind jedoch einige Anpassungen erforderlich, um die volle Druckerfunktionalität zu erhalten.
hu: Ha nem találja a nyomtatóhoz tartozó konfigurációs fájlt, de a nyomtató vezérlőpanelének típusa ismert, akkor keressen egy megfelelő [config fájlt](../config/), amely "generic-" előtaggal kezdődik. Ezekkel a nyomtató vezérlőpanel példafájlokkal sikeresen elvégezhető a kezdeti telepítés, de a nyomtató teljes funkcionalitásának eléréséhez némi testreszabásra lesz szükség.
ru: Если конфигурационный файл для принтера не найден, но известен тип платы управления принтером, то ищите соответствующий [config-файл](../config/), начинающийся с префикса "generic-". Приведенные примеры файлов платы управления принтером должны позволить успешно завершить начальную установку, но для получения полной функциональности принтера потребуется некоторая доработка.

source: It is also possible to define a new printer configuration from scratch. However, this requires significant technical knowledge about the printer and its electronics. It is recommended that most users start with an appropriate configuration file. If creating a new custom printer configuration file, then start with the closest example [config file](../config/) and use the Klipper [config reference](Config_Reference.md) for further information.
de: Es ist auch möglich, eine neue Druckerkonfiguration von Grund auf zu definieren. Dies erfordert jedoch erhebliche technische Kenntnisse über den Drucker und seine Elektronik. Es wird empfohlen, dass die meisten Benutzer mit einer geeigneten Konfigurationsdatei beginnen. Wenn Sie eine neue benutzerdefinierte Druckerkonfigurationsdatei erstellen, beginnen Sie mit der nächstgelegenen Beispiel-[Konfigurationsdatei](../config/) und verwenden Sie die Klipper-[Konfigurationsreferenz](Config_Reference.md) für weitere Informationen.
hu: Lehetőség van új nyomtatókonfiguráció nulláról történő meghatározására is. Ehhez azonban jelentős műszaki ismeretekre van szükség a nyomtatóval és annak elektronikájával kapcsolatban. A legtöbb felhasználónak ajánlott, hogy egy megfelelő konfigurációs fájllal kezd. Ha új, egyéni nyomtató konfigurációs fájlt hoz létre, akkor a legközelebbi példával [config fájl](../config/) kezd, és további információkért használd a Klipper [konfigurációs hivatkozás](Config_Reference.md) című dokumentumot.
ru: Можно также задать новую конфигурацию принтера с нуля. Однако это требует значительных технических знаний о принтере и его электронике. Большинству пользователей рекомендуется начинать работу с соответствующего файла конфигурации. При создании нового файла конфигурации принтера следует начать с ближайшего примера [config file](../config/), а для получения дополнительной информации использовать справочник Klipper [config reference](Config_Reference.md).

source: The comments at the top of the [printer configuration file](#obtain-a-klipper-configuration-file) should describe the settings that need to be set during "make menuconfig". Open the file in a web browser or text editor and look for these instructions near the top of the file. Once the appropriate "menuconfig" settings have been configured, press "Q" to exit, and then "Y" to save. Then run:
de: Die Kommentare am Anfang der [Druckerkonfigurationsdatei](#obtain-a-klipper-configuration-file) sollten die Einstellungen beschreiben, die während "make menuconfig" gesetzt werden müssen. Öffnen Sie die Datei in einem Webbrowser oder Texteditor und suchen Sie nach diesen Anweisungen am Anfang der Datei. Sobald Sie die entsprechenden "menuconfig"-Einstellungen vorgenommen haben, drücken Sie "Q" zum Beenden und dann "Y" zum Speichern. Führen Sie dann aus:
hu: A [nyomtató konfigurációs fájl](#obtain-a-klipper-configuration-file) tetején található megjegyzéseknek le kell írniuk a beállításokat, amelyeket a "make menuconfig" során kell beállítani. Nyissa meg a fájlt egy webböngészőben vagy szövegszerkesztőben, és keresse meg ezeket az utasításokat a fájl teteje közelében. Miután a megfelelő "menuconfig" beállításokat elvégezte, nyomja meg a "Q" gombot a kilépéshez, majd az "Y" gombot a mentéshez. Ezután futtassa:
ru: Комментарии в верхней части файла [printer configuration file](#obtain-a-klipper-configuration-file) должны описывать настройки, которые необходимо задать при выполнении команды "make menuconfig". Откройте файл в браузере или текстовом редакторе и найдите эти инструкции в верхней части файла. После того как соответствующие настройки "menuconfig" будут заданы, нажмите "Q" для выхода, а затем "Y" для сохранения. Затем запустите программу:

source: If the comments at the top of the [printer configuration file](#obtain-a-klipper-configuration-file) describe custom steps for "flashing" the final image to the printer control board then follow those steps and then proceed to [configuring OctoPrint](#configuring-octoprint-to-use-klipper).
de: Wenn die Kommentare am Anfang der [Druckerkonfigurationsdatei](#obtain-a-klipper-configuration-file) benutzerdefinierte Schritte zum "Flashen" des endgültigen images auf die Druckerkontrollkarte beschreiben, dann befolgen Sie diese Schritte und fahren Sie dann mit der [Konfiguration von OctoPrint](#configuring-octoprint-to-use-klipper) fort.
hu: Ha a [nyomtató konfigurációs fájl](#obtain-a-klipper-configuration-file) tetején található megjegyzések egyéni lépéseket írnak le a "flash" végső képnek a nyomtató vezérlőpanelére történő égetéséhez, akkor kövesd ezeket a lépéseket, majd folytasd az [OctoPrint konfigurálása](#configuring-octoprint-to-use-klipper) lépésekkel.
ru: Если в комментариях в верхней части файла [printer configuration file](#obtain-a-klipper-configuration-file) описаны пользовательские шаги по "прошивке" конечного изображения на плату управления принтером, то выполните эти шаги, а затем перейдите к [configuring OctoPrint](#configuring-octoprint-to-use-klipper).

source: Otherwise, the following steps are often used to "flash" the printer control board. First, it is necessary to determine the serial port connected to the micro-controller. Run the following:
de: Andernfalls werden die folgenden Schritte häufig zum "Flashen" der Druckersteuerplatine verwendet. Zunächst muss die an den Mikrocontroller angeschlossene serielle Schnittstelle ermittelt werden. Führen Sie die folgenden Schritte aus:
hu: Ellenkező esetben a következő lépéseket gyakran használják a nyomtató vezérlőlapjának "flash" égetésére. Először meg kell határozni a mikrokontrollerhez csatlakoztatott soros portot. Futtassa a következőket:
ru: В противном случае для "прошивки" платы управления принтером часто используются следующие действия. Во-первых, необходимо определить последовательный порт, подключенный к микроконтроллеру. Для этого выполните следующее:

source: The next step is to copy the [printer configuration file](#obtain-a-klipper-configuration-file) to the Raspberry Pi.
de: Der nächste Schritt besteht darin, die [Druckerkonfigurationsdatei](#obtain-a-klipper-configuration-file) auf den Raspberry Pi zu kopieren.
hu: A következő lépés a [nyomtató konfigurációs fájl](#obtain-a-klipper-configuration-file) átmásolása a Raspberry Pi-re.
ru: На следующем этапе необходимо скопировать [файл конфигурации принтера](#obtain-a-klipper-configuration-file) на Raspberry Pi.

source: Arguably the easiest way to set the Klipper configuration file is to use a desktop editor that supports editing files over the "scp" and/or "sftp" protocols. There are freely available tools that support this (eg, Notepad++, WinSCP, and Cyberduck). Load the printer config file in the editor and then save it as a file named "printer.cfg" in the home directory of the pi user (ie, /home/pi/printer.cfg).
de: Der wohl einfachste Weg, die Klipper-Konfigurationsdatei zu bearbeiten, ist die Verwendung eines Desktop-Editors, der das Bearbeiten von Dateien über die Protokolle "scp" und/oder "sftp" unterstützt. Es gibt frei verfügbare Tools, die dies unterstützen (z.B. Notepad++, WinSCP und Cyberduck). Laden Sie die Druckerkonfigurationsdatei in den Editor und speichern Sie sie dann als Datei mit dem Namen "printer.cfg" im Home-Verzeichnis des Pi-Benutzers (z. B. /home/pi/printer.cfg).
hu: Vitathatatlanul a Klipper konfigurációs fájl beállításának legegyszerűbb módja egy olyan asztali szerkesztő használata, amely támogatja a fájlok szerkesztését az "scp" és/vagy "sftp" protokollokon keresztül. Vannak szabadon elérhető eszközök, amelyek támogatják ezt (pl. Notepad++, WinSCP és Cyberduck). Töltse be a nyomtató konfigurációs fájlját a szerkesztőprogramba, majd mentsd el egy "printer.cfg" nevű fájlként a pi felhasználó home könyvtárába (pl. /home/pi/printer.cfg).
ru: Пожалуй, самым простым способом настройки конфигурационного файла Klipper является использование настольного редактора, поддерживающего редактирование файлов по протоколам "scp" и/или "sftp". Существуют свободно распространяемые инструменты, поддерживающие эту функцию (например, Notepad++, WinSCP и Cyberduck). Загрузите файл конфигурации принтера в редактор и сохраните его в виде файла с именем "printer.cfg" в домашнем каталоге пользователя pi (т.е. /home/pi/printer.cfg).

source: Alternatively, one can also copy and edit the file directly on the Raspberry Pi via ssh. That may look something like the following (be sure to update the command to use the appropriate printer config filename):
de: Alternativ kann man die Datei auch direkt auf den Raspberry Pi kopieren und per ssh bearbeiten. Das kann etwa wie folgt aussehen (stellen Sie sicher, dass Sie den Befehl aktualisieren, um den entsprechenden Dateinamen für die Druckerkonfiguration zu verwenden):
hu: Alternatívaként a fájlt közvetlenül a Raspberry Pi-n is lehet másolni és szerkeszteni SSH-n keresztül. Ez valahogy így nézhet ki (ügyeljünk arra, hogy a parancsot frissítsük a megfelelő nyomtató konfigurációs fájlnévvel):
ru: В качестве альтернативы можно скопировать и отредактировать файл непосредственно на Raspberry Pi через ssh. Это может выглядеть следующим образом (не забудьте обновить команду, чтобы использовать соответствующее имя файла конфигурации принтера):

source: It's common for each printer to have its own unique name for the micro-controller. The name may change after flashing Klipper, so rerun these steps again even if they were already done when flashing. Run:
de: Es ist üblich, dass jeder Drucker seinen eigenen, eindeutigen Namen für den Mikrocontroller hat. Der Name kann sich nach dem Flashen von Klipper ändern, also führen Sie diese Schritte erneut aus, auch wenn sie bereits beim Flashen durchgeführt wurden. Ausführen:
hu: Gyakori, hogy minden nyomtatónak saját egyedi neve van a mikrokontroller számára. A név a Klipper égetése után megváltozhat, ezért futtassa újra ezeket a lépéseket, még akkor is, ha már az égetéskor elvégezte őket. Futtatás:
ru: Обычно каждый принтер имеет свое собственное уникальное имя для микроконтроллера. После прошивки Klipper это имя может измениться, поэтому повторите эти шаги еще раз, даже если они уже были выполнены при прошивке. Выполнить:

source: Then update the config file with the unique name. For example, update the `[mcu]` section to look something similar to:
de: Dann aktualisieren Sie die Konfigurationsdatei mit dem eindeutigen Namen. Aktualisieren Sie zum Beispiel den Abschnitt `[mcu]` so, dass er in etwa so aussieht:
hu: Ezután frissítse a konfigurációs fájlt az egyedi névvel. Például frissítse az `[mcu]` részt, hogy valami hasonlót kapjon:
ru: Затем обновите конфигурационный файл с уникальным именем. Например, обновите секцию `[mcu]`, чтобы она выглядела примерно так:

source: After creating and editing the file it will be necessary to issue a "restart" command in the OctoPrint web terminal to load the config. A "status" command will report the printer is ready if the Klipper config file is successfully read and the micro-controller is successfully found and configured.
de: Nach dem Erstellen und Bearbeiten der Datei muss im OctoPrint-Webterminal ein "Neustart"-Befehl eingegeben werden, um die Konfiguration zu laden. Ein "Status"-Befehl meldet, dass der Drucker bereit ist, wenn die Klipper-Konfigurationsdatei erfolgreich gelesen und der Mikrocontroller erfolgreich gefunden und konfiguriert wurde.
hu: A fájl létrehozása és szerkesztése után az OctoPrint webes terminálján ki kell adni egy "újraindítás" parancsot a konfiguráció betöltéséhez. A "status" parancs azt jelenti, hogy a nyomtató készen áll, ha a Klipper config fájl sikeresen beolvasásra került, és a mikrokontroller sikeresen meg lett találva és konfigurálva.
ru: После создания и редактирования файла необходимо выполнить команду "restart" в веб-терминале OctoPrint для загрузки конфигурации. Команда "status" сообщит о готовности принтера, если файл конфигурации Klipper успешно прочитан, а микроконтроллер успешно найден и настроен.

source: When customizing the printer config file, it is not uncommon for Klipper to report a configuration error. If an error occurs, make any necessary corrections to the printer config file and issue "restart" until "status" reports the printer is ready.
de: Beim Anpassen der Druckerkonfigurationsdatei kommt es nicht selten vor, dass Klipper einen Konfigurationsfehler meldet. Wenn ein Fehler auftritt, nehmen Sie die erforderlichen Korrekturen an der Druckerkonfigurationsdatei vor und führen Sie einen Neustart durch, bis "Status" meldet, dass der Drucker bereit ist.
hu: A nyomtató konfigurációs fájljának testreszabásakor nem ritka, hogy a Klipper konfigurációs hibát jelez. Ha hiba lép fel, végezd el a szükséges javításokat a nyomtató konfigurációs fájljában, és add ki az "újraindítás" parancsot, amíg az "állapot" nem jelzi, hogy a nyomtató készen áll.
ru: При настройке файла конфигурации принтера нередко Klipper сообщает об ошибке конфигурации. При возникновении ошибки внесите необходимые исправления в файл конфигурации принтера и выполняйте команду "restart" до тех пор, пока "status" не сообщит о готовности принтера.

source: After Klipper reports that the printer is ready, proceed to the [config check document](Config_checks.md) to perform some basic checks on the definitions in the config file. See the main [documentation reference](Overview.md) for other information.
de: Nachdem Klipper meldet, dass der Drucker bereit ist, fahren Sie mit dem Dokument [config check document](Config_checks.md) fort, um einige grundlegende Prüfungen der Definitionen in der Konfigurationsdatei durchzuführen. Weitere Informationen finden Sie in der [Dokumentationsreferenz](Overview.md).
hu: Miután a Klipper jelenti, hogy a nyomtató készen áll, folytasd a [konfigurációs ellenőrzés](Config_checks.md) című dokumentumal, hogy elvégezz néhány alapvető ellenőrzést a config fájlban lévő definíciókon. További információkért lásd a fő [dokumentációs hivatkozás](Overview.md) című rész.
ru: После того как Klipper сообщит, что принтер готов, перейдите к документу [Проверка конфигурации](Config_checks.md) для выполнения некоторых базовых проверок определений в файле конфигурации. Другую информацию см. в основной части [справочной документации](Overview.md).

source: Klipper currently supports a number of Atmel ATmega based micro-controllers, [ARM based micro-controllers](Features.md#step-benchmarks), and [Beaglebone PRU](beaglebone.md) based printers.
zh_hans: Klipper目前支持数种基于Atmel ATmega的微控制器、[基于ARM的微控制器](Features.md#step-benchmarks)、和[Beaglebone可编程实时单元](beaglebone.md)的打印机。

source: Start by installing [OctoPi](https://github.com/guysoft/OctoPi) on the Raspberry Pi computer. Use OctoPi v0.17.0 or later - see the [octopi releases](https://github.com/guysoft/OctoPi/releases) for release information. One should verify that OctoPi boots and that the OctoPrint web server works. After connecting to the OctoPrint web page, follow the prompt to upgrade OctoPrint to v1.4.2 or later.
zh_hans: 先在树莓派上安装[OctoPi](https://github.com/guysoft/OctoPi)。使用OctoPi v0.17.0或更高版本，查看[octopi发布版](https://github.com/guysoft/OctoPi/releases)来获取最新的发布版。安装完系统后，请先验证OctoPi能正常启动，并且OctoPrint网络服务器正常运行。连接到OctoPrint网页后，按照提示将OctoPrint更新到v1.4.2或更高版本。

source: Select the appropriate micro-controller and review any other options provided. Once configured, run:
ko: 적절한 마이크로 컨트롤러를 선택하고 제공된 다른 옵션을 검토하십시오. 구성이 완료되면 다음을 실행합니다:
zh_hans: 选择恰当的微控制器并复查提供的其他选项。配置好后，运行：

source: It is necessary to determine the serial port connected to the micro-controller. For micro-controllers that connect via USB, run the following:
ko: 마이크로 컨트롤러에 연결된 시리얼 포트를 결정해야 합니다. USB를 통해 연결하는 마이크로 컨트롤러의 경우 다음을 실행합니다:
zh_hans: 必须先确定连接到微控制器的串行端口。对于通过 USB 连接的微控制器，运行以下命令：

source: The Klipper configuration is stored in a text file on the Raspberry Pi. Take a look at the example config files in the [config directory](../config/). The [config reference](Config_Reference.md) contains documentation on config parameters.
zh_hans: Klipper configuration 存储在Raspberry Pi上的一个文本文件中。看一下[config directory](../config/)。[config reference](Config_Reference.md)包含了config parameters.

source: Arguably the easiest way to update the Klipper configuration file is to use a desktop editor that supports editing files over the "scp" and/or "sftp" protocols. There are freely available tools that support this (eg, Notepad++, WinSCP, and Cyberduck). Use one of the example config files as a starting point and save it as a file named "printer.cfg" in the home directory of the pi user (ie, /home/pi/printer.cfg).
ko: 논란의 여지 없이 Klipper 구성 파일을 업데이트하는 가장 쉬운 방법은 "scp" 및/또는 "sftp" 프로토콜을 통한 파일 편집을 지원하는 데스크탑 편집기를 사용하는 것입니다. 이를 지원하는 무료 도구가 있습니다(예: Notepad++, WinSCP 및 Cyberduck). 예제 구성 파일 중 하나를 시작점으로 사용하고 pi 사용자의 홈 디렉토리(즉, /home/pi/printer.cfg)에 "printer.cfg"라는 파일로 저장합니다.
zh_hans: 可以说，更新Klipper configuration 文件的最简单方法是使用一个支持通过 "scp "或 "sftp "协议编辑文件的桌面编辑器。有一些免费的工具支持这个功能（例如，Notepad++、WinSCP和Cyberduck）。使用其中一个配置文件的例子作为起点，并将其保存为pi用户的主目录中名为 "printer.cfg "的文件（例如，/home/pi/printer.cfg）。

source: Alternatively, one can also copy and edit the file directly on the Raspberry Pi via ssh - for example:
ko: 또는 ssh를 통해 Raspberry Pi에서 직접 파일을 복사하고 편집할 수도 있습니다. 예를 들면 다음과 같습니다:
zh_hans: 另外，也可以通过ssh在Raspberry Pi上直接复制和编辑该文件。比如说：

source: Make sure to review and update each setting that is appropriate for the hardware.
ko: printer.cfg 파일 내용을 하드웨어에 적합한 각 설정을 검토하고 업데이트하십시오.
zh_hans: 确保你检查和更新每一个设置并且与硬件相符合。

source: It's common for each printer to have its own unique name for the micro-controller. The name may change after flashing Klipper, so rerun the `ls /dev/serial/by-id/*` command and then update the config file with the unique name. For example, update the `[mcu]` section to look something similar to:
ko: 각 프린터마다 마이크로 컨트롤러에 대해 고유한 이름이 있는 것이 일반적입니다. Klipper 플래싱 후에 이름이 변경될 수 있으므로 `ls /dev/serial/by-id/*` 명령을 다시 실행한 다음 구성 파일을 고유한 이름으로 업데이트하십시오. 예를 들어 `[mcu]` 섹션을 다음과 유사하게 업데이트합니다:
zh_hans: 每台打印机都有自己独特的微控制器名称是很常见的。烧写Klipper后这个名字可能会改变，所以重新运行`ls /dev/serial/by-id/*`命令，然后用这个唯一的名字更新配置文件。例如，更新"[mcu]"部分，看起来类似于:

source: After creating and editing the file it will be necessary to issue a "restart" command in the OctoPrint web terminal to load the config. A "status" command will report the printer is ready if the Klipper config file is successfully read and the micro-controller is successfully found and configured. It is not unusual to have configuration errors during the initial setup - update the printer config file and issue "restart" until "status" reports the printer is ready.
ko: 파일을 만들고 편집한 후 config 를 로드하려면 OctoPrint 웹 terminal 탭에서 "restart" 명령을 실행해야 합니다. "status" 명령은 Klipper 구성 파일을 성공적으로 읽고 마이크로 컨트롤러를 성공적으로 찾아서 구성한 경우 프린터가 준비되었음을 보고합니다. 초기 설정 중에 구성 오류가 발생하는 것은 드문 일이 아닙니다. 프린터 구성 파일을 업데이트하고 "status"에서 프린터가 준비되었다고 보고할 때까지 "restart"을 실행하십시오.
zh_hans: 在创建和编辑该文件后，有必要在OctoPrint网络终端发出 "restart"命令去重新加载config。"status" 命令将报告打印机已准备就绪。在初始设置期间出现配置错误是很正常的。更新打印机配置文件并发出 "restart"命令，直到 "状态 "报告打印机已准备就绪。

source: In addition to common g-code commands, Klipper supports a few extended commands - "status" and "restart" are examples of these commands. Use the "help" command to get a list of other extended commands.
ko: 추가로 일반적인 gcode 명령 외에도 Klipper는 몇 가지 확장 명령을 지원합니다. "status" 및 "restart"는 이러한 명령의 예입니다. "help" 명령을 사용하여 다른 확장 명령을 확인하십시오.
zh_hans: 除此之外常见的g-code命令之外，Klipper还支持一些扩展命令"status "和 "restart "就是这些命令的例子。使用 "help "命令可以获得其他扩展命令的列表。

source: After Klipper reports that the printer is ready go on to the [config check document](Config_checks.md) to perform some basic checks on the pin definitions in the config file.
ko: Klipper가 프린터가 준비되었다고 보고한 후 [config check document](Config_checks.md)로 이동하여 config 파일의 핀 정의에 대한 몇 가지 기본 검사를 수행합니다.
zh_hans: 在Klipper反馈打印机已经准备好后，进入[config check document](Config_checks.md)对配置文件中的引脚定义进行一些基本检查。

source: Contacting the developers
ko: 개발자에게 문의
zh_hans: 联系开发者

source: Be sure to see the [FAQ](FAQ.md) for answers to some common questions. See the [contact page](Contact.md) to report a bug or to contact the developers.
ko: 몇 가지 일반적인 질문에 대한 답변은 [FAQ](FAQ.md)를 참조하십시오. 버그를 보고하거나 개발자에게 연락하려면 [contact page](Contact.md)를 참조하세요.
zh_hans: 请务必查看[FAQ](FAQ.md)，了解一些常见问题的答案。请参阅[联系页面](Contact.md)来报告一个错误或联系开发者。
