Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Installation.po
Languages: de, hu, ko, ru, zh_hans

source: These instructions assume the software will run on a Raspberry Pi computer in conjunction with OctoPrint. It is recommended that a Raspberry Pi 2, 3, or 4 computer be used as the host machine (see the [FAQ](FAQ.md#can-i-run-klipper-on-something-other-than-a-raspberry-pi-3) for other machines).
de: Diese Anleitung geht davon aus, dass die Software auf einem Raspberry Pi Computer in Verbindung mit OctoPrint läuft. Es wird empfohlen, einen Raspberry Pi 2, 3 oder 4 als Host-Computer zu verwenden (siehe die [FAQ](FAQ.md#can-i-run-klipper-on-something-other-than-a-raspberry-pi-3) für andere Computer).
hu: Ezek az utasítások feltételezik, hogy a szoftver egy Raspberry Pi számítógépen fut az OctoPrint-el együtt. Javasoljuk, hogy egy Raspberry Pi 2, 3 vagy 4-es számítógépet használj gazdagépként (más gépekre vonatkozóan lásd a [GYIK](FAQ.md#can-i-run-klipper-on-something-other-other-than-a-raspberry-pi-3) című részt).
ko: 이 문서는 OctoPrint가 Raspberry Pi 에서 실행된다고 가정합니다. Raspberry Pi 2, 3 또는 4를 사용하는 것이 좋습니다 ([FAQ](FAQ.md#Raspberry-Pi-3-이외의-다른-기기에서-Klipper를-실행할-수-있습니까) 참조).
ru: В этих инструкциях предполагается, что программное обеспечение будет работать на компьютере Raspberry Pi совместно с OctoPrint. В качестве хост-машины рекомендуется использовать компьютер Raspberry Pi 2, 3 или 4 (см. [Часто задаваемые вопросы](FAQ.md#can-i-run-klipper-on-something-other-than-a-raspberry-pi-3) для других машин).
zh_hans: 本教程假定软件将会在树莓派上和 Octoprint 一起运行。推荐使用树莓派2/3/4作为主机（关于其他设备，请见[常见问题](FAQ.md#can-i-run-klipper-on-something-other-than-a-raspberry-pi-3)）。

source: Prepping an OS image
de: Vorbereiten eines Betriebssystem-Images
hu: OS képfájl előkészítése
ko: 설치 이미지 준비
ru: Подготовка образа операционной системы
zh_hans: 准备操作系统镜像

source: After installing OctoPi and upgrading OctoPrint, it will be necessary to ssh into the target machine to run a handful of system commands. If using a Linux or MacOS desktop, then the "ssh" software should already be installed on the desktop. There are free ssh clients available for other desktops (eg, [PuTTY](https://www.chiark.greenend.org.uk/~sgtatham/putty/)). Use the ssh utility to connect to the Raspberry Pi (ssh pi@octopi -- password is "raspberry") and run the following commands:
de: Nach der Installation von OctoPi und der Aktualisierung von OctoPrint müssen Sie sich per ssh in den Zielrechner einwählen, um einige Systembefehle auszuführen. Wenn Sie einen Linux- oder MacOS-Desktop verwenden, sollte die "ssh"-Software bereits auf dem Desktop installiert sein. Für andere Desktops gibt es kostenlose ssh-Clients (z. B. [PuTTY](https://www.chiark.greenend.org.uk/~sgtatham/putty/)). Verwenden Sie das ssh-Dienstprogramm, um sich mit dem Raspberry Pi zu verbinden (ssh pi@octopi -- Passwort ist "raspberry") und führen Sie die folgenden Befehle aus:
hu: Az OctoPi telepítése és az OctoPrint frissítése után néhány rendszerparancs futtatásához szükség lesz az "SSH" kapcsolatra a célgéphez. Ha Linux vagy MacOS asztali számítógépet használsz, akkor az "SSH" szoftvernek már telepítve kell lennie a gépen. Vannak ingyenes ssh-kliensek más asztali számítógépekhez (pl. [PuTTY](https://www.chiark.greenend.org.uk/~sgtatham/putty/)). Az SSH segédprogrammal csatlakozz a Raspberry Pi-hez (ssh pi@octopi -- a jelszó "raspberry"), és futtasd a következő parancsokat:
ko: OctoPi를 설치하고 OctoPrint를 업그레이드한 후 몇 가지 시스템 명령을 실행하려면 대상 시스템에 ssh해야 합니다. Linux 또는 MacOS 데스크탑을 사용하는 경우 "ssh" 소프트웨어가 이미 설치되어 있어야 합니다. 윈도우 OS 에서는 [PuTTY](https://www.chiark.greenend.org.uk/~sgtatham/putty/) 처럼 무료로 사용할 수 있는 ssh 클라이언트가 있습니다. ssh 유틸리티를 사용하여 Raspberry Pi(ssh pi@octpi -- 암호는 "raspberry")에 연결하고 다음 명령을 실행합니다:
ru: После установки OctoPi и обновления OctoPrint необходимо будет подключиться к целевому компьютеру по ssh для выполнения нескольких системных команд. Если используется рабочий стол Linux или macOS, то утилита "ssh", скорее всего, уже установлена. Существуют бесплатные ssh-клиенты, доступные для других настольных компьютеров (например, [PuTTY](https://www.chiark.greenend.org.uk/~sgtatham/putty/)). Используйте утилиту ssh для подключения к Raspberry Pi (ssh pi@octopi -- пароль "raspberry") и выполните следующие команды:
zh_hans: 在安装 OctoPi 和升级 OctoPrint后，用 ssh 进入目标设备，以运行少量的系统命令。如果使用Linux或MacOS系统，那么 "ssh"软件应该已经预装在系统上。有一些免费的ssh客户端可用于其他操作系统（例如，[PuTTY](https://www.chiark.greenend.org.uk/~sgtatham/putty/)）。使用ssh工具连接到Raspberry Pi（ssh pi@octopi --密码是 "raspberry"），并运行以下命令：

source: The above will download Klipper, install some system dependencies, setup Klipper to run at system startup, and start the Klipper host software. It will require an internet connection and it may take a few minutes to complete.
de: Die obigen Schritte laden Klipper herunter, installieren einige Systemabhängigkeiten, richten Klipper so ein, dass es beim Systemstart ausgeführt wird, und starten die Klipper-Hostsoftware. Dies erfordert eine Internetverbindung und kann einige Minuten in Anspruch nehmen.
hu: A fentiek letöltik a Klippert, telepítenek néhány rendszerösszetevőt, beállítják a Klippert, hogy a rendszer indulásakor fusson, és elindítja a Klipper gazdagép szoftverét. Internetkapcsolatra lesz szükség, és néhány percet is igénybe vehet.
ko: 위의 내용은 Klipper를 다운로드하고, 시스템에 필요한 패키지를 설치하고, 시스템 시작 시 Klipper 가 자동으로 실행되도록 설정하고, Klipper 호스트 소프트웨어를 시작합니다. 인터넷 연결이 필요하며 완료하는 데 몇 분 정도 걸릴 수 있습니다.
ru: Вышеописанное позволит загрузить Klipper, установить некоторые системные зависимости, настроить Klipper для запуска при запуске системы и запустить программное обеспечение Klipper host. Для этого потребуется подключение к Интернету, и его выполнение может занять несколько минут.
zh_hans: 以上将会下载Klipper，安装一些系统依赖，设置Klipper在系统启动时运行，并启动Klipper host软件。这将需要一个互联网连接以及可能需要几分钟时间才能完成。

source: Building and flashing the micro-controller
de: Kompilieren und Flashen des Mikrocontrollers
hu: A mikrokontroller felépítése és égetése
ko: 컴파일 및 펌웨어 업로드
ru: Компиляция и прошивка микроконтроллера
zh_hans: 构建和烧写微控制器

source: To compile the micro-controller code, start by running these commands on the Raspberry Pi:
de: Um den Code des Mikrocontrollers zu kompilieren, führen Sie zunächst diese Befehle auf dem Raspberry Pi aus:
hu: A mikrokontroller kódjának lefordításához futtasd ezeket a parancsokat a Raspberry Pi-n:
ko: 마이크로 컨트롤러 코드를 컴파일하려면 먼저 Raspberry Pi에서 다음 명령을 실행하십시오:
ru: Чтобы начать компиляцию кода прошивки, введите следующие команды на Raspberry Pi:
zh_hans: 在编译微控制器代码之前，首先在树莓派上运行这些命令：

source: It should report something similar to the following:
de: Es sollte etwas ähnliches wie das Folgende gemeldet werden:
hu: Az alábbiakhoz hasonlót kell kapnod:
ko: 그럼 다음과 비슷한 결과물을 얻을 수 있습니다:
ru: Должно отобразиться что-то вроде:
zh_hans: 它应该报告类似以下的内容：

source: It's common for each printer to have its own unique serial port name. This unique name will be used when flashing the micro-controller. It's possible there may be multiple lines in the above output - if so, choose the line corresponding to the micro-controller (see the [FAQ](FAQ.md#wheres-my-serial-port) for more information).
de: Es ist üblich, dass jeder Drucker einen eigenen, eindeutigen Namen für den seriellen Anschluss hat. Dieser eindeutige Name wird beim Flashen des Mikrocontrollers verwendet. Es ist möglich, dass es mehrere Zeilen in der obigen Ausgabe gibt - wenn dies der Fall ist, wählen Sie die Zeile, die dem Mikrocontroller entspricht (siehe [FAQ](FAQ.md#wheres-my-serial-port) für weitere Informationen).
hu: Gyakori, hogy minden nyomtatónak saját egyedi soros port neve van. Ezt az egyedi nevet használjuk a mikrokontroller égetésére. Lehetséges, hogy a fenti kimenetben több sor is található – ha igen, válaszd ki a mikrovezérlőnek megfelelő sort (további információkért lásd a [GYIK](FAQ.md#wheres-my-serial-port) részt).
ko: 각 프린터에는 고유한 시리얼 포트 이름이 있는 것이 일반적입니다. 이 고유한 이름은 마이크로 컨트롤러에 펌웨어 업로드 할때 사용됩니다. 위의 출력에 여러 줄이 있을 수 있습니다. 그렇다면 마이크로 컨트롤러에 해당하는 줄을 선택하십시오 (자세한 내용은 [FAQ](내-시리얼-포트는-어디에-있습니까) 참조).
ru: Обычно каждый принтер имеет свое уникальное имя последовательного порта. Это уникальное имя будет использоваться при прошивке микроконтроллера. Возможно, в приведенном выше выводе будет несколько строк - в этом случае выберите строку, соответствующую микроконтроллеру (более подробную информацию см. в разделе [FAQ](FAQ.md#wheres-my-serial-port)).
zh_hans: 通常每一个打印机都有自己独特的串口名，这个独特串口名将会在烧写微处理器时用到。在上述输出中可能有多行。如果是这样的话选择与微控制器相应的 (查看[FAQ](FAQ.md#wheres-my-serial-port)了解更多信息).

source: For common micro-controllers, the code can be flashed with something similar to:
de: Bei gängigen Mikrocontrollern kann der Code mit einer ähnlichen Methode geflasht werden:
hu: Az általános mikrokontrollereknél a kódot valami hasonlóval lehet égetni:
ko: 일반적인 마이크로 컨트롤러의 경우 다음과 유사한 명령어를 사용하여 펌웨어 업로드 할 수 있습니다:
ru: Большинство контроллеров могут быть прошиты с помощью:
zh_hans: 对于常见的微控制器，可以用类似以下的方法来烧写固件：

source: Be sure to update the FLASH_DEVICE with the printer's unique serial port name.
de: Stellen Sie sicher, dass Sie FLASH_DEVICE mit dem eindeutigen Namen des seriellen Anschlusses des Druckers aktualisieren.
hu: Feltétlenül frissítd a FLASH_DEVICE eszközt a nyomtató egyedi soros portjának nevével.
ko: 반드시 프린터의 고유한 시리얼 포트 이름으로 FLASH_DEVICE를 업데이트해야 합니다.
ru: Не забудьте заменить значение FLASH_DEVICE на имя порта вашего принтера.
zh_hans: 请务必用打印机的唯一串行端口名称来更新 FLASH_DEVICE 参数。

source: When flashing for the first time, make sure that OctoPrint is not connected directly to the printer (from the OctoPrint web page, under the "Connection" section, click "Disconnect").
de: Wenn Sie zum ersten Mal flashen, stellen Sie sicher, dass OctoPrint nicht direkt mit dem Drucker verbunden ist (klicken Sie auf der OctoPrint-Webseite im Abschnitt "Verbindung" auf "Trennen").
hu: Amikor először égetsz, győződj meg arról, hogy az OctoPrint nincs közvetlenül csatlakoztatva a nyomtatóhoz (az OctoPrint weboldalon a "Kapcsolat" részben kattints a "Kapcsolat bontása" gombra).
ko: 처음 펌업 할 때 OctoPrint가 프린터에 직접 연결되어 있지 않은지 확인하십시오 (OctoPrint 웹 페이지의 "Connection" 섹션에서 "Disconnect" 클릭).
ru: При первой прошивке убедитесь, что OctoPrint не подключен напрямую к принтеру (на веб-странице OctoPrint в разделе "Подключение" нажмите кнопку "Отключить").
zh_hans: 第一次烧写时要确保 OctoPrint 没有直接连接到打印机（在 OctoPrint 网页的 "连接 "分段中点击 "断开连接"）。

source: Configuring OctoPrint to use Klipper
de: OctoPrint für die Verwendung von Klipper konfigurieren
hu: Az OctoPrint beállítása a Klipper használatához
ko: Klipper 를 사용하기 위한 Octoprint 설정
ru: Конфигурация OctoPrint для работы с Klipper
zh_hans: 为Klipper配置 OctoPrint

source: The OctoPrint web server needs to be configured to communicate with the Klipper host software. Using a web browser, login to the OctoPrint web page and then configure the following items:
de: Der OctoPrint-Webserver muss für die Kommunikation mit der Klipper-Host-Software konfiguriert werden. Melden Sie sich mit einem Webbrowser auf der OctoPrint-Webseite an und konfigurieren Sie dann die folgenden Punkte:
hu: Az OctoPrint webszervert konfigurálni kell, hogy kommunikáljon a Klipper gazdagép szoftverével. Egy webböngészővel jelentkezz be az OctoPrint weboldalra, majd konfiguráld a következő elemeket:
ko: OctoPrint 웹 서버는 Klipper 호스트 소프트웨어와 통신하도록 구성해야 합니다. 웹 브라우저를 사용하여 OctoPrint 웹 페이지에 로그인한 후 다음 항목을 구성합니다:
ru: Для связи с хост-программой Klipper необходимо настроить веб-сервер OctoPrint. Используя веб-браузер, войдите на веб-страницу OctoPrint, а затем настройте следующие элементы:
zh_hans: OctoPrint网络服务器需要进行配置，以便与Klipper host 软件进行通信。使用网络浏览器，登录到OctoPrint网页，然后配置以下项目：

source: Navigate to the Settings tab (the wrench icon at the top of the page). Under "Serial Connection" in "Additional serial ports" add "/tmp/printer". Then click "Save".
de: Navigieren Sie zur Registerkarte "Einstellungen" (das Schraubenschlüssel-Symbol oben auf der Seite). Fügen Sie unter "Serielle Verbindung" in "Zusätzliche serielle Schnittstellen" "/tmp/printer" hinzu. Klicken Sie dann auf "Speichern".
hu: Lépj a Beállítások lapra (a csavarkulcs ikon az oldal tetején). A "További soros portok" részben a "Soros kapcsolat" alatt add hozzá a "/tmp/printer" elemet. Ezután kattints a "Mentés" gombra.
ko: 설정 탭(페이지 상단의 렌치 아이콘)으로 이동합니다. "Additional serial ports"의 "Serial Connection"에서 "/tmp/printer"를 추가합니다. 그런 다음 "Save"를 클릭하십시오.
ru: Перейдите на вкладку "Настройки" (значок гаечного ключа в верхней части страницы). В разделе "Последовательное соединение" в пункте "Дополнительные последовательные порты" добавьте "/tmp/printer". Затем нажмите кнопку "Сохранить".
zh_hans: 导航到 "设置 "（页面顶部的扳手图标）。在 "串行连接 "下的 "附加串行端口 "中添加"/tmp/printer"。然后点击 "保存"。

source: Enter the Settings tab again and under "Serial Connection" change the "Serial Port" setting to "/tmp/printer".
de: Gehen Sie erneut auf die Registerkarte "Einstellungen" und ändern Sie unter "Serielle Verbindung" die Einstellung "Serieller Anschluss" in "/tmp/printer".
hu: Lépj újra a Beállítások fülre, és a „Soros kapcsolat” alatt módosítsd a „Soros port” beállítást „/tmp/printer”-re.
ko: 설정 탭으로 다시 들어가 "Serial Connection"에서 "Serial Port" 설정을 "/tmp/printer"로 변경합니다.
ru: Снова войдите на вкладку "Настройки" и в разделе "Последовательное соединение" измените значение параметра "Последовательный порт" на "/tmp/printer".
zh_hans: 再次进入 "设置"，在 "串行连接" 下将 "串行端口" 设置改为"/tmp/printer"。

source: In the Settings tab, navigate to the "Behavior" sub-tab and select the "Cancel any ongoing prints but stay connected to the printer" option. Click "Save".
de: Navigieren Sie auf der Registerkarte "Einstellungen" zur Unterregisterkarte "Verhalten" und wählen Sie die Option "Laufende Drucke abbrechen, aber mit dem Drucker verbunden bleiben". Klicken Sie auf "Speichern".
hu: A Beállítások lapon lépj a „Viselkedés” al-lapra, és válaszd a „Folyamatban lévő nyomtatás törlése, de továbbra is csatlakozva maradjon a nyomtatóhoz” lehetőséget. Kattints a "Mentés" gombra.
ko: 설정 탭에서 "Behavior" 하위 탭으로 이동하여 "Cancel any ongoing prints but stay connected to the printer" 옵션을 선택합니다. "Save"를 클릭합니다.
ru: На вкладке "Настройки" перейдите на подвкладку "Поведение" и выберите опцию "Отменить все текущие отпечатки, но оставаться подключенным к принтеру". Нажмите кнопку "Сохранить".
zh_hans: 在 "设置 "中，浏览到 "Behavior "子选项卡，选择 "取消任何正在进行的打印，但保持与打印机的连接 "选项。点击 "保存"。

source: From the main page, under the "Connection" section (at the top left of the page) make sure the "Serial Port" is set to "/tmp/printer" and click "Connect". (If "/tmp/printer" is not an available selection then try reloading the page.)
de: Vergewissern Sie sich auf der Hauptseite unter dem Abschnitt "Verbindung" (oben links auf der Seite), dass der "Serial Port" auf "/tmp/printer" eingestellt ist, und klicken Sie auf "Verbinden". (Wenn "/tmp/printer" nicht zur Auswahl steht, versuchen Sie, die Seite neu zu laden.)
hu: A főoldalon, a „Kapcsolat” részben (az oldal bal felső sarkában) győződj meg arról, hogy a „Soros Port” beállítása „/tmp/printer”, majd kattints a „Csatlakozás” gombra. (Ha a „/tmp/printer” nem elérhető, próbáld meg újratölteni az oldalt.)
ko: 메인 페이지의 "Connection" 섹션(페이지 왼쪽 상단)에서 "Serial Port"가 "/tmp/printer"로 설정되어 있는지 확인하고 "Connect"을 클릭합니다. ("/tmp/printer"를 선택할 수 없는 경우 페이지를 다시 로드해 보십시오.)
ru: На главной странице в разделе "Подключение" (в левой верхней части страницы) убедитесь, что для параметра "Последовательный порт" выбрано значение "/tmp/printer", и нажмите кнопку "Подключить". (Если "/tmp/printer" недоступен, попробуйте перезагрузить страницу.)
zh_hans: 在主页上，在 "连接 "部分（在页面的左上方），确保 "串行端口 "被设置为"/tmp/printer"，然后点击 "连接"。(如果"/tmp/printer "不是一个可用的选择，那么试着重新加载页面)

source: Once connected, navigate to the "Terminal" tab and type "status" (without the quotes) into the command entry box and click "Send". The terminal window will likely report there is an error opening the config file - that means OctoPrint is successfully communicating with Klipper. Proceed to the next section.
de: Sobald die Verbindung hergestellt ist, navigieren Sie zur Registerkarte "Terminal" und geben Sie "status" (ohne Anführungszeichen) in das Befehlseingabefeld ein und klicken Sie auf "Senden". Das Terminalfenster wird wahrscheinlich melden, dass ein Fehler beim Öffnen der Konfigurationsdatei aufgetreten ist - das bedeutet, dass OctoPrint erfolgreich mit Klipper kommuniziert. Fahren Sie mit dem nächsten Abschnitt fort.
hu: A csatlakozás után lépj a "Terminal" fülre, és írd be a "status" kifejezést (idézőjelek nélkül) a parancsbeviteli mezőbe, majd kattints a "Küldés" gombra. A terminálablak valószínűleg hibát jelez a konfigurációs fájl megnyitásakor – ez azt jelenti, hogy az OctoPrint sikeresen kommunikál a Klipperrel. Tovább a következő részhez.
ko: 일단 연결되면 "Terminal" 탭으로 이동하여 명령 입력 상자에 "status" (따옴표 제외)를 입력하고 "Send"를 클릭합니다. 터미널 창은 config 파일을 여는 동안 오류가 발생했다고 보고할 것입니다. 이는 OctoPrint가 Klipper와 성공적으로 통신하고 있음을 의미합니다. 다음 섹션으로 이동합니다.
ru: После подключения перейдите на вкладку "Терминал", введите в поле ввода команды "status" (без кавычек) и нажмите кнопку "Отправить". Скорее всего, в окне терминала появится сообщение об ошибке открытия файла конфигурации - это означает, что OctoPrint успешно взаимодействует с Klipper. Перейдите к следующему разделу.
zh_hans: 连接后，导航到 "终端 "选项卡，在命令输入框中输入 "status"（不带引号），然后点击 "发送"。终端窗口可能会报告在打开配置文件时出现了错误--这意味着 OctoPrint 与 Klipper 成功地进行了通信。继续下一部分。

source: Configuring Klipper
de: Klipper einstellen
hu: A Klipper beállítása
ko: Klipper 설정
ru: Настройка клиперов
zh_hans: 配置 Klipper

source: Klipper reports error messages via the OctoPrint terminal tab. The "status" command can be used to re-report error messages. The default Klipper startup script also places a log in **/tmp/klippy.log** which provides more detailed information.
de: Klipper meldet Fehlermeldungen über die OctoPrint-Terminal-Registerkarte. Der Befehl "status" kann verwendet werden, um Fehlermeldungen erneut zu melden. Das Standard-Startskript von Klipper legt außerdem ein Protokoll in **/tmp/klippy.log** an, das detailliertere Informationen enthält.
hu: A Klipper az OctoPrint terminállapon keresztül jelenti a hibaüzeneteket. A "status" paranccsal a hibaüzenetek újra jelenthetők. A Klipper alapértelmezett indítószkriptje egy naplót is elhelyez a **/tmp/klippy.log** fájlban, amely részletesebb információkat tartalmaz.
ko: Klipper는 OctoPrint terminal 탭을 통해 오류 메시지를 보고합니다. "status" 명령을 사용하여 오류 메시지를 다시 보고할 수 있습니다. Klipper 시작 스크립트는 **/tmp/klippy.log**를 통해 자세한 정보를 제공합니다.
ru: Klipper сообщает о сообщениях об ошибках на вкладке терминала OctoPrint. Для повторного вывода сообщений об ошибках можно использовать команду "status". Сценарий запуска Klipper по умолчанию также помещает журнал в **/tmp/klippy.log**, в котором содержится более подробная информация.
zh_hans: Klipper通过OctoPrint终端标签报告错误信息。可以使用 "status "命令来重新报告错误信息。默认的Klipper启动脚本也在**/tmp/klippy.log**中放置一个日志，提供更详细的信息。

source: Installation
hu: Telepítés
ko: 설치
ru: Установка

source: Start by installing [OctoPi](https://github.com/guysoft/OctoPi) on the Raspberry Pi computer. Use OctoPi v0.17.0 or later - see the [OctoPi releases](https://github.com/guysoft/OctoPi/releases) for release information. One should verify that OctoPi boots and that the OctoPrint web server works. After connecting to the OctoPrint web page, follow the prompt to upgrade OctoPrint to v1.4.2 or later.
de: Beginnen Sie mit der Installation von [OctoPi](https://github.com/guysoft/OctoPi) auf dem Raspberry Pi Computer. Verwenden Sie OctoPi v0.17.0 oder höher - siehe [OctoPi releases](https://github.com/guysoft/OctoPi/releases) für Versionsinformationen. Stellen Sie sicher, dass OctoPi bootet und dass der OctoPrint-Webserver funktioniert. Nachdem Sie sich mit der OctoPrint-Webseite verbunden haben, folgen Sie der Aufforderung, OctoPrint auf v1.4.2 oder höher zu aktualisieren.
hu: Kezd az [OctoPi](https://github.com/guysoft/OctoPi) telepítésével a Raspberry Pi számítógépére. Használd az OctoPi v0.17.0-s vagy újabb verzióját. A kiadásokkal kapcsolatos információkért tekintsd meg az [OctoPi-kiadásokat](https://github.com/guysoft/OctoPi/releases). Ellenőrizni kell, hogy az OctoPi elindul-e, és hogy az OctoPrint webszerver működik-e. Miután csatlakozott az OctoPrint weboldalhoz, kövesse az utasításokat az OctoPrint 1.4.2-es vagy újabb verziójára való frissítéséhez.
ru: Начните с установки [OctoPi](https://github.com/guysoft/OctoPi) на компьютер Raspberry Pi. Используйте OctoPi версии 0.17.0 или более поздней - информацию о релизах см. в разделе [OctoPi releases](https://github.com/guysoft/OctoPi/releases). Необходимо убедиться, что OctoPi загружается и веб-сервер OctoPrint работает. После подключения к веб-странице OctoPrint выполните запрос на обновление OctoPrint до версии 1.4.2 или более поздней.

source: Obtain a Klipper Configuration File
de: Beziehen einer Klipper-Konfigurationsdatei
hu: Klipper konfigurációs fájl beszerzése
ru: Получение файла конфигурации Klipper

source: Most Klipper settings are determined by a "printer configuration file" that will be stored on the Raspberry Pi. An appropriate configuration file can often be found by looking in the Klipper [config directory](../config/) for a file starting with a "printer-" prefix that corresponds to the target printer. The Klipper configuration file contains technical information about the printer that will be needed during the installation.
de: Die meisten Klipper-Einstellungen werden durch eine "Druckerkonfigurationsdatei" bestimmt, die auf dem Raspberry Pi gespeichert wird. Eine geeignete Konfigurationsdatei kann oft gefunden werden, indem man im Klipper [config-Verzeichnis](../config/) nach einer Datei sucht, die mit einem "printer-" Präfix beginnt und dem Zieldrucker entspricht. Die Klipper-Konfigurationsdatei enthält technische Informationen über den Drucker, die während der Installation benötigt werden.
hu: A legtöbb Klipper beállítást egy "nyomtató konfigurációs fájl" határozza meg, amelyet a Raspberry Pi tárol. A megfelelő konfigurációs fájlt gyakran úgy találhatjuk meg, hogy a Klipper [config könyvtárában](../config/) keresünk egy "printer-" előtaggal kezdődő fájlt, amely megfelel a célnyomtatónak. A Klipper konfigurációs fájl tartalmazza a nyomtatóra vonatkozó technikai információkat, amelyekre a telepítés során szükség lesz.
ru: Большинство настроек Klipper определяется "файлом конфигурации принтера", который будет храниться на Raspberry Pi. Соответствующий файл конфигурации часто можно найти, заглянув в каталог Klipper [config](../config/) в поисках файла, начинающегося с префикса "printer-", который соответствует целевому принтеру. Конфигурационный файл Klipper содержит техническую информацию о принтере, которая понадобится в процессе установки.

source: If there isn't an appropriate printer configuration file in the Klipper config directory then try searching the printer manufacturer's website to see if they have an appropriate Klipper configuration file.
de: Wenn es keine passende Druckerkonfigurationsdatei im Klipper-Konfigurationsverzeichnis gibt, versuchen Sie auf der Website des Druckerherstellers nach einer passenden Klipper-Konfigurationsdatei zu suchen.
hu: Ha nincs megfelelő nyomtató konfigurációs fájl a Klipper config könyvtárban, akkor keresse meg a nyomtató gyártójának weboldalát, hogy van-e megfelelő Klipper konfigurációs fájljuk.
ru: Если в каталоге Klipper config нет соответствующего файла конфигурации принтера, попробуйте поискать на сайте производителя принтера, чтобы узнать, есть ли у него соответствующий файл конфигурации Klipper.
