Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Kinematics.po
Languages: fr, zh_hans, zh_hant

source: This document provides an overview of how Klipper implements robot motion (its [kinematics](https://en.wikipedia.org/wiki/Kinematics)). The contents may be of interest to both developers interested in working on the Klipper software as well as users interested in better understanding the mechanics of their machines.
fr: Ce document donne un aperçu de la façon dont Klipper implémente le mouvement du robot (sa [cinématique](https://en.wikipedia.org/wiki/Kinematics)). Ce contenu peut intéresser aussi bien les développeurs travaillant sur le logiciel Klipper que les utilisateurs intéressés à mieux comprendre la mécanique de leurs machines.
zh_hans: 该文档提供Klipper实现机械[运动学](https://en.wikipedia.org/wiki/Kinematics)控制的概述，以供 致力于完善Klipper的开发者 或 希望对自己的设备的机械原理有进一步了解的爱好者 参考。
zh_hant: 該文件提供Klipper實現機械[運動學](https://en.wikipedia.org/wiki/Kinematics)控制的概述，以供 致力於完善Klipper的開發者 或 希望對自己的裝置的機械原理有進一步瞭解的愛好者 參考。

source: Acceleration
fr: Accélération
zh_hans: 加速
zh_hant: 加速

source: Klipper implements a constant acceleration scheme whenever the print head changes velocity - the velocity is gradually changed to the new speed instead of suddenly jerking to it. Klipper always enforces acceleration between the tool head and the print. The filament leaving the extruder can be quite fragile - rapid jerks and/or extruder flow changes lead to poor quality and poor bed adhesion. Even when not extruding, if the print head is at the same level as the print then rapid jerking of the head can cause disruption of recently deposited filament. Limiting speed changes of the print head (relative to the print) reduces risks of disrupting the print.
fr: Klipper met en œuvre un schéma d'accélération constante chaque fois que la tête d'impression change de vitesse - la vitesse est progressivement modifiée pour atteindre la nouvelle vitesse au lieu d'être brusquement atteinte. Klipper applique toujours l'accélération entre la tête de l'outil et l'impression. Le filament sortant de l'extrudeuse peut être assez fragile - des secousses rapides et/ou des changements de débit de l'extrudeuse entraînent une qualité médiocre et une mauvaise adhérence du lit. Même en l'absence d'extrusion, si la tête d'impression se trouve au même niveau que l'impression, des secousses rapides de la tête peuvent perturber le filament récemment déposé. Limiter les changements de vitesse de la tête d'impression (par rapport à l'impression) réduit les risques de perturbation de l'impression.
zh_hans: Klipper总使用常加速度策略——打印头的速度总是梯度变化到新的速度，而非使用速度突变的方式。Klipper着眼于打印件和打印头之间的速度变化。离开挤出机的耗材十分脆弱，突然的移动速度和/或挤出流量突变可能会导致造成打印质量或床黏着能力的下降。甚至在无挤出时，如果打印头和打印件顶端在同一水平面时，喷嘴的速度突变有可能对刚挤出的耗材进行剐蹭。限制打印头相对于打印件的速度，可以减少剐蹭打印件的风险。
zh_hant: Klipper總使用常加速度策略——列印頭的速度總是梯度變化到新的速度，而非使用速度突變的方式。Klipper著眼於列印件和列印頭之間的速度變化。離開擠出機的耗材十分脆弱，突然的移動速度和/或擠出流量突變可能會導致造成列印質量或床黏著能力的下降。甚至在無擠出時，如果列印頭和列印件頂端在同一水平面時，噴嘴的速度突變有可能對剛擠出的耗材進行剮蹭。限制列印頭相對於列印件的速度，可以減少剮蹭列印件的風險。

source: It is also important to limit acceleration so that the stepper motors do not skip or put excessive stress on the machine. Klipper limits the torque on each stepper by virtue of limiting the acceleration of the print head. Enforcing acceleration at the print head naturally also limits the torque of the steppers that move the print head (the inverse is not always true).
fr: Il est également important de limiter l'accélération afin que les moteurs pas à pas ne perdent pas de pas et ne soumettent pas la machine à des contraintes excessives. Klipper limite le couple de chaque moteur pas à pas en limitant l'accélération de la tête d'impression. Le fait d'imposer une accélération à la tête d'impression limite naturellement aussi le couple des moteurs pas à pas qui déplacent la tête d'impression (l'inverse n'est pas toujours vrai).
zh_hans: 限制减速度也能减少步进电机丢步和炸机的状况。Klipper通过限制打印头的加速度来限制每个步进电机的力矩。限制打印头的加速度自然也限制了移动打印头的步进器的扭矩（反之则不一定）。
zh_hant: 限制減速度也能減少步進電機丟步和炸機的狀況。Klipper通過限制列印頭的加速度來限制每個步進電機的力矩。限制列印頭的加速度自然也限制了移動列印頭的步進器的扭矩（反之則不一定）。

source: Klipper implements constant acceleration. The key formula for constant acceleration is:
fr: Klipper met en œuvre une accélération constante. La formule clé de l'accélération constante est la suivante :
zh_hans: Klipper实现恒加速度控制，关键的方程如下：
zh_hant: Klipper實現恒加速度控制，關鍵的方程如下：

source: Trapezoid generator
fr: Générateur de trapézoïdes
zh_hans: 梯形发生器
zh_hant: 梯形發生器

source: Klipper uses a traditional "trapezoid generator" to model the motion of each move - each move has a start speed, it accelerates to a cruising speed at constant acceleration, it cruises at a constant speed, and then decelerates to the end speed using constant acceleration.
fr: Klipper utilise un "générateur de trapèze" traditionnel pour modéliser le mouvement de chaque déplacement - chaque déplacement a une vitesse de départ, il accélère jusqu'à une vitesse de croisière à une accélération constante, il se déplace à une vitesse constante, puis décélère jusqu'à la vitesse finale en utilisant une décélération constante.
zh_hans: Klipper 使用传统的"梯形发生器"来产生每个动作的运动--每个动作都有一个起始速度，先恒定的加速度加速到一个巡航速度，再以恒定的速度巡航，最后用恒定的加速度减速到终点速度。
zh_hant: Klipper 使用傳統的"梯形發生器"來產生每個動作的運動--每個動作都有一個起始速度，先恒定的加速度加速到一個巡航速度，再以恒定的速度巡航，最後用恒定的加速度減速到終點速度。

source: It's called a "trapezoid generator" because a velocity diagram of the move looks like a trapezoid.
fr: On l'appelle "générateur de trapèze" parce que le diagramme de vitesse du mouvement ressemble à un trapèze.
zh_hans: 因为移动时的速度图看起来像一个梯形，它被称为 "梯形发生器"。
zh_hant: 因為移動時的速度圖看起來像一個梯形，它被稱為 "梯形發生器"。

source: The cruising speed is always greater than or equal to both the start speed and the end speed. The acceleration phase may be of zero duration (if the start speed is equal to the cruising speed), the cruising phase may be of zero duration (if the move immediately starts decelerating after acceleration), and/or the deceleration phase may be of zero duration (if the end speed is equal to the cruising speed).
fr: La vitesse de croisière est toujours supérieure ou égale à la fois à la vitesse de départ et à la vitesse d'arrivée. La phase d'accélération peut être de durée nulle (si la vitesse de départ est égale à la vitesse de croisière), la phase de croisière peut être de durée nulle (si le mouvement commence immédiatement à décélérer après l'accélération), et/ou la phase de décélération peut être de durée nulle (si la vitesse finale est égale à la vitesse de croisière).
zh_hans: 巡航速度总是大于等于起始和终端速度。加速度阶段可能持续时间为0（如果起始速度等于巡航速度），巡航速度的持续时间也可为0（如果在加速结束后马上进行减速），减速阶段也能为0（如果终端速度等于巡航速度）。
zh_hant: 巡航速度總是大於等於起始和終端速度。加速度階段可能持續時間為0（如果起始速度等於巡航速度），巡航速度的持續時間也可為0（如果在加速結束后馬上進行減速），減速階段也能為0（如果終端速度等於巡航速度）。

source: Look-ahead
fr: Projection
zh_hans: 预计算（look-ahead）
zh_hant: 預計算（look-ahead）

source: The "look-ahead" system is used to determine cornering speeds between moves.
fr: Le système de projection "look-ahead" est utilisé pour déterminer les vitesses lors des virages entre les mouvements.
zh_hans: 拐角速度使用预计算系统进行处理。
zh_hant: 拐角速度使用預計算系統進行處理。

source: Consider the following two moves contained on an XY plane:
fr: Considérons les deux mouvements suivants contenus dans un plan XY :
zh_hans: 考虑以下两个在 XY 平面上的移动：
zh_hant: 考慮以下兩個在 XY 平面上的移動：

source: In the above situation it is possible to fully decelerate after the first move and then fully accelerate at the start of the next move, but that is not ideal as all that acceleration and deceleration would greatly increase the print time and the frequent changes in extruder flow would result in poor print quality.
fr: Dans la situation ci-dessus, il est possible de décélérer complètement après le premier mouvement et d'accélérer complètement au début du mouvement suivant, mais ce n'est pas idéal car toutes ces accélérations et décélérations augmenteraient considérablement le temps d'impression et les changements fréquents dans le flux de l'extrudeuse entraîneraient une mauvaise qualité d'impression.
zh_hans: 在上述的状况下，打印机可以在第一步时减速至停止，并在第二步开始时加速至巡航速度。但这种运动策略并不理想，完全减速和完全加速会大幅增加打印时间，同时挤出量会频繁变动，从而导致打印质量的下降。
zh_hant: 在上述的狀況下，印表機可以在第一步時減速至停止，並在第二步開始時加速至巡航速度。但這種運動策略並不理想，完全減速和完全加速會大幅增加列印時間，同時擠出量會頻繁變動，從而導致列印質量的下降。

source: To solve this, the "look-ahead" mechanism queues multiple incoming moves and analyzes the angles between moves to determine a reasonable speed that can be obtained during the "junction" between two moves. If the next move is nearly in the same direction then the head need only slow down a little (if at all).
fr: Pour résoudre ce problème, le mécanisme de projection "look-ahead" met en file d'attente plusieurs mouvements entrants et analyse les angles entre les mouvements pour déterminer une vitesse raisonnable pouvant être obtenue pendant la "jonction" entre deux mouvements. Si le déplacement suivant est presque dans la même direction, la tête ne doit ralentir que légèrement (voire pas du tout).
zh_hans: 要解决这种情况，klipper引入了预计算机制，预先依次计算后续的数个移动，分析其中的拐角并确定合适的拐角速度。如果下一步的速度与现时的移动速度相近，则滑车速度仅会稍微减少。
zh_hant: 要解決這種情況，klipper引入了預計算機制，預先依次計算後續的數個移動，分析其中的拐角並確定合適的拐角速度。如果下一步的速度與現時的移動速度相近，則滑車速度僅會稍微減少。

source: However, if the next move forms an acute angle (the head is going to travel in nearly a reverse direction on the next move) then only a small junction speed is permitted.
fr: Toutefois, si le mouvement suivant forme un angle aigu (la tête va se déplacer dans une direction presque inverse lors du mouvement suivant), seule une petite vitesse de jonction est autorisée.
zh_hans: 然而，如果下一步形成一个尖锐的拐角（滑车将在下一步进行近于反方向的移动），则只能采用一个很低的拐角速度。
zh_hant: 然而，如果下一步形成一個尖銳的拐角（滑車將在下一步進行近於反方向的移動），則只能採用一個很低的拐角速度。

source: The junction speeds are determined using "approximated centripetal acceleration". Best [described by the author](https://onehossshay.wordpress.com/2011/09/24/improving_grbl_cornering_algorithm/). However, in Klipper, junction speeds are configured by specifying the desired speed that a 90° corner should have (the "square corner velocity"), and the junction speeds for other angles are derived from that.
fr: Les vitesses de jonction sont déterminées en utilisant "l'accélération centripète approximative". Best [décrit par l'auteur](https://onehossshay.wordpress.com/2011/09/24/improving_grbl_cornering_algorithm/). Cependant, dans Klipper, les vitesses de jonction sont configurées en spécifiant la vitesse souhaitée pour un angle de 90° (la "vitesse de l'angle carré"), et les vitesses de jonction des autres angles en sont dérivées.
zh_hans: 转角速度由“近似向心加速度”确定。最好[由作者描述](https://onehossshay.wordpress.com/2011/09/24/improving_grbl_cornering_algorithm/)。然而在Klipper中转角速度是通过指定90°角应该有的理想速度（“直角速度”）并且其他的角度的转角速度也是根据它推导出来的。
zh_hant: 結點速度使用“近似向心加速度”確定。最佳 [作者描述](https://onehossshay.wordpress.com/2011/09/24/improving_grbl_cornering_algorithm/)。但是，在 Klipper 中，通過指定 90° 角應具有的所需速度（“方形角速度”）來配置結點速度，並由此得出其他角度的結點速度。

source: Key formula for look-ahead:
fr: Formule clé pour la projection :
zh_hans: 预计算的关键方程：
zh_hant: 預計算的關鍵方程：

source: Smoothed look-ahead
fr: Lissage de la projection
zh_hans: 预计算结果平滑
zh_hant: 預計算結果平滑

source: Klipper also implements a mechanism for smoothing out the motions of short "zigzag" moves. Consider the following moves:
fr: Klipper met également en œuvre un mécanisme permettant de lisser les mouvements de courts déplacements en "zigzag". Considérons les mouvements suivants :
zh_hans: Klipper 实现了一种用于平滑短距离之字形移动的机制。参考以下移动：
zh_hant: Klipper 實現了一種用於平滑短距離之字形移動的機制。參考以下移動：

source: In the above, the frequent changes from acceleration to deceleration can cause the machine to vibrate which causes stress on the machine and increases the noise. To reduce this, Klipper tracks both regular move acceleration as well as a virtual "acceleration to deceleration" rate. Using this system, the top speed of these short "zigzag" moves are limited to smooth out the printer motion:
fr: Dans l'exemple ci-dessus, les passages fréquents de l'accélération à la décélération peuvent faire vibrer la machine provoquant des contraintes sur la machine et augmentant le bruit. Pour réduire ce phénomène, Klipper suit à la fois l'accélération des mouvements réguliers et un taux virtuel "d'accélération à décélération". Grâce à ce système, la vitesse maximale de ces courts mouvements en "zigzag" est limitée pour lisser le mouvement de l'imprimante :
zh_hans: 在上述情况下，从加速到减速的频繁变化会导致机器振动并且会对机器造成压力和加噪音。为了减少这种情况，Klipper既跟踪常规的移动加速度并且也跟踪虚拟的"加减速率"。利用这个系统，这些短的"zigzag"移动的最高速度被限制以使得打印机的运动可以更加平滑：
zh_hant: 在上述情況下，從加速到減速的頻繁變化會導致機器振動，從而對機器造成壓力並增加噪音。為了減少這種情況，Klipper 跟踪常規移動加速度以及虛擬“加速到減速”率。使用這個系統，這些短的“之字形”移動的最高速度被限制為平滑打印機運動：

source: Specifically, the code calculates what the velocity of each move would be if it were limited to this virtual "acceleration to deceleration" rate (half the normal acceleration rate by default). In the above picture the dashed gray lines represent this virtual acceleration rate for the first move. If a move can not reach its full cruising speed using this virtual acceleration rate then its top speed is reduced to the maximum speed it could obtain at this virtual acceleration rate. For most moves the limit will be at or above the move's existing limits and no change in behavior is induced. For short zigzag moves, however, this limit reduces the top speed. Note that it does not change the actual acceleration within the move - the move continues to use the normal acceleration scheme up to its adjusted top-speed.
fr: Plus précisément, le code calcule ce que serait la vitesse de chaque mouvement s'il était limité à ce taux virtuel "d'accélération à décélération" (la moitié du taux d'accélération normal par défaut). Dans l'image ci-dessus, les lignes grises en pointillés représentent ce taux d'accélération virtuel pour le premier déplacement. Si un déplacement ne peut atteindre sa vitesse de croisière maximale en utilisant ce taux d'accélération virtuel, sa vitesse maximale est réduite à la vitesse maximale obtenu avec ce taux d'accélération virtuel. Pour la plupart des mouvements, la limite sera égale ou supérieure aux limites existantes du mouvement et aucun changement de comportement n'est induit. En revanche, pour les déplacements courts en zigzag, cette limite réduit la vitesse maximale. Notez que cela ne modifie pas l'accélération réelle du mouvement - le mouvement continue d'utiliser le schéma d'accélération normal jusqu'à sa vitesse maximale ajustée.
zh_hans: 具体来说，代码计算的是限制在这个虚拟的“加速到减速”率下时（默认为正常加速率的一半），每个动作的速度是多少。在上图中，灰色虚线代表了第一段移动时的虚拟加速率。如果一段移动使用这个虚拟加速度不能达到目标巡航速度，那么这段移动的最高速度将被降低到它在这个虚拟加速率下所能获得的最大速度。对于大多数移动来说，该限制将处于或高于该移动的现有限制，并且不会改变移动的行为。然而，对于短的 "之 "字形移动，这个限制会降低最高速度。请注意，它不会改变移动中的实际加速度--移动会继续使用正常的加速，直到其调整后的最高速度。
zh_hant: 具體來說，代碼計算每次移動的速度，如果它被限制在這個虛擬的“加速到減速”率（默認情況下為正常加速率的一半）。在上圖中，灰色虛線表示第一步的虛擬加速度。如果使用此虛擬加速度無法達到其全巡航速度，則其最高速度將降低到在此虛擬加速度下可以達到的最大速度。對於大多數移動，限制將等於或高於移動的現有限制，並且不會引起行為變化。然而，對於短的之字形移動，這個限制會降低最高速度。請注意，它不會改變移動中的實際加速度 - 移動將繼續使用正常加速方案，直至其調整後的最高速度。

source: Generating steps
fr: Étapes de la génération
zh_hans: 生成步数（Generating steps）
zh_hant: 生成步驟

source: Once the look-ahead process completes, the print head movement for the given move is fully known (time, start position, end position, velocity at each point) and it is possible to generate the step times for the move. This process is done within "kinematic classes" in the Klipper code. Outside of these kinematic classes, everything is tracked in millimeters, seconds, and in cartesian coordinate space. It's the task of the kinematic classes to convert from this generic coordinate system to the hardware specifics of the particular printer.
fr: Une fois le processus d'anticipation terminé, le mouvement de la tête d'impression du mouvement donné est entièrement connu (temps, position de départ, position finale, vitesse à chaque point) et il est possible de générer les durées de pas du mouvement. Ce processus est effectué dans les "classes cinématiques" du code Klipper. En dehors de ces classes cinématiques, tout est suivi en millimètres, en secondes et dans un espace de coordonnées cartésiennes. C'est la tâche des classes cinématiques de convertir ce système de coordonnées générique aux spécificités matérielles de l'imprimante particulière.
zh_hans: 前瞻过程完成后给定移动的打印头运动已被确定（时间、开始位置、结束位置、每一点的速度），可以被用于生成移动的步进时间。这个过程是在Klipper代码的运动学类中完成的。在这些运动学类之外，所有的东西都是以毫米、秒为单位，在笛卡尔坐标空间进行跟踪。运动学类负责将这个通用坐标系统转换为符合打印机硬件特性的坐标系。
zh_hant: 一旦前瞻過程完成，給定移動的打印頭移動是完全已知的（時間、開始位置、結束位置、每個點的速度），並且可以生成移動的步進時間。此過程在 Klipper 代碼中的“運動學類”中完成。在這些運動學類之外，一切都以毫米、秒和笛卡爾坐標空間為單位進行跟踪。運動學類的任務是將通用坐標系轉換為特定打印機的硬件細節。

source: Klipper uses an [iterative solver](https://en.wikipedia.org/wiki/Root-finding_algorithm) to generate the step times for each stepper. The code contains the formulas to calculate the ideal cartesian coordinates of the head at each moment in time, and it has the kinematic formulas to calculate the ideal stepper positions based on those cartesian coordinates. With these formulas, Klipper can determine the ideal time that the stepper should be at each step position. The given steps are then scheduled at these calculated times.
fr: Klipper utilise un [solveur itératif](https://en.wikipedia.org/wiki/Root-finding_algorithm) pour générer les durés de pas pour chaque moteur. Le code contient les formules permettant de calculer les coordonnées cartésiennes idéales de la tête à chaque instant, ainsi que les formules cinématiques permettant de calculer les positions idéales des moteurs à partir de ces coordonnées cartésiennes. Grâce à ces formules, Klipper peut déterminer le moment idéal où le moteur doit se trouver à chaque position de pas. Les étapes données sont alors programmées à ces moments calculés.
zh_hans: Klipper使用一个[迭代求解器](https://zh.wikipedia.org/wiki/%E6%B1%82%E6%A0%B9%E7%AE%97%E6%B3%95)来生成每个步进的步进时间。该代码包含了计算打印头在每个时间点上的理想笛卡尔坐标的公式，它还有运动学公式来计算基于这些笛卡尔坐标的理想步进位置。通过这些公式，Klipper可以确定步进电机在每个步进位置时的理想步进时间。然后在这些计算出的时间内安排给定的步进。
zh_hant: Klipper 使用 [iterative solver](https://en.wikipedia.org/wiki/Root-finding_algorithm) 為每個步進器生成步進時間。該代碼包含計算每個時刻頭部理想XYZ坐標的公式，並且它具有根據這些XYZ坐標計算理想步進器位置的動作公式。通過這些公式，Klipper 可以確定步進器應該在每個步進位置的理想時間。然後在這些計算的時間安排給定的步驟。

source: The key formula to determine how far a move should travel under constant acceleration is:
fr: La formule clé déterminant la distance qu'un mouvement doit parcourir sous une accélération constante est la suivante :
zh_hans: 确定一个移动在恒定加速度下应该移动多远的关键公式是：
zh_hant: 確定在恆定加速度下移動應該行進多遠的關鍵公式是：

source: and the key formula for movement with constant velocity is:
fr: et la formule clé d'un mouvement à vitesse constante est :
zh_hans: 并且匀速运动的关键公式是：
zh_hant: 勻速動作的關鍵公式是：

source: The key formulas for determining the cartesian coordinate of a move given a move distance is:
fr: Les formules clés permettant de déterminer la coordonnée cartésienne d'un déplacement en fonction de la distance du déplacement sont les suivantes :
zh_hans: 在给定移动距离的情况下用于确定移动的笛卡尔坐标的关键公式为：
zh_hant: 在給定移動距離的情況下，確定移動的XYZ坐標的關鍵公式是：

source: Cartesian Robots
fr: Robots cartésiens
zh_hans: 笛卡尔机器
zh_hant: XYZ 機型

source: Generating steps for cartesian printers is the simplest case. The movement on each axis is directly related to the movement in cartesian space.
fr: La génération de pas des imprimantes cartésiennes est le cas le plus simple. Le mouvement sur chaque axe est directement lié au mouvement dans l'espace cartésien.
zh_hans: 为笛卡尔坐标的打印机生成步进是最简单的情况。每个轴上的运动与笛卡尔空间中的运动直接相关。
zh_hant: 為XYZ機型打印機生成執行動作是最簡單。每個軸上的動作與各XYZ空間直接相關。

source: Key formulas:
fr: Formules clés :
zh_hans: 关键公式：
zh_hant: 關鍵公式：

source: CoreXY Robots
fr: Robots CoreXY
zh_hans: CoreXY 机器
zh_hant: CoreXY 機型

source: Generating steps on a CoreXY machine is only a little more complex than basic cartesian robots. The key formulas are:
fr: La génération de pas d'une machine CoreXY n'est qu'un peu plus complexe que les robots cartésiens de base. Les formules clés sont les suivantes :
zh_hans: 在CoreXY的机器上生成步进只比基本的卡特尔机器人复杂一点。关键公式是：
zh_hant: 在 CoreXY 機器上生成動作只比基本的XYZ機型的打印機複雜一點。關鍵公式是：

source: Delta Robots
fr: Robots Delta
zh_hans: 三角洲机器
zh_hant: 三角洲機型

source: Step generation on a delta robot is based on Pythagoras's theorem:
fr: La génération de pas d'un robot delta est basée sur le théorème de Pythagore :
zh_hans: 三角洲结构机器人上的步进生成基于勾股定理：
zh_hant: 三角洲機型的動作生成基於畢達哥拉斯定理：

source: Stepper motor acceleration limits
fr: Limites d'accélération du moteur pas à pas
zh_hans: 步进电机加速限制
zh_hant: 步進電機加速度限制

source: With delta kinematics it is possible for a move that is accelerating in cartesian space to require an acceleration on a particular stepper motor greater than the move's acceleration. This can occur when a stepper arm is more horizontal than vertical and the line of movement passes near that stepper's tower. Although these moves could require a stepper motor acceleration greater than the printer's maximum configured move acceleration, the effective mass moved by that stepper would be smaller. Thus the higher stepper acceleration does not result in significantly higher stepper torque and it is therefore considered harmless.
fr: Avec la cinématique delta, il est possible qu'un mouvement accélèrant dans l'espace cartésien nécessite une accélération sur un moteur pas à pas particulier supérieure à l'accélération du mouvement. Cela peut se produire lorsque le bras d'un moteur pas à pas est plus horizontal que vertical et que la ligne de mouvement passe près de la tour de ce moteur pas à pas. Bien que ces mouvements puissent nécessiter une accélération du moteur pas à pas supérieure à l'accélération maximale du mouvement configuré de l'imprimante, la masse effective déplacée par ce moteur pas à pas serait plus faible. Ainsi, l'accélération plus élevée du moteur pas à pas n'entraîne pas un couple beaucoup plus élevé et est donc considérée comme inoffensive.
zh_hans: 在三角洲机器运动时，打印头在笛卡尔空间中运动进行一定加速度的加速运动，其对应轴的步进电机需要高于前述加速度的加速度。这种状况在一打印壁需提供的水平运动幅度大于垂直运动幅度，并且，运动直线靠近某一垂柱时发生。尽管这些运动会要求步进电机的加速度超过打印机的加速度设置限额，但单个步进电机需要承担的有效质量是相对较小的。因此，增加的步进电机加速度不会显著增加步进电机的扭矩需求，可认为这种现象是无害的。
zh_hant: 使用三角洲機型時，在XYZ空間中加速的動作可能需要特定步進電機上的加速度大於運動的加速度。當步進臂比垂直更水平並且運動線通過步進器塔附近時，可能會發生這種情況。儘管這些移動可能需要一個大於打印機配置的最大移動加速度的步進電機加速度，但該步進電機移動的有效質量會更小。因此，更高的步進加速度不會導致顯著更高的步進扭矩，因此被認為是無害的。

source: However, to avoid extreme cases, Klipper enforces a maximum ceiling on stepper acceleration of three times the printer's configured maximum move acceleration. (Similarly, the maximum velocity of the stepper is limited to three times the maximum move velocity.) In order to enforce this limit, moves at the extreme edge of the build envelope (where a stepper arm may be nearly horizontal) will have a lower maximum acceleration and velocity.
fr: Cependant, afin d'éviter les cas extrêmes, Klipper applique un plafond maximal à l'accélération du moteur de trois fois l'accélération de déplacement maximale configurée de l'imprimante. (De même, la vitesse maximale du moteur est limitée à trois fois la vitesse de déplacement maximale). Afin de faire respecter cette limite, les mouvements situés à l'extrémité de l'enveloppe de construction (où le bras du stepper peut être presque horizontal) auront une accélération et une vitesse maximales inférieures.
zh_hans: 然而，为了避免极端状况，Klipper强制将步进电机的加速度上限设置为打印机加速度上限的3倍。（同样，步进电机的速度上限也设置为打印机速度上限的3倍。）为了实现上述设置，在打印区域水平边沿的（存在打印臂接近水平的）位置，打印头的速度和加速度上限将相应降低。
zh_hant: 但是，為避免極端情況，Klipper 將步進加速度的最大上限設置為打印機配置的最大移動加速度的三倍。 （類似地，步進器的最大速度被限制為最大移動速度的三倍。）為了強制執行此限制，在構建包絡的最邊緣（步進器臂可能幾乎水平）的移動將具有較低的最大加速度和速度。

source: Extruder kinematics
fr: Cinématique de l'extrudeuse
zh_hans: 挤出机运动学
zh_hant: 擠出機動作
