Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Kinematics.po
Languages: fr, zh_hans, zh_hant

source: Klipper implements extruder motion in its own kinematic class. Since the timing and speed of each print head movement is fully known for each move, it's possible to calculate the step times for the extruder independently from the step time calculations of the print head movement.
fr: Klipper implémente le mouvement de l'extrudeuse dans sa propre classe cinématique. Comme la durée et la vitesse de chaque mouvement de la tête d'impression sont entièrement connus pour chaque mouvement, il est possible de calculer les durées de pas de l'extrudeuse indépendamment des calculs de durées de pas du mouvement de la tête d'impression.
zh_hans: Klipper 在自身的运动学类中实现了挤出机的运动。由于每个打印头运动的时间和速度是完全已知的，因此可以独立于打印头运动的步长计算来计算挤出机的步长。
zh_hant: Klipper 在其自己的動作類別中實現了擠出機動作。由於每個打印頭移動的時間和速度對於每次移動都是完全已知的，因此可以獨立於打印頭移動的步進時間計算來計算擠出機的步進時間。

source: Basic extruder movement is simple to calculate. The step time generation uses the same formulas that cartesian robots use:
fr: Le mouvement de base de l'extrudeuse est simple à calculer. La génération de durée de pas utilise les mêmes formules que celles utilisées par les robots cartésiens :
zh_hans: 基本的挤出机运动计算起来很简单。步进时间的生成使用和笛卡尔结构相同的公式：
zh_hant: 基本的擠出機運動很容易計算。步時間生成使用與笛卡爾機器人相同的公式：

source: Pressure advance
fr: Avance à la pression
zh_hans: 压力提前

source: Experimentation has shown that it's possible to improve the modeling of the extruder beyond the basic extruder formula. In the ideal case, as an extrusion move progresses, the same volume of filament should be deposited at each point along the move and there should be no volume extruded after the move. Unfortunately, it's common to find that the basic extrusion formulas cause too little filament to exit the extruder at the start of extrusion moves and for excess filament to extrude after extrusion ends. This is often referred to as "ooze".
fr: L'expérimentation a montré qu'il est possible d'améliorer la modélisation de l'extrudeuse au-delà de la formule de base de l'extrudeuse. Dans le cas idéal, au fur et à mesure qu'un mouvement d'extrusion progresse, le même volume de filament devrait être déposé à chaque point du mouvement et il ne devrait pas y avoir de volume extrudé après le mouvement. Malheureusement, il est courant de constater que les formules d'extrusion de base font que trop peu de filament sort de l'extrudeuse au début des mouvements d'extrusion et qu'un excès de filament est extrudé après la fin de l'extrusion. Ce phénomène est souvent appelé "suintement".
zh_hans: 实验表明，在基本的挤出机方程之上可以改进挤出机的模型。在理想情况下，随着挤出移动的进行，沿移动的每个点应寄出相同体积的耗材，并且在移动后不应挤出任何耗材。不幸的是，在实际情况下，基本的挤出机方程会导致在挤出运动开始时挤出过少的耗材，并且在挤出结束后挤出过多的耗材。这通常被称为“溢料”。
zh_hant: 實驗表明，除了基本的擠出機配方外，還可以改進擠出機的建模。在理想情況下，隨著擠出移動的進行，沿移動的每個點應沉積相同體積的細絲，並且移動後不應有擠出體積。不幸的是，通常會發現基本擠出配方會導致在擠出運動開始時離開擠出機的細絲太少，而在擠出結束後擠出過多的細絲。這通常被稱為"ooze"。

source: ![ooze](img/ooze.svg.png)
fr: ![suintement](img/ooze.svg.png)
zh_hans: ![溢料](img/ooze.svg.png)

source: The "pressure advance" system attempts to account for this by using a different model for the extruder. Instead of naively believing that each mm^3 of filament fed into the extruder will result in that amount of mm^3 immediately exiting the extruder, it uses a model based on pressure. Pressure increases when filament is pushed into the extruder (as in [Hooke's law](https://en.wikipedia.org/wiki/Hooke%27s_law)) and the pressure necessary to extrude is dominated by the flow rate through the nozzle orifice (as in [Poiseuille's law](https://en.wikipedia.org/wiki/Poiseuille_law)). The key idea is that the relationship between filament, pressure, and flow rate can be modeled using a linear coefficient:
fr: Le système d'"avance à la pression" tente de tenir compte de ce phénomène en utilisant un modèle différent pour l'extrudeuse. Au lieu de croire naïvement que chaque mm^3 de filament introduit dans l'extrudeuse entraînera la sortie immédiate de cette quantité de mm^3, est utilisé un modèle basé sur la pression. La pression augmente lorsque le filament est poussé dans l'extrudeuse (comme dans la [loi de Hooke](https://en.wikipedia.org/wiki/Hooke%27s_law)) et la pression nécessaire pour extruder est dominée par le débit à travers l'orifice de la buse (comme dans la [loi de Poiseuille](https://en.wikipedia.org/wiki/Poiseuille_law)). L'idée principale est que la relation entre le filament, la pression et le débit peut être modélisée par un coefficient linéaire :
zh_hans: "压力推进"系统试图通过使用一个不同的挤出机模型来解决这个问题。它不理想的假设送入挤出机的每mm^3耗材将导致该体积的mm^3立即被挤出，而是使用基于压力的模型。当耗材被推入挤出机时，压力会增加（如[胡克定律](https://en.wikipedia.org/wiki/Hooke%27s_law)），而挤出所需的压力则由通过喷嘴孔口的流速决定（如[泊伊维尔定律](https://en.wikipedia.org/wiki/Poiseuille_law)）。关键的想法是，耗材、压力和流速之间的关系可以用一个线性系数来建模：
zh_hant: "pressure advance"系統試圖通過使用不同型號的擠出機來解決這個問題。與其天真地相信每 mm^3 的長絲送入擠出機都會導致該量的 mm^3 立即離開擠出機，而是使用基於壓力的模型。當長絲被推入擠出機時壓力增加（如[胡克定律]（https://en.wikipedia.org/wiki/Hooke%27s_law）），擠出所需的壓力由通過噴嘴孔的流速決定（如 [Poiseuille 定律](https://en.wikipedia.org/wiki/Poiseuille_law)）。關鍵思想是燈絲、壓力和流量之間的關係可以使用線性係數進行建模：

source: See the [pressure advance](Pressure_Advance.md) document for information on how to find this pressure advance coefficient.
fr: Voir le document [avance à la pression](Pressure_Advance.md) pour savoir comment déterminer ce coefficient d'avance à la pression.
zh_hans: 有关如何测量压力提前系数的信息，请参阅 [压力提前](Pressure_Advance.md) 文档。
zh_hant: 有關如何查找此壓力提前係數的信息，請參閱 [壓力提前](Pressure_Advance.md) 文檔。

source: The basic pressure advance formula can cause the extruder motor to make sudden velocity changes. Klipper implements "smoothing" of the extruder movement to avoid this.
fr: La formule de base de l'avance à la pression peut entraîner des changements brusques de la vitesse du moteur de l'extrudeuse. Klipper met en œuvre un "lissage" du mouvement de l'extrudeuse pour éviter cela.
zh_hans: 基本的压力推进公式会对挤出机电机的速度进行很大的瞬时调整。Klipper 通过实施挤出机运动的"平滑"（smoothing）以避免这种情况。
zh_hant: 基本的壓力提前公式會導致擠出機電機發生突然的速度變化。 Klipper 實現了擠出機運動的“平滑”以避免這種情況。

source: The above graph shows an example of two extrusion moves with a non-zero cornering velocity between them. Note that the pressure advance system causes additional filament to be pushed into the extruder during acceleration. The higher the desired filament flow rate, the more filament must be pushed in during acceleration to account for pressure. During head deceleration the extra filament is retracted (the extruder will have a negative velocity).
fr: Le graphique ci-dessus montre un exemple de deux mouvements d'extrusion avec une vitesse de virage non nulle entre eux. Notez que le système d'avance à la pression fait que du filament supplémentaire est poussé dans l'extrudeuse pendant l'accélération. Plus le débit de filament souhaité est élevé, plus il faut pousser de filament dans l'extrudeuse pendant l'accélération pour tenir compte de la pression. Pendant la décélération de la tête, le filament supplémentaire est rétracté (l'extrudeuse aura une vitesse négative).
zh_hans: 上图以两个挤出运动为例，它们之间的转弯速度不为零。请注意，压力推进系统在加速过程中会导致额外的耗材被推入挤出机。所需的耗材流量越高，在加速过程中必须推入更多的耗材以均衡压力。在打印头减速期间，额外的耗材会被回抽（挤出机将有一个负速度）。
zh_hant: 上圖顯示了兩個擠壓移動的示例，它們之間的轉彎速度為非零。請注意，壓力推進系統會在加速過程中將額外的細絲推入擠出機。所需的燈絲流速越高，在加速過程中必須推入的燈絲越多以解決壓力問題。在機頭減速期間，額外的細絲縮回（擠出機將具有負速度）。

source: The "smoothing" is implemented using a weighted average of the extruder position over a small time period (as specified by the `pressure_advance_smooth_time` config parameter). This averaging can span multiple g-code moves. Note how the extruder motor will start moving prior to the nominal start of the first extrusion move and will continue to move after the nominal end of the last extrusion move.
fr: Le "lissage" est implémenté en utilisant une moyenne pondérée de la position de l'extrudeuse sur une très courte période de temps (comme spécifié par le paramètre de configuration `pressure_advance_smooth_time`). Cette moyenne peut s'étendre sur plusieurs mouvements du g-code. Notez comment le moteur de l'extrudeuse commencera à bouger avant le début nominal du premier mouvement d'extrusion et continuera à bouger après la fin nominale du dernier mouvement d'extrusion.
zh_hans: “平滑”由挤出机位置在一小段时间内的加权平均值实现的（由 `pressure_advance_smooth_time` 配置参数指定）。这种平均可以跨越多个 g 代码移动。请注意，挤出机电机将如何在第一次挤出运动的标称起点之前开始移动，并在最后一次挤出运动的标称结束之后继续移动。
zh_hant: “平滑”是使用擠出機位置在一小段時間內的加權平均值來實現的（由 `pressure_advance_smooth_time` 配置參數指定）。這種平均可以跨越多個 g 代碼移動。請注意擠出機電機將如何在第一次擠出移動的標稱開始之前開始移動，並將在最後一次擠出移動的標稱結束後繼續移動。

source: Key formula for "smoothed pressure advance":
fr: Formule clé pour "l'avance à la pression lissée" :
zh_hans: "平滑压力提前"的关键公式：
zh_hant: "smoothed pressure advance"的關鍵公式：

source: Kinematics
fr: Cinématiques
zh_hans: 运动学
zh_hant: 運動學
