Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Manual_Level.po
Languages: hu, ko, zh_hans, zh_hant

source: This document describes tools for calibrating a Z endstop and for performing adjustments to bed leveling screws.
hu: Ez a dokumentum a Z végállás kalibrálásához és az ágyat kiegyenlítő csavarok beállításához szükséges eszközöket ismerteti.
ko: 이 문서는 Z 엔드스톱을 보정하고 BED 레벨링 나사를 조정하기 위한 도구에 대해 설명합니다.
zh_hans: 本文介绍了用于校准Z限位和对打印床调品螺丝进行调整的工具。
zh_hant: 本文介紹了用於校準Z限位和對列印床調品螺絲進行調整的工具。

source: Calibrating a Z endstop
hu: Z végállás kalibrálása
ko: Z 엔드스톱 보정
zh_hans: 校准 Z 限位
zh_hant: 校準 Z 限位

source: An accurate Z endstop position is critical to obtaining high quality prints.
hu: A pontos Z végállás pozíciója kritikus fontosságú a jó minőségű nyomatok elkészítéséhez.
ko: 정확한 Z 엔드스톱 위치는 고품질 인쇄물을 얻는 데 매우 중요합니다.
zh_hans: 准确的 Z 轴限位位置对于获得高质量打印至关重要。
zh_hant: 準確的 Z 軸限位位置對於獲得高質量列印至關重要。

source: Note, though, the accuracy of the Z endstop switch itself can be a limiting factor. If one is using Trinamic stepper motor drivers then consider enabling [endstop phase](Endstop_Phase.md) detection to improve the accuracy of the switch.
hu: Vegye figyelembe azonban, hogy maga a Z végálláskapcsoló pontossága korlátozó tényező lehet. Ha Trinamic léptetőmotor-meghajtókat használunk, akkor fontoljuk meg a [végstop fázis](Endstop_Phase.md) érzékelés engedélyezését a kapcsoló pontosságának javítása érdekében.
ko: 그러나 Z 엔드스톱 스위치 자체의 정확도가 제한 요소가 될 수 있습니다. Trinamic 스테퍼 모터 드라이버를 사용하는 경우 [endstop phase](Endstop_Phase.md) 감지를 활성화하여 스위치의 정확도를 높이는 것이 좋습니다.
zh_hans: 请注意，Z 限位开关本身的精度限制了调平的精度。如果使用 Trinamic 步进电机驱动，那么可以考虑启用[限位相位](Endstop_Phase.md)检测以提高开关的精度。
zh_hant: 請注意，Z 限位開關本身的精度限制了調平的精度。如果使用 Trinamic 步進電機驅動，那麼可以考慮啟用[限位相位](Endstop_Phase.md)檢測以提高開關的精度。

source: To perform a Z endstop calibration, home the printer, command the head to move to a Z position that is at least five millimeters above the bed (if it is not already), command the head to move to an XY position near the center of the bed, then navigate to the OctoPrint terminal tab and run:
hu: A Z végpont kalibrálásának végrehajtásához kapcsolja be a nyomtatót, utasítsa a fejet, hogy mozogjon egy Z pozícióba, amely legalább öt milliméterrel az ágy felett van (ha még nincs), utasítsa a fejet, hogy mozogjon egy X-Y pozícióba, közel a nyomtató közepéhez az ágyra, majd navigáljon az OctoPrint terminál fülre, és futtassa:
ko: Z 엔드스톱 보정을 수행하려면 프린터를 홈으로 이동하고 헤드가 BED 에서 최소 5mm 위에 있는 Z 위치로 이동하도록 명령하고 (아직 하지 않는 경우) 헤드가 중심 근처의 XY 위치로 이동하도록 명령합니다. BED 에서 OctoPrint 터미널 탭으로 이동하여 다음을 실행합니다:
zh_hans: 要进行Z轴限位校准，请归位打印机，命令打印头移动到离床身至少5毫米的Z轴位置（如果还没有），命令打印头移动到靠近床身中心的XY位置，然后到OctoPrint终端中并且运行：
zh_hant: 要執行 Z 限位器校準，請將打印機歸位，命令打印頭移動到距離床身至少 5 毫米的 Z 位置（如果尚未），命令打印頭移動到靠近打印頭中心的 XY 位置床，然後導航到 OctoPrint 終端選項卡並運行：

source: Then follow the steps described at ["the paper test"](Bed_Level.md#the-paper-test) to determine the actual distance between the nozzle and bed at the given location. Once those steps are complete one can `ACCEPT` the position and save the results to the config file with:
hu: Ezután kövesse a ["a papírteszt"](Bed_Level.md#the-paper-test) pontban leírt lépéseket a fúvóka és az ágy közötti tényleges távolság meghatározásához az adott helyen. Ha ezek a lépések befejeződtek, akkor `ACCEPT` és elmentheti az eredményeket a config fájlba a következővel:
ko: 그런 다음 ["the paper test"](Bed_Level.md#the-paper-test) 에 설명된 단계에 따라 주어진 위치에서 노즐과 BED 사이의 실제 거리를 결정합니다. 이러한 단계가 완료되면 위치를 `ACCEPT` 하고 다음을 사용하여 구성 파일에 결과를 저장할 수 있습니다:
zh_hans: 塞纸测试然后按照["塞纸测试"](Bed_Level.md#the-paper-test)描述的步骤，确定喷嘴和床身在给定位置的实际距离。一旦这些步骤完成，就可以`ACCEPT`该位置，并将结果保存到配置文件中：
zh_hant: 然後按照 ["the paper test"](Bed_Level.md#the-paper-test) 中描述的步驟確定給定位置的噴嘴和床之間的實際距離。完成這些步驟後，可以“接受”該位置並將結果保存到配置文件中：

source: It's preferable to use a Z endstop switch on the opposite end of the Z axis from the bed. (Homing away from the bed is more robust as then it is generally always safe to home the Z.) However, if one must home towards the bed it is recommended to adjust the endstop so that it triggers a small distance (eg, .5mm) above the bed. Almost all endstop switches can safely be depressed a small distance beyond their trigger point. When this is done, one should find that the `Z_ENDSTOP_CALIBRATE` command reports a small positive value (eg, .5mm) for the Z position_endstop. Triggering the endstop while it is still some distance from the bed reduces the risk of inadvertent bed crashes.
hu: Előnyösebb, ha a Z végálláskapcsolót a Z tengelynek az ággyal ellentétes végére helyezzük. (Az ágytól távolabb történő kezdőpont keresés robusztusabb, mivel akkor általában mindig biztonságosan lehet a Z-t kezdőpontra állítani.) Ha azonban az ágy felé kell kezdőpontot felvenni, ajánlott a végálláskapcsolót úgy beállítani, hogy az kis távolságra (pl. 0,5 mm-re) az ágy fölött kapcsoljon. Majdnem minden végálláskapcsoló biztonságosan lenyomható egy kis távolsággal a kioldási ponton túl. Ha ez megtörtént, azt kell tapasztalni, hogy a `Z_ENDSTOP_CALIBRATE` parancs egy kis pozitív értéket (pl. .5mm) jelez a Z pozíció végálláshoz. A végállás érzékelése akkor, amikor az még bizonyos távolságra van az ágytól, csökkenti a véletlen ágyba ütközések kockázatát.
ko: BED 에서 Z축의 반대쪽 끝에 Z 엔드스톱 스위치를 사용하는 것이 좋습니다. (BED 에서 멀어지는 방향으로 귀환하는 것이 일반적으로 Z로 귀환하는 것이 항상 안전하므로 더 강력합니다.) 그러나 BED 를 향해 Homing 하는 경우 BED 위의 작은 거리(예: 0.5mm)가 트리거되도록 엔드스톱을 조정하는 것이 좋습니다. 거의 모든 엔드스톱 스위치는 트리거 포인트를 넘어 약간 떨어진 거리에서 안전하게 누를 수 있습니다. 이 작업이 완료되면 `Z_ENDSTOP_CALIBRATE` 명령이 Z position_endstop 에 대해 작은 양수 값(예: .5mm)을 나태내는 것을 알 수 있습니다. BED 에서 아직 약간의 거리가 있는 동안 엔드스톱을 트리거하면 의도하지 않은 BED 충돌의 위험이 줄어듭니다.
zh_hans: 最好是在Z轴与加热床面之间使用Z限位开关（远离床面的限位开关更加稳定安全，因为这样的话，Z轴的原点通常是安全的）。然而，如果必须向加热床归位，建议调整限位开关，使其在加热床床面上方一小段距离（例如0.5毫米）触发。几乎所有的限位开关都可以在触发点以外的一小段距离安全地压下。当这样做时，你会发现`Z_ENDSTOP_CALIBRATE`命令输出一个小的正值（比如0.5毫米）的Z限位位置。
zh_hant: 最好在床的 Z 軸的另一端使用 Z 限位開關。 （遠離床的歸位更加穩健，因為通常將 Z 歸位總是安全的。）但是，如果必須向床歸位，建議調整限位器以觸發小距離（例如，0.5 毫米） ) 在床上方。幾乎所有的限位開關都可以安全地按下其觸發點以外的一小段距離。完成此操作後，應該會發現“Z_ENDSTOP_CALIBRATE”命令報告了 Z position_endstop 的一個小的正值（例如，0.5mm）。在離床仍有一段距離時觸發終點止動裝置可降低意外撞床的風險。

source: Some printers have the ability to manually adjust the location of the physical endstop switch. However, it's recommended to perform Z endstop positioning in software with Klipper - once the physical location of the endstop is in a convenient location, one can make any further adjustments by running Z_ENDSTOP_CALIBRATE or by manually updating the Z position_endstop in the configuration file.
hu: Egyes nyomtatókon lehetőség van a fizikai végálláskapcsoló helyének kézi beállítására. Azonban ajánlott a Z végállás pozíciónálását szoftveresen elvégezni a Klipperrel. Ha a végállás fizikai helyzete megfelelő helyen van, a további beállításokat a Z_ENDSTOP_CALIBRATE futtatásával vagy a Z position_endstop konfigurációs fájlban lévő Z position_endstop manuális frissítésével lehet elvégezni.
ko: 일부 프린터에는 물리적 엔드스톱 스위치의 위치를 수동으로 조정할 수 있는 기능이 있습니다. 그러나 Klipper 를 사용하여 소프트웨어에서 Z 엔드스톱 위치 지정을 수행하는 것이 좋습니다. 엔드스톱의 물리적 위치가 편리한 위치에 있으면 Z_ENDSTOP_CALIBRATE 를 실행하거나 구성 파일에서 Z position_endstop 을 수동으로 업데이트하여 추가 조정을 수행할 수 있습니다.
zh_hans: 某些打印机能够手动调整限位开关的物理位置，但是建议使用 Klipper 在软件中执行 Z 限位定位-在将限位的物理位置固定于方便微调的位置，就可以通过运行 Z_ENDSTOP_CALIBRATE 或通过手动更新配置文件中的 Z position_endstop 来进行进一步的调整。
zh_hant: 某些打印機能夠手動調整物理止動開關的位置。但是，建議使用 Klipper 在軟件中執行 Z 終點定位 - 一旦終點的物理位置位於方便的位置，可以通過運行 Z_ENDSTOP_CALIBRATE 或通過手動更新配置文件中的 Z position_endstop 來進行任何進一步的調整。

source: Adjusting bed leveling screws
hu: Ágyszintező csavarok beállítása
ko: BED 레벨링 나사 조정
zh_hans: 调整打印调平螺丝
zh_hant: 調整列印調平螺絲

source: The secret to getting good bed leveling with bed leveling screws is to utilize the printer's high precision motion system during the bed leveling process itself. This is done by commanding the nozzle to a position near each bed screw and then adjusting that screw until the bed is a set distance from the nozzle. Klipper has a tool to assist with this. In order to use the tool it is necessary to specify each screw XY location.
hu: Az ágyat kiegyenlítő csavarokkal történő jó szintezés titka a nyomtató nagy pontosságú mozgásrendszerének kihasználása a szintezési folyamat során. Ez úgy történik, hogy a fúvókát az egyes szintezőcsavarok közelében lévő pozícióba navigáljuk, majd az adott csavart addig állítjuk, amíg az ágy egy meghatározott távolságra nem kerül a fúvókától. A Klipper rendelkezik egy eszközzel, amely ezt segíti. Az eszköz használatához meg kell adni az egyes csavarok X-Y helyzetét.
ko: BED 레벨링 나사로 BED 레벨링을 잘 하는 비결은 BED 레벨링 과정 자체에서 프린터의 고정밀 모션 시스템을 활용하는 것입니다. 이것은 노즐을 각 BED 나사 근처의 위치로 지정한 다음 BED 가 노즐에서 설정된 거리가 될 때까지 해당 나사를 조정하여 수행됩니다. Klipper에는 이를 지원하는 도구가 있습니다. 도구를 사용하려면 각 나사 XY 위치를 지정해야 합니다.
zh_hans: 使用打印床调平螺丝获得平整打印床的秘诀是在床身调平过程中利用打印机高精度的运动系统，通过将喷嘴命令到每个调平螺丝附近的位置，然后调整该螺丝直到床与喷嘴保持固定的距离。Klipper 的一个内置工具可以协助解决这个问题。为了使用该工具，必须指定每个螺丝的XY坐标。
zh_hant: 使用床身調平螺絲獲得良好床身調平的秘訣是在床身調平過程中利用打印機的高精度運動系統。這是通過將噴嘴命令到每個床螺桿附近的位置，然後調整該螺桿直到床與噴嘴之間的設定距離來完成的。 Klipper 有一個工具可以幫助解決這個問題。為了使用該工具，必須指定每個螺絲的 XY 位置。

source: This is done by creating a `[bed_screws]` config section. For example, it might look something similar to:
hu: Ezt egy `[bed_screws]` konfigurációs szakasz létrehozásával érhetjük el. Ez például valahogy így nézhet ki:
ko: 이것은 `[bed_screws]` config 섹션을 생성하여 수행됩니다. 예를 들어 다음과 유사할 수 있습니다:
zh_hans: 这是通过创建一个`[bed_screws]`配置部分来实现的。例如，它可能看起来类似于以下内容:
zh_hant: 這是通過創建一個 `[bed_screws]` 配置部分來完成的。例如，它可能看起來類似於：

source: If a bed screw is under the bed, then specify the XY position directly above the screw. If the screw is outside the bed then specify an XY position closest to the screw that is still within the range of the bed.
hu: Ha egy ágycsavar az ágy alatt van, akkor adja meg az X-Y pozíciót közvetlenül a csavar felett. Ha a csavar az ágyon kívül van, akkor adja meg a csavarhoz legközelebbi X-Y-pozíciót, amely még az ágy hatótávolságán belül van.
ko: BED 나사가 BED 아래에 있는 경우 나사 바로 위에 XY 위치를 지정합니다. 나사가 BED 외부에 있으면 여전히 BED 범위 내에 있는 나사에 가장 가까운 XY 위치를 지정합니다.
zh_hans: 如果床头调平螺丝在床下，则指定调平螺丝正上方的XY位置。如果螺钉在床身外，则指定一个最接近调平螺丝的XY位置，但仍在床身的范围内。
zh_hant: 如果床底螺絲位於床底下，則指定螺絲正上方的 XY 位置。如果螺絲在床外，則指定最靠近仍在床範圍內的螺絲的 XY 位置。

source: Once the config file is ready, run `RESTART` to load that config, and then one can start the tool by running:
hu: Miután a konfigurációs fájl készen áll, futtassa a `RESTART` parancsot a konfiguráció betöltéséhez, majd elindíthatja az eszközt a következő futtatásával:
ko: config 파일이 준비되면 `RESTART`를 실행하여 해당 config 를 로드한 다음 다음을 실행하여 도구를 시작할 수 있습니다:
zh_hans: 一旦配置文件准备好了，运行`RESTART`来加载该配置，然后就可以通过运行以下命令使用工具:
zh_hant: 配置文件準備好後，運行“RESTART”以加載該配置，然後可以通過運行以下命令啟動該工具：

source: This tool will move the printer's nozzle to each screw XY location and then move the nozzle to a Z=0 height. At this point one can use the "paper test" to adjust the bed screw directly under the nozzle. See the information described in ["the paper test"](Bed_Level.md#the-paper-test), but adjust the bed screw instead of commanding the nozzle to different heights. Adjust the bed screw until there is a small amount of friction when pushing the paper back and forth.
hu: Ez az eszköz a nyomtató fúvókát minden egyes csavar X-Y helyére mozgatja, majd a fúvókát Z=0 magasságba mozgatja. Ezen a ponton a "papírteszt" segítségével közvetlenül a fúvóka alatt lehet beállítani az ágy csavarját. Lásd a ["a papírteszt"](Bed_Level.md#the-paper-test)-ben leírtakat. De a fúvóka különböző magasságokba navigálása helyett az ágycsavart állítsa be. Addig állítsa a csavart, amíg a papír előre-hátra tolása közben kis súrlódás nem keletkezik.
ko: 이 도구는 프린터의 노즐을 각 나사 XY 위치로 이동한 다음 노즐을 Z=0 높이로 이동합니다. 이 시점에서 ["the paper test"](Bed_Level.md#the-paper-test) 를 사용하여 노즐 바로 아래의 BED 나사를 조정할 수 있습니다. 용지를 앞뒤로 밀 때 약간의 마찰이 있을 때까지 BED 나사를 조정합니다.
zh_hans: 这个工具将把打印机的喷嘴移动到每个调平螺丝的XY位置，然后把喷嘴移动到Z=0的高度。在这一点上，可以使用"纸张测试"来直接调整喷嘴下方的热床调平螺母。参见["纸张测试"](Bed_Level.md#the-paper-test)中描述的信息，但要调整的是热床螺母而不是指定喷头到不同的高度。调整热床调平螺母，直到来回推送纸张时有少量的摩擦。
zh_hant: 此工具會將打印機的噴嘴移動到每個螺絲 XY 位置，然後將噴嘴移動到 Z=0 高度。此時可以使用“試紙”來調整噴嘴正下方的床頭螺絲。請參閱 ["the paper test"](Bed_Level.md#the-paper-test) 中描述的信息，但要調整床螺絲而不是命令噴嘴到不同的高度。調整床螺絲，直到來回推紙時有少量摩擦。

source: Once the screw is adjusted so that a small amount of friction is felt, run either the `ACCEPT` or `ADJUSTED` command. Use the `ADJUSTED` command if the bed screw needed an adjustment (typically anything more than about 1/8th of a turn of the screw). Use the `ACCEPT` command if no significant adjustment is necessary. Both commands will cause the tool to proceed to the next screw. (When an `ADJUSTED` command is used, the tool will schedule an additional cycle of bed screw adjustments; the tool completes successfully when all bed screws are verified to not require any significant adjustments.) One can use the `ABORT` command to exit the tool early.
hu: Miután a csavart úgy állítottuk be, hogy egy kis súrlódás érezhető legyen, futtassuk az `ACCEPT` vagy az `ADJUSTED` parancsot. Használja az `ADJUSTED` parancsot, ha a szintezőcsavar beállítására van szükség (általában bármi, ami több mint 1/8 csavarfordulat). Használja az `ACCEPT` parancsot, ha nincs szükség jelentős beállításra. Mindkét parancs hatására a szerszám a következő csavarhoz lép. (Ha az `ADJUSTED` parancsot használja, a szerszám egy további szintezőcsavar-beállítási ciklust ütemez be. A szerszám sikeresen befejezi, ha az összes szintezőcsavarról bebizonyosodik, hogy nem igényel jelentős beállítást.) Az `ABORT` paranccsal idő előtt ki lehet lépni a szintezésből.
ko: 약간의 마찰이 느껴지도록 나사를 조정했으면 `ACCEPT` 또는 `ADJUSTED` 명령을 실행합니다. BED 나사를 조정해야 하는 경우 `ADJUSTED` 명령을 사용합니다 (일반적으로 나사 회전의 약 1/8 이상). 더이상 조정이 필요하지 않은 경우 `ACCEPT` 명령을 사용하십시오. 두 명령 모두 도구가 다음 나사로 진행하도록 합니다. ('ADJUSTED' 명령을 사용하면 도구가 BED 나사 조정의 추가 주기를 예약합니다. 모든 BED 나사가 더이상 조정이 필요하지 않은 것으로 확인되면 도구가 성공적으로 완료됩니다.) `ABORT` 명령을 사용하여 도구를 일찍 종료할 수 있습니다.
zh_hans: 一旦螺丝被调整到可以感觉到少量的摩擦，运行`ACCEPT`或者`ADJUSTED`命令。如果床身螺丝需要调整（通常是任何超过1/8圈的转动），使用`ADJUSTED`命令。如果没有必要进行重大调整，则使用`ACCEPT`命令。这两条命令都会使工具进入下一个螺丝。(当使用`ADJUSTED`命令时，工具将安排一个额外的床身螺钉调整周期；当所有热床调平螺丝被确认不需要任何重大调整时，工具成功完成。)也可以使用`ABORT`命令来提前退出工具。
zh_hant: 一旦調整好螺絲以感覺到少量摩擦，運行“接受”或“調整”命令。如果底座螺絲需要調整（通常超過螺絲的 1/8 圈），請使用“ADJUSTED”命令。如果不需要進行重大調整，請使用“ACCEPT”命令。這兩個命令都會使工具繼續下一個螺絲。 （當使用“ADJUSTED”命令時，該工具將安排一個額外的底螺絲調整週期；當驗證所有底螺絲不需要任何重大調整時，該工具成功完成。）可以使用“ABORT”命令退出工具早。

source: This system works best when the printer has a flat printing surface (such as glass) and has straight rails. Upon successful completion of the bed leveling tool the bed should be ready for printing.
hu: Ez a rendszer akkor működik a legjobban, ha a nyomtató sík nyomtatási felülettel (például üveggel) és egyenes sínekkel rendelkezik. Az ágyszintező eszköz sikeres elvégzése után az ágy készen áll a nyomtatásra.
ko: 이 시스템은 프린터에 평평한 인쇄 표면(예: 유리)이 있고 직선 레일이 있을 때 가장 잘 작동합니다. BED 레벨링 도구가 성공적으로 완료되면 BED 인쇄할 준비가 되어야 합니다.
zh_hans: 这个系统在打印机有一个平整的打印表面（如玻璃）并有笔直的导轨时效果最好。在成功完成打印床调平工具后，热床应该准备好进行打印。
zh_hant: 當打印機具有平坦的打印表面（例如玻璃）並具有直導軌時，此系統效果最佳。成功完成床調平工具後，床應準備好進行打印。

source: Fine grained bed screw adjustments
hu: Finom menetes ágycsavar beállítások
ko: 미세한 BED 나사 조정
zh_hans: 细颗粒热床调平螺丝调整
zh_hant: 細粒床身螺桿調整

source: If the printer uses three bed screws and all three screws are under the bed, then it may be possible to perform a second "high precision" bed leveling step. This is done by commanding the nozzle to locations where the bed moves a larger distance with each bed screw adjustment.
hu: Ha a nyomtató három szintezőcsavart használ, és mindhárom csavar az ágy alatt van, akkor lehetséges egy második "nagy pontosságú" szintezési lépés elvégzése. Ez úgy történik, hogy a fúvókát olyan helyekre irányítja, ahol az ágy minden egyes szintezőcsavar beállítással nagyobb távolságot mozdul el.
ko: 프린터가 3개의 BED 나사를 사용하고 3개의 나사가 모두 BED 아래에 있는 경우 두 번째 "고정밀" BED 레벨링 단계를 수행할 수 있습니다. 이것은 각 BED 나사 조정으로 BED가 더 먼 거리를 이동하는 위치로 노즐을 명령하여 수행됩니다.
zh_hans: 如果打印机使用三个热床调平螺丝，并且所有三个调平螺丝都在热床下面，那么就有可能执行第二个"高精度"热床调平步骤。这是通过命令喷头到热床当在每次调整床身时移动较大距离的位置来实现的。
zh_hant: 如果打印機使用三個床身螺絲並且所有三個螺絲都在床身下方，則可以執行第二個“高精度”床身調平步驟。這是通過將噴嘴命令到每次調整床螺桿時床移動較大距離的位置來完成的。

source: For example, consider a bed with screws at locations A, B, and C:
hu: Vegyünk például egy ágyat, amelynek A, B és C helyén csavarok vannak:
ko: 예를 들어 위치 A, B 및 C에 나사가 있는 BED를 생각할 수 있습니다:
zh_hans: 例如，考虑一张在A B C位置有螺丝的打印平台：
zh_hant: 例如，考慮在 A、B 和 C 位置有螺絲的床：

source: For each adjustment made to the bed screw at location C, the bed will swing along a pendulum defined by the remaining two bed screws (shown here as a green line). In this situation, each adjustment to the bed screw at C will move the bed at position D a further amount than directly at C. It is thus possible to make an improved C screw adjustment when the nozzle is at position D.
hu: A C helyen lévő szintezőcsavar minden egyes beállítása esetén az ágy a fennmaradó két szintezőcsavar által meghatározott inga mentén fog lengeni (itt zöld vonalként látható). Ebben a helyzetben a szintezőcsavar állítása a C helyzetben az ágyat kissebb a D helyzetben egy nagyobb mértékben mozdítja el.
ko: 위치 C에서 BED 나사를 조정할 때마다 BED는 나머지 2개의 BED 나사 (여기서는 녹색 선으로 표시)에 의해 정의된 선을 따라 양쪽으로 기울어 집니다. 이 상황에서 C에서 BED 나사를 조정할 때마다 C에서 보다 D 위치에서 BED가 더 많이 움직입니다. 따라서 노즐이 위치 D에 있을 때 C 나사 조정을 개선할 수 있습니다.
zh_hans: 在位于C位置的螺丝每次调整间，打印床/打印头将沿着由其余两个螺丝定义的坐标摆锤摆动（此处显示为绿线）。在这种情况下，每次调整C处的床螺钉都会使打印床在位置D处移动比在C处移动更多的量。因此，可以通过将喷嘴置于D位置进行对C位置螺丝的精确调整。
zh_hant: 對於位置 C 處的床身螺絲進行的每次調整，床身將沿著由其餘兩個床身螺絲定義的擺錘擺動（此處顯示為綠線）。在這種情況下，在 C 處對床螺桿的每次調整都會使 D 位置的床比直接在 C 處移動更多的量。因此，當噴嘴處於位置 D 時，可以進行改進的 C 螺桿調節。

source: To enable this feature, one would determine the additional nozzle coordinates and add them to the config file. For example, it might look like:
hu: A funkció engedélyezéséhez meg kell határozni a további fúvókakoordinátákat, és hozzá kell adni őket a konfigurációs fájlhoz. Ez például így nézhet ki:
ko: 이 기능을 활성화하려면 추가 노즐 좌표를 결정하고 config 파일에 추가해야 합니다. 예를 들어 다음과 같을 수 있습니다:
zh_hans: 要启用此功能，需要定义额外的喷嘴坐标并将其添加到配置文件中。例如：
zh_hant: 要啟用此功能，需要確定額外的噴嘴坐標並將它們添加到配置文件中。例如，它可能看起來像：

source: When this feature is enabled, the `BED_SCREWS_ADJUST` tool will first prompt for coarse adjustments directly above each screw position, and once those are accepted, it will prompt for fine adjustments at the additional locations. Continue to use `ACCEPT` and `ADJUSTED` at each position.
hu: Ha ez a funkció engedélyezve van, a `BED_SCREWS_ADJUST` eszköz először közvetlenül az egyes csavarok pozíciói felett kér durva beállításokat, és ha ezeket elfogadta, akkor a további helyeken finom beállításokat kér. Folytassa az `ACCEPT` és `ADJUSTED` használatával minden egyes pozícióban.
ko: 이 기능이 활성화되면 `BED_SCREWS_ADJUST` 도구는 먼저 각 나사 위치 바로 위의 대략적인 조정을 요청하고 일단 수락되면 추가 위치에서 미세 조정을 요청합니다. 각 위치에서 `ACCEPT` 및 `ADJUSTED` 를 계속 사용합니다.
zh_hans: 当此功能被启用时，`BED_SCREWS_ADJUST`工具将先提示在每个螺钉位置正上方进行粗调，一旦这些被接受，它将提示在其他位置进行细调。继续在每个位置使用`ACCEPT`和`ADJUSTED`。
zh_hant: 啟用此功能後，“BED_SCREWS_ADJUST”工具將首先在每個螺絲位置的正上方提示進行粗調，一旦接受，它將提示在其他位置進行微調。繼續在每個位置使用 `ACCEPT` 和 `ADJUSTED`。

source: Adjusting bed leveling screws using the bed probe
hu: Az ágy szintezőcsavarjainak beállítása mérőszonda segítségével
ko: BED 프로브를 사용하여 BED 레벨링 나사 조정
zh_hans: 使用打印床探针调整打印床调平螺丝
zh_hant: 使用床探頭調整床校平螺絲

source: This is another way to calibrate the bed level using the bed probe. To use it you must have a Z probe (BL Touch, Inductive sensor, etc).
hu: Ez egy másik módja az ágyszint kalibrálásának a mérőszonda segítségével. Használatához rendelkeznie kell Z-szondával (BL Touch, induktív érzékelő stb.).
ko: 이것은 BED 프로브를 사용하여 BED 레벨을 보정하는 또 다른 방법입니다. 그것을 사용하려면 Z 프로브 (BL Touch, Inductive sensor 등)가 있어야 합니다.
zh_hans: 这是用打印床探头调平的另一种方法。要使用它，你必须有一个Z探针（BL Touch，电感式传感器等）。
zh_hant: 這是使用床探頭校準床位的另一種方法。要使用它，您必須有一個 Z 探頭（BL Touch、感應傳感器等）。

source: To enable this feature, one would determine the nozzle coordinates such that the Z probe is above the screws, and then add them to the config file. For example, it might look like:
hu: A funkció engedélyezéséhez meg kell határozni a fúvóka koordinátáit úgy, hogy a Z szonda a csavarok felett legyen, majd hozzá kell adni a konfigurációs fájlhoz. Ez például így nézhet ki:
ko: 이 기능을 활성화하려면 Z 프로브가 나사 위에 있도록 노즐 좌표를 결정한 다음 구성 파일에 추가합니다. 예를 들어 다음과 같을 수 있습니다:
zh_hans: 要启用该功能，先要确定喷嘴坐标，使Z探头位于螺丝上方，然后将其添加到配置文件中。例如，它可能看起来像：
zh_hant: 要啟用此功能，需要確定噴嘴坐標，使 Z 探頭位於螺絲上方，然後將它們添加到配置文件中。例如，它可能看起來像：

source: This means that:
hu: Ez azt jelenti, hogy:
ko: 이는 다음을 의미합니다:
zh_hans: 这意味着：
zh_hant: 這意味著：

source: Repeat the process several times until you get a good level bed - normally when all adjustments are below 6 minutes.
hu: Ismételje meg a folyamatot többször, amíg egy jó vízszintes ágyat nem kap. Általában akkor jó, ha minden beállítás 6 percnyi fordulat alatt van.
ko: BED가 수평이 될 때까지 이 과정을 여러 번 반복합니다. 일반적으로 6분 미만의 시간이 필요합니다.
zh_hans: 重复这个过程几次，直到打印床变得足够水平--通常情况下，这意味着所有的位置需要的调整都小于6分钟。
zh_hant: 重複這個過程幾次，直到你得到一個好的水平床——通常當所有的調整都低於 6 分鐘。

source: If using a probe that is mounted on the side of the hotend (that is, it has an X or Y offset) then note that adjusting the bed tilt will invalidate any previous probe calibration that was performed with a tilted bed. Be sure to run [probe calibration](Probe_Calibrate.md) after the bed screws have been adjusted.
hu: Ha olyan szondát használ, amely a nyomtatófej oldalára van szerelve (azaz X vagy Y eltolással rendelkezik), akkor vegye figyelembe, hogy az ágy dőlésének beállítása érvényteleníti a korábbi, dőlésszögű ágyon végzett szintkalibrálást. Az ágy csavarjainak beállítása után mindenképpen futtassa le a [szonda kalibrálása](Probe_Calibrate.md) parancsot.
ko: 핫엔드 측면에 장착된 프로브를 사용하는 경우(즉, X 또는 Y 오프셋이 있음) BED 기울기를 조정하면 기울어진 BED 에서 수행된 이전 프로브 교정이 무효화됩니다. 반드시 BED 나사를 조정한 후 [probe calibration](Probe_Calibrate.md) 을 실행하세요.
zh_hans: 如果使用安装在热端侧面的探头（即它有一个X或Y偏移），那么请注意，调整床身倾斜度将使以前在倾斜的床身下进行的任何探针校准失效。一定要在调整打印床螺丝后运行[探针校准](Probe_Calibrate.md)。
zh_hant: 如果使用安裝在熱端側面的探頭（即，它具有 X 或 Y 偏移），請注意調整床傾斜度將使之前使用傾斜床執行的任何探頭校準無效。確保在調整底座螺絲後運行 [探頭校準](Probe_Calibrate.md)。

source: The `MAX_DEVIATION` parameter is useful when a saved bed mesh is used, to ensure that the bed level has not drifted too far from where it was when the mesh was created. For example, `SCREWS_TILT_CALCULATE MAX_DEVIATION=0.01` can be added to the custom start gcode of the slicer before the mesh is loaded. It will abort the print if the configured limit is exceeded (0.01mm in this example), giving the user a chance to adjust the screws and restart the print.
hu: A `MAX_DEVIATION` paraméter akkor hasznos, ha egy mentett ágyhálót használunk, hogy biztosítsuk, hogy az ágy szintje ne térjen el túlságosan attól a helytől, ahol a háló létrehozásakor volt. Például a `SCREWS_TILT_CALCULATE MAX_DEVIATION=0.01` hozzáadható a szeletelő egyéni indító G-Kódjához a háló betöltése előtt. Ez megszakítja a nyomtatást, ha a beállított határértéket túllépi (ebben a példában 0,01 mm), lehetőséget adva a felhasználónak a csavarok beállítására és a nyomtatás újraindítására.
ko: `MAX_DEVIATION` 매개변수는 저장된 BED MESH 가 사용될 때 BED 레벨이 MESH 가 생성되었을 때의 위치에서 너무 멀어지지 않았는지 확인하는 데 유용합니다. 예를 들어 메시가 로드되기 전에 슬라이서의 사용자 정의 start gcode에 `SCREWS_TILT_CALCULATE MAX_DEVIATION=0.01`을 추가할 수 있습니다. 구성된 제한(이 예에서는 0.01mm)을 초과하면 인쇄가 중단되어 사용자가 나사를 조정하고 인쇄를 다시 시작할 수 있습니다.
zh_hant: 當使用保存的床面網格時，“MAX_DEVIATION”參數很有用，以確保床面高度不會偏離網格創建時的位置太遠。例如，可以在加載網格之前將“SCREWS_TILT_CALCULATE MAX_DEVIATION=0.01”添加到切片器的自定義啟動 gcode。如果超過配置的限制（本例中為 0.01mm），它將中止打印，讓用戶有機會調整螺絲並重新開始打印。

source: The screw1 is always the reference point for the others, so the system assumes that screw1 is at the correct height. Always run `G28` first and then run `SCREWS_TILT_CALCULATE` - it should produce output similar to:
hu: Az 1. csavar mindig a referenciapont a többi csavar számára, így a rendszer feltételezi, hogy az 1. csavar a megfelelő magasságban van. Először mindig futtassa le a `G28` G-Kódot, majd futtassa le a `SCREWS_TILT_CALCULATE` parancsot. Ennek a következőhöz hasonló kimenetet kell eredményeznie:
ko: 나사1은 항상 다른 기준점이므로 시스템은 나사1이 올바른 높이에 있다고 가정합니다. 항상 `G28`을 먼저 실행한 다음 `SCREWS_TILT_CALCULATE`를 실행하십시오. 다음과 유사한 출력이 생성되어야 합니다:
zh_hant: 螺絲 1 始終是其他螺絲的參考點，因此系統假定螺絲 1 處於正確的高度。始終先運行 `G28`，然後運行 `SCREWS_TILT_CALCULATE` - 它應該產生類似於以下內容的輸出：
