Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Manual_Level.po
Languages: hu, ko, zh_hans, zh_hant

source: The `DIRECTION` parameter is useful if you can turn your bed adjustment screws in one direction only. For example, you might have screws that start tightened in their lowest (or highest) possible position, which can only be turned in a single direction, to raise (or lower) the bed. If you can only turn the screws clockwise, run `SCREWS_TILT_CALCULATE DIRECTION=CW`. If you can only turn them counter-clockwise, run `SCREWS_TILT_CALCULATE DIRECTION=CCW`. A suitable reference point will be chosen such that the bed can be leveled by turning all the screws in the given direction.
hu: A `DIRECTION` paraméter akkor hasznos, ha az ágy szintező csavarjait csak egy irányba tudja elfordítani. Például lehetnek olyan csavarjai, amelyek a lehető legalacsonyabb (vagy legmagasabb) pozícióban vannak meghúzva, és csak egy irányba forgathatók az ágy emeléséhez (vagy süllyesztéséhez). Ha a csavarokat csak az óramutató járásával megegyező irányban tudja elfordítani, futtassa a `SCREWS_TILT_CALCULATE DIRECTION=CW` parancsot. Ha csak az óramutató járásával ellentétes irányban tudja elforgatni őket, futtassa a `SCREWS_TILT_CALCULATE DIRECTION=CCW` parancsot. A program kiválaszt egy megfelelő referenciapontot, hogy az ágyat az összes csavar adott irányba történő elfordításával szintezhesse.
ko: `DIRECTION` 매개변수는 BED 조정 나사를 한 방향으로만 돌릴 수 있는 경우에 유용합니다. 예를 들어, BED 를 올리거나 내리기 위해 한 방향으로만 돌릴 수 있는 가장 낮은 (또는 가장 높은) 위치에서 조이기 시작하는 나사가 있을 수 있습니다. 나사를 시계 방향으로만 돌릴 수 있다면 `SCREWS_TILT_CALCULATE DIRECTION=CW`를 실행합니다. 시계 반대 방향으로만 돌릴 수 있다면 `SCREWS_TILT_CALCULATE DIRECTION=CCW`를 실행하세요. 모든 나사를 주어진 방향으로 돌려 BED 가 수평을 이룰 수 있도록 적절한 기준점을 선택합니다.
zh_hant: 如果您只能在一個方向轉動床調節螺絲，則“方向”參數很有用。例如，您可能會在可能的最低（或最高）位置開始擰緊螺絲，該螺絲只能在一個方向上轉動，以升高（或降低）床。如果只能順時針轉動螺絲，請運行“SCREWS_TILT_CALCULATE DIRECTION=CW”。如果您只能逆時針轉動它們，請運行“SCREWS_TILT_CALCULATE DIRECTION=CCW”。將選擇一個合適的參考點，以便可以通過沿給定方向轉動所有螺絲來調平床。

source: Manual leveling
hu: Kézi szintezés
ko: 수동 레벨링
zh_hans: 手动调平
zh_hant: 手動調平

source: front left screw is the reference point you must not change it.
hu: a bal első csavar a referenciapont, nem szabad megváltoztatni.
zh_hant: 左前螺絲是參考點，你不能改變它。

source: front right screw must be turned clockwise 1 full turn and a quarter turn
hu: a jobb első csavart az óramutató járásával megegyező irányban kell elfordítani 1 teljes és negyed fordulatot
zh_hant: 右前螺絲必須順時針旋轉 1 整圈和四分之一圈

source: rear right screw must be turned counter-clockwise 50 minutes
hu: a jobb hátsó csavart az óramutató járásával ellentétes irányba kell forgatni 50 percnyi fordulatot
zh_hant: 右後螺絲必須逆時針轉動至 50 分鐘方向

source: rear left screw must be turned clockwise 2 minutes (not need it's ok)
hu: bal hátsó csavart az óramutató járásával megegyező irányba kell forgatni 2 percnyit (nem kell tökéletesnek lennie)
zh_hant: 左後螺絲必須順時針轉動至 2 分鐘方向（不需要就可以了）

source: Note that "minutes" refers to "minutes of a clock face". So, for example, 15 minutes is a quarter of a full turn.
hu: Vegye figyelembe, hogy a "percek" az "óra számlapjának perceire" utalnak. Így például 15 perc egy teljes fordulat negyedének felel meg.
zh_hant: 請注意，“分鐘”是指“鐘面的分鐘”。因此，例如，15 分鐘是一整圈的四分之一。

source: - front left screw is the reference point you must not change it. - front right screw must be turned clockwise 1 full turn and a quarter turn - rear right screw must be turned counter-clockwise 50 minutes - read left screw must be turned clockwise 2 minutes (not need it's ok)
ko: - 전면 왼쪽 나사는 변경해서는 안 되는 기준점입니다 - 전면 오른쪽 나사는 시계 방향으로 완전히 1바퀴, 1/4바퀴 돌려야 합니다 - 후면 오른쪽 나사는 시계 반대 방향으로 50분 돌려야 합니다 - 후면 왼쪽 나사는 시계 방향으로 2분 돌려야 합니다 (필요 없다면 안해도 무방).
