Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/MCU_Commands.po
Languages: hu, ko, zh_hans

source: This document provides information on the low-level micro-controller commands that are sent from the Klipper "host" software and processed by the Klipper micro-controller software. This document is not an authoritative reference for these commands, nor is it an exclusive list of all available commands.
hu: Ez a dokumentum a Klipper "gazdagép" szoftvere által küldött és a Klipper mikrokontroller szoftvere által feldolgozott alacsony szintű mikrokontroller-parancsokról nyújt információt. Ez a dokumentum nem hiteles hivatkozás ezekre a parancsokra, és nem is az összes rendelkezésre álló parancs kizárólagos listája.
ko: 이 문서는 Klipper "호스트" 소프트웨어에서 전송되고 Klipper 마이크로 컨트롤러 소프트웨어에 의해 처리되는 저수준 마이크로 컨트롤러 명령에 대한 정보를 제공합니다. 이 문서가 모든 MCU 명령어를 커버하지는 않습니다.
zh_hans: 该文档介绍了Klipper上位机软件发送到微控制器的，并由微处理器负责执行的底层命令。该文档不是这些命令的权威文档，也并未包含所有命令。

source: This document may be useful for developers interested in understanding the low-level micro-controller commands.
hu: Ez a dokumentum hasznos lehet az alacsony szintű mikrokontroller-parancsok megértése iránt érdeklődő fejlesztők számára.
ko: 이 문서는 저수준 마이크로 컨트롤러 명령을 이해하는 데 관심이 있는 개발자에게 유용할 수 있습니다.
zh_hans: 若想深入了解底层微处理器命令，该文档是不错的入门材料。

source: See the [protocol](Protocol.md) document for more information on the format of commands and their transmission. The commands here are described using their "printf" style syntax - for those unfamiliar with that format, just note that where a '%...' sequence is seen it should be replaced with an actual integer. For example, a description with "count=%c" could be replaced with the text "count=10". Note that parameters that are considered "enumerations" (see the above protocol document) take a string value which is automatically converted to an integer value for the micro-controller. This is common with parameters named "pin" (or that have a suffix of "_pin").
hu: A parancsok formátumával és továbbításával kapcsolatos további információkért lásd a [protokol](Protocol.md) dokumentumot. A parancsok itt a "printf" stílusú szintaxisukkal vannak leírva - azok számára, akik nem ismerik ezt a formátumot, csak azt kell megjegyezni, hogy ahol egy '%...' szekvencia látható, azt egy tényleges egész számmal kell helyettesíteni. Például a "count=%c" leírást a "count=10" szöveggel lehet helyettesíteni. Vegyük figyelembe, hogy a "felsorolásnak" tekintett paraméterek (lásd a fenti protokolldokumentumot) string értéket vesznek fel, amelyet a mikrokontroller automatikusan egész értékké konvertál. Ez a "pin" nevű (vagy "_pin" utótaggal rendelkező) paramétereknél gyakori.
ko: 명령어 형식 및 전송에 대한 자세한 내용은 [프로토콜](Protocol.md) 문서를 참조하십시오. 여기에 있는 명령은 "printf" 스타일 구문을 사용하여 설명됩니다. 해당 형식에 익숙하지 않은 사용자를 위해 '%...' 시퀀스가 표시되는 경우 실제 정수로 대체되어야 합니다. 예를 들어 "count=%c"가 있는 설명은 "count=10"이라는 텍스트로 대체될 수 있습니다. "열거"로 간주되는 매개변수 (위의 프로토콜 문서 참조) 는 마이크로 컨트롤러의 정수 값으로 자동 변환되는 문자열 값을 사용합니다. 이것은 "pin" (또는 "\_pin" 접미사가 있는) 이라는 매개변수가 일반적입니다.
zh_hans: 关于命令的格式和传输的更多信息，见[protocol](Protocol.md)文件。这里的命令是使用其 "printf "风格的语法描述的--对于那些不熟悉这种格式的人来说，只需注意在看到'%...'序列时，应该用一个实际的整数来代替。例如，"count=%c "的描述可以被替换为 "count=10"。请注意，那些被认为是 "enumerations "的参数（见上述协议文件）采取的是一个字符串值，对于微控制器来说，它被自动转换为一个整数值。这在名为 "pin"（或后缀为"_pin"）的参数中很常见。

source: Startup Commands
hu: Indítási parancsok
ko: 시작 명령
zh_hans: 启动命令

source: It may be necessary to take certain one-time actions to configure the micro-controller and its peripherals. This section lists common commands available for that purpose. Unlike most micro-controller commands, these commands run as soon as they are received and they do not require any particular setup.
hu: A mikrokontroller és perifériái konfigurálásához szükség lehet bizonyos egyszeri műveletek elvégzésére. Ez a szakasz erre a célra rendelkezésre álló általános parancsokat sorolja fel. A mikrokontroller legtöbb parancsától eltérően ezek a parancsok a fogadásuk után azonnal lefutnak, és nem igényelnek különösebb beállításokat.
ko: 마이크로 컨트롤러 및 주변 장치를 구성하기 위해 특정 일회성 작업을 수행해야 할 수도 있습니다. 이 섹션에서는 해당 용도로 사용할 수 있는 일반적인 명령을 나열합니다. 대부분의 마이크로 컨트롤러 명령과 달리 이러한 명령은 수신되는 즉시 실행되며 특정 설정이 필요하지 않습니다.
zh_hans: 可能需要采取某些一次性的命令来配置微控制器及其片上外备。本节列出了可用于该目的的常用命令。与大多数微控制器的命令不同，这些命令在收到后立即运行，它们不需要任何特殊的设置。

source: Common startup commands:
hu: Gyakori indítási parancsok:
ko: 일반적인 시작 명령:
zh_hans: 常见的启动命令：

source: `set_digital_out pin=%u value=%c` : This command immediately configures the given pin as a digital out GPIO and it sets it to either a low level (value=0) or a high level (value=1). This command may be useful for configuring the initial value of LEDs and for configuring the initial value of stepper driver micro-stepping pins.
hu: `set_digital_out pin=%u value=%c` : Ez a parancs az adott tűt azonnal digitális kimeneti GPIO-ként konfigurálja, és vagy alacsony (value=0) vagy magas (value=1) szintre állítja. Ez a parancs hasznos lehet a LED-ek kezdeti értékének konfigurálásához és a léptető vezérlő mikrolépés tűk kezdeti értékének konfigurálásához.
ko: `set_digital_out pin=%u value=%c` : 이 명령은 주어진 핀을 디지털 출력 GPIO로 즉시 구성하고 이를 low level (값=0) 또는 high level (값=1)로 설정합니다. 이 명령은 LED의 초기 값을 구성하고 스테퍼 드라이버 마이크로 스테핑 핀의 초기 값을 구성하는 데 유용할 수 있습니다.
zh_hans: `set_digital_out pin=%u value=%c`：该命令立即将指定的引脚配置为数字输出GPIO，并将其设置为低电平（value=0）或高电平（value=1）。这条命令对于配置LED的初始值和配置步进驱动器微步进引脚的初始值很有用。

source: `set_pwm_out pin=%u cycle_ticks=%u value=%hu` : This command will immediately configure the given pin to use hardware based pulse-width-modulation (PWM) with the given number of cycle_ticks. The "cycle_ticks" is the number of MCU clock ticks each power on and power off cycle should last. A cycle_ticks value of 1 can be used to request the fastest possible cycle time. The "value" parameter is between 0 and 255 with 0 indicating a full off state and 255 indicating a full on state. This command may be useful for enabling CPU and nozzle cooling fans.
hu: `set_pwm_out pin=%u cycle_ticks=%u value=%hu` : Ez a parancs azonnal beállítja az adott tűt, hogy hardveres impulzusszélesség-modulációt (PWM) használjon a megadott számú cycle_tickkel. A "cycle_ticks" az MCU órajelének a száma, ameddig az egyes bekapcsolási és kikapcsolási ciklusoknak tartaniuk kell. Az 1-es cycle_ticks értékkel a lehető leggyorsabb ciklusidő kérhető. A "value" paraméter 0 és 255 között van, 0 a teljesen kikapcsolt állapotot, 255 pedig a teljesen bekapcsolt állapotot jelenti. Ez a parancs hasznos lehet a CPU és a nyomtatófej hűtő ventilátorok engedélyezéséhez.
ko: `set_pwm_out pin=%u cycle_ticks=%u value=%hu` : 이 명령은 주어진 수의 cycle_ticks로 하드웨어 기반 PWM(펄스 폭 변조)을 사용하도록 지정된 핀을 즉시 구성합니다. "cycle_ticks"는 각 전원 켜기 및 전원 끄기 주기가 지속되어야 하는 MCU 클록 틱 수입니다. cycle_ticks 값 1은 가능한 가장 빠른 주기 시간을 요청하는 데 사용할 수 있습니다. "값" 매개변수는 0에서 255 사이이며 0은 완전히 꺼진 상태를 나타내고 255는 완전히 켜진 상태를 나타냅니다. 이 명령은 CPU 및 노즐 냉각 팬을 활성화하는 데 유용할 수 있습니다.
zh_hans: `set_pwm_out pin=%u cycle_ticks=%u value=%hu`：该命令将立即配置指定的引脚，使其使用硬件的脉宽调制（PWM）和给定的cycle_ticks。“cycle_ticks”是指每个通电和断电周期应该持续的MCU时钟数。cycle_ticks的值为1表示使用最短的周期时间。“value”参数在0-255之间，0表示完全关闭状态，255表示完全开启状态。该命令对启用CPU和喷嘴冷却风扇很有用。

source: Low-level micro-controller configuration
hu: Alacsony szintű mikrokontroller konfiguráció
ko: 저수준 마이크로 컨트롤러 구성
zh_hans: 底层微控制器配置

source: Most commands in the micro-controller require an initial setup before they can be successfully invoked. This section provides an overview of the configuration process. This section and the following sections are likely only of interest to developers interested in the internal details of Klipper.
hu: A mikrokontroller legtöbb parancsa a sikeres indítás előtt kezdeti beállítást igényel. Ez a szakasz áttekintést nyújt a konfigurációs folyamatról. Ez és a következő szakaszok valószínűleg csak a Klipper belső részletei iránt érdeklődő fejlesztők számára érdekesek.
ko: 마이크로 컨트롤러의 대부분의 명령은 성공적으로 호출되기 전에 초기 설정이 필요합니다. 이 섹션에서는 구성 프로세스의 개요를 제공합니다. 이 섹션과 다음 섹션은 Klipper의 내부 세부 정보에 관심이 있는 개발자만 관심을 가질 것입니다.
zh_hans: 微控制器中的大多数命令在成功调用之前需要进行初始设置。本节提供了一个配置过程的概述。本节和下面的章节适用于对Klipper的内部细节感兴趣的开发者。

source: When the host first connects to the micro-controller it always starts by obtaining a data dictionary (see [protocol](Protocol.md) for more information). After the data dictionary is obtained the host will check if the micro-controller is in a "configured" state and configure it if not. Configuration involves the following phases:
hu: Amikor a gazdagép először csatlakozik a mikrokontrollerhez, mindig egy adatszótár lekérésével kezdi (további információkért lásd [protokolt](Protocol.md)). Az adatszótár lekérése után a gazdagép ellenőrzi, hogy a mikrokontroller "konfigurált" állapotban van-e, és ha nem, akkor konfigurálja. A konfigurálás a következő fázisokat foglalja magában:
ko: 호스트가 마이크로 컨트롤러에 처음 연결할 때 항상 data dictionary를 얻는 것으로 시작합니다 (자세한 내용은 [프로토콜](Protocol.md) 참조). data dictionary 을 얻은 후 호스트는 마이크로 컨트롤러가 "configured" 상태인지 확인하고 그렇지 않은 경우 Configuration 합니다. Configuration 에는 다음 단계가 포함됩니다:
zh_hans: 当主机第一次连接到微控制器时，它总是从获得一个数据字典开始（更多信息见[protocol](Protocol.md)）。获得数据字典后，主机将检查微控制器是否处于 "已配置 "状态，如果不是，就进行配置。配置包括以下几个阶段：

source: `get_config` : The host starts by checking if the micro-controller is already configured. The micro-controller responds to this command with a "config" response message. The micro-controller software always starts in an unconfigured state at power-on. It remains in this state until the host completes the configuration processes (by issuing a finalize_config command). If the micro-controller is already configured from a previous session (and is configured with the desired settings) then no further action is needed by the host and the configuration process ends successfully.
hu: `get_config` : A gazdagép ellenőrzi, hogy a mikrokontroller már konfigurálva van-e. A mikrokontroller erre a parancsra egy "config" válaszüzenettel válaszol. A mikrokontroller szoftvere bekapcsoláskor mindig konfigurálatlan állapotban indul. Ebben az állapotban marad mindaddig, amíg a gazdagép be nem fejezi a konfigurációs folyamatokat (a finalize_config parancs kiadásával). Ha a mikrokontroller már konfigurálva van egy korábbi munkamenetből (és a kívánt beállításokkal van konfigurálva), akkor a gazdagépnek nincs szüksége további lépésekre, és a konfigurációs folyamat sikeresen befejeződik.
ko: `get_config` : 호스트는 마이크로 컨트롤러가 이미 구성되어 있는지 확인하는 것으로 시작합니다. 마이크로 컨트롤러는 "config" 응답 메시지로 이 명령에 응답합니다. 마이크로 컨트롤러 소프트웨어는 전원을 켤 때 항상 configuration 되지 않은 상태로 시작됩니다. 호스트가 configuration 프로세스를 완료할 때까지 이 상태를 유지합니다 (finalize_config 명령으로 실행). 마이크로 컨트롤러가 이전 세션에서 이미 configuration 되어 있고 원하는 설정으로 구성된 경우 호스트에서 추가 작업이 필요하지 않으며 구성 프로세스가 성공적으로 종료됩니다.
zh_hans: `get_config`：主机首先检查微控制器是否已经被配置。微控制器用一个 "config "的响应信息来回应这个命令。微控制器软件在上电时总是以未配置的状态启动。在主机完成配置过程之前（通过发出finalize_config命令），它一直处于这种状态。如果微控制器已经在前一个会话中进行了配置（并且配置了所需的设置），那么主机就不需要进一步的操作，配置过程成功结束。

source: `allocate_oids count=%c` : This command is issued to inform the micro-controller of the maximum number of object-ids (oid) that the host requires. It is only valid to issue this command once. An oid is an integer identifier allocated to each stepper, each endstop, and each schedulable gpio pin. The host determines in advance the number of oids it will require to operate the hardware and passes this to the micro-controller so that it may allocate sufficient memory to store a mapping from oid to internal object.
hu: `allocate_oids count=%c` : Ezt a parancsot azért adjuk ki, hogy tájékoztassuk a mikrokontrollert az objektum-id-k (oid) maximális számáról, amelyre a gazdagépnek szüksége van. Ezt a parancsot csak egyszer lehet kiadni. Az oid egy egész számú azonosító, amely minden egyes léptetőhöz, minden végálláshoz és minden ütemezhető GPIO tűhöz hozzárendelt. A gazdagép előre meghatározza a hardver működtetéséhez szükséges oid-ek számát, és ezt átadja a mikrokontrollernek, hogy az elegendő memóriát rendelhessen az oid-ről a belső objektumra való leképezés tárolásához.
ko: `allocate_oids count=%c` : 이 명령은 호스트에 필요한 최대 object-id (oid) 수를 마이크로 컨트롤러에 알리기 위해 실행됩니다. 이 명령은 한 번만 실행하는 것이 유효합니다. oid 는 각 스테퍼, 각 엔드스톱 및 예약 가능한 각 gpio 핀에 할당된 정수 식별자입니다. 호스트는 하드웨어를 작동하는데 필요한 oid 수를 미리 결정하고 이를 마이크로 컨트롤러에 전달하여 oid 에서 내부 개체로의 매핑을 저장하기에 충분한 메모리를 할당할 수 있습니다.
zh_hans: `allocate_oids count=%c`：这条命令是用来通知微控制器主机所需的对象标识（oid）的最大数量。这条命令只有效一次。oid是分配给每个步进电机、每个限位开关和每个可调度的gpio引脚的一个整数标识。主机事先确定操作硬件所需的oid数量，并将其传递给微控制器，以便它可以分配足够的内存来存储从oid到内部对象的映射。

source: `config_XXX oid=%c ...` : By convention any command starting with the "config_" prefix creates a new micro-controller object and assigns the given oid to it. For example, the config_digital_out command will configure the specified pin as a digital output GPIO and create an internal object that the host can use to schedule changes to the given GPIO. The oid parameter passed into the config command is selected by the host and must be between zero and the maximum count supplied in the allocate_oids command. The config commands may only be run when the micro-controller is not in a configured state (ie, prior to the host sending finalize_config) and after the allocate_oids command has been sent.
hu: `config_XXX oid=%c ...` : A konvenció szerint minden "config_" előtaggal kezdődő parancs létrehoz egy új mikrokontroller objektumot, és hozzárendeli a megadott oid-et. Például a config_digital_out parancs a megadott tűt digitális kimeneti GPIO-ként konfigurálja, és létrehoz egy belső objektumot, amelyet a gazdagép használhat az adott GPIO módosításainak ütemezésére. A config parancsba átadott oid paramétert a gazdagép választja ki, és annak nulla és az allocate_oids parancsban megadott maximális szám között kell lennie. A config parancsok csak akkor futtathatók, ha a mikrokontroller nincs konfigurált állapotban (azaz a gazdagép által elküldött finalize_config parancs előtt) és az allocate_oids parancs elküldése után.
ko: `config_XXX oid=%c ...` : 전통적으로 "config_" 접두사로 시작하는 모든 명령은 새 마이크로 컨트롤러 개체를 만들고 지정된 oid 를 할당합니다. 예를 들어 config_digital_out 명령은 지정된 핀을 디지털 출력 GPIO 로 구성하고 호스트가 주어진 GPIO 에 대한 변경을 예약하는데 사용할 수 있는 내부 개체를 생성합니다. config 명령에 전달된 oid 매개변수는 호스트에 의해 선택되며 0 과 assign_oids 명령에 제공된 최대 개수 사이에 있어야 합니다. config 명령은 마이크로 컨트롤러가 구성된 상태가 아닐 때 (즉, 호스트가 finalize_config를 전송하기 전) 및 assign_oids 명령이 전송된 후에만 실행할 수 있습니다.
zh_hans: `config_XXX oid=%c ...`：按照惯例，任何以 "config_"开头的命令都会创建一个新的微控制器对象，并将给定的oid赋予它。例如，config_digital_out命令将把指定的引脚配置为数字输出GPIO，并创建一个内部对象，主机可以用它来安排改变指定的GPIO的输出。传入config命令的oid参数由主机选择，必须介于0和allocate_oids命令中提供的最大计数之间。config命令只能在微控制器不处于已配置状态时（即在主机发送finalize_config之前）和allocate_oids命令被发送之后运行。

source: `finalize_config crc=%u` : The finalize_config command transitions the micro-controller from an unconfigured state to a configured state. The crc parameter passed to the micro-controller is stored and provided back to the host in "config" response messages. By convention, the host takes a 32bit CRC of the configuration it will request and at the start of subsequent communication sessions it checks that the CRC stored in the micro-controller exactly matches its desired CRC. If the CRC does not match then the host knows the micro-controller has not been configured in the state desired by the host.
hu: `finalize_config crc=%u` : A finalize_config parancs a mikrokontrollert egy konfigurálatlan állapotból egy konfigurált állapotba helyezi át. A mikrokontrollernek átadott crc paraméter tárolásra kerül, és a "config" válaszüzenetekben visszaküldésre kerül a gazdagépnek. A konvenció szerint az állomás 32 bites CRC-t vesz az általa kért konfigurációról, és a későbbi kommunikációs munkamenetek kezdetén ellenőrzi, hogy a mikrokontrollerben tárolt CRC pontosan megegyezik-e a kívánt CRC-vel. Ha a CRC nem egyezik, akkor a gazdagép tudja, hogy a mikrokontroller nem az általa kívánt állapotba lett konfigurálva.
ko: `finalize_config crc=%u` : finalize_config 명령은 마이크로 컨트롤러를 구성되지 않은 상태에서 구성된 상태로 전환합니다. 마이크로 컨트롤러에 전달된 crc 매개변수는 저장되고 "config" 응답 메시지로 호스트에 다시 제공됩니다. 관례에 따라 호스트는 요청할 구성의 32비트 CRC를 가져오고 후속 통신 세션이 시작될 때 마이크로 컨트롤러에 저장된 CRC가 원하는 CRC와 정확히 일치하는지 확인합니다. CRC가 일치하지 않으면 호스트는 마이크로 컨트롤러가 호스트가 원하는 상태로 구성되지 않았음을 알고 있습니다.
zh_hans: `finalize_config crc=%u`：finalize_config命令将微控制器从未配置状态转换为已配置状态。传递给微控制器的crc参数被储存起来，并在 "config "响应信息中反馈给主机。按照惯例，主机对它所要求的配置采取32位的CRC，并在随后的通信会话开始时，检查存储在微控制器中的CRC是否与它所希望的CRC正确匹配。如果CRC不匹配，那么主机就知道微控制器还没有被配置到主机所希望的状态。

source: Common micro-controller objects
hu: Gyakori mikrokontroller objektumok
ko: 일반적인 마이크로 컨트롤러 오브젝트
zh_hans: 常见的微控制器对象

source: This section lists some commonly used config commands.
hu: Ez a szakasz néhány gyakran használt konfigurációs parancsot sorol fel.
ko: 이 섹션에는 일반적으로 사용되는 몇 가지 config 명령이 나열되어 있습니다.
zh_hans: 本节列出了一些常用的配置命令。

source: `config_digital_out oid=%c pin=%u value=%c default_value=%c max_duration=%u` : This command creates an internal micro-controller object for the given GPIO 'pin'. The pin will be configured in digital output mode and set to an initial value as specified by 'value' (0 for low, 1 for high). Creating a digital_out object allows the host to schedule GPIO updates for the given pin at specified times (see the queue_digital_out command described below). Should the micro-controller software go into shutdown mode then all configured digital_out objects will be set to 'default_value'. The 'max_duration' parameter is used to implement a safety check - if it is non-zero then it is the maximum number of clock ticks that the host may set the given GPIO to a non-default value without further updates. For example, if the default_value is zero and the max_duration is 16000 then if the host sets the gpio to a value of one then it must schedule another update to the gpio pin (to either zero or one) within 16000 clock ticks. This safety feature can be used with heater pins to ensure the host does not enable the heater and then go off-line.
hu: `config_digital_out oid=%c pin=%u value=%c default_value=%c max_duration=%u` : Ez a parancs létrehoz egy belső mikrokontroller objektumot a megadott GPIO 'tű' számára. A tű digitális kimeneti módban lesz konfigurálva, és a 'value' által megadott kezdeti értékre lesz beállítva (0 az alacsony, 1 a magas). A digital_out objektum létrehozása lehetővé teszi a gazdagép számára, hogy az adott tű GPIO frissítéseit meghatározott időpontokban ütemezze (lásd az alább ismertetett queue_digital_out parancsot). Ha a mikrokontroller szoftvere kikapcsolási módba kerül, akkor az összes konfigurált digital_out objektum 'default_value' értékre kerül. A 'max_duration' paraméter egy biztonsági ellenőrzés megvalósítására szolgál. Ha nem nulla, akkor ez a maximális órajelek száma, amelyet a gazdagép további frissítés nélkül az adott GPIO-t nem alapértelmezett értékre állíthatja. Például, ha az alapértelmezett érték nulla, a max_duration pedig 16000, akkor ha egy értékre állítja a GPIO-t, akkor 16000 órajelen belül újabb frissítést kell ütemeznie a GPIO-n (nullára vagy egyre). Ez a biztonsági funkció használható a fűtési kimenetek biztosítására, hogy a gazdagép ne kapcsolja be a fűtést, majd ne kapcsoljon ki.
ko: `config_digital_out oid=%c pin=%u value=%c default_value=%c max_duration=%u` : 이 명령은 주어진 GPIO '핀'에 대한 내부 마이크로 컨트롤러 객체를 만듭니다. 디지털 출력 모드에서 구성되고 'value'(낮음은 0, 높음은 1)로 지정된 초기 값으로 설정됩니다. digital_out 객체를 생성하면 호스트가 지정된 시간에 지정된 핀에 대한 GPIO 업데이트를 예약할 수 있습니다 (아래에 설명된 queue_digital_out 명령 참조). 마이크로 컨트롤러 소프트웨어가 종료 모드로 전환되면 구성된 모든 digital_out 개체가 'default_value'로 설정됩니다. 'max_duration' 매개변수는 안전 검사를 구현하는 데 사용됩니다. 0이 아니면 호스트가 추가 업데이트 없이 지정된 GPIO를 기본값이 아닌 값으로 설정할 수 있는 최대 클록 틱 수입니다. 예를 들어 default_value가 0이고 max_duration이 16000이면 호스트가 gpio를 1의 값으로 설정하면 16000 클럭 틱 내에서 gpio 핀에 대한 또 다른 업데이트(0 또는 1)를 예약해야 합니다. 이 안전 기능을 히터 핀과 함께 사용하여 호스트가 히터를 활성화한 다음 오프라인으로 전환하지 않도록 할 수 있습니다.
zh_hans: `config_digital_out oid=%c pin=%u value=%c default_value=%c max_duration=%u`：该命令为给定的GPIO'pin'创建一个内部微控制器对象。该引脚将被配置为数字输出模式，并被设置为'value'指定的初始值（0为低，1为高）。创建一个digital_out对象允许主机在指定的时间内对指定引脚刷新GPIO输出状态（见下面描述的queue_digital_out命令）。如果微控制器软件进入关机模式，那么所有配置的digital_out对象将被设置为'default_value'。max_duration "参数用于实现安全检查--如果它是非零，那么它代表主机可以将指定的GPIO设为非默认值而不需要刷新的最大时钟数。例如，如果default_value是0，max_duration是16000，那么如果主机将gpio设置为1，它必须在16000个时钟刻度内刷新gpio引脚的输出（为0或1）。这个安全功能可用于加热器引脚，以确保主机不会启用加热器后脱机。

source: `config_pwm_out oid=%c pin=%u cycle_ticks=%u value=%hu default_value=%hu max_duration=%u` : This command creates an internal object for hardware based PWM pins that the host may schedule updates for. Its usage is analogous to config_digital_out - see the description of the 'set_pwm_out' and 'config_digital_out' commands for parameter description.
hu: `config_pwm_out oid=%c pin=%u cycle_ticks=%u value=%hu default_value=%hu max_duration=%u` : Ez a parancs létrehoz egy belső objektumot a hardveralapú PWM-tűkhöz, amelyek frissítését a gazdagép be tudja ütemezni. Használata analóg a config_digital_out paranccsal. A paraméterek leírását lásd a 'set_pwm_out' és a 'config_digital_out' parancsok leírásában.
ko: `config_pwm_out oid=%c pin=%u cycle_ticks=%u value=%hu default_value=%hu max_duration=%u` : 이 명령은 호스트가 업데이트를 예약할 수 있는 하드웨어 기반 PWM 핀에 대한 내부 개체를 만듭니다. 사용법은 config_digital_out과 유사합니다. 매개변수 설명은 'set_pwm_out' 및 'config_digital_out' 명령에 대한 설명을 참조하세요.
zh_hans: `config_pwm_out oid=%c pin=%u cycle_ticks=%u value=%hu default_value=%hu max_duration=%u`：该命令为基于硬件的PWM引脚创建一个内部对象，主机可以定期刷新。它的用法与config_digital_out类似--参数说明见'set_pwm_out'和'config_digital_out'命令的描述。

source: `config_analog_in oid=%c pin=%u` : This command is used to configure a pin in analog input sampling mode. Once configured, the pin can be sampled at regular interval using the query_analog_in command (see below).
hu: `config_analog_in oid=%c pin=%u` : Ez a parancs egy tű analóg bemeneti mintavételezési módban történő konfigurálására szolgál. A konfigurálás után a tű rendszeres időközönként mintavételezhető a query_analog_in paranccsal (lásd alább).
ko: `config_analog_in oid=%c pin=%u` : 이 명령은 아날로그 입력 샘플링 모드에서 핀을 구성하는 데 사용됩니다. 일단 구성되면 query_analog_in 명령을 사용하여 일정한 간격으로 핀을 샘플링할 수 있습니다(아래 참조).
zh_hans: `config_analog_in oid=%c pin=%u`：该命令用于将一个引脚配置为模拟输入采样模式。一旦配置完成，就可以使用query_analog_in命令（见下文）以固定的时间间隔对该引脚进行采样。

source: `config_endstop oid=%c pin=%c pull_up=%c stepper_count=%c` : This command creates an internal "endstop" object. It is used to specify the endstop pins and to enable "homing" operations (see the endstop_home command below). The command will configure the specified pin in digital input mode. The 'pull_up' parameter determines whether hardware provided pullup resistors for the pin (if available) will be enabled. The 'stepper_count' parameter specifies the maximum number of steppers that this endstop may need to halt during a homing operation (see endstop_home below).
hu: `config_endstop oid=%c pin=%c pull_up=%c stepper_count=%c` : Ez a parancs létrehoz egy belső "endstop" objektumot. Ez a végállási tűk megadására és a "kezdőpont" műveletek engedélyezésére szolgál (lásd alább az endstop_home parancsot). A parancs a megadott tűt digitális bemeneti módban konfigurálja. A 'pull_up' paraméter határozza meg, hogy a hardver által biztosított pullup ellenállások a tűhöz (ha vannak) engedélyezve lesznek-e. A 'stepper_count' paraméter meghatározza a maximális számú steppert, amelyet ennek a végállásnak meg kell állítania egy kezdőpont művelet során (lásd az endstop_home parancsot alább).
ko: `config_endstop oid=%c pin=%c pull_up=%c stepper_count=%c` : 이 명령은 내부 "endstop" 개체를 만듭니다. 엔드스톱 핀을 지정하고 "호밍" 작업을 활성화하는 데 사용됩니다 (아래 endstop_home 명령 참조). 이 명령은 디지털 입력 모드에서 지정된 핀을 구성합니다. 'pull_up' 매개변수는 핀에 대한 하드웨어 제공 풀업 저항(사용 가능한 경우)이 활성화되는지 여부를 결정합니다. 'stepper_count' 매개변수는 이 엔드스톱이 원점 복귀 작업 동안 중지해야 할 수 있는 최대 스테퍼 수를 지정합니다(아래 endstop_home 참조).
zh_hans: `config_endstop oid=%c pin=%c pull_up=%c stepper_count=%c` : 该命令创建一个内部的 "endstop"对象。它用于指定限位开关的引脚，并启用 "homing "操作（见下面的endstop_home命令）。该命令将把指定的引脚配置为数字输入模式。‘pull_up’参数决定是否启用硬件为引脚提供的上拉电阻（如果有的话）。‘stepper_count’参数规定了在归零操作中，该限位开关触发器可能需要的最大步进数（见下文endstop_home）。
