Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/MCU_Commands.po
Languages: hu, ko, zh_hans

source: `config_spi oid=%c bus=%u pin=%u mode=%u rate=%u shutdown_msg=%*s` : This command creates an internal SPI object. It is used with spi_transfer and spi_send commands (see below). The "bus" identifies the SPI bus to use (if the micro-controller has more than one SPI bus available). The "pin" specifies the chip select (CS) pin for the device. The "mode" is the SPI mode (should be between 0 and 3). The "rate" parameter specifies the SPI bus rate (in cycles per second). Finally, the "shutdown_msg" is an SPI command to send to the given device should the micro-controller go into a shutdown state.
hu: `config_spi oid=%c bus=%u pin=%u mode=%u rate=%u shutdown_msg=%*s` : Ez a parancs létrehoz egy belső SPI objektumot. A spi_transfer és spi_send parancsokkal együtt használható (lásd alább). A "bus" azonosítja a használni kívánt SPI-buszt (ha a mikrokontroller egynél több SPI-busszal rendelkezik). A "pin" az eszköz chipkiválasztó (CS) tűjét határozza meg. A "mode" az SPI módot jelöli (0 és 3 között kell lennie). A "rate" paraméter az SPI-busz sebességét adja meg (másodpercenkénti ciklusokban). Végül a "shutdown_msg" egy SPI-parancs, amelyet az adott eszköznek kell küldeni, ha a mikrokontroller leállási állapotba kerül.
ko: `config_spi oid=%c bus=%u pin=%u mode=%u rate=%u shutdown_msg=%*s` : 이 명령은 내부 SPI 개체를 만듭니다. spi_transfer 및 spi_send 명령과 함께 사용됩니다 (아래 참조). "버스"는 사용할 SPI 버스를 식별합니다(마이크로 컨트롤러에 사용 가능한 SPI 버스가 두 개 이상 있는 경우). "핀"은 장치의 칩 선택(CS) 핀을 지정합니다. "모드"는 SPI 모드입니다 (0과 3 사이여야 함). "rate" 매개변수는 SPI 버스 속도(초당 사이클)를 지정합니다. 마지막으로 "shutdown_msg"는 마이크로 컨트롤러가 종료 상태가 될 경우 지정된 장치에 보내는 SPI 명령입니다.
zh_hans: `config_spi oid=%c bus=%u pin=%u mode=%u rate=%u shutdown_msg=%*s`：该命令创建了一个内部SPI对象。它与spi_transfer和spi_send命令一起使用（见下文）。"bus"标识了要使用的SPI总线（如果微控制器有一个以上的SPI总线可用）。"pin"指定了设备的片选（CS）引脚。"mode"指定SPI模式（应该在0到3之间）。"rate "参数指定了SPI总线的速率（以每秒周期为单位）。最后，"shutdown_msg "是在微控制器进入关机状态时向给定设备发送的SPI命令。

source: `config_spi_without_cs oid=%c bus=%u mode=%u rate=%u shutdown_msg=%*s` : This command is similar to config_spi, but without a CS pin definition. It is useful for SPI devices that do not have a chip select line.
hu: `config_spi_without_cs oid=%c bus=%u mode=%u rate=%u shutdown_msg=%*s` : Ez a parancs hasonló a config_spi parancshoz, de CS tű definíció nélkül. Hasznos olyan SPI eszközöknél, amelyek nem rendelkeznek Chip Select vonallal.
ko: `config_spi_without_cs oid=%c bus=%u mode=%u rate=%u shutdown_msg=%*s` : 이 명령은 config_spi와 유사하지만 CS 핀 정의가 없습니다. 칩 선택 라인이 없는 SPI 장치에 유용합니다.
zh_hans: `config_spi_without_cs oid=%c bus=%u mode=%u rate=%u shutdown_msg=%*s` : 这个命令类似于config_spi，但是没有CS引脚的定义。它对没有芯片选择线的SPI设备很有用。

source: Common commands
hu: Gyakori parancsok
ko: 일반적인 명령
zh_hans: 常用命令

source: This section lists some commonly used run-time commands. It is likely only of interest to developers looking to gain insight into Klipper.
hu: Ez a szakasz néhány gyakran használt futásidejű parancsot sorol fel. Valószínűleg csak a Klipperbe betekintést nyerni kívánó fejlesztők számára érdekes.
ko: 이 섹션에서는 일반적으로 사용되는 몇 가지 런타임 명령을 나열합니다. Klipper 에 대한 통찰력을 얻으려는 개발자에게만 관심이 있을 것입니다.
zh_hans: 本节列出了一些常用的运行时命令。对希望深入了解Klipper的开发者可能会感兴趣。

source: `set_digital_out_pwm_cycle oid=%c cycle_ticks=%u` : This command configures a digital output pin (as created by config_digital_out) to use "software PWM". The 'cycle_ticks' is the number of clock ticks for the PWM cycle. Because the output switching is implemented in the micro-controller software, it is recommended that 'cycle_ticks' correspond to a time of 10ms or greater.
hu: `set_digital_out_pwm_cycle oid=%c cycle_ticks=%u` : Ez a parancs egy (config_digital_out által létrehozott) digitális kimeneti tűt úgy konfigurál, hogy "szoftveres PWM"-et használjon. A 'cycle_ticks' a PWM-ciklushoz tartozó órajelek száma. Mivel a kimeneti kapcsolás a mikrokontroller szoftverében valósul meg, ajánlott, hogy a 'cycle_ticks' 10 ms vagy annál nagyobb időnek feleljen meg.
ko: `set_digital_out_pwm_cycle oid=%c cycle_ticks=%u` : 이 명령은 "소프트웨어 PWM"을 사용하도록 디지털 출력 핀(config_digital_out에 의해 생성됨)을 구성합니다. 'cycle_ticks'는 PWM 주기의 클록 틱 수입니다. 출력 스위칭은 마이크로 컨트롤러 소프트웨어에서 구현되기 때문에 'cycle_ticks'는 10ms 이상의 시간에 해당하는 것이 좋습니다.
zh_hans: `set_digital_out_pwm_cycle oid=%c cycle_ticks=%u`：该命令将数字输出引脚（由config_digital_out创建）配置为使用 "软件PWM"。'cycle_ticks' 是PWM周期的时钟数。因为输出切换是在微控制器软件中实现的，建议把'cycle_ticks'对应的时间设为10ms或更大。

source: `queue_digital_out oid=%c clock=%u on_ticks=%u` : This command will schedule a change to a digital output GPIO pin at the given clock time. To use this command a 'config_digital_out' command with the same 'oid' parameter must have been issued during micro-controller configuration. If 'set_digital_out_pwm_cycle' has been called then 'on_ticks' is the on duration (in clock ticks) for the pwm cycle. Otherwise, 'on_ticks' should be either 0 (for low voltage) or 1 (for high voltage).
hu: `queue_digital_out oid=%c clock=%u on_ticks=%u` : Ez a parancs egy digitális kimeneti GPIO tű váltását ütemezi a megadott órajelen. A parancs használatához a mikrokontroller konfigurálása során ki kell adni egy 'config_digital_out' parancsot ugyanazzal a 'oid' paraméterrel. Ha a 'set_digital_out_pwm_cycle' parancsot hívták, akkor az 'on_ticks' a pwm-ciklus bekapcsolási időtartama (órajelekben). Ellenkező esetben az 'on_ticks' értékének vagy 0-nak (alacsony feszültség esetén) vagy 1-nek (magas feszültség esetén) kell lennie.
ko: `queue_digital_out oid=%c clock=%u on_ticks=%u` : 이 명령은 주어진 클록 시간에 디지털 출력 GPIO 핀에 대한 변경을 예약합니다. 이 명령을 사용하려면 마이크로 컨트롤러 구성 중에 동일한 'oid' 매개변수를 사용하여 'config_digital_out' 명령을 실행해야 합니다.'set_digital_out_pwm_cycle'이 호출된 경우 'on_ticks'는 pwm 주기의 온 지속 시간 (클록 틱 단위)입니다. 그렇지 않으면 'on_ticks'는 0 (low voltage) 또는 1 (high voltage)이어야 합니다.
zh_hans: `queue_digital_out oid=%c clock=%u on_ticks=%u` : 这个命令将安排在设定的时钟时间内改变数字输出GPIO引脚。要使用这条命令，必须在微控制器配置过程中发出具有相同‘oid’参数的'config_digital_out'命令。如果'set_digital_out_pwm_cycle'已经被调用，那么'on_ticks'就是pwm周期的开启时间（以时钟数为单位）。否则，'on_ticks'应该是0（低电压）或1（高电压）。

source: `queue_pwm_out oid=%c clock=%u value=%hu` : Schedules a change to a hardware PWM output pin. See the 'queue_digital_out' and 'config_pwm_out' commands for more info.
hu: `queue_pwm_out oid=%c clock=%u value=%hu` : Beütemezi a hardveres PWM kimeneti tű változását. Lásd a 'queue_digital_out' és a 'config_pwm_out' parancsokat további információkért.
ko: `queue_pwm_out oid=%c clock=%u value=%hu` : 하드웨어 PWM 출력 핀에 대한 변경을 예약합니다. 자세한 내용은 'queue_digital_out' 및 'config_pwm_out' 명령을 참조하세요.
zh_hans: `queue_pwm_out oid=%c clock=%u value=%hu` ：安排改变一个硬件PWM输出引脚。更多信息请参考 'queue_digital_out' 和 'config_pwm_out' 命令。

source: `query_analog_in oid=%c clock=%u sample_ticks=%u sample_count=%c rest_ticks=%u min_value=%hu max_value=%hu` : This command sets up a recurring schedule of analog input samples. To use this command a 'config_analog_in' command with the same 'oid' parameter must have been issued during micro-controller configuration. The samples will start as of 'clock' time, it will report on the obtained value every 'rest_ticks' clock ticks, it will over-sample 'sample_count' number of times, and it will pause 'sample_ticks' number of clock ticks between over-sample samples. The 'min_value' and 'max_value' parameters implement a safety feature - the micro-controller software will verify the sampled value (after any oversampling) is always between the supplied range. This is intended for use with pins attached to thermistors controlling heaters - it can be used to check that a heater is within a temperature range.
hu: `query_analog_in oid=%c clock=%u sample_ticks=%u sample_count=%c rest_ticks=%u min_value=%hu max_value=%hu` : Ez a parancs beállítja az analóg bemeneti minták ismétlődő ütemezését. A parancs használatához a mikrokontroller konfigurálása során ki kell adni egy 'config_analog_in' parancsot ugyanazzal az 'oid' paraméterrel. A minták a 'clock' időponttól kezdődnek, a kapott értékről minden 'rest_ticks' óraütemenként jelentést készít, a 'sample_count' számú alkalommal túlmintázza a mintát, és a túlmintázott minták között 'sample_ticks' számú óraütemnyi szünetet tart. A 'min_value' és 'max_value' paraméterek egy biztonsági funkciót valósítanak meg. A mikrokontroller szoftvere ellenőrizni fogja, hogy a mintavételezett érték (az esetleges túlmintavételezés után) mindig a megadott tartományon belül van-e. Ezt a fűtőtesteket vezérlő hőszenzorokhoz csatlakoztatott tűkkel való használatra szánják. Ezzel ellenőrizhető, hogy a fűtőtest egy hőmérséklet tartományon belül van-e.
ko: `query_analog_in oid=%c clock=%u sample_ticks=%u sample_count=%c rest_ticks=%u min_value=%hu max_value=%hu` : 이 명령은 아날로그 입력 샘플의 반복 일정을 설정합니다. 이 명령을 사용하려면 마이크로 컨트롤러 구성 중에 동일한 'oid' 매개변수를 사용하여 'config_analog_in' 명령을 실행해야 합니다. 샘플은 '클럭' 시간부터 시작하고, 'rest_ticks' 클럭 틱마다 얻은 값을 보고하고, 'sample_count'번 오버샘플링하고, 'sample_ticks' 클럭 틱 수를 일시 중지합니다. 'min_value' 및 'max_value' 매개변수는 안전 기능을 구현합니다. 마이크로 컨트롤러 소프트웨어는 샘플링된 값(오버샘플링 후)이 항상 제공된 범위 사이에 있는지 확인합니다. 이것은 히터를 제어하는 서미스터에 부착된 핀과 함께 사용하기 위한 것입니다. 히터가 온도 범위 내에 있는지 확인하는 데 사용할 수 있습니다.
zh_hans: `query_analog_in oid=%c clock=%u sample_ticks=%u sample_count=%c rest_ticks=%u min_value=%hu max_value=%hu`：此命令设置了一个对模拟输入的循环采样。要使用这条命令，必须在微控制器配置时发出具有相同'oid'参数的 'config_analog_in '命令。采样将从'clock'时间开始，它将每隔'rest_ticks'时钟数报告获得的值，'sample_count'是过量采样次数，'sample_ticks'是在过量采样之间暂停的时钟数。"min_value "和 "max_value "参数实现了安全功能--微控制器软件将验证采样值（在每次过采样之后）总是在安全范围内。这是为连接到控制加热器的热敏电阻的引脚而设计的--它可以用来检查加热器是否在一个温度范围内。

source: `get_clock` : This command causes the micro-controller to generate a "clock" response message. The host sends this command once a second to obtain the value of the micro-controller clock and to estimate the drift between host and micro-controller clocks. It enables the host to accurately estimate the micro-controller clock.
hu: `get_clock` : E parancs hatására a mikrokontroller egy "órajel" válaszüzenetet generál. A gazdagép másodpercenként egyszer küldi el ezt a parancsot, hogy megkapja a mikrokontroller órajel értékét, és megbecsülje a gazdagép és a mikrokontroller órajelei közötti eltérést. Ez lehetővé teszi a gazdagép számára a mikrokontroller órajelének pontos becslését.
ko: `get_clock` : 이 명령은 마이크로 컨트롤러가 "clock" 응답 메시지를 생성하도록 합니다. 호스트는 이 명령을 1초에 한 번 전송하여 마이크로 컨트롤러 클록의 값을 얻고 호스트와 마이크로 컨트롤러 클록 간의 드리프트를 추정합니다.이를 통해 호스트는 마이크로 컨트롤러 clock을 정확하게 추정할 수 있습니다.
zh_hans: `get_clock`：该命令使微控制器产生一个 "clock"响应消息。主机每秒发送一次这个命令，以获得微控制器的时钟值，并估计主机和微控制器时钟之间的漂移。它使主机能够准确估计微控制器的时钟。

source: Stepper commands
hu: Léptető parancsok
ko: 스테퍼 명령
zh_hans: 步进器命令

source: `queue_step oid=%c interval=%u count=%hu add=%hi` : This command schedules 'count' number of steps for the given stepper, with 'interval' number of clock ticks between each step. The first step will be 'interval' number of clock ticks since the last scheduled step for the given stepper. If 'add' is non-zero then the interval will be adjusted by 'add' amount after each step. This command appends the given interval/count/add sequence to a per-stepper queue. There may be hundreds of these sequences queued during normal operation. New sequence are appended to the end of the queue and as each sequence completes its 'count' number of steps it is popped from the front of the queue. This system allows the micro-controller to queue potentially hundreds of thousands of steps - all with reliable and predictable schedule times.
hu: `queue_step oid=%c interval=%u count=%hu add=%hi` : Ez a parancs ütemezi a 'számítási' lépést az adott léptetőhöz, az 'intervallum' lépések közötti órajellel. Az első lépés az 'intervallum' órajelek száma lesz az adott léptető utolsó ütemezett lépése óta. Ha az 'add' nem nulla, akkor az intervallum minden lépés után az 'add' értékkel módosul. Ez a parancs a megadott intervallum/count/add szekvenciát egy léptetőkénti sorba illeszti. A normál működés során több száz ilyen szekvencia állhat a sorban. Az új szekvenciák a sor végére kerülnek, és amint minden szekvencia teljesíti a 'szám' lépések számát, a sor elejére kerülnek. Ez a rendszer lehetővé teszi a mikrokontroller számára, hogy több százezer lépést állítson sorba. Mindezt megbízható és kiszámítható ütemezési idővel.
ko: `queue_step oid=%c interval=%u count=%hu add=%hi` : 이 명령은 각 단계 사이의 '간격' 클럭 틱 수와 함께 지정된 스테퍼에 대한 '카운트' 단계 수를 예약합니다. 첫 번째 단계는 주어진 스테퍼에 대해 마지막으로 예약된 단계 이후의 클럭 틱의 '간격' 수입니다. '추가'가 0이 아닌 경우 간격은 각 단계 후에 '추가' 양만큼 조정됩니다. 이 명령은 지정된 간격/카운트/추가 시퀀스를 스테퍼별 대기열에 추가합니다. 정상 작동 중에 이러한 시퀀스가 수백 개 있을 수 있습니다. 새 시퀀스가 대기열 끝에 추가되고 각 시퀀스가 '카운트' 단계 수를 완료할 때 대기열 앞에서 팝됩니다. 이 시스템을 통해 마이크로 컨트롤러는 잠재적으로 수십만 단계를 대기열에 넣을 수 있습니다. 모두 안정적이고 예측 가능한 일정 시간으로 이루어집니다.
zh_hans: `queue_step oid=%c interval=%u count=%hu add=%hi`：该命令安排指定的步进电机输出'count'个步数，'interval'是每步之间的时钟数间隔。命令中的第一步与上一个步进输出命令最后一步的时间间隔为'interval'个时钟数。如果'add'不为零，那么每步之后的间隔将以'add'的增量调整。该命令将给定的间隔/计数/增量序列附加到每个步进队列中。在正常操作中，可能有数百个这样的序列排队。新的序列被添加到队列的末尾，当每个序列完成了它的 'count'步数后它就从队列的前面弹出去。这个系统允许微控制器将几十万步排入队列--所有这些都有可靠且可预测的调度时序。

source: `set_next_step_dir oid=%c dir=%c` : This command specifies the value of the dir_pin that the next queue_step command will use.
hu: `set_next_step_dir oid=%c dir=%c` : Ez a parancs adja meg a következő queue_step parancs által használt dir_pin értékét.
ko: `set_next_step_dir oid=%c dir=%c` : 이 명령은 다음 queue_step 명령이 사용할 dir_pin 값을 지정합니다.
zh_hans: `set_next_step_dir oid=%c dir=%c`：该命令指定了下一个queue_step命令将使用的dir_pin的值。

source: `reset_step_clock oid=%c clock=%u` : Normally, step timing is relative to the last step for a given stepper. This command resets the clock so that the next step is relative to the supplied 'clock' time. The host usually only sends this command at the start of a print.
hu: `reset_step_clock oid=%c clock=%u` : Normális esetben a lépés időzítése az adott léptető utolsó lépéséhez viszonyítva történik. Ez a parancs visszaállítja az órajelet, így a következő lépés a megadott 'órajel' időponthoz képest történik. A gazdagép általában csak a nyomtatás kezdetén küldi ezt a parancsot.
ko: `reset_step_clock oid=%c clock=%u` : 일반적으로 단계 타이밍은 주어진 스테퍼의 마지막 단계에 상대적입니다. 이 명령은 다음 단계가 제공된 '시계' 시간을 기준으로 하도록 시계를 재설정합니다.호스트는 일반적으로 인쇄 시작 시에만 이 명령을 보냅니다.
zh_hans: `reset_step_clock oid=%c clock=%u`：通常情况下步进时序是相对于给定步进的上一步。这条命令重置了时钟，使下一步是相对于提供的 'clock' 时间。通常主机只在打印开始时发送此命令。

source: `stepper_get_position oid=%c` : This command causes the micro-controller to generate a "stepper_position" response message with the stepper's current position. The position is the total number of steps generated with dir=1 minus the total number of steps generated with dir=0.
hu: `stepper_get_position oid=%c` : E parancs hatására a mikrokontroller egy "stepper_position" válaszüzenetet generál a léptető aktuális pozíciójával. A pozíció a dir=1-gyel generált lépések teljes száma mínusz a dir=0-val generált lépések teljes száma.
ko: `stepper_get_position oid=%c` : 이 명령은 마이크로 컨트롤러가 스테퍼의 현재 위치와 함께 "stepper_position" 응답 메시지를 생성하도록 합니다. 위치는 dir=1 로 생성된 총 단계 수에서 dir=0 으로 생성된 총 단계 수를 뺀 것입니다.
zh_hans: `stepper_get_position oid=%c`：该命令使微控制器生成一个 "stepper_position "响应消息，其中包含步进器的当前位置。该位置是dir=1时产生的总步数减去dir=0时的总步数。

source: `endstop_home oid=%c clock=%u sample_ticks=%u sample_count=%c rest_ticks=%u pin_value=%c` : This command is used during stepper "homing" operations. To use this command a 'config_endstop' command with the same 'oid' parameter must have been issued during micro-controller configuration. When this command is invoked, the micro-controller will sample the endstop pin every 'rest_ticks' clock ticks and check if it has a value equal to 'pin_value'. If the value matches (and it continues to match for 'sample_count' additional samples spread 'sample_ticks' apart) then the movement queue for the associated stepper will be cleared and the stepper will come to an immediate halt. The host uses this command to implement homing - the host instructs the endstop to sample for the endstop trigger and then it issues a series of queue_step commands to move a stepper towards the endstop. Once the stepper hits the endstop, the trigger will be detected, the movement halted, and the host notified.
hu: `endstop_home oid=%c clock=%u sample_ticks=%u sample_count=%c rest_ticks=%u pin_value=%c` : Ezt a parancsot a léptető "kezdőpont" műveletek során használják. A parancs használatához a mikrokontroller konfigurálása során ki kell adni egy 'config_endstop' parancsot ugyanazzal az 'oid' paraméterrel. Amikor ez a parancs meghívásra kerül, a mikrokontroller minden 'rest_ticks' órajelenként mintavételezi az endstop-tűt, és ellenőrzi, hogy annak értéke megegyezik-e a 'pin_value' értékkel. Ha az érték megegyezik (és továbbra is megegyezik a 'sample_count' további 'sample_ticks' távolságra elosztott mintákon keresztül), akkor a kapcsolódó léptető mozgási sora törlődik, és a léptető azonnal megáll. A gazdagép ezt a parancsot a kezdőpont megvalósítására használja. A gazdagép utasítja a végállást, hogy mintavételezzen a végállási triggerre, majd egy sor queue_step parancsot ad ki a léptető mozgatására a végállás felé. Amint a léptető eléri a végállást, a kapcsoló érzékeli, a mozgás megáll, és a gazdagépet értesíti.
ko: `endstop_home oid=%c clock=%u sample_ticks=%u sample_count=%c rest_ticks=%u pin_value=%c` : 이 명령은 스테퍼 "호밍" 작업 중에 사용됩니다. 이 명령을 사용하려면 마이크로 컨트롤러 구성 중에 동일한 'oid' 매개변수를 사용하여 'config_endstop' 명령을 실행해야 합니다. 이 명령이 호출되면 마이크로 컨트롤러는 'rest_ticks' 클록 틱마다 엔드스톱 핀을 샘플링하고 'pin_value'와 같은 값이 있는지 확인합니다. 값이 일치하면 (그리고 'sample_count' 추가 샘플이 'sample_ticks' 간격으로 계속 일치하면) 연결된 스테퍼의 이동 대기열이 지워지고 스테퍼가 즉시 중지됩니다. 호스트는 이 명령을 사용하여 homing을 구현합니다. 호스트는 endstop에 endstop 트리거에 대한 샘플링을 지시한 다음 일련의 queue_step 명령을 실행하여 스테퍼를 endstop으로 이동시킵니다. 스테퍼가 엔드스톱에 도달하면 트리거가 감지되고 이동이 중지되며 호스트에 알림이 표시됩니다.
zh_hans: `endstop_home oid=%c clock=%u sample_ticks=%u sample_count=%c rest_ticks=%u pin_value=%c`：该命令用于步进电机 "homing"操作。要使用这条命令，必须在微控制器配置过程中发出具有相同 'oid '参数的 'config_endstop '命令。当这个命令被调用时，微控制器将在每一个'rest_ticks'时钟刻度上对限位开关引脚进行采样，并检查它的值是否等于'pin_value'。如果开关被触发（并且以间隔'sample_ticks'为周期，额外持续'sample_count'次被触发），那么相关步进的运动队列将被清除，步进将立即停止。主机使用该命令实现归位–主机指示限位开关对限位开关的触发进行采样，然后发出一系列queue_step命令，使步进向限位移动。一旦步进电机撞到限位开关，检测到触发，运动就会停止并通知主机。

source: Move queue
hu: Sor áthelyezése
zh_hans: 运动队列

source: Each queue_step command utilizes an entry in the micro-controller "move queue". This queue is allocated when it receives the "finalize_config" command, and it reports the number of available queue entries in "config" response messages.
hu: Minden queue_step parancs a mikrovezérlő "move queue" sorában lévő bejegyzést használja. Ez a várólista a "finalize_config" parancs fogadásakor kerül kiosztásra, és a "config" válaszüzenetekben jelenti a rendelkezésre álló várólista-bejegyzések számát.
ko: 각 queue_step 명령은 마이크로 컨트롤러 "move queue"의 항목을 활용합니다. 이 큐는 "finalize_config" 명령을 수신할 때 할당되며 "config" 응답 메시지에 사용 가능한 큐 항목 수를 보고합니다.
zh_hans: 每个queue_step命令都利用了微控制器 "move queue "中的一个条目。这个队列是在它收到 "finalize_config "命令时分配的，它在 "config "响应信息中报告可用队列条目的数量。

source: It is the responsibility of the host to ensure that there is available space in the queue before sending a queue_step command. The host does this by calculating when each queue_step command completes and scheduling new queue_step commands accordingly.
hu: A gazdagép felelőssége, hogy a queue_step parancs elküldése előtt megbizonyosodjon arról, hogy van-e szabad hely a várólistán. A gazdagép ezt úgy teszi, hogy kiszámítja az egyes queue_step parancsok mikor fejeződnek be, és ennek megfelelően ütemezi az új queue_step parancsokat.
ko: queue_step 명령을 보내기 전에 큐에 사용 가능한 공간이 있는지 확인하는 것은 호스트의 책임입니다. 호스트는 각 queue_step 명령이 완료될 때를 계산하고 그에 따라 새 queue_step 명령을 예약하여 이를 수행합니다.
zh_hans: 在发送queue_step命令之前，主机有责任确保队列中有可用空间。这需要主机通过计算每个queue_step命令完成的时间并相应地安排新的queue_step命令来实现。

source: SPI Commands
hu: SPI parancsok
ko: SPI 명령
zh_hans: SPI 命令

source: `spi_transfer oid=%c data=%*s` : This command causes the micro-controller to send 'data' to the spi device specified by 'oid' and it generates a "spi_transfer_response" response message with the data returned during the transmission.
hu: `spi_transfer oid=%c data=%*s` : Ez a parancs arra készteti a mikrokontrollert, hogy a 'data'-t a 'oid' által megadott SPI eszközre küldje, és egy "spi_transfer_response" válaszüzenetet generál az átvitel során visszaküldött adatokkal.
ko: `spi_transfer oid=%c data=%*s` : 이 명령은 마이크로 컨트롤러가 'oid'로 지정된 spi 장치에 '데이터'를 보내도록 하고 전송 중에 반환된 데이터로 "spi_transfer_response" 응답 메시지를 생성합니다.
zh_hans: `spi_transfer oid=%c data=%*s`：这条命令使微控制器向 'oid '指定的spi设备发送 'data' ，并生成一个 "spi_transfer_response "的响应消息，其中包括传输期间返回的数据。

source: `spi_send oid=%c data=%*s` : This command is similar to "spi_transfer", but it does not generate a "spi_transfer_response" message.
hu: `spi_send oid=%c data=%*s` : Ez a parancs hasonló az "spi_transfer" parancshoz, de nem generál "spi_transfer_response" üzenetet.
ko: `spi_send oid=%c data=%*s` : 이 명령은 "spi_transfer"와 유사하지만 "spi_transfer_response" 메시지를 생성하지 않습니다.
zh_hans: `spi_send oid=%c data=%*s`：这个命令与 "spi_transfer "类似，但它不产生 "spi_transfer_response "消息。

source: MCU commands
hu: MCU parancsok
ko: MCU 명령
zh_hans: MCU命令

source: `config_stepper oid=%c step_pin=%c dir_pin=%c invert_step=%c step_pulse_ticks=%u` : This command creates an internal stepper object. The 'step_pin' and 'dir_pin' parameters specify the step and direction pins respectively; this command will configure them in digital output mode. The 'invert_step' parameter specifies whether a step occurs on a rising edge (invert_step=0) or falling edge (invert_step=1). The 'step_pulse_ticks' parameter specifies the minimum duration of the step pulse. If the mcu exports the constant 'STEPPER_BOTH_EDGE=1' then setting step_pulse_ticks=0 and invert_step=-1 will setup for stepping on both the rising and falling edges of the step pin.
hu: `config_stepper oid=%c step_pin=%c dir_pin=%c invert_step=%c step_pulse_ticks=%u` : Ez a parancs létrehoz egy belső léptető objektumot. A 'step_pin' és 'dir_pin' paraméterek megadják a lépést és irányokat; ez a parancs digitális kimeneti módban konfigurálja őket. Az 'invert_step' paraméter meghatározza, hogy a lépés emelkedő élre (invert_step=0) vagy csökkenő élre (invert_step=1) történjen. A 'step_pulse_ticks' paraméter a lépésimpulzus minimális időtartamát határozza meg. Ha az MCU a 'STEPPER_BOTH_EDGE=1' konstansot exportálja, akkor a step_pulse_ticks=0 és az invert_step=-1 beállítása a step_pin emelkedő és csökkenő éleire történő lépést is beállítja.
zh_hans: `config_stepper oid=%c step_pin=%c dir_pin=%c invert_step=%c step_pulse_ticks=%u`：该命令创建一个内部步进器对象。'step_pin'和'dir_pin'参数分别指定步进和方向引脚；该命令将把它们配置为数字输出模式。'invert_step'参数指定步进是发生在上升沿（invert_step=0）还是下降沿（invert_step=1）。'step_pulse_ticks'参数指定了步进脉冲的最小持续时间。如果MCU输出常数 "STEPPER_BOTH_EDGE=1"，那么设置step_pulse_ticks=0和invert_step=-1将设置在步进引脚的上升沿和下降沿都进行步进输出。

source: `config_stepper oid=%c step_pin=%c dir_pin=%c invert_step=%c` : This command creates an internal stepper object. The 'step_pin' and 'dir_pin' parameters specify the step and direction pins respectively; this command will configure them in digital output mode. The 'invert_step' parameter specifies whether a step occurs on a rising edge (invert_step=0) or falling edge (invert_step=1).
ko: `config_stepper oid=%c step_pin=%c dir_pin=%c invert_step=%c` : 이 명령은 내부 스테퍼 개체를 만듭니다. 'step_pin' 및 'dir_pin' 매개변수는 각각 단계 및 방향 핀을 지정합니다. 이 명령은 디지털 출력 모드에서 구성합니다. 'invert_step' 매개변수는 상승 에지(invert_step=0) 또는 하강 에지(invert_step=1)에서 단계가 발생하는지 여부를 지정합니다.
