Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Measuring_Resonances.po
Languages: fr, hu, ko

source: **Warning!** It is not advisable to run the shaper autocalibration very frequently (e.g. before every print, or every day). In order to determine resonance frequencies, autocalibration creates intensive vibrations on each of the axes. Generally, 3D printers are not designed to withstand a prolonged exposure to vibrations near the resonance frequencies. Doing so may increase wear of the printer components and reduce their lifespan. There is also an increased risk of some parts unscrewing or becoming loose. Always check that all parts of the printer (including the ones that may normally not move) are securely fixed in place after each auto-tuning.
fr: **Attention !** Il est déconseillé d'exécuter l'autocalibrage de l'input shaper très fréquemment (par exemple, avant chaque impression ou tous les jours). Afin de déterminer les fréquences de résonance, l'autocalibrage crée des vibrations intenses sur chacun des axes. Les imprimantes 3D ne sont pas conçues pour résister à une exposition prolongée à des vibrations proches des fréquences de résonance. Cela pourrait augmenter l'usure des composants de l'imprimante et réduire leur durée de vie. Il existe également un risque accru que certaines pièces se dévissent ou se desserrent. Vérifiez toujours que toutes les pièces de l'imprimante (y compris celles qui ne peuvent normalement pas bouger) sont solidement fixées en place après chaque réglage automatique.
hu: **Figyelmeztetés!** Nem tanácsos a gépen az automatikus kalibrációt nagyon gyakran futtatni (pl. minden nyomtatás előtt vagy minden nap). A rezonanciafrekvenciák meghatározása érdekében az automatikus kalibrálás intenzív rezgéseket hoz létre az egyes tengelyeken. A 3D nyomtatókat általában nem úgy tervezték, hogy a rezonanciafrekvenciákhoz közeli rezgéseknek tartósan ellenálljanak. Ez növelheti a nyomtató alkatrészeinek kopását és csökkentheti élettartamukat. Megnő a kockázata annak is, hogy egyes alkatrészek kicsavarodnak vagy meglazulnak. Minden egyes automatikus hangolás után mindig ellenőrizze, hogy a nyomtató minden alkatrésze (beleértve azokat is, amelyek normál esetben nem mozoghatnak) biztonságosan a helyén van-e rögzítve.
ko: **경고!** 셰이퍼 자동 보정을 매우 자주 실행하지 않는 것이 좋습니다 (예: 인쇄할 때마다 또는 매일). 공진 주파수를 결정하기 위해 자동 보정은 각 축에 집중적인 진동을 생성합니다. 일반적으로 3D 프린터는 공진 주파수 근처의 진동에 장기간 노출되는 것을 견디도록 설계되지 않았습니다. 그렇게 하면 프린터 구성 요소의 마모가 증가하고 수명이 단축될 수 있습니다. 또한 일부 부품이 풀리거나 느슨해질 위험이 증가합니다. 각 자동 조정 후에 프린터의 모든 부품 (일반적으로 움직이지 않는 부품 포함) 이 제자리에 단단히 고정되어 있는지 항상 확인하십시오.

source: Also, due to some noise in measurements, it is possible that the tuning results will be slightly different from one calibration run to another one. Still, it is not expected that the noise will affect the print quality too much. However, it is still advised to double-check the suggested parameters, and print some test prints before using them to confirm they are good.
fr: De plus, en raison d'un certain bruit dans les mesures, il est possible que les résultats de réglage soient légèrement différents d'un calibrage à l'autre. Ce bruit ne devrait pas trop affecter la qualité d'impression. Cependant, il est conseillé de revérifier les paramètres suggérés et d'imprimer des tests d'impression avant de les utiliser pour confirmer qu'ils sont corrects.
hu: Továbbá a mérések zajossága miatt lehetséges, hogy a hangolási eredmények kissé eltérnek az egyes kalibrálási folyamatok között. Ennek ellenére nem várható, hogy a zaj túlságosan befolyásolja a nyomtatási minőséget. Mindazonáltal továbbra is tanácsos kétszer is ellenőrizni a javasolt paramétereket, és használat előtt nyomtatni néhány próbanyomatot, hogy megbizonyosodjon arról, hogy azok megfelelőek.
ko: 또한 측정의 일부 노이즈로 인해 조정 결과가 교정 실행마다 약간 다를 수 있습니다. 그러나 노이즈가 인쇄 품질에 너무 많은 영향을 줄 것으로 예상되지는 않습니다. 그러나 여전히 제안된 매개변수를 다시 확인하고 테스트 인쇄물을 인쇄하여 사용하기 전에 양호한지 확인하는 것이 좋습니다.

source: Offline processing of the accelerometer data
fr: Traitement hors ligne des données de l’accéléromètre
hu: A gyorsulásmérő adatainak offline feldolgozása
ko: 가속도계 데이터의 오프라인 처리

source: It is possible to generate the raw accelerometer data and process it offline (e.g. on a host machine), for example to find resonances. In order to do so, run the following commands via Octoprint terminal:
fr: Il est possible de générer les données brutes de l’accéléromètre et de les traiter hors ligne (par exemple sur une machine hôte), par exemple pour trouver des résonances. Pour ce faire, exécutez les commandes suivantes via le terminal Octoprint :
hu: Lehetőség van a nyers gyorsulásmérő adatok előállítására és offline feldolgozására (pl. egy központi gépen), például rezonanciák keresésére. Ehhez futtassa a következő parancsokat az Octoprint terminálon keresztül:
ko: 예를 들어 공진을 찾기 위해 원시 가속도계 데이터를 생성하고 오프라인으로(예: 호스트 머신에서) 처리할 수 있습니다. 그렇게 하려면 Octoprint 터미널을 통해 다음 명령을 실행하십시오:

source: ignoring any errors for `SET_INPUT_SHAPER` command. For `TEST_RESONANCES` command, specify the desired test axis. The raw data will be written into `/tmp` directory on the RPi.
fr: ignorez toute erreur pour la commande `SET_INPUT_SHAPER`. Pour la commande `TEST_RESONANCES`, spécifiez l’axe de test souhaité. Les données brutes seront écrites dans le répertoire `/tmp` sur le RPi.
hu: a `SET_INPUT_SHAPER` parancs hibáinak figyelmen kívül hagyása. A `TEST_RESONANCES` parancshoz adja meg a kívánt teszttengelyt. A nyers adatok az RPi `/tmp` könyvtárába kerülnek kiírásra.
ko: `SET_INPUT_SHAPER` 명령에 대한 오류를 무시합니다. `TEST_RESONANCES` 명령의 경우 원하는 테스트 축을 지정합니다. 원시 데이터는 RPi의 `/tmp` 디렉토리에 기록됩니다.

source: The data can be processed later by the following scripts: `scripts/graph_accelerometer.py` and `scripts/calibrate_shaper.py`. Both of them accept one or several raw csv files as the input depending on the mode. The graph_accelerometer.py script supports several modes of operation:
fr: Les données peuvent être traitées ultérieurement avec les scripts suivants : `scripts/graph_accelerometer.py` et `scripts/calibrate_shaper.py`. Les deux acceptent un ou plusieurs fichiers csv bruts comme entrée en fonction du mode. Le script graph_accelerometer.py prend en charge plusieurs modes de fonctionnement :
hu: Az adatokat később a következő szkriptekkel lehet feldolgozni: `scripts/graph_accelerometer.py` és `scripts/calibrate_shaper.py`. Mindkettő egy vagy több nyers csv-fájlt fogad el bemenetként a módtól függően. A graph_accelerometer.py szkript többféle üzemmódot támogat:
ko: 데이터는 나중에 다음 스크립트로 처리할 수 있습니다: `scripts/graph_accelerometer.py` 및 `scripts/calibrate_shaper.py`. 둘 다 모드에 따라 하나 또는 여러 개의 원시 csv 파일을 입력으로 허용합니다. graph_accelerometer.py 스크립트는 여러 작동 모드를 지원합니다:

source: plotting raw accelerometer data (use `-r` parameter), only 1 input is supported;
fr: pour le traçage des données brutes de l’accéléromètre (utilisez le paramètre `-r`), seule 1 entrée est prise en charge ;
hu: nyers gyorsulásmérő adatok ábrázolása (használja a `-r` paramétert), csak 1 bemenet támogatott;
ko: 원시 가속도계 데이터 플로팅(`-r` 매개변수 사용), 1개의 입력만 지원됩니다;

source: plotting a frequency response (no extra parameters required), if multiple inputs are specified, the average frequency response is computed;
fr: tracer une réponse en fréquence (aucun paramètre supplémentaire n'est requis), si plusieurs entrées sont spécifiées, la réponse en fréquence moyenne est calculée ;
hu: frekvenciaválasz ábrázolása (nincs szükség további paraméterekre), ha több bemenet van megadva, az átlagos frekvenciaválasz kerül kiszámításra;
ko: 주파수 응답을 플로팅(추가 매개변수가 필요하지 않음), 다중 입력이 지정된 경우 평균 주파수 응답이 계산됩니다;

source: comparison of the frequency response between several inputs (use `-c` parameter); you can additionally specify which accelerometer axis to consider via `-a x`, `-a y` or `-a z` parameter (if none specified, the sum of vibrations for all axes is used);
fr: comparaison de la réponse en fréquence entre plusieurs entrées (utiliser le paramètre `-c`) ; vous pouvez également spécifier l’axe de l’accéléromètre à prendre en compte via le paramètre `-a x`, `-a y` ou `-a z` (si aucun n’est spécifié, la somme des vibrations pour tous les axes est utilisée) ;
hu: több bemenet frekvenciaválaszának összehasonlítása (használja a `-c` paramétert); a `-a x`, `-a y` vagy `-a z` paraméterrel ezen felül megadhatja, hogy melyik gyorsulásmérő tengelyt vegye figyelembe (ha nincs megadva, az összes tengely rezgéseinek összegét használja);
ko: 여러 입력 간의 주파수 응답 비교(`-c` 매개변수 사용) `-a x`, `-a y` 또는 `-a z` 매개변수를 통해 고려할 가속도계 축을 추가로 지정할 수 있습니다(지정되지 않은 경우 모든 축의 진동 합계가 사용됨);

source: plotting the spectrogram (use `-s` parameter), only 1 input is supported; you can additionally specify which accelerometer axis to consider via `-a x`, `-a y` or `-a z` parameter (if none specified, the sum of vibrations for all axes is used).
fr: traçage du spectrogramme (utiliser le paramètre `-s`), seule 1 entrée est prise en charge ; vous pouvez également spécifier l’axe de l’accéléromètre à prendre en compte via le paramètre `-a x`, `-a y` ou `-a z` (si aucun n’est spécifié, la somme des vibrations pour tous les axes est utilisée).
hu: a spektrogram ábrázolása (használja a `-s` paramétert), csak 1 bemenet támogatott; a `-a x`, `-a y` vagy `-a z` paraméterrel ezen felül megadhatja, hogy melyik gyorsulásmérő tengelyt vegye figyelembe (ha nincs megadva, akkor az összes tengely rezgéseinek összegét használja).
ko: 스펙트로그램 플로팅(`-s` 매개변수 사용), 1개의 입력만 지원됩니다. `-a x`, `-a y` 또는 `-a z` 매개변수를 통해 고려할 가속도계 축을 추가로 지정할 수 있습니다(지정되지 않은 경우 모든 축의 진동 합계가 사용됨).

source: Note that graph_accelerometer.py script supports only the raw_data\*.csv files and not resonances\*.csv or calibration_data\*.csv files.
fr: Notez que graph_accelerometer.py script ne prend en charge que les fichiers raw_data\*.csv et non les fichiers resonances\*.csv ou calibration_data\*.csv.
hu: Vegye figyelembe, hogy a graph_accelerometer.py szkript csak a raw_data\*.csv fájlokat támogatja, a resonances\*.csv vagy calibration_data\*.csv fájlokat nem.
ko: graph_accelerometer.py 스크립트는 raw_data\*.csv 파일만 지원하고 resonances\*.csv 또는 calibration_data\*.csv 파일은 지원하지 않습니다.

source: For example,
fr: Par exemple,
hu: Például,
ko: 예를 들어,

source: will plot the comparison of several `/tmp/raw_data_x_*.csv` files for Z axis to `/tmp/resonances_x.png` file.
fr: tracera la comparaison de plusieurs fichiers `/tmp/raw_data_x_*.csv` pour l’axe Z dans le fichier `/tmp/resonances_x.png`.
hu: több `/tmp/raw_data_x_*.csv` fájl és `/tmp/resonances_x.png` fájl összehasonlítását ábrázolja a Z tengelyen.
ko: Z 축에 대한 여러 `/tmp/raw_data_x_*.csv` 파일을 `/tmp/resonances_x.png` 파일과 비교하여 플롯합니다.

source: The shaper_calibrate.py script accepts 1 or several inputs and can run automatic tuning of the input shaper and suggest the best parameters that work well for all provided inputs. It prints the suggested parameters to the console, and can additionally generate the chart if `-o output.png` parameter is provided, or the CSV file if `-c output.csv` parameter is specified.
fr: Le script shaper_calibrate.py accepte 1 ou plusieurs entrées et peut exécuter le réglage automatique de l'input shaper et suggérer les meilleurs paramètres pour les entrées fournies. Il affiche les paramètres suggérés sur la console et peut en outre générer un graphique si le paramètre `-o output.png` est fourni, ou un fichier CSV si le paramètre `-c output.csv` est spécifié.
hu: A shaper_calibrate.py szkript 1 vagy több bemenetet fogad el, és képes a bemeneti formázó automatikus hangolására, valamint a legjobb paraméterek kiválasztására, amelyek jól működnek az összes megadott bemeneten. A javasolt paramétereket kiírja a konzolra, és emellett képes létrehozni a grafikont, ha `-o output.png` paramétert adunk meg, vagy a CSV fájlt, ha `-c output.csv` paramétert adunk meg.
ko: shaper_calibration.py 스크립트는 하나 이상의 입력을 허용하고 입력 shaper의 자동 조정을 실행할 수 있고 제공된 모든 입력에 대해 잘 작동하는 최상의 매개변수를 제안할 수 있습니다. 제안된 매개변수를 콘솔에 출력하고 `-o output.png` 매개변수가 제공된 경우 차트를 추가로 생성하거나 `-c output.csv` 매개변수가 지정된 경우 CSV 파일을 생성할 수 있습니다.

source: Providing several inputs to shaper_calibrate.py script can be useful if running some advanced tuning of the input shapers, for example:
fr: Fournir plusieurs entrées à shaper_calibrate.py script peut être utile si vous exécutez un réglage avancé de l'input shaper, par exemple :
hu: Több bemenet megadása a shaper_calibrate.py szkriptnek hasznos lehet, ha például a bemeneti formázók haladó hangolását végezzük:
ko: shaper_calibration.py 스크립트에 여러 입력을 제공하면 입력 셰이퍼의 일부 고급 조정을 실행하는 경우 유용할 수 있습니다. 예를 들면 다음과 같습니다:

source: Running `TEST_RESONANCES AXIS=X OUTPUT=raw_data` (and `Y` axis) for a single axis twice on a bed slinger printer with the accelerometer attached to the toolhead the first time, and the accelerometer attached to the bed the second time in order to detect axes cross-resonances and attempt to cancel them with input shapers.
fr: Exécutez `TEST_RESONANCES AXIS=X OUTPUT=raw_data` (et `Y` axe) pour un seul axe deux fois sur une imprimante cartésienne avec l’accéléromètre fixé à la tête d’outil la première fois, et l’accéléromètre fixé au lit la deuxième fois afin de détecter les résonances croisées des axes et de tenter de les annuler avec l'input shaper.
hu: A `TEST_RESONANCES AXIS=X OUTPUT=raw_data` (és `Y` tengely) futtatása egy tengelyre kétszer egy Y ágyas nyomtatón úgy, hogy a gyorsulásmérő először a szerszámfejhez, másodszor pedig az ágyhoz csatlakozik, hogy a tengelyek keresztrezonanciáit felismerjük, és megpróbáljuk azokat a bemeneti alakítókkal megszüntetni.
ko: 처음에는 툴 헤드에 가속도계가 부착된 bed slinger 프린터에서 단일 축에 대해 `TEST_RESONANCES AXIS=X OUTPUT=raw_data`(및 `Y` 축)를 두 번 실행하고 두 번째로 베드에 가속도계를 부착한 순서대로 실행 축 교차 공명을 감지하고 입력 셰이퍼로 취소하려고 시도합니다.

source: Running `TEST_RESONANCES AXIS=Y OUTPUT=raw_data` twice on a bed slinger with a glass bed and a magnetic surfaces (which is lighter) to find the input shaper parameters that work well for any print surface configuration.
fr: Exécutez `TEST_RESONANCES AXIS=Y OUTPUT=raw_data` deux fois sur le lit avec un lit en verre et une surface magnétique (plus légère) pour trouver les paramètres d'input shaper qui fonctionnent bien pour n’importe quelle configuration de surface d’impression.
hu: A `TEST_RESONANCES AXIS=Y OUTPUT=raw_data` kétszeri futtatása egy üvegágyas és egy mágneses felületű (amelyik könnyebb) ágyon, hogy megtaláljuk azokat a bemeneti alakító paramétereket, amelyek jól működnek bármilyen nyomtatási felületkonfiguráció esetén.
ko: 유리 베드와 자성 표면 (더 가벼움)이 있는 bed slinger에서 `TEST_RESONANCES AXIS=Y OUTPUT=raw_data`를 두 번 실행하여 모든 인쇄 표면 구성에 잘 작동하는 입력 셰이퍼 매개변수를 찾습니다.

source: Combining the resonance data from multiple test points.
fr: Combinaison des données de résonance de plusieurs points de test.
hu: A több vizsgálati pontból származó rezonanciaadatok kombinálása.
ko: 여러 테스트 지점의 공진 데이터 결합.

source: Combining the resonance data from 2 axis (e.g. on a bed slinger printer to configure X-axis input_shaper from both X and Y axes resonances to cancel vibrations of the *bed* in case the nozzle 'catches' a print when moving in X axis direction).
fr: Combinaison des données de résonance à partir de 2 axes (par exemple, sur une imprimante cartésienne pour configurer les input_shaper de l’axe X à partir des résonances des axes X et Y pour annuler les vibrations du lit * * au cas où la buse « attraperait » une impression lors du déplacement dans la direction de l’axe X).
hu: A 2 tengely rezonanciaadatainak kombinálása (pl. egy Y tengelyen lévő ágyas nyomtatónál az X-tengely input_shaper konfigurálása mind az X-, mind az Y-tengely rezonanciáiból, hogy az *ágy* rezgéseit megszüntesse, ha a fúvóka 'elkap' egy nyomtatást, amikor X tengely irányában mozog).
ko: 2축의 공명 데이터 결합 (예: bed slinger 프린터에서 X축과 Y축 모두에서 X축 input_shaper 를 구성하는 공진은 X축 방향으로 이동할 때 노즐이 인쇄물을 '치는' 경우 *BED* 의 진동을 취소하기 위해 공진).

source: [input_shaper] shaper_freq_x: ... shaper_type_x: ... shaper_freq_y: 34.6 shaper_type_y: mzv [printer] max_accel: 3000 # should not exceed the estimated max_accel for X and Y axes
fr: [input_shaper] shaper_freq_x: ... shaper_type_x: ... shaper_freq_y: 34.6 shaper_type_y: mzv [printer] max_accel: 3000 # Ne devrait pas dépasser les valeurs estimées d'accélération calculées pour les axes X et Y
hu: [input_shaper] shaper_freq_x: ... shaper_type_x: ... shaper_freq_y: 34.6 shaper_type_y: mzv [printer] max_accel: 3000 # nem haladhatja meg a becsült max_accel értéket az X és Y tengelyeknél.

source: [adxl345 hotend] # Assuming `hotend` chip is connected to an RPi cs_pin: rpi:None [adxl345 bed] # Assuming `bed` chip is connected to a printer MCU board cs_pin: ... # Printer board SPI chip select (CS) pin [resonance_tester] # Assuming the typical setup of the bed slinger printer accel_chip_x: adxl345 hotend accel_chip_y: adxl345 bed probe_points: ...
fr: [adxl345 hotend] # En considérant que l'adxl de la tête connectée au RPI cs_pin: rpi:None [adxl345 bed] # En considérant que l'adxl du lit est connecté au MCU cs_pin: ... # Printer board SPI chip select (CS) pin [resonance_tester] # En considérant un montage standard pour une imprimante cartésienne accel_chip_x: adxl345 hotend accel_chip_y: adxl345 bed probe_points: ...
hu: [adxl345 hotend] # Feltételezve, hogy a `hotend` chip egy RPi-hez van csatlakoztatva. cs_pin: rpi:None [adxl345 bed] # Feltételezve, hogy a `bed` chip egy nyomtató MCU lapkához van csatlakoztatva. cs_pin: ... # nyomtató alaplap SPI chip kiválasztó (CS) tűje [resonance_tester] # Feltételezve az Y ágyas nyomtató tipikus beállítását. accel_chip_x: adxl345 hotend accel_chip_y: adxl345 bed probe_points: ...

source: [resonance_tester] accel_chip: ... probe_points: ... max_smoothing: 0.25 # an example
fr: [resonance_tester] accel_chip: ... probe_points: ... max_smoothing: 0.25 # valeur exemple
hu: [resonance_tester] accel_chip: ... probe_points: ... max_smoothing: 0.25 # egy példa

source: Testing custom axes
fr: Test des axes personnalisés
hu: Egyéni tengelyek tesztelése
ko: 사용자 정의 축 테스트

source: `TEST_RESONANCES` command supports custom axes. While this is not really useful for input shaper calibration, it can be used to study printer resonances in-depth and to check, for example, belt tension.
fr: la commande ` TEST_RESONANCES` prend en charge les axes personnalisés. Bien que cela ne soit pas vraiment utile pour l’étalonnage des input shaper, cela peut être utilisé pour étudier en profondeur les résonances de l’imprimante et vérifier, par exemple, la tension de la courroie.
hu: `TEST_RESONANCES` parancs támogatja az egyéni tengelyeket. Bár ez nem igazán hasznos a bemeneti alakító kalibrálásához, a nyomtató rezonanciáinak alapos tanulmányozására és például a szíjfeszítés ellenőrzésére használható.
ko: `TEST_RESONANCES` 명령은 사용자 지정 축을 지원합니다. 이것은 입력 셰이퍼 보정에 실제로 유용하지 않지만 프린터 공진을 심층적으로 연구하고 예를 들어 벨트 장력을 확인하는 데 사용할 수 있습니다.

source: To check the belt tension on CoreXY printers, execute
fr: Pour vérifier la tension de la courroie sur les imprimantes CoreXY, exécutez
hu: A CoreXY nyomtatókon a szíjfeszítés ellenőrzéséhez hajtsa végre a következőt
ko: CoreXY 프린터의 벨트 장력을 확인하려면 다음을 실행하십시오

source: and use `graph_accelerometer.py` to process the generated files, e.g.
fr: et utilisez `graph_accelerometer.py` pour traiter les fichiers générés.
hu: és használjuk a `graph_accelerometer.py` fájlt a generált fájlok feldolgozásához, pl.
ko: 생성된 파일을 처리하기 위해 `graph_accelerometer.py`를 사용합니다, 예들들어.

source: which will generate `/tmp/resonances.png` comparing the resonances.
fr: qui générera `/tmp/résonances.png` en comparant les résonances.
hu: amely a rezonanciákat összehasonlítva `/tmp/resonances.png` képet hoz létre.
ko: 이것은 공명을 비교하는 `/tmp/resonances.png`를 생성합니다.

source: For Delta printers with the default tower placement (tower A ~= 210 degrees, B ~= 330 degrees, and C ~= 90 degrees), execute
fr: Pour les imprimantes Delta avec le placement des tours par défaut (tour A ~= 210 degrés, B ~= 330 degrés et C ~= 90 degrés), exécutez
hu: Az alapértelmezett toronyelhelyezésű Delta nyomtatók esetében (A torony ~= 210 fok, B ~= 330 fok és C ~= 90 fok), hajtsa végre a következőt
ko: 기본 타워 배치(타워 A ~= 210도, B ~= 330도 및 C ~= 90도)가 있는 Delta 프린터의 경우 다음을 실행합니다

source: and then use the same command
fr: puis utilisez la même commande
hu: majd használja ugyanazt a parancsot
ko: 그런 다음 동일한 명령을 사용하십시오

source: to generate `/tmp/resonances.png` comparing the resonances.
fr: pour générer le fichier de comparaison des résonnances `/tmp/résonances.png`.
hu: `/tmp/resonances.png` létrehozásához, amely összehasonlítja a rezonanciákat.
ko: 그러면 공명을 비교하는 `/tmp/resonances.png`를 생성합니다.

source: When sourcing ADXL345, be aware that there is a variety of different PCB board designs and different clones of them. Make sure that the board supports SPI mode (small number of boards appear to be hard-configured for I2C by pulling SDO to GND), and, if it is going to be connected to a 5V printer MCU, that it has a voltage regulator and a level shifter.
fr: Lors de l’approvisionnement en ADXL345, sachez qu’il existe une variété de conceptions de cartes PCB différentes et différents clones. Assurez-vous que la carte prend en charge le mode SPI (un petit nombre de cartes semble être configurée en dur pour I2C avec SDO raccordé au GND) et, si elle doit être connectée à un microcontrôleur d’imprimante 5V, qu’elle dispose d’un régulateur de tension et d’un décalage de niveau.
hu: Az ADXL345 beszerzésekor vegye figyelembe, hogy számos különböző NYÁK lapkakialakítás és különböző klónok léteznek. Győződjön meg róla, hogy a kártya támogatja az SPI módot (kis számú kártya úgy tűnik, hogy szorosan konfigurálva van az I2C-re az SDO GND-re húzásával), és ha 5V-os nyomtató MCU-hoz csatlakozik ellenőrizze,hogy rendelkezik feszültségszabályozóval és szintválasztóval.

source: [mcu rpi] serial: /tmp/klipper_host_mcu [adxl345] cs_pin: rpi:None [resonance_tester] accel_chip: adxl345 probe_points: 100, 100, 20 # an example
fr: [mcu rpi] serial: /tmp/klipper_host_mcu [adxl345] cs_pin: rpi:None [resonance_tester] accel_chip: adxl345 probe_points: 100, 100, 20 # valeur exemple
hu: [mcu rpi] serial: /tmp/klipper_host_mcu [adxl345] cs_pin: rpi:None [resonance_tester] accel_chip: adxl345 probe_points: 100, 100, 20 # egy példa

source: This will generate 2 CSV files (`/tmp/resonances_x_*.csv` and `/tmp/resonances_y_*.csv`). These files can be processed with the stand-alone script on a Raspberry Pi. To do that, run the following commands:
fr: Cela générera 2 fichiers CSV (`/tmp/resonances_x_*.csv` et `/tmp/resonances_y_*.csv`). Ces fichiers peuvent être traités avec le script autonome sur un Raspberry Pi. Pour ce faire, exécutez les commandes suivantes :
hu: Ez 2 CSV fájlt fog létrehozni (`/tmp/resonances_x_*.csv` és `/tmp/resonances_y_*.csv`) Ezeket a fájlokat a Raspberry Pi-n lévő önálló szkript segítségével lehet feldolgozni. Ehhez futtassa a következő parancsokat:

source: The raw data can also be obtained by running the command `ACCELEROMETER_MEASURE` command twice during some normal printer activity - first to start the measurements, and then to stop them and write the output file. Refer to [G-Codes](G-Codes.md#adxl345) for more details.
fr: Les données brutes peuvent également être obtenues en exécutant la commande `ACCELEROMETER_MEASURE` deux fois - d’abord pour démarrer les mesures, puis pour les arrêter et écrire le fichier de sortie. Reportez-vous à [G-Codes](G-Codes.md#adxl345) pour plus de détails.
hu: A nyers adatokat úgy is megkaphatjuk, ha a `ACCELEROMETER_MEASURE` parancsot kétszer futtatjuk valamilyen normál nyomtatási tevékenység közben - először a mérések elindításához, majd azok leállításához és a kimeneti fájl írásához. További részletekért lásd a [G-Kódok](G-Codes.md#adxl345) című dokumentumot.
