Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Measuring_Resonances.po
Languages: fr, hu, ko

source: Measuring Resonances
fr: Mesurer la résonance
hu: Rezonanciák mérése
ko: 공진 측정

source: Klipper has built-in support for ADXL345 accelerometer, which can be used to measure resonance frequencies of the printer for different axes, and auto-tune [input shapers](Resonance_Compensation.md) to compensate for resonances. Note that using ADXL345 requires some soldering and crimping. ADXL345 can be connected to a Raspberry Pi directly, or to an SPI interface of an MCU board (it needs to be reasonably fast).
fr: Klipper prend en charge l’accéléromètre ADXL345, qui peut être utilisé pour mesurer les fréquences de résonance de l’imprimante sur différents axes, et le réglage automatique [input shapers](Resonance_Compensation.md) pour limiter les résonances. Notez que l’utilisation de l’ADXL345 nécessite un peu de soudure et de sertissage. L’ADXL345 peut être connecté directement à un Raspberry Pi, ou à une interface SPI d’une carte MCU (qui doit être rapide).
hu: A Klipper beépített támogatással rendelkezik az ADXL345 gyorsulásmérőhöz, amely a nyomtató rezonanciáinak mérésére használható a különböző tengelyek esetében, és automatikus hangolással [rezonancia kompenzációval](Resonance_Compensation.md) a rezonanciák kompenzálására. Vegye figyelembe, hogy az ADXL345 használata némi forrasztást és krimpelést igényel. Az ADXL345 közvetlenül csatlakoztatható egy Raspberry Pi-hez, vagy egy MCU-kártya SPI-interfészéhez (meglehetősen gyorsnak kell lennie).
ko: Klipper는 다양한 축에 대한 프린터의 공진 주파수를 측정하는 데 사용할 수 있는 ADXL345 가속도계를 기본적으로 지원하고 공진을 보상하기 위해 [input shapers](Resonance_Compensation.md) 를 자동 조정합니다. ADXL345 를 사용하려면 약간의 납땜 및 압착이 필요합니다. ADXL345는 Raspberry Pi에 직접 연결하거나 MCU 보드의 SPI 인터페이스에 연결할 수 있습니다 (빠른 속도가 필요하기 때문에).

source: Installation instructions
fr: Instructions d’installation
hu: Telepítési utasítások
ko: 설치 방법

source: Wiring
fr: Câblage
hu: Vezetékek
ko: 배선

source: You need to connect ADXL345 to your Raspberry Pi via SPI. Note that the I2C connection, which is suggested by ADXL345 documentation, has too low throughput and **will not work**. The recommended connection scheme:
fr: Vous devez connecter ADXL345 à votre Raspberry Pi via SPI. Notez que la connexion I2C, suggérée par la documentation ADXL345, a un débit trop faible et ** ne fonctionnera pas**. Le schéma de connexion recommandé :
hu: Az ADXL345-öt SPI-n keresztül kell csatlakoztatnia a Raspberry Pi-hez. Vegye figyelembe, hogy az ADXL345 dokumentációja által javasolt I2C kapcsolatnak túl alacsony az adatforgalmi képessége, és **nem fog működni**. Az ajánlott kapcsolási séma:
ko: SPI 를 통해 ADXL345 를 Raspberry Pi에 연결해야 합니다. ADXL345 문서에서 제안하는 I2C 연결은 처리량이 너무 낮아 **작동하지 않습니다**. 권장 연결 방식:

source: ADXL345 pin
fr: Brochage de l'ADXL345
hu: ADXL345 tű
ko: ADXL345 핀

source: RPi pin
fr: Brochage du RPI
hu: RPi tű
ko: RPi 핀

source: RPi pin name
fr: Nom des broches du RPI
hu: RPi tű név
ko: RPi 핀 이름

source: 3V3 (or VCC)
fr: 3,3 V (ou VCC)
ko: 3V3 (또는 VCC)

source: 3.3v DC power
fr: Alimentation 3.3v continu
hu: 3.3v DC feszültség
ko: 3.3v 직류 전원

source: Ground
fr: Terre
hu: Föld

source: Fritzing wiring diagrams for some of the ADXL345 boards:
fr: Schémas de câblage de Fritzing pour certaines des cartes ADXL345 :
hu: Fritzing kapcsolási rajzok néhány ADXL345 laphoz:
ko: ADXL345 보드에 대한 Fritzing 배선 다이어그램:

source: Double-check your wiring before powering up the Raspberry Pi to prevent damaging it or the accelerometer.
fr: Vérifiez votre câblage avant de mettre le Raspberry Pi sous tension pour éviter de l’endommager ou d’endommager l’accéléromètre.
hu: A Raspberry Pi bekapcsolása előtt ellenőrizze kétszer is a vezetékeket, nehogy megsérüljön a Raspberry Pi vagy a gyorsulásmérő.
ko: Raspberry Pi 또는 가속도계의 손상을 방지하기 위해 Raspberry Pi의 전원을 켜기 전에 배선을 다시 확인하십시오.

source: Mounting the accelerometer
fr: Montage de l’accéléromètre
hu: A gyorsulásmérő felszerelése
ko: 가속도계 장착

source: The accelerometer must be attached to the toolhead. One needs to design a proper mount that fits their own 3D printer. It is better to align the axes of the accelerometer with the printer's axes (but if it makes it more convenient, axes can be swapped - i.e. no need to align X axis with X and so forth - it should be fine even if Z axis of accelerometer is X axis of the printer, etc.).
fr: L’accéléromètre doit être fixé sur la tête d'impression. Il faut concevoir un support approprié qui s’adapte à l'imprimante 3D. Il est préférable d’aligner les axes de l’accéléromètre avec les axes de l’imprimante (mais ce n'est pas obligatoire - c’est-à-dire pas besoin d’aligner l’axe X avec X et ainsi de suite - cela devrait être correct même si l’axe Z de l’accéléromètre est l’axe X de l’imprimante, etc.).
hu: A gyorsulásmérőt a szerszámfejhez kell csatlakoztatni. Meg kell tervezni egy megfelelő rögzítést, amely illeszkedik a saját 3D nyomtatóhoz. A gyorsulásmérő tengelyeit jobb a nyomtató tengelyeihez igazítani (de ha ez kényelmesebbé teszi, a tengelyek felcserélhetők - azaz nem kell az X tengelyt X-hez igazítani, és így tovább. Akkor is rendben kell lennie, ha a gyorsulásmérő Z tengelye a nyomtató X tengelye, stb).
ko: 가속도계는 툴헤드에 부착되어야 합니다. 자신의 3D 프린터에 맞는 적절한 마운트를 설계해야 합니다. 가속도계의 축을 프린터의 축과 정렬하는 것이 좋습니다 (그러나 더 편리하게 만들면 축을 바꿀 수 있습니다. 즉, X축을 X와 정렬할 필요가 없습니다. Z축이 다음과 같아도 괜찮습니다. 가속도계는 프린터의 X축 등).

source: An example of mounting ADXL345 on the SmartEffector:
fr: Exemple de montage d’ADXL345 sur le SmartEffector :
hu: Példa az ADXL345 SmartEffectorra történő felszerelésére:
ko: SmartEffector 에 ADXL345 를 장착하는 예:

source: Note that on a bed slinger printer one must design 2 mounts: one for the toolhead and one for the bed, and run the measurements twice. See the corresponding [section](#bed-slinger-printers) for more details.
fr: Notez que sur une imprimante cartésienne, il faut concevoir 2 supports : un pour la tête et un pour le lit, et exécuter les mesures deux fois. Voir la [section](#bed-slinger-printers) correspondante pour plus de détails.
hu: Vegye figyelembe, hogy egy ágycsúsztatós nyomtatónál 2 rögzítést kell tervezni: egyet a szerszámfejhez és egyet az ágyhoz, és a méréseket kétszer kell elvégezni. További részletekért lásd a megfelelő [szakaszt](#bed-slinger-printers).
ko: BED Slingers 프린터에서 하나는 2개의 마운트를 설계해야 합니다. 하나는 헤드용, 다른 하나는 베드용이고 측정을 두 번 실행합니다. 자세한 내용은 해당 [section](#bed-slinger-printers) 을 참조하세요.

source: **Attention:** make sure the accelerometer and any screws that hold it in place do not touch any metal parts of the printer. Basically, the mount must be designed such as to ensure the electrical isolation of the accelerometer from the printer frame. Failing to ensure that can create a ground loop in the system that may damage the electronics.
fr: ** Attention:** assurez-vous que l’accéléromètre et les vis qui le maintiennent en place ne touchent aucune partie métallique de l’imprimante. Fondamentalement, le support doit être conçu de manière à assurer l’isolation électrique de l’accéléromètre du châssis de l’imprimante. Ne pas s’assurer de cette isolation peut créer une boucle de terre dans le système qui peut endommager l’électronique.
hu: **Figyelem:** győződjön meg arról, hogy a gyorsulásmérő és a helyére rögzítő csavarok nem érnek a nyomtató fém részeihez. Alapvetően a rögzítést úgy kell kialakítani, hogy biztosítsa a gyorsulásmérő elektromos szigetelését a nyomtató keretétől. Ennek elmulasztása földhurkot hozhat létre a rendszerben, ami károsíthatja az elektronikát.
ko: **주의:** 가속도계와 이를 고정하는 나사가 프린터의 금속 부분에 닿지 않도록 하십시오. 기본적으로 마운트는 프린터 프레임에서 가속도계의 전기적 절연을 보장하도록 설계되어야 합니다. 시스템에 접지가 되지 않으면 전자장치를 손상시킬 수 있습니다.

source: Software installation
fr: Installation logicielle
hu: Szoftver telepítése
ko: 소프트웨어 설치

source: Afterwards, check and follow the instructions in the [RPi Microcontroller document](RPi_microcontroller.md) to setup the "linux mcu" on the Raspberry Pi.
fr: Vérifiez et suivez les instructions dans le [document RPi Microcontroller](RPi_microcontroller.md) pour configurer le « linux mcu » sur le Raspberry Pi.
hu: Ezután ellenőrizze és kövesse az [RPi Microcontroller dokumentum](RPi_microcontroller.md) utasításait a "linux mcu" beállításához a Raspberry Pi-n.
ko: 이후 [RPi Microcontroller document](RPi_microcontroller.md) 의 지시사항에 따라 라즈베리파이에 "linux mcu"를 설정합니다.

source: Make sure the Linux SPI driver is enabled by running `sudo raspi-config` and enabling SPI under the "Interfacing options" menu.
fr: Assurez-vous que le pilote SPI Linux est activé en exécutant `sudo raspi-config` et en activant SPI dans le menu « Options d’interface ».
hu: Győződjünk meg róla, hogy a Linux SPI-illesztőprogram engedélyezve van a `sudo raspi-config` futtatásával és az SPI engedélyezésével az "Interfacing options" menüben.
ko: `sudo raspi-config` 를 실행하고 "Interfacing options" 메뉴에서 SPI를 활성화하여 Linux SPI 드라이버가 활성화되어 있는지 확인합니다.

source: It is advised to start with 1 probe point, in the middle of the print bed, slightly above it.
fr: Il est conseillé de commencer par 1 point de test, au milieu du lit d’impression, légèrement au-dessus.
hu: Javasoljuk, hogy 1 mérőpontal kezdje, a nyomtatási ágy közepén, kissé felette.
ko: 프린터 BED 중간, 약간 위에서 프로브 포인트 1개로 시작하는 것이 좋습니다.

source: Restart Klipper via the `RESTART` command.
fr: Redémarrez Klipper avec la commande `RESTART`.
hu: Indítsa újra a Klippert a `RESTART` paranccsal.
ko: `RESTART` 명령을 통해 Klipper를 다시 시작하십시오.

source: Measuring the resonances
fr: Mesurer les résonances
hu: A rezonanciák mérése
ko: 공진 측정

source: Checking the setup
fr: Vérification de la configuration
hu: A beállítás ellenőrzése
ko: 설정 확인

source: Now you can test a connection.
fr: Vous pouvez maintenant tester la connexion.
hu: Most már tesztelheti a kapcsolatot.
ko: 이제 연결을 테스트할 수 있습니다.

source: For "non bed-slingers" (e.g. one accelerometer), in Octoprint, enter `ACCELEROMETER_QUERY`
fr: Pour les imprimntes non cartésiennes (celles avec une seul accéléromètre), dans Octoprint, entrez `ACCELEROMETER_QUERY`
hu: A "nem ágyat érintő" (pl. egy gyorsulásmérő), az Octoprintben írja be a `ACCELEROMETER_QUERY` bejegyzést
ko: "non bed-slingers"(예: 가속도계 1개) 의 경운 Octoprint에 `ACCELEROMETER_QUERY` 를 입력하세요

source: For "bed-slingers" (e.g. more than one accelerometer), enter `ACCELEROMETER_QUERY CHIP=<chip>` where `<chip>` is the name of the chip as-entered, e.g. `CHIP=bed` (see: [bed-slinger](#bed-slinger-printers)) for all installed accelerometer chips.
fr: Pour les imprimante cartésiennes (plus d’un accéléromètre), entrez `ACCELEROMETER_QUERY CHIP=<chip>` où `<chip>` est le nom de la puce tel qu’il a été entré, par exemple `CHIP=bed` (voir : [bed-slinger](#bed-slinger-printers)) faites-le pour tous les accéléromètre installés.
hu: A "bed-slingers" (pl. egynél több gyorsulásmérő) esetében írja be a `ACCELEROMETER_QUERY CHIP=<chip>` ahol `<chip>` a chip neve a beírt formában, pl. `CHIP=bed` (lásd: [bed-slinger](#bed-slinger-printers)) az összes telepített gyorsulásmérő chiphez.
ko: "bed-slingers" (예: 둘 이상의 가속도계) 의 경우 `ACCELERROMETER_QUERY CHIP=<chip>`을 입력합니다. 여기서 `<chip>`은 입력된 칩의 이름입니다. 예: 설치된 가속도 칩에 대해 `CHIP=bed`(참조: [bed-slinger](#bed-slinger-printers)).

source: You should see the current measurements from the accelerometer, including the free-fall acceleration, e.g.
fr: Vous devriez voir les mesures actuelles de l’accéléromètre, y compris l’accélération en chute libre.
hu: A gyorsulásmérő aktuális méréseit kell látnia, beleértve a szabadesés gyorsulását is, pl.
ko: 자유 낙하 가속도를 포함하여 가속도계의 현재 측정값이 표시되어야 합니다. 예는 아래와 같습니다.

source: If you get an error like `Invalid adxl345 id (got xx vs e5)`, where `xx` is some other ID, it is indicative of the connection problem with ADXL345, or the faulty sensor. Double-check the power, the wiring (that it matches the schematics, no wire is broken or loose, etc.), and soldering quality.
fr: Si vous obtenez une erreur comme `Invalid adxl345 id (got xx vs e5)`, où `xx` est un autre ID, cela indique un problème de connexion avec ADXL345, ou de capteur défectueux. Vérifiez l’alimentation, le câblage (correspondance avec les schémas, aucun fil coupé ou desserré, etc.) et la qualité de la soudure.
hu: Ha olyan hibát kap, mint `Invalid adxl345 id (got xx vs e5)`, ahol `xx` valami más azonosító, azaz ADXL345-öt érintő kapcsolati problémára vagy a hibás érzékelőre utal. Ellenőrizze kétszer is a tápellátást, a kábelezést (hogy megfelel-e a kapcsolási rajzoknak, nincs-e törött vagy laza vezeték stb.) és a forrasztás minőségét.
ko: `Invalid adxl345 id (got xx vs e5)` 와 같은 오류가 발생하면 (여기서 'xx'는 다른 ID임) ADXL345의 연결 문제 또는 센서 결함을 나타냅니다. 전원, 배선(회로도와 일치하는지, 와이어가 끊어지거나 느슨하지 않은지 등) 및 납땜 품질을 다시 확인하십시오.

source: Next, try running `MEASURE_AXES_NOISE` in Octoprint, you should get some baseline numbers for the noise of accelerometer on the axes (should be somewhere in the range of ~1-100). Too high axes noise (e.g. 1000 and more) can be indicative of the sensor issues, problems with its power, or too noisy imbalanced fans on a 3D printer.
fr: Ensuite, essayez d’exécuter `MEASURE_AXES_NOISE` dans Octoprint, vous devriez obtenir des chiffres de base pour le bruit de fond l’accéléromètre sur les axes (qui devrait se situer entre 1 et 100). Un bruit de fond d’axe trop élevé (par exemple 1000 et plus) peut indiquer des problèmes de capteur, des problèmes de puissance ou des ventilateurs déséquilibrés amenant trop de vibrations sur l'imprimante 3D.
hu: Ezután próbáld meg futtatni a `MEASURE_AXES_NOISE` parancsot az Octoprintben, így kaphatsz néhány alapszámot a gyorsulásmérő zajára a tengelyeken (valahol a ~1-100-as tartományban kell lennie). A túl magas tengelyzaj (pl. 1000 és több) az érzékelő problémáira, a tápellátásával kapcsolatos problémákra vagy a 3D nyomtató túl zajos, kiegyensúlyozatlan ventilátoraira utalhat.
ko: 다음으로 Octoprint에서 `MEASURE_AXES_NOISE`를 실행해 보십시오. 축의 가속도계 노이즈에 대한 기준 수치를 얻어야 합니다 (~1-100 범위 어딘가에 있어야 함). 너무 높은 축 노이즈(예: 1000개 이상)는 센서 문제, 전원 문제 또는 3D 프린터의 너무 시끄러운 팬이 원인일 수 있습니다.

source: Now you can run some real-life tests. Run the following command:
fr: Vous pouvez maintenant exécuter des tests réels. Exécutez la commande suivante :
hu: Most már lefuttathat néhány valós tesztet. Futtassa a következő parancsot:
ko: 이제 실제 테스트를 실행할 수 있습니다. 다음 명령을 실행합니다:

source: Note that it will create vibrations on X axis. It will also disable input shaping if it was enabled previously, as it is not valid to run the resonance testing with the input shaper enabled.
fr: Notez que cela créera des vibrations sur l’axe X. Ce test désactivera les valeurs l'input shaper déjà paramétrées. Le test de résonnance ne peut pas être fait avec l'input shaper' déjà activé.
hu: Vegye figyelembe, hogy az X tengelyen rezgéseket hoz létre. A bemeneti alakítást is letiltja, ha az korábban engedélyezve volt, mivel a rezonancia tesztelés nem érvényes a bemeneti alakító engedélyezésével.
ko: X축에 진동을 생성합니다. 또한 입력 셰이퍼가 활성화된 상태에서 공진 테스트를 실행하는 것이 유효하지 않기 때문에 이전에 활성화된 경우 입력 셰이핑을 비활성화합니다.

source: **Attention!** Be sure to observe the printer for the first time, to make sure the vibrations do not become too violent (`M112` command can be used to abort the test in case of emergency; hopefully it will not come to this though). If the vibrations do get too strong, you can attempt to specify a lower than the default value for `accel_per_hz` parameter in `[resonance_tester]` section, e.g.
fr: ** Attention ! ** Observez l’imprimante la première fois, pour vous assurer que les vibrations ne deviennent pas trop violentes (la commande `M112` peut être utilisée pour interrompre le test en cas d’urgence - espérons que cela n’arrivera pas à cela). Si les vibrations deviennent trop fortes, vous pouvez essayer de spécifier une valeur inférieure à la valeur par défaut pour le paramètre `accel_per_hz` dans la section `[resonance_tester]`.
hu: **Figyelem!** Az első alkalommal mindenképpen figyelje meg a nyomtatót, hogy a rezgések ne legyenek túl hevesek (az `M112` paranccsal vészhelyzet esetén megszakítható a teszt; remélhetőleg azonban erre nem kerül sor). Ha a rezgések mégis túl erősek lesznek, megpróbálhat az alapértelmezettnél alacsonyabb értéket megadni az `accel_per_hz` paraméterhez a `[resonance_tester]` szakaszban, pl.
ko: **주의!** 진동이 너무 심하지 않도록 프린터를 처음 관찰해야 합니다('M112' 명령은 비상시 테스트를 중단하는 데 사용할 수 있습니다. 그러나 이것은 자주 사용되지 않았으면 합니다). 진동이 너무 강해지면 `[resonance_tester]` 섹션에서 `accel_per_hz` 매개변수의 기본값보다 낮은 값을 지정할 수 있습니다. 예를 들어.

source: If it works for X axis, run for Y axis as well:
fr: Si cela fonctionne pour l’axe X, exécutez également la commande pour l’axe Y :
hu: Ha az X tengelyen működik, futtassa az Y tengelyen is:
ko: X축에 대해 작동하는 경우 Y축에 대해서도 실행합니다:

source: This script will generate the charts `/tmp/shaper_calibrate_x.png` and `/tmp/shaper_calibrate_y.png` with frequency responses. You will also get the suggested frequencies for each input shaper, as well as which input shaper is recommended for your setup. For example:
fr: Ce script générera les graphiques `/tmp/shaper_calibrate_x.png` et `/tmp/shaper_calibrate_y.png` avec les réponses en fréquence. Vous obtiendrez également les fréquences suggérées pour chaque mode d'input shaper', ainsi que la valeur recommandée pour votre configuration. Par exemple :
hu: Ez a szkript létrehozza a `/tmp/shaper_calibrate_x.png` és `/tmp/shaper_calibrate_y.png` diagramokat a frekvenciaválaszokkal. Az egyes bemeneti shaperek javasolt frekvenciáit is megkapja, valamint azt, hogy melyik bemeneti shaper ajánlott az Ön beállításához. Például:
ko: 이 스크립트는 주파수 응답과 함께 `/tmp/shaper_calibration_x.png` 및 `/tmp/shaper_calibration_y.png` 차트를 생성합니다. 또한 각 입력 셰이퍼에 대해 제안된 주파수와 설정에 권장되는 입력 셰이퍼를 얻을 수 있습니다. 예를 들어:

source: The suggested configuration can be added to `[input_shaper]` section of `printer.cfg`, e.g.:
fr: La configuration suggérée peut être ajoutée à la section `[input_shaper]` de `printer.cfg`, par exemple :
hu: A javasolt konfiguráció hozzáadható az `[input_shaper]` szakaszhoz a `printer.cfg` részben, például:
ko: 제안된 구성은 `printer.cfg`의 `[input_shaper]` 섹션에 추가할 수 있습니다. 예:

source: or you can choose some other configuration yourself based on the generated charts: peaks in the power spectral density on the charts correspond to the resonance frequencies of the printer.
fr: Ou vous pouvez choisir vous-même une autre configuration en fonction des graphiques générés : les pics de densité spectrale de puissance sur les graphiques correspondent aux fréquences de résonance de l’imprimante.
hu: vagy választhat más konfigurációt is a generált diagramok alapján: a diagramokon a teljesítményspektrális sűrűség csúcsai megfelelnek a nyomtató rezonanciafrekvenciáinak.
ko: 또는 생성된 차트를 기반으로 다른 구성을 직접 선택할 수 있습니다. 차트의 전력 스펙트럼 밀도 피크는 프린터의 공진 주파수에 해당합니다.

source: Note that alternatively you can run the input shaper autocalibration from Klipper [directly](#input-shaper-auto-calibration), which can be convenient, for example, for the input shaper [re-calibration](#input-shaper-re-calibration).
fr: Notez que vous pouvez également exécuter l’autoétalonnage de l'input shaper' à partir de Klipper [directement](#input-shaper-auto-calibration), ce qui peut être pratique, par exemple, pour l'input shaper' [recalibration](#input-shaper-re-calibration).
hu: Megjegyzendő, hogy alternatívaként a bemeneti alakító automatikus kalibrációját a Klipperből [közvetlenül](#input-shaper-auto-calibration) is futtathatja, ami például a bemeneti alakító [re-kalibrációjához](#input-shaper-re-calibration) lehet hasznos.
ko: Klipper에서 [directly](#input-shaper-auto-calibration) 입력 셰이퍼 자동 보정을 실행하는게 편리할 수 있습니다, 예를 들어 입력 셰이퍼의 경우 [re-calibration](#input-shaper-re-calibration) 을 사용합니다.

source: Bed-slinger printers
fr: Imprimantes cartésiennes
hu: Bed-slinger nyomtatók
ko: Bed-slinger 프린터

source: If your printer is a bed slinger printer, you will need to change the location of the accelerometer between the measurements for X and Y axes: measure the resonances of X axis with the accelerometer attached to the toolhead and the resonances of Y axis - to the bed (the usual bed slinger setup).
fr: Si votre imprimante est une imprimante cartésienne, vous devrez changer l’emplacement de l’accéléromètre entre les mesures pour les axes X et Y : mesurez les résonances de l’axe X avec l’accéléromètre fixé à la tête d’outil et les résonances de l’axe Y - au lit (la configuration habituelle des imprimantes cartésiennes).
hu: Ha az Ön nyomtatója ágya Y tengelyen van, akkor meg kell változtatnia a gyorsulásmérő helyét az X és Y tengelyek mérései között: az X tengely rezonanciáit a szerszámfejre szerelt gyorsulásmérővel, az Y tengely rezonanciáit pedig az ágyra szerelt gyorsulásmérővel kell mérnie (a szokásos nyomtató beállítással).
ko: 프린터가 bed slinger 프린터인 경우 X축과 Y축 측정 사이에 가속도계의 위치를 변경해야 합니다. 툴 헤드에 부착된 가속도계로 X축의 공명과 Y축의 공진을 측정합니다. BED (일반적인 bed slinger 설정).

source: However, you can also connect two accelerometers simultaneously, though they must be connected to different boards (say, to an RPi and printer MCU board), or to two different physical SPI interfaces on the same board (rarely available). Then they can be configured in the following manner:
fr: Cependant, vous pouvez également connecter les deux accéléromètres simultanément, bien qu'ils doivent être connectés à des cartes différentes (par exemple, à une carte RPi et MCU d'imprimante), ou à deux interfaces SPI physiques différentes sur la même carte (rarement disponibles). Ensuite, ils peuvent être configurés de la manière suivante :
hu: Azonban két gyorsulásmérőt is csatlakoztathatsz egyszerre, bár ezeket különböző lapokhoz kell csatlakoztatni (mondjuk egy RPi és egy nyomtató MCU laphoz), vagy két különböző fizikai SPI interfészhez ugyanazon a lapon (ritkán elérhető). Ezután a következő módon lehet őket konfigurálni:
ko: 그러나 두 개의 가속도계를 동시에 연결할 수도 있지만 서로 다른 보드(예: RPi 및 프린터 MCU 보드)에 연결하거나 동일한 보드에 있는 두 개의 서로 다른 물리적 SPI 인터페이스(드물게 사용 가능)에 연결해야 합니다. 그런 다음 다음과 같은 방식으로 구성할 수 있습니다:

source: Then the commands `TEST_RESONANCES AXIS=X` and `TEST_RESONANCES AXIS=Y` will use the correct accelerometer for each axis.
fr: Ensuite, les commandes `TEST_RESONANCES AXIS=X` et `TEST_RESONANCES AXIS=Y` utiliseront le bon accéléromètre pour chaque axe.
hu: Ekkor a `TEST_RESONANCES AXIS=X` és `TEST_RESONANCES AXIS=Y` parancsok a megfelelő gyorsulásmérőt fogják használni minden tengelyhez.
ko: 그런 다음 `TEST_RESONANCES AXIS=X` 및 `TEST_RESONANCES AXIS=Y` 명령을 각 축 가속도계에 사용합니다.

source: Max smoothing
fr: Lissage maximum
hu: Max simítás
