Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Measuring_Resonances.po
Languages: fr, hu, ko

source: Keep in mind that the input shaper can create some smoothing in parts. Automatic tuning of the input shaper performed by `calibrate_shaper.py` script or `SHAPER_CALIBRATE` command tries not to exacerbate the smoothing, but at the same time they try to minimize the resulting vibrations. Sometimes they can make a sub-optimal choice of the shaper frequency, or maybe you simply prefer to have less smoothing in parts at the expense of a larger remaining vibrations. In these cases, you can request to limit the maximum smoothing from the input shaper.
fr: Gardez à l'esprit que l'input shaper peut créer un lissage sur certaines parties de l'impression. Le réglage automatique du input shaper effectué par le script `calibrate_shaper.py` ou la commande `SHAPER_CALIBRATE` essaie de limiter le lissage, mais il essaie aussi de minimiser les vibrations résultantes. Cela peut conduire parfois, à un choix peu optimisé de la fréquence du input shaper ou peut-être préférez-vous simplement avoir moins de lissage dans certaines parties de l'impression au détriment des vibrations restantes. Dans ces cas, vous pouvez demander de limiter le lissage maximal à partir du input haper.
hu: Ne feledje, hogy a bemeneti formázó simítást hozhat létre az alkatrészekben. A `calibrate_shaper.py` szkript vagy `SHAPER_CALIBRATE` parancs által végrehajtott bemeneti formázó automatikus hangolása nem súlyosbítja a simítást, ugyanakkor megpróbálja minimalizálni az ebből eredő rezgéseket. Néha az alakformáló frekvencia optimálistól elmaradó választását hozhatják, vagy talán egyszerűen csak kevésbé simítják az alkatrészeket a nagyobb fennmaradó rezgések rovására. Ezekben az esetekben kérheti a bemeneti formázó maximális simításának korlátozását.
ko: 입력 셰이퍼는 부분에 약간의 smoothing을 생성할 수 있습니다. `calibration_shaper.py` 스크립트 또는 `SHAPER_CALIBRATE` 명령에 의해 수행되는 입력 셰이퍼의 자동 조정은 smoothing을 악화시키지 않으려고 시도합니다, 그러나 동시에 그들은 결과적인 진동을 최소화하려고 노력합니다. 때때로 그들은 셰이퍼 주파수의 차선책을 선택하거나 더 큰 잔여 진동을 희생시키면서 부품의 smoothing을 줄이는 것을 선호할 수 있습니다. 이러한 경우 입력 셰이퍼에서 최대 스무딩을 제한하도록 요청할 수 있습니다.

source: Let's consider the following results from the automatic tuning:
fr: Regardons les résultats suivants du réglage automatique :
hu: Nézzük meg az automatikus hangolás következő eredményeit:
ko: 자동 튜닝의 결과를 다음과 같이 가정해 보겠습니다:

source: Note that the reported `smoothing` values are some abstract projected values. These values can be used to compare different configurations: the higher the value, the more smoothing a shaper will create. However, these smoothing scores do not represent any real measure of smoothing, because the actual smoothing depends on [`max_accel`](#selecting-max-accel) and `square_corner_velocity` parameters. Therefore, you should print some test prints to see how much smoothing exactly a chosen configuration creates.
fr: Notez que les valeurs rapportées `smoothing` sont des valeurs projetées abstraites. Ces valeurs peuvent être utilisées pour comparer différentes configurations : plus la valeur est élevée, plus l'input shaper créera de lissage. Cependant, ces scores de lissage ne représentent aucune mesure réelle du lissage, car le lissage réel dépend des paramètres [`max_accel`](#selecting-max-accel) et `square_corner_velocity`. Par conséquent, vous devez faire des impressions de test pour voir exactement le lissage crée par la configuration choisie.
hu: Vegye figyelembe, hogy a bejelentett `simítás` értékek absztrakt vetített értékek. Ezek az értékek különböző konfigurációk összehasonlítására használhatók: minél magasabb az érték, annál nagyobb simítást hoz létre a formázó. Ezek a simítási értékek azonban nem jelentik a simítás valódi mértékét, mivel a tényleges simítás a [`max_accel`](#selecting-max-accel) és `square_corner_velocity` paraméterektől függ. Ezért érdemes néhány tesztnyomatot nyomtatni, hogy lássuk, pontosan mekkora simítást hoz létre a kiválasztott konfiguráció.
ko: 보고된 `smoothing` 값은 일부 추상적으로 투영 값입니다. 이 값은 다양한 구성을 비교하는 데 사용할 수 있습니다. 값이 높을수록 셰이퍼가 더 부드럽게 만듭니다. 그러나 이러한 smoothing 점수는 smoothing 의 실제 측정을 나타내지 않습니다. 실제 smoothing 은 [`max_accel`](#selecting-max-accel) 및 `square_corner_velocity` 매개변수에 의존하기 때문입니다. 따라서 선택한 구성이 정확히 얼마나 스무딩을 생성하는지 확인하려면 몇 가지 테스트 인쇄를 인쇄해야 합니다.

source: In the example above the suggested shaper parameters are not bad, but what if you want to get less smoothing on the X axis? You can try to limit the maximum shaper smoothing using the following command:
fr: Dans l'exemple ci-dessus, les paramètres de mise en forme suggérés ne sont pas mauvais, mais que se passe-t-il si vous souhaitez obtenir moins de lissage sur l'axe X ? Vous pouvez essayer de limiter le lissage maximal du shaper à l'aide de la commande suivante :
hu: A fenti példában a javasolt alakító paraméterek nem rosszak, de mi van akkor, ha az X tengelyen kevesebb simítást szeretne elérni? Megpróbálhatja korlátozni a maximális alakító simítást a következő paranccsal:
ko: 위의 예에서 제안된 셰이퍼 매개변수는 나쁘지 않지만 만약 X축에서 스무딩을 줄이고 싶다면? 다음 명령을 사용하여 최대 셰이퍼 smoothing 을 제한할 수 있습니다:

source: which limits the smoothing to 0.2 score. Now you can get the following result:
fr: ce qui limite le lissage à un score de 0,2. Vous pouvez maintenant obtenir le résultat suivant :
hu: amely a simítást 0,2 pontszámra korlátozza. Most a következő eredményt kaphatja:
ko: smoothing을 0.2 점수로 제한합니다. 이제 다음과 같은 결과를 얻을 수 있습니다:

source: If you compare to the previously suggested parameters, the vibrations are a bit larger, but the smoothing is significantly smaller than previously, allowing larger maximum acceleration.
fr: Si vous comparez avec les paramètres suggérés précédemment, les vibrations sont un peu plus importantes, mais le lissage est nettement plus faible qu'auparavant, ce qui permet une accélération maximale plus importante.
hu: Ha összehasonlítjuk a korábban javasolt paraméterekkel, a rezgések kicsit nagyobbak, de a simítás lényegesen kisebb, mint korábban, ami nagyobb maximális gyorsulást tesz lehetővé.
ko: 앞서 제안한 파라미터와 비교하면 진동은 조금 더 크지만 이전보다 스무딩이 현저히 작아 최대 가속도가 더 커졌습니다.

source: When deciding which `max_smoothing` parameter to choose, you can use a trial-and-error approach. Try a few different values and see which results you get. Note that the actual smoothing produced by the input shaper depends, primarily, on the lowest resonance frequency of the printer: the higher the frequency of the lowest resonance - the smaller the smoothing. Therefore, if you request the script to find a configuration of the input shaper with the unrealistically small smoothing, it will be at the expense of increased ringing at the lowest resonance frequencies (which are, typically, also more prominently visible in prints). So, always double-check the projected remaining vibrations reported by the script and make sure they are not too high.
fr: Lorsque vous choisissez le paramètre `max_smoothing`, vous pouvez utiliser une approche par essais et erreurs. Essayez quelques valeurs différentes et voyez quels résultats vous obtenez. Notez que le lissage réel produit par le modeleur d'entrée dépend principalement de la fréquence de résonance la plus basse de l'imprimante : plus la fréquence de la résonance la plus basse est élevée, plus le lissage est petit. Par conséquent, si vous demandez au script de trouver une configuration de l'input shaper avec un lissage irréaliste, cela se fera au détriment d'une résonnance accrue aux fréquences les plus basses (qui sont, généralement, plus visibles dans les impressions). Donc, vérifiez toujours les vibrations restantes projetées signalées par le script et assurez-vous qu'elles ne sont pas trop élevées.
hu: A `max_smoothing` paraméter kiválasztásakor a próbálgatás és a tévedés módszerét alkalmazhatjuk. Próbáljon ki néhány különböző értéket, és nézze meg, milyen eredményeket kap. Vegye figyelembe, hogy a bemeneti alakító által előállított tényleges simítás elsősorban a nyomtató legalacsonyabb rezonanciafrekvenciájától függ: minél magasabb a legalacsonyabb rezonancia frekvenciája - annál kisebb a simítás. Ezért ha azt kéri a parancsfájltól, hogy a bemeneti alakító olyan konfigurációját keresse meg, amely irreálisan kis simítással rendelkezik, akkor ez a legalacsonyabb rezonanciafrekvenciákon (amelyek jellemzően a nyomatokon is jobban láthatóak) megnövekedett rezgés árán fog történni. Ezért mindig ellenőrizze kétszeresen a szkript által jelzett vetített maradó rezgéseket, és győződjön meg róla, hogy azok nem túl magasak.
ko: 선택할 `max_smoothing` 매개변수를 결정할 때 시행착오를 거칠 수 있습니다. 몇 가지 다른 값을 시도하고 어떤 결과를 얻을 수 있는지 확인하십시오. 입력 셰이퍼에 의해 생성된 실제 smoothing 은 주로 프린터의 가장 낮은 공진 주파수에 따라 달라집니다. 가장 낮은 공진의 주파수가 높을수록 smoothing이 작아집니다. 따라서 비현실적으로 작은 smoothing 으로 입력 셰이퍼의 구성을 찾도록 스크립트를 요청하는 경우 가장 낮은 공명 주파수(일반적으로 인쇄물에서도 더 두드러지게 나타남) 에서 링잉이 증가하게 됩니다. 따라서 스크립트에서 보고한 예상 잔여 진동을 항상 다시 확인하고 너무 높지 않은지 확인하십시오.

source: Note that if you chose a good `max_smoothing` value for both of your axes, you can store it in the `printer.cfg` as
fr: Notez que si vous avez choisi une bonne valeur `max_smoothing` pour vos deux axes, vous pouvez la stocker dans `printer.cfg` comme
hu: Ha mindkét tengelyhez jó `max_smoothing` értéket választott, akkor azt a `printer.cfg` állományban tárolhatja a következő módon
ko: 두 축에 대해 좋은 `max_smoothing` 값을 선택했다면 `printer.cfg`에 다음과 같이 저장할 수 있습니다

source: Then, if you [rerun](#input-shaper-re-calibration) the input shaper auto-tuning using `SHAPER_CALIBRATE` Klipper command in the future, it will use the stored `max_smoothing` value as a reference.
fr: Ensuite, si vous [réexécutez](#input-shaper-re-calibration) le réglage automatique de l'input shaper à l'aide de la commande `SHAPER_CALIBRATE`, c'est la valeur stockée `max_smoothing` qui sera prise comme référence.
hu: Ezután, ha a jövőben [újraindítja](#input-shaper-re-calibration) a bemeneti alakító automatikus hangolását a `SHAPER_CALIBRATE` Klipper parancs segítségével, akkor a tárolt `max_smoothing` értéket fogja referenciaként használni.
ko: 그런 다음 나중에 `SHAPER_CALIBRATE` Klipper 명령을 사용하여 입력 shaper 자동 튜닝을 [rerun](#input-shaper-re-calibration) 실행하면 저장된 `max_smoothing` 값을 참조로 사용합니다.

source: Selecting max_accel
fr: Sélection de max_accel
hu: A max_accel kiválasztása
ko: max_accel 선택

source: Since the input shaper can create some smoothing in parts, especially at high accelerations, you will still need to choose the `max_accel` value that does not create too much smoothing in the printed parts. A calibration script provides an estimate for `max_accel` parameter that should not create too much smoothing. Note that the `max_accel` as displayed by the calibration script is only a theoretical maximum at which the respective shaper is still able to work without producing too much smoothing. It is by no means a recommendation to set this acceleration for printing. The maximum acceleration your printer is able to sustain depends on its mechanical properties and the maximum torque of the used stepper motors. Therefore, it is suggested to set `max_accel` in `[printer]` section that does not exceed the estimated values for X and Y axes, likely with some conservative safety margin.
fr: Étant donné que l'input shaper peut créer un certain lissage dans les pièces, en particulier à des accélérations élevées, vous devrez toujours choisir la valeur `max_accel` qui ne crée pas trop de lissage dans les pièces imprimées. Un script d'étalonnage fournit une estimation du paramètre `max_accel` qui ne devrait pas créer trop de lissage. Notez que le `max_accel` tel qu'affiché par le script de calibrage n'est qu'un maximum théorique auquel l'input shaper est encore capable de travailler sans produire trop de lissage. Il ne s'agit en aucun cas d'une recommandation pour définir cette accélération sur vos l'impression. L'accélération maximale que votre imprimante est capable de supporter dépend de ses propriétés mécaniques et du couple maximal des moteurs pas à pas utilisés. Par conséquent, il est suggéré de définir un `max_accel` dans la section `[printer]` qui ne dépasse pas les valeurs estimées pour les axes X et Y, probablement avec une marge de sécurité.
hu: Mivel a bemeneti alakító némi simítást okozhat az elemekben, különösen nagy gyorsulásoknál, továbbra is meg kell választani a `max_accel` értéket, amely nem okoz túl nagy simítást a nyomtatott alkatrészekben. Egy kalibrációs szkript becslést ad a `max_accel` paraméterre, amely nem okozhat túl nagy simítást. Vegye figyelembe, hogy a kalibrációs szkript által megjelenített `max_accel` csak egy elméleti maximum, amelynél az adott alakító még képes úgy dolgozni, hogy nem okoz túl nagy simítást. Semmiképpen sem ajánlott ezt a gyorsulást beállítani a nyomtatáshoz. A nyomtatója által elviselhető maximális gyorsulás a nyomtató mechanikai tulajdonságaitól és a használt léptetőmotorok maximális nyomatékától függ. Ezért javasolt a `max_accel` beállítása a `[nyomtató]` szakaszban, amely nem haladja meg az X és Y tengelyek becsült értékeit, valószínűleg némi konzervatív biztonsági tartalékkal.
ko: 입력 셰이퍼는 특히 높은 가속에서 부품에 약간의 smoothing 을 생성할 수 있으므로 인쇄된 부품에 너무 많은 smoothing 을 생성하지 않는 'max_accel' 값을 선택해야 합니다. 보정 스크립트는 smoothing을 너무 많이 생성하지 않아야 하는 'max_accel' 매개변수에 대한 추정치를 제공합니다. 보정 스크립트에 의해 표시되는 'max_accel'은 각 셰이퍼가 너무 많은 smoothing 을 생성하지 않고 여전히 작동할 수 있는 이론적인 최대값일 뿐입니다. 인쇄를 위해 이 가속을 설정하는 것은 결코 권장되지 않습니다. 프린터가 유지할 수 있는 최대 가속도는 기계적 특성과 사용된 스테퍼 모터의 최대 토크에 따라 다릅니다. 따라서 `[printer]` 섹션에서 `max_accel` 을 X 및 Y축의 예상 값을 초과하지 않도록 설정하는 것이 좋습니다. 약간의 보수적인 안전 제한이 있을 수 있습니다.

source: Alternatively, follow [this](Resonance_Compensation.md#selecting-max_accel) part of the input shaper tuning guide and print the test model to choose `max_accel` parameter experimentally.
fr: Vous pouvez également suivre la partie [this](Resonance_Compensation.md#selecting-max_accel) du guide de réglage de l'input shaper et imprimer un modèle de test pour choisir le paramètre `max_accel` de manière expérimentale.
hu: Alternatívaként kövesse [ezt](Resonance_Compensation.md#selecting-max_accel) a részt a bemeneti alakító hangolási útmutatójában, és nyomtassa ki a tesztmodellt a `max_accel` paraméter kísérleti kiválasztásához.
ko: 또는 입력 셰이퍼 튜닝 가이드의 [this](Resonance_Compensation.md#selecting-max_accel) 부분을 따르고 테스트 모델을 인쇄하여 `max_accel` 매개변수를 실험적으로 선택합니다.

source: The same notice applies to the input shaper [auto-calibration](#input-shaper-auto-calibration) with `SHAPER_CALIBRATE` command: it is still necessary to choose the right `max_accel` value after the auto-calibration, and the suggested acceleration limits will not be applied automatically.
fr: Même remarque pour l'input shaper [auto-calibration](#input-shaper-auto-calibration) avec la commande `SHAPER_CALIBRATE` : il faut encore choisir la bonne valeur `max_accel` après l'auto-calibrage et les limites d'accélération suggérées ne seront pas appliquées automatiquement.
hu: Ugyanez a figyelmeztetés vonatkozik a bemeneti alakító [automatikus kalibrálás](#input-shaper-auto-calibration) `SHAPER_CALIBRATE` paranccsal történő használatára is: az automatikus kalibrálás után továbbra is szükséges a megfelelő `max_accel` érték kiválasztása, és a javasolt gyorsulási korlátok nem lesznek automatikusan alkalmazva.
ko: 동일한 알림이 `SHAPER_CALIBRATE` 명령을 사용하여 입력 셰이퍼 [auto-calibration](#input-shaper-auto-calibration) 에 적용됩니다: 자동 보정 후에도 올바른 `max_accel` 값을 선택해야 하며 제안된 가속 제한은 자동으로 적용되지 않습니다.

source: If you are doing a shaper re-calibration and the reported smoothing for the suggested shaper configuration is almost the same as what you got during the previous calibration, this step can be skipped.
fr: Si vous effectuez un réétalonnage du shaper et que le lissage signalé pour la configuration de shaper suggérée est presque le même que celui que vous avez obtenu lors du calibrage précédent, cette étape peut être ignorée.
hu: Ha a formázó újrakalibrálását végzi, és a javasolt formázó konfigurációhoz tartozó simítás majdnem megegyezik az előző kalibrálás során kapott értékkel, ez a lépés kihagyható.
ko: 만약 셰이퍼 재보정을 수행하고 제안된 셰이퍼 구성에 대해 보고된 smoothing 이 이전 보정 중에 얻은 것과 거의 동일한 경우 이 단계를 건너뛸 수 있습니다.

source: Input Shaper auto-calibration
fr: Calibrage automatique de l'input shaper
hu: Bemeneti formázó automatikus kalibrálása
ko: 사용자 정의 축 테스트

source: Besides manually choosing the appropriate parameters for the input shaper feature, it is also possible to run the auto-tuning for the input shaper directly from Klipper. Run the following command via Octoprint terminal:
fr: En plus de choisir manuellement les paramètres appropriés pour la fonction d'input shaper, il est également possible d'exécuter le réglage automatique pour l'input shaper directement à partir de Klipper. Exécutez la commande suivante via le terminal Octoprint :
hu: A bemeneti formázó funkció megfelelő paramétereinek kézi kiválasztása mellett a bemeneti alakító automatikus hangolása közvetlenül a Klipperből is elvégezhető. Futtassa a következő parancsot az Octoprint terminálon keresztül:
ko: 입력 셰이퍼 기능에 대한 적절한 매개변수를 수동으로 선택하는 것 외에도 Klipper에서 직접 입력 셰이퍼에 대한 자동 조정을 실행할 수도 있습니다. Octoprint 터미널을 통해 다음 명령을 실행합니다:

source: This will run the full test for both axes and generate the csv output (`/tmp/calibration_data_*.csv` by default) for the frequency response and the suggested input shapers. You will also get the suggested frequencies for each input shaper, as well as which input shaper is recommended for your setup, on Octoprint console. For example:
fr: Cela exécutera le test complet pour les deux axes et générera la sortie csv (`/tmp/calibration_data_*.csv` par défaut) pour la réponse en fréquence et les input shaper suggérés. Vous obtiendrez également les fréquences suggérées pour chaque input shaper, ainsi que l'input shaper recommandé pour votre configuration, sur la console Octoprint. Par exemple :
hu: Ez lefuttatja a teljes tesztet mindkét tengelyre, és létrehozza a csv-kimenetet (`/tmp/calibration_data_*.csv` alapértelmezés szerint) a frekvenciaválaszról és a javasolt bemeneti alakítókról. Az Octoprint konzolon megkapja az egyes bemeneti alakítók javasolt frekvenciáit is, valamint azt, hogy melyik bemeneti alakítót ajánljuk az Ön beállításához. Például:
ko: 그러면 두 축에 대한 전체 테스트가 실행되고 주파수 응답 및 제안된 입력 셰이퍼에 대한 csv 출력 (기본적으로 `/tmp/calibration_data_*.csv`) 이 생성됩니다. 또한 Octoprint 콘솔에서 각 입력 셰이퍼에 대해 제안된 주파수와 설정에 권장되는 입력 셰이퍼를 얻을 수 있습니다. 예를 들어:

source: If you agree with the suggested parameters, you can execute `SAVE_CONFIG` now to save them and restart the Klipper. Note that this will not update `max_accel` value in `[printer]` section. You should update it manually following the considerations in [Selecting max_accel](#selecting-max_accel) section.
fr: Si vous êtes d'accord avec les paramètres suggérés, vous pouvez exécuter `SAVE_CONFIG` maintenant pour les enregistrer et redémarrer Klipper. Notez que cela ne mettra pas à jour la valeur `max_accel` dans la section `[printer]`. Vous devez le mettre à jour manuellement en suivant les recommandations de la section [Selecting max_accel](#selecting-max_accel).
hu: Ha egyetért a javasolt paraméterekkel, akkor a `SAVE_CONFIG` parancsot most végre lehet hajtani a paraméterek mentéséhez és a Klipper újraindításához. Vegye figyelembe, hogy ez nem frissíti a `max_accel` értéket a `[printer]` szakaszban. Ezt manuálisan kell frissítenie a [max_accel kiválasztása](#selecting-max_accel) szakaszban leírtak szerint.
ko: 제안된 매개변수에 동의하면 지금 `SAVE_CONFIG` 를 실행하여 저장하고 Klipper를 다시 시작할 수 있습니다. 이것은 `[printer]` 섹션의 `max_accel` 값을 업데이트하지 않습니다. [Selecting max_accel](#selecting-max_accel) 섹션을 수동으로 업데이트해야 합니다.

source: If your printer is a bed slinger printer, you can specify which axis to test, so that you can change the accelerometer mounting point between the tests (by default the test is performed for both axes):
fr: Si votre imprimante est une imprimante cartésienne, vous pouvez spécifier l'axe à tester, afin de pouvoir modifier le point de montage de l'accéléromètre entre les tests (par défaut, le test est effectué pour les deux axes) :
hu: Ha a nyomtatója Y tengelyén van az ágy akkor megadhatja, hogy melyik tengelyt kívánja tesztelni, így a tesztek között megváltoztathatja a gyorsulásmérő rögzítési pontját (alapértelmezés szerint a teszt mindkét tengelyen végrehajtásra kerül):
ko: 프린터가 bed slinger 프린터인 경우 테스트할 축을 지정할 수 있으므로 테스트 사이에 가속도계 장착 지점을 변경할 수 있습니다 (기본적으로 테스트는 두 축 모두에 대해 수행됨):

source: You can execute `SAVE_CONFIG` twice - after calibrating each axis.
fr: Vous pouvez exécuter `SAVE_CONFIG` deux fois - après avoir calibré chaque axe.
hu: A `SAVE_CONFIG` parancsot kétszer - minden egyes tengely kalibrálása után - lehet végrehajtani.
ko: 각 축을 보정한 후 `SAVE_CONFIG`를 두 번 실행할 수 있습니다.

source: However, if you connected two accelerometers simultaneously, you simply run `SHAPER_CALIBRATE` without specifying an axis to calibrate the input shaper for both axes in one go.
fr: Cependant, si vous avez connecté deux accéléromètres simultanément, vous pouvez exécutez simplement `SHAPER_CALIBRATE` sans spécifier d'axe pour calibrer l'input shaper pour les deux axes en une seule fois.
hu: Ha azonban egyszerre két gyorsulásmérőt csatlakoztatott, egyszerűen futtassa a `SHAPER_CALIBRATE` parancsot tengely megadása nélkül, hogy a bemeneti alakítót mindkét tengelyre egy menetben kalibrálja.
ko: 그러나 두 개의 가속도계를 동시에 연결한 경우 축을 지정하지 않고 `SHAPER_CALIBRATE`를 실행하여 두 축에 대한 입력 셰이퍼를 한 번에 보정하기만 하면 됩니다.

source: Input Shaper re-calibration
fr: Réétalonnage de l'input shaper
hu: Bemeneti formázó újrakalibrálása
ko: Input Shaper 재보정

source: `SHAPER_CALIBRATE` command can be also used to re-calibrate the input shaper in the future, especially if some changes to the printer that can affect its kinematics are made. One can either re-run the full calibration using `SHAPER_CALIBRATE` command, or restrict the auto-calibration to a single axis by supplying `AXIS=` parameter, like
fr: La commande `SHAPER_CALIBRATE` peut également être utilisée pour recalibrer l'input shaper ultérieurement, en particulier si des modifications de l'imprimante pouvant affecter sa cinématique sont apportées. On peut soit relancer l'étalonnage complet à l'aide de la commande `SHAPER_CALIBRATE`, soit restreindre l'auto-étalonnage à un seul axe en fournissant le paramètre `AXIS=`, comme
hu: `SHAPER_CALIBRATE` parancs arra is használható, hogy a bemeneti alakítót a jövőben újra kalibrálja, különösen akkor, ha a nyomtató kinematikáját befolyásoló változások történnek. A teljes kalibrációt vagy a `SHAPER_CALIBRATE` paranccsal lehet újra lefuttatni, vagy az automatikus kalibrálást egyetlen tengelyre lehet korlátozni az `AXIS=` paraméter megadásával, például a következő módon
ko: `SHAPER_CALIBRATE` 명령은 향후 입력 셰이퍼를 다시 보정하는 데 사용할 수도 있습니다. 특히 운동학에 영향을 줄 수 있는 프린터 변경 사항이 있는 경우 더욱 그렇습니다. `SHAPER_CALIBRATE` 명령을 사용하여 전체 보정을 다시 실행하거나 다음과 같이 `AXIS=` 매개변수를 제공하여 자동 보정을 단일 축으로 제한할 수 있습니다
