Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Overview.po
Languages: da, de, fr, hu, it, ko, ru, zh_hans, zh_hant

source: Welcome to the Klipper documentation. If new to Klipper, start with the [features](Features.md) and [installation](Installation.md) documents.
da: Velkommen til Klippers dokumentation. Hvis du er ny her, anbefales det at starte med [funktioner](Features.md) og [installation](Installation.md) dokumenterne.
de: Willkommen auf der Klipper-Dokumentationsseite! Wenn Klipper für dich neu ist, starte doch einfach mit den [Features](Features.md) und den [Installations-Dokumenten](Installation.md).
fr: Bienvenue dans la documentation de Klipper. Si vous débutez avec Klipper, commencez par les sections [fonctionnalités](Features.md) et [installation](Installation.md).
hu: Üdvözlünk a Klipper dokumentációjában. Ha még nem ismered a Klippert, kezd a [funkciók](Features.md) és [telepítés](Installation.md) dokumentumokkal.
it: Benvenuto nella documentazione di Klipper. Se sei nuovo di Klipper, inizia con i documenti [features](Features.md) e [installation](Installation.md).
ko: Klipper 에 오신것을 환영합니다. Klipper를 처음 사용하는 경우라면 [features](Features.md) 및 [installation](Installation.md) 문서부터 시작하십시오.
ru: Добро пожаловать в документацию Klipper. Если вы новичок в Klipper, начните с документации о [возможностях](Features.md) и [установке](Installation.md).
zh_hans: 欢迎使用Klipper文档。如果刚接触Klipper，请从[特性](features.md)和[安装](installation.md)文档开始阅读。
zh_hant: 歡迎使用Klipper文件。如果剛接觸Klipper，請從[特性](features.md)和[安裝](installation.md)文件開始閱讀。

source: Overview information
da: Informationsoverblik
de: Übersicht
fr: Informations générales
hu: Áttekintő információk
it: Informazioni generali
ko: 개요 정보
ru: Обзорная информация
zh_hans: 概览信息
zh_hant: 概覽資訊

source: [Features](Features.md): A high-level list of features in Klipper.
da: [Funktioner](Features.md): En udførlig liste over funktionerne i Klipper.
de: [Features](Features.md): Eine grobe Übersicht über die Features von Klipper.
fr: [Fonctionnalités](Features.md) : Une liste avancée des fonctionnalités de Klipper.
hu: [Funkciók](Features.md): A Klipper funkcióinak magas szintű listája.
it: [Caratteristiche](Features.md): un elenco di funzionalità di alto livello in Klipper.
ko: [특징들](Features.md): Klipper의 상위 수준 기능 목록.
ru: [Функции](Features.md): Общий список возможностей Klipper.
zh_hans: [功能](Features.md)：Klipper 中的高级功能列表。
zh_hant: [功能](Features.md)：Klipper 中的高級功能列表。

source: [FAQ](FAQ.md): Frequently asked questions.
da: [OSS](FAQ.md): Ofte Stillede Spørgsmål.
de: [FAQ](FAQ.md): Häufig gestellte Fragen.
fr: [FAQ](FAQ.md) : Foire aux questions.
hu: [GYIK](FAQ.md): Gyakran ismételt kérdések.
it: [FAQ](FAQ.md): Domande frequenti.
ko: [자주하는 질문](FAQ.md): 자주 묻는 질문.
ru: [ЧАВО](FAQ.md): Часто задаваемые вопросы.
zh_hans: [常见问题](FAQ.md)：常见问题。
zh_hant: [常見問題](FAQ.md)：常見問題。

source: [Releases](Releases.md): The history of Klipper releases.
da: [Udgivelser](Releases.md): Historik over Klipper-udgivelser.
de: [Releases](Releases.md): Veröffentlichungshistorie von Klipper.
fr: [Versions](Releases.md) : L'historique des versions de Klipper.
hu: [Kiadások](Releases.md): Klipper kiadások története.
it: [Releases](Releases.md): La storia delle versioni di Klipper.
ko: [릴리즈 정보](Releases.md): 클리퍼 릴리즈 히스토리.
ru: [Releases](Releases.md): История релизов Klipper.
zh_hans: [发行版](Release.md)：Klipper 的版本发布历史。
zh_hant: [發行版](Release.md)：Klipper 的版本發佈歷史。

source: [Config changes](Config_Changes.md): Recent software changes that may require users to update their printer config file.
da: [Konfigurationsændringer](Config_Changes.md): Nylige ændringer af softwaren, der kan kræve at brugeren opdaterer sin printers konfigurationsfil.
de: [Config changes](Config_Changes.md): Die neuesten Änderungen, die potentielle Änderungen an der Konfigurationsdatei des Druckers auslösen können.
fr: [Modifications de configuration](Config_Changes.md) : Modifications récentes du logiciel pouvant nécessiter que les utilisateurs mettent à jour la configuration de leur imprimante.
hu: [Konfigurációs változások](Config_Changes.md): A legújabb szoftverváltozások, amelyek miatt a felhasználóknak frissíteniük kell a nyomtató konfigurációs fájlját.
it: [Modifiche alla configurazione](Config_Changes.md): recenti modifiche al software che potrebbero richiedere agli utenti di aggiornare il file di configurazione della stampante.
ko: [Config changes](Config_Changes.md): 사용자가 프린터 config 파일을 업데이트해야 할 수 있는 최근 소프트웨어 변경 사항.
ru: [Изменения конфигурации](Config_Changes.md): Недавние изменения программного обеспечения, которые могут потребовать от пользователей обновления файла конфигурации принтера.
zh_hans: [配置更改](Config_Changes.md)：可能需要手动更新打印机配置文件的软件更改。
zh_hant: [配置更改](Config_Changes.md)：可能需要手動更新印表機配置檔案的軟體更改。

source: [Contact](Contact.md): Information on bug reporting and general communication with the Klipper developers.
da: [Kontakt](Contact.md): Information om rapportering af fejl, samt generel kommunikation med Klippers udviklere.
de: [Contact](Contact.md): Kontaktinformationen bei Fehlern oder Anfragen an die Klipper-Entwickler.
fr: [Contact](Contact.md) : Informations sur les rapports d'anomalies et communication générale avec les développeurs de Klipper.
hu: [Kapcsolat](Contact.md): Információk a hibajelentésekről és a Klipper fejlesztőivel való általános kommunikációról.
it: [Contatto](Contact.md): Informazioni sulla segnalazione di bug e comunicazione generale con gli sviluppatori di Klipper.
ko: [연락처](Contact.md): 버그 보고 및 Klipper 개발자와의 일반적인 커뮤니케이션에 대한 정보.
ru: [Связатся](Contact.md): Информация по сообщениям об ошибках и общению с разработчиками Klipper.
zh_hans: [联系](Contact.md)：关于如何提交错误报告和联系 Klipper 开发者的信息。
zh_hant: [聯繫](Contact.md)：關於如何提交錯誤報告和聯繫 Klipper 開發者的資訊。

source: [Installation](Installation.md): Guide to installing Klipper.
da: [Installation](Installation.md): Vejledning til installation af Klipper.
de: [Installation](Installation.md): Anleitung zur Installation von Klipper.
fr: [Installation](Installation.md) : Guide d'installation de Klipper.
hu: [Telepítés](Installation.md): Klipper telepítési útmutató.
it: [Installazione](Installation.md): Guida all'installazione di Klipper.
ko: [설치](Installation.md): 클리퍼 설치 안내입니다.
ru: [Установка](Installation.md): Гайд по установке Klipper.
zh_hans: [安装](Installation.md)：Klipper 安装指南。
zh_hant: [安裝](Installation.md)：Klipper 安裝指南。

source: [Config Reference](Config_Reference.md): Description of config parameters.
da: [Konfigurations reference](Config_Reference.md): Beskrivelse af parametre der kan konfigureres.
de: [Config Reference](Config_Reference.md): Beschreibung der Einstellmöglichkeiten.
fr: [Référence de la configuration](Config_Reference.md) : Description de tous les paramètres de configuration.
hu: [Konfigurációs hivatkozás](Config_Reference.md): A konfigurációs paraméterek leírása.
it: [Riferimento di configurazione](Config_Reference.md): Descrizione dei parametri di configurazione.
ko: [Config Reference](Config_Reference.md): config 매개변수에 대한 설명.
ru: [Справочник по конфигурации](Config_Reference.md): Описание параметров конфигурации.
zh_hans: [配置参考](Config_Reference.md)：配置参数说明。
zh_hant: [配置參考](Config_Reference.md)：配置參數說明。

source: [Rotation Distance](Rotation_Distance.md): Calculating the rotation_distance stepper parameter.
da: [Rotationsdistance](Rotation_Distance.md): Beregning af Rotationsdistance parameteren.
de: [Rotation Distance](Rotation_Distance.md): Berechnung des Schrittmotor-Parameters rotation_distance.
fr: [Distance de rotation](Rotation_Distance.md) : Calcul du paramètre rotation_distance du moteur.
hu: [Forgatási távolság](Rotation_Distance.md): A rotation_distance léptető paraméter kiszámítása.
it: [Distanza di rotazione](Rotation_Distance.md): Calcolo del parametro stepper rotation_distance.
ko: [Rotation Distance](Rotation_Distance.md): rotation_distance 스테퍼 모터 매개변수 계산.
ru: [Дистанция поворота](Rotation_Distance.md): Расчет параметра дистанции попорота(Rotation_distance).
zh_hans: [旋转距离](Rotation_Distance.md)：计算旋转距离(rotation_distance)步进参数。
zh_hant: [旋轉距離](Rotation_Distance.md)：計算旋轉距離(rotation_distance)步進參數。

source: [Config checks](Config_checks.md): Verify basic pin settings in the config file.
da: [Konfigurationstjek](Config_checks.md): Verificér basale pinouts i konfigurationsfilen.
de: [Config checks](Config_checks.md): Überprüfung der grundlegenden Pin-Einstellungen in der Konfigurationsdatei.
fr: [Vérifications de la configuration](Config_checks.md) : Vérification des paramètres de base des broches du fichier de configuration.
hu: [Konfigurációs ellenőrzések](Config_checks.md): Alapvető tűbeállítások ellenőrzése a konfigurációs fájlban.
it: [Controlli di configurazione](Config_checks.md): verifica le impostazioni di base dei pin nel file di configurazione.
ko: [Config checks](Config_checks.md): cofnig 파일에서 기본 핀 설정 확인.
ru: [Проверки конфигурации](Config_checks.md): Проверка основных настроек контактов в файле конфигурации.
zh_hans: [检查配置](Config_checks.md)：验证配置文件中的基本引脚设置。
zh_hant: [檢查配置](Config_checks.md)：驗證配置檔案中的基本引腳設定。

source: [Bed level](Bed_Level.md): Information on "bed leveling" in Klipper.
da: [Byggeplade nivellering](Bed_Level.md): Information om "nivellering af byggeplade" i Klipper.
de: [Bed level](Bed_Level.md): Informationen über "bed leveling" in Klipper.
fr: [Nivelage du lit](Bed_Level.md) : Informations sur le "nivelage du lit" dans Klipper.
hu: [Tárgyasztal szintezése](Bed_Level.md): Információ a "tárgyasztal szintezéséről" a Klipperben.
it: [Livello del piatto](Bed_Level.md): Informazioni sul "livellamento del piatto" in Klipper.
ko: [베드 레벨링](Bed_Level.md): Klipper의 "베드 레벨링"에 대한 정보.
ru: [Уровень кровати](Bed_Level.md): Информация о "выравнивании кровати" в Klipper.
zh_hans: [打印床调平](Bed_Level.md)：Klipper 中关于“打印床调平”的信息。
zh_hant: [列印床調平](Bed_Level.md)：Klipper 中關於「列印床調平」的資訊。

source: [Delta calibrate](Delta_Calibrate.md): Calibration of delta kinematics.
da: [Delta kalibrering](Delta_Calibrate.md): Kalibrering af Delta-printere.
de: [Delta calibrate](Delta_Calibrate.md): Kalibrierung der Delta-Kinematik.
fr: [Calibration delta](Delta_Calibrate.md) : Calibration de la cinématique Delta.
hu: [Delta kalibrálás](Delta_Calibrate.md): A delta kinematika kalibrálása.
it: [Calibrazione Delta](Delta_Calibrate.md): Calibrazione della cinematica delta.
ko: [델타 캘리브레이션](Delta_Calibrate.md): 델타 방식 프린터 교정.
ru: [Delta calibrate](Delta_Calibrate.md): Калибровка дельта-киноматики.
zh_hans: [三角洲校准](Delta_Calibrate.md)：校准三角洲结构。
zh_hant: [三角洲校準](Delta_Calibrate.md)：校準三角洲結構。

source: [Probe calibrate](Probe_Calibrate.md): Calibration of automatic Z probes.
da: [Probekalibrering](Probe_Calibrate.md): Kalibrering af automatiske Z prober.
de: [Probe calibrate](Probe_Calibrate.md): Kalibrierung von automatischen Z-Sonden.
fr: [Calibration de la sonde](Probe_Calibrate.md) : Calibration automatique des sondes Z.
hu: [Szonda kalibrálása](Probe_Calibrate.md): Automatikus Z-szondák kalibrálása.
it: [Calibrazione sonda](Probe_Calibrate.md): Calibrazione di sonde Z automatiche.
ko: [프로브 캘리브레이션](Probe_Calibrate.md): 자동 Z 프로브 교정.
ru: [Probe calibrate](Probe_Calibrate.md): Калибровка автоматический Z-зондов.
zh_hans: [探针校准](Probe_Calibrate.md)：校准自动Z探针。
zh_hant: [探針校準](Probe_Calibrate.md)：校準自動Z探針。

source: [BL-Touch](BLTouch.md): Configure a "BL-Touch" Z probe.
da: [BL-Touch](BLTouch.md): Konfigurering af "BL-Touch" probe.
de: [BL-Touch](BLTouch.md): Einrichten einer "BL-Touch" Z-Sonde.
fr: [BL-Touch](BLTouch.md) : Configuration d'une sonde "BL-Touch".
hu: [BL-Touch](BLTouch.md): "BL-Touch" Z szonda konfigurálása.
it: [BL-Touch](BLTouch.md): Configurare una sonda Z "BL-Touch".
ko: [BL-Touch](BLTouch.md): "BL-Touch" Z 프로브를 구성합니다.
ru: [BL-Touch](BLTouch.md): Конфигурация Z-зондов "BL-Touch".
zh_hans: [BL-Touch](BLTouch.md)：配置“BL-Touch”Z 探针。
zh_hant: [BL-Touch](BLTouch.md)：配置「BL-Touch」Z 探針。

source: [Manual level](Manual_Level.md): Calibration of Z endstops (and similar).
da: [Manuel nivellering](Manual_Level.md): Kalibrering af Z endestop (og lignende).
de: [Manuelles Leveln](Manual_Level.md): Kalibrierung der Z-Endstopps (und ähnlichem).
fr: [Nivelage manuel](Manual_Level.md) : Calibration des butées Z (et similaires).
hu: [Kézi szintezés](Manual_Level.md): Z végállások kalibrálása (és hasonlók).
it: [Livello manuale](Manual_Level.md): Calibrazione dei finecorsa Z (e simili).
ko: [수동 레벨링](Manual_Level.md): Z 엔드스톱(및 유사)의 보정.
ru: [Manual level](Manual_Level.md): Калибровка крайних точек Z ( и подобные).
zh_hans: [手动调平](Manual_Level.md)：校准 Z 限位和调整热床调平螺丝。
zh_hant: [手動調平](Manual_Level.md)：校準 Z 限位和調整熱床調平螺絲。

source: [Bed Mesh](Bed_Mesh.md): Bed height correction based on XY locations.
da: [Nivelleringsgitter](Bed_Mesh.md): Nivellering af byggepladen baseret på X/Y positioner.
de: [Bed Mesh](Bed_Mesh.md): Betthöhenkorrektion basierend auf XY Koordinaten.
fr: [Maillage du lit](Bed_Mesh.md) : Correction de la hauteur du lit basée sur les emplacements XY.
hu: [Tárgyasztal háló](Bed_Mesh.md): X-Y-helyeken alapuló tárgyasztal szintkorrekció.
it: [Maglia del letto](Bed_Mesh.md): Correzione dell'altezza del piatto basata sulle posizioni XY.
ko: [베드 메쉬](Bed_Mesh.md): XY 위치를 기반으로 한 BED 높이 보정.
ru: [Bed Mesh](Bed_Mesh.md): Коррекция высоты дна на основе расположения XY.
zh_hans: [床网](Bed_Mesh)：基于 XY 位置的打印床高度补偿。
zh_hant: [床網](Bed_Mesh.md)：基於 XY 位置的列印床高度補償。

source: [Endstop phase](Endstop_Phase.md): Stepper assisted Z endstop positioning.
da: [Endestop fase](Endstop_Phase.md): Z endestop ved brug af stepper-motor.
de: [Endstop phase](Endstop_Phase.md): Z-Endstopp-Positionierung mithilfe von Steppermotoren.
fr: [Phase de fin de course](Endstop_Phase.md) : Positionnement de la butée Z assisté par moteur.
hu: [Végállás fázis](Endstop_Phase.md): Z végállás pozícionálása lépéssegédlettel.
it: [Endstop phase](Endstop_Phase.md): Posizionamento finecorsa Z assistito da stepper.
ko: [Endstop phase](Endstop_Phase.md): 스테퍼 지원 Z 엔드스톱 포지셔닝.
ru: [Endstop phase](Endstop_Phase.md): Позиционирование концевого упора Z с помощью шарового двигателя.
zh_hans: [限位相位](Endstop_Phase.md)：使用步进电机相位辅助 Z 限位定位。
zh_hant: [限位相位](Endstop_Phase.md)：使用步進電機相位輔助 Z 限位定位。

source: [Resonance compensation](Resonance_Compensation.md): A tool to reduce ringing in prints.
da: [Resonans kompensering](Resonance_Compensation.md): Et værktøj til reduktion af vibrationsartefakter under print.
de: [Resonance compensation](Resonance_Compensation.md): Ein Werkzeug zum reduzieren von Ringing in Drucken.
fr: [Compensation de la résonance](Resonance_Compensation.md) : Un outil permettant de réduire la résonance durant les impressions.
hu: [Rezonancia kompenzáció](Resonance_Compensation.md): Egy eszköz a nyomatok gyűrődésének (ringing) csökkentésére.
it: [Compensazione della risonanza](Resonance_Compensation.md): Uno strumento per ridurre le risonanze nelle stampe.
ko: [Resonance compensation](Resonance_Compensation.md): 인쇄물에서 물결을 줄이는 도구.
ru: [Resonance compensation](Resonance_Compensation.md): Инструмент для уменьшения звона при печати.
zh_hans: [共振补偿](Resonance_Compensation)：减少打印震纹的工具。
zh_hant: [共振補償](Resonance_Compensation.md)：減少列印震紋的工具。

source: [Measuring resonances](Measuring_Resonances.md): Information on using adxl345 accelerometer hardware to measure resonance.
da: [Måling af resonans](Measuring_Resonances.md): Information om brug af adxl345 accelerometer hardware til måling af resonans.
de: [Measuring resonances](Measuring_Resonances.md): Informationen über das Verwenden von adxl345-Beschleunigungssensoren um Resonanz zu messen.
fr: [Mesure des résonances](Measuring_Resonances.md) : Informations sur l'utilisation d'un accéléromètre adxl345 pour mesurer les résonances.
hu: [Rezonanciák mérése](Measuring_Resonances.md): adxl345 gyorsulásmérő hardver használatával kapcsolatos információk a rezonancia méréséhez.
it: [Misurare le risonanze](Measuring_Resonances.md): Informazioni sull'uso dell'hardware dell'accelerometro adxl345 per misurare le risonanze.
ko: [Measuring resonances](Measuring_Resonances.md): 공진을 측정하기 위해 adxl345 가속도계 하드웨어를 사용하는 방법에 대한 정보.
ru: [Измерение резонанса](Measuring_Resonances.md): Информация об использовании аппаратных средств акселерометра adxl345 для измерения резонанса.
zh_hans: [测量共振](Measuring_Resonances.md)：使用 adxl345 加速度计模块测量共振。
zh_hant: [測量共振](Measuring_Resonances.md)：使用 adxl345 加速度計模組測量共振。

source: [Pressure advance](Pressure_Advance.md): Calibrate extruder pressure.
da: [Pressure advance](Pressure_Advance.md): Kalibrering af trykket i dyssen.
de: [Pressure advance](Pressure_Advance.md): Extruder-Druck kalibrieren.
fr: [Avance à la pression](Pressure_Advance.md) : Calibration de la pression dans l'extrudeur.
hu: [Nyomás előtolás](Pressure_Advance.md): Az extruder nyomásának kalibrálása.
it: [Avanzamento pressione](Pressure_Advance.md): Calibra la pressione dell'estrusore.
ko: [Pressure advance](Pressure_Advance.md): 익스트루더 압출 보정.
ru: [Pressure advance](Pressure_Advance.md): Калибровка давления в экструдере.
zh_hans: [提前压力](Pressure_Advance.md)：校准挤出机压力。
zh_hant: [提前壓力](Pressure_Advance.md)：校準擠出機壓力。

source: [Slicers](Slicers.md): Configure "slicer" software for Klipper.
da: [Slicere](Slicers.md): Konfiguration af slicer-software til brug med Klipper.
de: [Slicers](Slicers.md): "Slicer"-Software für Klipper einrichten.
fr: [Trancheurs](Slicers.md) : Configuration d'un logiciel de "tranchage" pour Klipper.
hu: [Szeletelők](Slicers.md): A „szeletelő” szoftverek konfigurálása a Klipper számára.
it: [Slicers](Slicers.md): Configurare il software "slicer" per Klipper.
ko: [슬라이서](Slicers.md): Klipper용 "슬라이서" 소프트웨어 구성.
ru: [Slicers](Slicers.md): Настройка программного обеспечения "слайсера" для Klipper.
zh_hans: [切片](Slicers.md)：为 Klipper 配置切片软件。
zh_hant: [切片](Slicers.md)：為 Klipper 配置切片軟體。

source: [Command Templates](Command_Templates.md): G-Code macros and conditional evaluation.
da: [Kommandoskabeloner](Command_Templates.md): G-Code makroer og betinget evaluering.
de: [Command Templates](Command_Templates.md): G-Code Makros und bedingte Evaluierung.
fr: [Modèles de commande](Command_Templates.md) : Macros G-Code et évaluation conditionnelle.
hu: [Parancssablonok](Command_Templates.md): G-kód makrók és feltételes kiértékelés.
it: [Modelli di comando](Command_Templates.md): Macro G-Code e valutazione condizionale.
ko: [Command Templates](Command_Templates.md): G-Code 매크로 및 조건부 평가.
ru: [Шаблоны команд](Command_Templates.md): Макросы G-Code и условная оценка.
zh_hans: [命令模板](Command_Templates.md)：G代码宏和条件判断。
zh_hant: [命令模板](Command_Templates.md)：G程式碼宏和條件判斷。

source: [Status Reference](Status_Reference.md): Information available to macros (and similar).
da: [Status Reference](Status_Reference.md): Informationer til brug i makroer (og lignende).
de: [Status Reference](Status_Reference.md): Informationen zu verfügbaren Makros (und ähnlichem).
fr: [Référence des états](Status_Reference.md) : Informations disponibles pour les macros (et similaires).
hu: [Állapot referencia](Status_Reference.md): A makrók (és hasonlók) számára elérhető információk.
it: [Riferimento stato](Status_Reference.md): informazioni disponibili per le macro (e simili).
ko: [Status Reference](Status_Reference.md): 매크로(및 유사)에 사용할 수 있는 정보.
ru: [Status Reference](Status_Reference.md): Информация, доступная макросам (и им подобным).
zh_hans: [状态参考](Status_Reference.md)：可用于宏和类似功能的信息。
zh_hant: [狀態參考](Status_Reference.md)：可用於宏和類似功能的資訊。

source: [TMC Drivers](TMC_Drivers.md): Using Trinamic stepper motor drivers with Klipper.
da: [TMC Drivere](TMC_Drivers.md): Brug af Trinamic stepper motor drivere med Klipper.
de: [TMC Drivers](TMC_Drivers.md): Trinamic-Steppermotor-Treiber mit Klipper verwenden.
fr: [Pilotes TMC](TMC_Drivers.md) : Utilisation des pilotes de moteurs pas à pas Trinamic avec Klipper.
hu: [TMC Meghajtók](TMC_Drivers.md): Trinamic léptetőmotor-meghajtók használata Klipperrel.
it: [Driver TMC](TMC_Drivers.md): Uso dei driver Trinamic per motori passo-passo con Klipper.
ko: [TMC 드라이버](TMC_Drivers.md): Klipper와 함께 Trinamic 스테퍼 모터 드라이버 사용.
ru: [TMC Drivers](TMC_Drivers.md): Использование драйверов шаговых двигателей Trinamic с Klipper.
zh_hans: [TMC驱动](TMC_Drivers.md)：在 Klipper 中使用 Trinamic 步进电机驱动。
zh_hant: [TMC驅動](TMC_Drivers.md)：在 Klipper 中使用 Trinamic 步進電機驅動。

source: [PWM tools](Using_PWM_Tools.md): Guide on how to use PWM controlled tools such as lasers or spindles.
da: [PWM værktøjer](Using_PWM_Tools.md): Vejledning om brug af PWM (Pulse Width Modulation) værktøjer, som Lasere og fræsespindler.
de: [PWM tools](Using_PWM_Tools.md): Anleitung zum Verwenden von PWM-gesteuerten Werkzeugen (bspw. Laser oder Spindeln).
fr: [Outils PWM](Using_PWM_Tools.md) : Guide sur l'utilisation des outils contrôlés par PWM tels que les lasers ou les broches.
hu: [PWM eszközök](Using_PWM_Tools.md): Útmutató a PWM vezérelt szerszámok, például lézerek vagy orsók használatához.
it: [Strumenti PWM](Using_PWM_Tools.md): Guida su come usare gli strumenti controllati da PWM come i laser o i mandrini.
ko: [PWM tools](Using_PWM_Tools.md): 레이저 또는 스핀들과 같은 PWM 제어 도구를 사용하는 방법에 대한 안내.
ru: [PWM tools](Using_PWM_Tools.md): Руководство по использованию инструментов с ШИМ-управлением, таких как лазеры или шпиндели.
zh_hans: [PWM 工具](Using_PWM_Tools.md)：关于如何使用 PWM 控制的工具，例如激光器或电钻头。
zh_hant: [PWM 工具](Using_PWM_Tools.md)：關於如何使用 PWM 控制的工具，例如鐳射器或電鉆頭。

source: [G-Codes](G-Codes.md): Information on commands supported by Klipper.
da: [G-koder](G-Codes.md): Information om kommandoer der understøttes af Klipper.
de: [G-Codes](G-Codes.md): Informationen zu unterstützten Kommandos in Klipper.
fr: [G-Codes](G-Codes.md) : Informations sur les instructions prises en charge par Klipper.
hu: [G-kódok](G-Codes.md): Információk a Klipper által támogatott parancsokról.
it: [Codici G](G-Codes.md): Informazioni sui comandi supportati da Klipper.
ko: [G-Codes](G-Codes.md): Klipper에서 지원하는 G-Code 대한 정보.
ru: [G-Codes](G-Codes.md): Информация о командах, поддерживаемых Klipper.
zh_hans: [G代码](G-Codes.md)：用于 Klipper 的G代码命令。
zh_hant: [G程式碼](G-Codes.md)：用於 Klipper 的G程式碼命令。

source: Developer Documentation
da: Udvikler-dokumentation
de: Entwicklerdokumentation
fr: Documentation pour les développeurs
hu: Fejlesztői Dokumentáció
it: Documentazione per sviluppatori
ko: 개발자 문서
ru: Документация для разработчиков
zh_hans: 开发者文档
zh_hant: 開發者文件

source: [Code overview](Code_Overview.md): Developers should read this first.
da: [Kode overblik](Code_Overview.md): Udviklere bør læse dette først.
de: [Code overview](Code_Overview.md): Entwickler sollten dies zuerst lesen.
fr: [Aperçu du code](Code_Overview.md) : Les développeurs devraient lire ceci en premier.
hu: [Kódáttekintés](Code_Overview.md): A fejlesztőknek először ezt kell elolvasniuk.
it: [Panoramica del codice](Code_Overview.md): Gli sviluppatori dovrebbero leggere prima questo.
ko: [코딩 개요](Code_Overview.md): 개발자라면 읽어야 하는 문서.
ru: [Обзор кода](Code_Overview.md): Разработчики должны прочитать это в первую очередь.
zh_hans: [代码概述](Code_Overview.md)：开发者应该从这个文档开始阅读。
zh_hant: [程式碼概述](Code_Overview.md)：開發者應該從這個文件開始閱讀。

source: [Kinematics](Kinematics.md): Technical details on how Klipper implements motion.
da: [Kinematik](Kinematics.md): Tekniske detaljer om hvordan Klipper implementerer bevægelser.
de: [Kinematics](Kinematics.md): Technische Details zur Implementierung von Bewegungen in Klipper.
fr: [Cinématiques](Kinematics.md) : Détails techniques sur la façon dont Klipper met en œuvre les mouvements.
hu: [Kinematika](Kinematics.md): Technikai részletek arról, hogyan valósítja meg a Klipper a mozgást.
it: [Cinematica](Kinematics.md): Dettagli tecnici su come Klipper implementa il movimento.
ko: [Kinematics](Kinematics.md): Klipper가 모션을 구현하는 방법에 대한 기술 세부 정보.
ru: [Кинематика](Kinematics.md): Технические подробности о том, как Klipper реализует движение.
zh_hans: [运动学](Kinematics.md)：关于 Klipper 如何实现运动的技术细节。
zh_hant: [運動學](Kinematics.md)：關於 Klipper 如何實現運動的技術細節。
