Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Overview.po
Languages: da, de, fr, hu, it, ko, ru, zh_hans, zh_hant

source: [Protocol](Protocol.md): Information on the low-level messaging protocol between host and micro-controller.
da: [Protokol](Protocol.md): Information om Lav-niveau beskedprotokollen mellem vært og mcu.
de: [Protocol](Protocol.md): Informationen über das low-level Nachrichtenprotokoll zwischen Host und Mikrocontroller.
fr: [Protocole](Protocol.md) : Informations sur le protocole de messagerie de bas niveau entre l'hôte et le microcontrôleur.
hu: [Protokoll](Protocol.md): A gazdagép és a mikrokontroller közötti alacsony szintű üzenetküldési protokollról szóló információk.
it: [Protocollo](Protocol.md): Informazioni sul protocollo di messaggistica di basso livello tra host e microcontrollore.
ko: [프로토콜](Protocol.md): 호스트와 마이크로 컨트롤러 간의 저수준 메시징 프로토콜에 대한 정보.
ru: [Protocol](Protocol.md): Информация о низкоуровневом протоколе обмена сообщениями между хостом и микроконтроллером.
zh_hans: [协议](Protocol.md)：主机和微控制器之间的低级通信协议的信息。
zh_hant: [協議](Protocol.md)：主機和微控制器之間的低階通訊協議的資訊。

source: [API Server](API_Server.md): Information on Klipper's command and control API.
da: [API Server](API_Server.md): Information om Klippers Kommando og kontrol API.
de: [API Server](API_Server.md): Informationen über Klipper's Kommando- und Steuerungs-API.
fr: [API du serveur](API_Server.md) : Informations sur l'API de commande et de contrôle de Klipper.
hu: [API-kiszolgáló](API_Server.md): Információ a Klipper parancs és vezérlő API-járól.
it: [Server API](API_Server.md): Informazioni sulle API di comando e controllo di Klipper.
ko: [API 서버](API_Server.md): Klipper의 명령 및 제어 API에 대한 정보.
ru: [API Server](API_Server.md): Информация о командно-контрольном API Klipper.
zh_hans: [API 服务器](API_Server.md)：关于 Klipper 的命令与控制 API 的信息。
zh_hant: [API 伺服器](API_Server.md)：關於 Klipper 的命令與控制 API 的資訊。

source: [MCU commands](MCU_Commands.md): A description of low-level commands implemented in the micro-controller software.
da: [MCU kommandoer](MCU_Commands.md): En beskrivelse om lav-niveau kommandoer implementeret i mcu-softwaren.
de: [MCU commands](MCU_Commands.md): Eine Beschreibung von low-level Kommandos, die in der Mikrocontroller-Software implementiert sind.
fr: [Commandes MCU](MCU_Commands.md) : Une description des commandes de bas niveau implémentées dans le logiciel du micro-contrôleur.
hu: [MCU-parancsok](MCU_Commands.md): A mikrokontroller szoftverében megvalósított alacsony szintű parancsok leírása.
it: [Comandi MCU](MCU_Commands.md): Una descrizione dei comandi di basso livello implementati nel software del microcontrollore.
ko: [MCU 명령어](MCU_Commands.md): 마이크로 컨트롤러 소프트웨어에 구현된 저수준 명령에 대한 설명.
ru: [Команды MCU](MCU_Commands.md): Описание низкоуровневых команд, реализованных в программном обеспечении микроконтроллера.
zh_hans: [MCU 指令](MCU_Commands.md)：描述在微控制器软件中实现的低级指令。
zh_hant: [MCU 指令](MCU_Commands.md)：描述在微控制器軟體中實現的低階指令。

source: [CAN bus protocol](CANBUS_protocol.md): Klipper CAN bus message format.
da: [CAN-bus protokol](CANBUS_protocol.md): Klippers CAN-bus besked format.
de: [CAN bus protocol](CANBUS_protocol.md): Klipper's CAN-Bus Nachrichtenformat.
fr: [Protocole du bus CAN](CANBUS_protocol.md) : Format de messages du bus CAN de Klipper.
hu: [CAN-busz protokoll](CANBUS_protocol.md): Klipper CAN-busz üzenetformátum.
it: [Protocollo bus CAN](CANBUS_protocol.md): formato del messaggio Klipper CAN bus.
ko: [캔버스 프로토콜](CANBUS_protocol.md): Klipper CAN 버스 메시지 형식.
ru: [Протокол шины CAN](CANBUS_protocol.md): Формат сообщений шины CAN от Klipper.
zh_hans: [CAN 总线协议](CANBUS_protocol.md)：Klipper 的 CAN总线报文格式。
zh_hant: [CAN 匯流排協議](CANBUS_protocol.md)：Klipper 的 CAN匯流排報文格式。

source: [Debugging](Debugging.md): Information on how to test and debug Klipper.
da: [Fejlfinding](Debugging.md): Information om test og fejlfinding af Klipper.
de: [Debugging](Debugging.md): Informationen über das Testen und Debuggen von Klipper.
fr: [Débogage](Debugging.md) : Informations sur la façon de tester et déboguer Klipper.
hu: [Hibakeresés](Debugging.md): Klipper tesztelésével és hibakeresésével kapcsolatos információk.
it: [Debug](Debug.md): Informazioni su come testare e fare il debug di Klipper.
ko: [디버깅](Debugging.md): Klipper를 테스트하고 디버그하는 방법에 대한 정보.
ru: [Debugging](Debugging.md): Информация о том, как тестировать и отлаживать Klipper.
zh_hans: [调试](Debugging.md)：关于如何测试和调试 Klipper。
zh_hant: [除錯](Debugging.md)：關於如何測試和除錯 Klipper。

source: [Benchmarks](Benchmarks.md): Information on the Klipper benchmark method.
da: [Benchmark](Benchmarks.md): Information om Klippers benchmark metode.
de: [Benchmarks](Benchmarks.md): Informationen über die Klipper Benchmark-Methode.
fr: [Tests de charge](Benchmarks.md) : Informations sur la méthode de tests de charge de Klipper.
hu: [Jelszintek](Benchmarks.md): Klipper jelszint módszerrel kapcsolatos információk.
it: [Benchmarks](Benchmarks.md): Informazioni sul metodo di benchmark Klipper.
ko: [벤치마크](Benchmarks.md): Klipper 벤치마크 방법에 대한 정보.
ru: [Benchmarks](Benchmarks.md): Информация об эталонном методе Klipper.
zh_hans: [基准测试](Benchmarks.md)：关于 Klipper 基准测试的方法。
zh_hant: [基準測試](Benchmarks.md)：關於 Klipper 基準測試的方法。

source: [Contributing](CONTRIBUTING.md): Information on how to submit improvements to Klipper.
da: [Bidragelse](CONTRIBUTING.md): Information om indsending af bidrag/forbedringer til Klipper.
de: [Contributing](CONTRIBUTING.md): Informationen über das Einreichen von Verbesserungen von Klipper.
fr: [Contribuer](CONTRIBUTING.md) : Comment proposer des améliorations pour Klipper.
hu: [Hozzájárulás](CONTRIBUTING.md): Információ arról, hogyan küldhetsz fejlesztéseket a Klipperhez.
it: [Contribuire](CONTRIBUTING.md): Informazioni su come presentare miglioramenti a Klipper.
ko: [기여](CONTRIBUTING.md): 개선 사항을 Klipper에 제출하는 방법에 대한 정보.
ru: [Contributing](CONTRIBUTING.md): Информация о том, как вносить улучшения в Klipper.
zh_hans: [贡献](CONTRIBUTING.md)：有关如何向 Klipper 提交改进方法的信息。
zh_hant: [貢獻](CONTRIBUTING.md)：有關如何向 Klipper 提交改進方法的資訊。

source: [Packaging](Packaging.md): Information on building OS packages.
da: [Pakning/Bundling](Packaging.md): Information om opbygning af OS-pakker.
de: [Packaging](Packaging.md): Informationen über das Kompilieren von Betriebssystem-Paketen.
fr: [Packaging](Packaging.md) : Informations sur la construction de paquets de système d'exploitation.
hu: [Csomagolás](Packaging.md): Az operációs rendszer csomagjainak összeállításával kapcsolatos információk.
it: [Packaging](Packaging.md): informazioni sulla creazione di pacchetti del sistema operativo.
ko: [패키징](Packaging.md): OS 패키지 빌드에 대한 정보.
ru: [Packaging](Packaging.md): Информация о сборке пакетов ОС.
zh_hans: [打包](Packaging.md)：有关于如何构建系统包的信息。
zh_hant: [打包](Packaging.md)：有關於如何構建系統包的資訊。

source: Device Specific Documents
da: Enheds-specifikke dokumenter
de: Geräteabhängige Dokumente
fr: Documents spécifiques à certains appareils
hu: Eszközspecifikus Dokumentumok
it: Documenti specifici del dispositivo
ko: 기기별 문서
ru: Документы по конкретным устройствам
zh_hans: 设备特定文档
zh_hant: 裝置特定文件

source: [Example configs](Example_Configs.md): Information on adding an example config file to Klipper.
da: [Konfigurationseksempler](Example_Configs.md): Information om tilføjelse af Konfigurationseksempler til Klipper.
de: [Example configs](Example_Configs.md): Informationen über das Hinzufügen von Beispiel-Konfigurationsdateien zu Klipper.
fr: [Exemples de configurations](Example_Configs.md) : Informations sur l'ajout d'un exemple de fichier de configuration à Klipper.
hu: [Példa konfigurációk](Example_Configs.md): Információ egy példa konfigurációs fájl Klipperhez való hozzáadásával kapcsolatban.
it: [Configurazioni di esempio](Example_Configs.md): Informazioni su come aggiungere un file di configurazione di esempio a Klipper.
ko: [config 예제](Example_Configs.md): 예제 config 파일을 Klipper에 추가하는 방법에 대한 정보.
ru: [Example configs](Example_Configs.md): Информация о добавлении примера конфигурационного файла в Klipper.
zh_hans: [示列配置](Example_Configs.md)：有关于添加示列配置到 Klipper 的信息。
zh_hant: [示列配置](Example_Configs.md)：有關於新增示列配置到 Klipper 的資訊。

source: [SDCard Updates](SDCard_Updates.md): Flash a micro-controller by copying a binary to an sdcard in the micro-controller.
da: [SD-kort opdateringer](SDCard_Updates.md): Flash en mcu ved at kopiere en binær fil til kortet i mcu'en.
de: [SDCard Updates](SDCard_Updates.md): Den Mikrocontroller flashen, indem man eine Firmwaredatei auf die SD-Karte kopiert.
fr: [Mises à jour par carte SD](SDCard_Updates.md) : Flasher le micro-contrôleur en copiant un binaire sur une carte SD.
hu: [SD-kártya Frissítések](SDCard_Updates.md): Mikrokontroller égetése egy bináris állománynak a mikrokontroller SD-kártyára történő másolásával.
it: [Aggiornamenti SDCard](SDCard_Updates.md): esegui il flashing di un microcontrollore copiando un file binario su una scheda SD nel microcontrollore.
ko: [SDCard 업데이트](SDCard_Updates.md): sdcard 에 바이너리를 복사하여 마이크로 컨트롤러 펌웨어 업데이르 하는 방법.
ru: [SDCard Updates](SDCard_Updates.md): Прошивка микроконтроллера путем копирования двоичного файла на sdcard в микроконтроллере.
zh_hans: [SD卡更新](SDCard_Updates.md)：通过将固件拷贝到SD卡中，再通过微控制器的SD卡槽来刷写微控制器。
zh_hant: [SD卡更新](SDCard_Updates.md)：通過將韌體拷貝到SD卡中，再通過微控制器的SD卡槽來刷寫微控制器。

source: [Raspberry Pi as Micro-controller](RPi_microcontroller.md): Details for controlling devices wired to the GPIO pins of a Raspberry Pi.
da: [Raspberry Pi som mcu](RPi_microcontroller.md): Detaljer om styring af enheder forbundet til Rasperry Pis GPIO pins.
de: [Raspberry Pi als Mikrocontroller](RPi_microcontroller.md): Details über die Steuerung von Geräten, welche an die Raspberry Pi GPIO-Pins angeschlossen sind.
fr: [Raspberry Pi en tant que micro-contrôleur](RPi_microcontroller.md) : Détails pour contrôler les appareils connectés aux broches GPIO d'un Raspberry Pi.
hu: [Raspberry Pi mint mikrokontroller](RPi_microcontroller.md): A Raspberry Pi GPIO-tűire csatlakoztatott eszközök vezérlésének részletei.
it: [Raspberry Pi come microcontrollore](RPi_microcontroller.md): Dettagli per controllare i dispositivi collegati ai pin GPIO di un Raspberry Pi.
ko: [Raspberry Pi as Micro-controller](RPi_microcontroller.md): Raspberry Pi의 GPIO 핀에 연결된 장치 제어에 대한 세부 정보.
ru: [Raspberry Pi как микроконтроллер](RPi_microcontroller.md): Детали для управления устройствами, подключенными к контактам GPIO Raspberry Pi.
zh_hans: [将树莓派作为微控制器](RPi_microcontroller.md)：关于如何控制与树莓派 GPIO 引脚连接的设备。
zh_hant: [將樹莓派作為微控制器](RPi_microcontroller.md)：關於如何控制與樹莓派 GPIO 引腳連線的裝置。

source: [Bootloaders](Bootloaders.md): Developer information on micro-controller flashing.
da: [Bootloadere](Bootloaders.md): Udvikler-information om flash af mcu.
de: [Bootloaders](Bootloaders.md): Entwicklerinformationen über das Flashen von Mikrocontrollern.
fr: [Bootloaders](Bootloaders.md) : Informations pour les développeurs sur le flashage des microcontrôleurs.
hu: [Bootloaderek](Bootloaders.md): Fejlesztői információk a mikrokontrollerek égetéséről.
it: [Bootloaders](Bootloaders.md): Informazioni per gli sviluppatori sul flashing del microcontrollore.
ko: [브트로더](Bootloaders.md): 마이크로 컨트롤러 펌업에 대한 개발자 정보.
ru: [Bootloaders](Bootloaders.md): Информация для разработчиков о прошивке микроконтроллеров.
zh_hans: [底层引导程序](Bootloaders.md)：有关于微控制器刷写的开发者信息。
zh_hant: [底層載入程式](Bootloaders.md)：有關於微控制器刷寫的開發者資訊。

source: [CAN bus](CANBUS.md): Information on using CAN bus with Klipper.
da: [CAN-bus](CANBUS.md): Information om brug af CAN-bus med Klipper.
de: [CAN bus](CANBUS.md): Informationen über die Verwendung des CAN-Bus mit Klipper.
fr: [Bus CAN](CANBUS.md) : Informations sur l'utilisation du bus CAN avec Klipper.
hu: [CAN-busz](CANBUS.md): Információk a CAN-busz Klipper-el való használatáról.
it: [CAN bus](CANBUS.md): Informazioni sull'uso del CAN bus con Klipper.
ko: [캔버스](CANBUS.md): Klipper에서 CAN 버스를 사용하는 방법에 대한 정보.
ru: [CAN шина](CANBUS.md): Информация об использовании шины CAN с Klipper.
zh_hans: [CAN 总线](CANBUS.md)：有关于 Klipper 使用 CAN 总线的信息。
zh_hant: [CAN 匯流排](CANBUS.md)：有關於 Klipper 使用 CAN 匯流排的資訊。

source: [TSL1401CL filament width sensor](TSL1401CL_Filament_Width_Sensor.md)
da: [TSL1401CL filament bredde sensor](TSL1401CL_Filament_Width_Sensor.md)
de: [TSL1401CL Filamentbreitensensor](TSL1401CL_Filament_Width_Sensor.md)
fr: [Capteur de largeur de filament TSL1401CL](TSL1401CL_Filament_Width_Sensor.md)
hu: [TSL1401CL szálszélesség érzékelő](TSL1401CL_Filament_Width_Sensor.md)
it: [Sensore larghezza filamento TSL1401CL](TSL1401CL_Filament_Width_Sensor.md)
ru: [TSL1401CL датчик ширины нити](TSL1401CL_Filament_Width_Sensor.md)
zh_hans: [TSL1401CL 耗材线径传感器](TSL1401CL_Filament_Width_Sensor.md)
zh_hant: [TSL1401CL 耗材線徑感測器](TSL1401CL_Filament_Width_Sensor.md)

source: Overview
da: Overblik
de: Übersicht
fr: Vue d'ensemble
hu: Áttekintés
it: Panoramica
ko: 개요
ru: Обзор
zh_hans: 概述
zh_hant: 概述

source: Installation and Configuration
da: Installation og konfigurering
de: Installation und Konfiguration
fr: Installation et configuration
hu: Telepítés és Konfiguráció
it: Installazione e configurazione
ko: 설치 및 설정
ru: Установка и настройка
zh_hans: 安装和配置
zh_hant: 安裝和配置

source: [Multi-MCU Homing](Multi_MCU_Homing.md): Homing and probing using multiple micro-controllers.
da: [Multi-MCU Homing](Multi_MCU_Homing.md): Homing og nivellering ved brug af flere mcu'er.
de: [Multi-MCU Homing](Multi_MCU_Homing.md): Homing und Probing mithilfe mehrerer Mikrocontroller.
fr: [Prise origine multi-MCU](Multi_MCU_Homing.md): Mise à l'origine et palpage utilisant plusieurs micro-contrôleurs.
hu: [Multi-MCU Kezdőpont](Multi_MCU_Homing.md): Kezdőpont felvétel és szintezés több mikrovezérlő használatával.
it: [Multi-MCU Homing](Multi_MCU_Homing.md): Homing e probing utilizzando più microcontrollori.
ru: [Multi-MCU Homing](Multi_MCU_Homing.md): Наведение и зондирование с использованием нескольких микроконтроллеров.
zh_hans: [多 MCU 归零](Multi_MCU_Homing.md)：在归位和探测时使用多个微处理器。
zh_hant: [Multi-MCU Homing](Multi_MCU_Homing.md)：在歸位和探測時使用多個微處理器。

source: [Skew correction](Skew_Correction.md): Adjustments for axes not perfectly square.
da: [korrektion af skævhed](Skew_Correction.md): Justering af akser der ikke løber 100% vinkelret.
fr: [Correction d'obliquité](Skew_Correction.md) : Ajustements des axes qui ne sont pas parfaitement d'équerre.
hu: [Ferdeség korrekció](Skew_Correction.md): A nem tökéletesen derékszögű tengelyek korrekciója.
ru: [Коррекция перекоса](Skew_Correction.md): Корректировка для осей, не являющихся идеально квадратными.
zh_hant: [偏斜校正](Skew_Correction.md)：調整不完全垂直的軸（不完美的方形）。

source: [Beaglebone](Beaglebone.md): Details for running Klipper on the Beaglebone PRU.
da: [Beaglebone](Beaglebone.md): Detaljer for kørsel af Klipper på Beaglebone PRU.
fr: [Beaglebone](Beaglebone.md) : Détails pour l'exécution de Klipper sur le SBC Beaglebone.
hu: [Beaglebone](Beaglebone.md): Klipper futtatásának részletei a Beaglebone PRU-n.
ru: [Beaglebone](Beaglebone.md): Подробности для запуска Klipper на Beaglebone PRU.
zh_hant: [Beaglebone](Beaglebone.md)：在 Beaglebone PRU 上執行 Klipper 的詳細資訊。

source: [Hall filament width sensor](Hall_Filament_Width_Sensor.md)
da: [Hall filament-bredde sensor](Hall_Filament_Width_Sensor.md)
fr: [Détecteur de largeur de filament à effet hall](Hall_Width_Sensor.md)
hu: [Hall szálszélesség érzékelő](Hall_Filament_Width_Sensor.md)
ru: [Датчик ширины нити Холла](Hall_Filament_Width_Sensor.md)
zh_hant: [霍爾列印絲寬度感測器](Hall_Filament_Width_Sensor.md)

source: [Exclude Object](Exclude_Object.md): The guide to the Exclude Objects implementation.
da: [Ekskludér objekt](Exclude_Object.md): Vejledning om implementering af Ekskludér objekt funktionen.
hu: [Objektumok kizárása](Exclude_Object.md): Az Objektumok kizárása implementációjának útmutatója.

source: [Axis Twist Compensation](Axis_Twist_Compensation.md): A tool to compensate for inaccurate probe readings due to twist in X gantry.
da: [Kompensering af Akse-rotation](Axis_Twist_Compensation.md): Værktøj til brug for kompensering af upræcise målinger grundet rotation i X-aksen.
hu: [Axis Twist Compensation](Axis_Twist_Compensation.md): Eszköz az X portál csavarodásából adódó pontatlan szonda leolvasások kompenzálására.

source: [Bootloader Entry](Bootloader_Entry.md): Requesting the bootloader.
da: [Bootloader Kald](Bootloader_Entry.md): Anmodning til bootloader.
hu: [Bootloader Entry](Bootloader_Entry.md): Rendszerbetöltő kérése.

source: [CAN bus troubleshooting](CANBUS_Troubleshooting.md): Tips for troubleshooting CAN bus.
da: [CAN-bus fejlfinding](CANBUS_Troubleshooting.md): Tips til fejlfinding af CAN-bus.
hu: [CAN bus troubleshooting](CANBUS_Troubleshooting.md): Tippek a CAN-busz hibaelhárításához.

source: [Exclude Object](Exclude_Object.md): The guide to the Exclude Objecs implementation.
fr: [Exclusion d'objets](Exclude_Object.md) : Le guide de l'implémentation de l'exclusion d'objets.

source: [Skew correction](skew_correction.md): Adjustments for axes not perfectly square.
it: [Correzione inclinazione](skew_correction.md): Regolazioni per assi non perfettamente squadrati.
ko: [Skew correction](skew_correction.md): 축 틀어짐 보정.
zh_hans: [偏斜校正](skew_correction.md)：调整不是完美垂直的轴（不完美的方形）。

source: [Beaglebone](beaglebone.md): Details for running Klipper on the Beaglebone PRU.
it: [Beaglebone](beaglebone.md): Dettagli per l'esecuzione di Klipper sulla PRU Beaglebone.
ko: [Beaglebone](beaglebone.md): Beaglebone PRU에서 Klipper를 실행하는 방법에 대한 세부 정보.
zh_hans: [Beaglebone](beaglebone.md)：在 Beaglebone 可编程实时单元(PRU)上运行 Klipper 的详细信息。

source: [Hall filament width sensor](HallFilamentWidthSensor.md)
it: [Sensore di larghezza del filamento Hall](HallFilamentWidthSensor.md)
ko: [홀 필라멘트 너비 센서](HallFilamentWidthSensor.md)
zh_hans: [霍尔耗材线径宽度传感器](HallFilamentWidthSensor.md)
