Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Pressure_Advance.po
Languages: es, ko, zh_hant

source: This document provides information on tuning the "pressure advance" configuration variable for a particular nozzle and filament. The pressure advance feature can be helpful in reducing ooze. For more information on how pressure advance is implemented see the [kinematics](Kinematics.md) document.
es: Este documento provee información sobre el ajuste de variable de configuración "avance de presión" para un rociador y filamento particular. La función "avance de presión" puede ser de ayuda en la reducción del rezumado. Para más información acerca de cómo "avance de presión" está implementada, vea el documento de [cinemática](Kinematics.md).
ko: 이 문서는 특정 노즐 및 필라멘트에 대한 "Pressure advance" config 변수 조정에 대한 정보를 제공합니다. pressure advance 기능은 ooze (노즐 흘러내림) 를 줄이는 데 도움이 될 수 있습니다. pressure advance 가 구현되는 방법에 대한 자세한 내용은 [kinematics](Kinematics.md) 문서를 참조하십시오.
zh_hant: 本文件提供了關於調整特定噴嘴和耗材「pressure advance」配置變數的方法。pressure advance功能可以減少漏料。關於如何實現pressure advance的更多資訊，見[運動學](Kinematics.md)檔案。

source: Tuning pressure advance
es: Ajustando del avance de presión
ko: pressure advance 튜닝
zh_hant: 調整pressure advance

source: Pressure advance does two useful things - it reduces ooze during non-extrude moves and it reduces blobbing during cornering. This guide uses the second feature (reducing blobbing during cornering) as a mechanism for tuning.
es: El Avance de presión hace dos cosas útiles - reduce el rezumado durante movimientos no extrudentes y reduce el goteo durante el esquinado. Esta guía usa la segunda característica (reducir el goteo durante el esquinado) como un mecanismo para el ajuste.
ko: Pressure advance 는 두 가지 유용한 작업을 수행합니다. 즉, 출력하지 않는 움직임 동안 노즐 흘러내림을 줄이고 코너링 중에 얼룩을 줄입니다. 이 가이드는 튜닝을 위한 메커니즘으로 두 번째 기능(코너링 중 얼룩 감소)을 사용합니다.
zh_hant: Pressure advance有兩個作用 - 它可以減少非擠出移動過程中的溢料和減少轉彎時的凸起。本指南使用第二個功能（減少轉彎過程中的凸起）作為優化機制。

source: In order to calibrate pressure advance the printer must be configured and operational as the tuning test involves printing and inspecting a test object. It is a good idea to read this document in full prior to running the test.
es: Para calibrar el avance de presión la impresora debe ser configurada y estar operacional, ya que la prueba de ajuste involucra imprimir e inspeccionar un objeto de prueba. Es una buena idea el leer este documento en su totalidad previo al ejecutar la prueba.
ko: 튜닝 테스트에는 개체의 인쇄 및 검사가 포함되므로 pressure advance 를 보정하려면 프린터를 구성하고 작동해야 합니다. 테스트를 실행하기 전에 이 문서를 완전히 읽는 것이 좋습니다.
zh_hant: 爲了校準pressure advance，印表機必須已經配置完成並可以正常工作。因為調優測試涉及列印和檢查測試對象。在執行測試之前，最好完整閱讀本文件。

source: Use a slicer to generate g-code for the large hollow square found in [docs/prints/square_tower.stl](prints/square_tower.stl). Use a high speed (eg, 100mm/s), zero infill, and a coarse layer height (the layer height should be around 75% of the nozzle diameter). Make sure any "dynamic acceleration control" is disabled in the slicer.
es: Use un rebanador para generar el código G para el cuadrado grande hueco que se encuentra en [docs/prints/square_tower.stl](prints/square_tower.stl). Use una velocidad alta (e.g. 100mm/s), cero relleno, y una altura de capa gruesa (la altura de capa debería estar entorno del 75% del diámetro del rociador). Asegúrese de que cualquier "control de aceleración dinámica" está deshabilitado en el rebanador.
ko: 슬라이서를 사용하여 [docs/prints/square_tower.stl](prints/square_tower.stl) 에 있는 큰 속이 빈 사각형에 대한 g-code 를 생성합니다. high speed (예: 100mm/s), zero infill 및 coarse layer height (레이어 높이는 노즐 직경의 약 75% 여야 함) 를 사용합니다.
zh_hant: 使用切片器為 [docs/prints/square_tower.stl](prints/square_tower.stl) 中的大空心正方形生成 g 代碼。使用高速（例如，100 毫米/秒）、零填充和粗層高度（層高應約為噴嘴直徑的 75%）。確保在切片器中禁用任何“動態加速控制”。

source: Prepare for the test by issuing the following G-Code command:
es: Prepare para la prueba mediante el envío del siguiente comando en código G:
ko: 다음 G-Code 명령을 실행하여 테스트를 준비합니다:
zh_hant: 通過發出以下 G-Code命令為測試做準備：

source: This command makes the nozzle travel slower through corners to emphasize the effects of extruder pressure. Then for printers with a direct drive extruder run the command:
es: Este comando hace que el rociador recorra de forma más lenta por las esquinas para enfatizar los efectos de la presión de extrusión. Entonces, para impresoras con un extrusor de manejo directo, ejecute el comando:
ko: 이 명령은 노즐이 코너를 통과하는 속도를 줄여 익스트루더 압력의 영향을 줍니다. 그런 다음 직결식 익스트루더가 있는 프린터의 경우 다음 명령을 실행합니다:
zh_hant: 此命令使噴嘴通過角落的速度變慢，以強調擠出機壓力的影響。然後對於帶有直接驅動擠出機的打印機，運行命令：

source: For long bowden extruders use:
es: Para extrusores de Bowden utilice:
ko: 보우덴 방식의 경우 다음을 사용하십시오:
zh_hant: 遠程擠出機，請使用：

source: Then print the object. When fully printed the test print looks like:
es: Entonces imprima el objeto. Cuando este totalmente impresa, la prueba de impresión debería asemejarse a:
ko: 그런 다음 개체를 인쇄합니다. 완전히 인쇄되면 테스트 인쇄는 다음과 같습니다:
zh_hant: 然後打印對象。完全打印後，測試打印看起來像：

source: The above TUNING_TOWER command instructs Klipper to alter the pressure_advance setting on each layer of the print. Higher layers in the print will have a larger pressure advance value set. Layers below the ideal pressure_advance setting will have blobbing at the corners, and layers above the ideal setting can lead to rounded corners and poor extrusion leading up to the corner.
es: El comando TUNING_TOWER precedente instruye a Klipper de alterar la configuración de Avance de presión en cada capa de la impresión. Las capas más altas en la impresión tendrán establecido un Avance de presión más alto.
ko: 위의 TUNING_TOWER 명령은 Klipper가 인쇄물의 각 레이어에서 pressure_advance 설정을 변경하도록 지시합니다. 인쇄물의 레이어가 높을수록 pressure_advance 값이 더 크게 설정됩니다. 이상적인 pressure_advance 설정 아래의 레이어는 모서리에 얼룩이 생기고 이상적인 설정 위의 레이어는 모서리가 둥글고 모서리까지 돌출되지 않게 될 수 있습니다.
zh_hant: 上面的 TUNING_TOWER 命令指示 Klipper 更改打印的每一層的 pressure_advance 設置。打印中的較高層將設置較大的pressure advance值。低於理想 pressure_advance 設置的圖層在拐角處會出現斑點，而高於理想設置的圖層可能會導致圓角和導致拐角處的擠壓不良。

source: One can cancel the print early if one observes that the corners are no longer printing well (and thus one can avoid printing layers that are known to be above the ideal pressure_advance value).
es: Uno puede cancelar la impresión tempranamente si observa que las esquinas no se están imprimiendo bien (y por ende se puede evitar imprimir capas que ya se sepa que estén por encima del valor ideal de Avance de presión).
ko: 모서리가 정상적으로 출력되지 않는다면 인쇄를 일찍 취소할 수 있습니다 (이후에 이상적인 pressure_advance 값보다 높은 것으로 알려진 레이어 인쇄를 피할 수 있습니다).
zh_hant: 如果觀察到角落不再打印良好，則可以提前取消打印（因此可以避免打印已知高於理想 pressure_advance 值的層）。

source: Inspect the print and then use a digital calipers to find the height that has the best quality corners. When in doubt, prefer a lower height.
es: Inspeccione la impresión y entonces use calibres digitales para encontrar la altura que tienen las esquinas de mejor calidad. En la duda, prefiera una altura menor.
ko: 인쇄물을 검사한 다음 디지털 캘리퍼스를 사용하여 모서리 품질이 가장 좋은 높이를 찾습니다. 확실하지 않은 경우 낮은 높이를 선택하세요.
zh_hant: 檢查打印，然後使用數字卡尺找到具有最佳質量角的高度。如有疑問，請選擇較低的高度。

source: The pressure_advance value can then be calculated as `pressure_advance = <start> + <measured_height> * <factor>`. (For example, `0 + 12.90 * .020` would be `.258`.)
es: El Avance de presión (pressure_advance) puede ser calculado como `pressure_advance = <comienzo> + <altura_medida> * <factor>`. (Por ejemplo, `0 + 12.90 * .020` sería `.258`.)
ko: pressure_advance 값은 `pressure_advance = <start> + <measured_height> * <factor>` 로 계산할 수 있습니다. (예를 들어 '0 + 12.90 * .020'은 '.258'이 됩니다.)
zh_hant: 然後可以將 pressure_advance 值計算為`pressure_advance = <start> + <measured_height> * <factor>`。 （例如，`0 + 12.90 * .020` 將是 `.258`。）

source: It is possible to choose custom settings for START and FACTOR if that helps identify the best pressure advance setting. When doing this, be sure to issue the TUNING_TOWER command at the start of each test print.
es: Es posible elegir configuraciones personalizadas para START y FACTOR si eso ayuda a identificar la mejor configuración de Avance de presión. Cuando se haga esto, esté seguro de enviar el comando TUNING_TOWER al comienzo de cada prueba de impresión.
ko: 최상의 pressure advance 설정을 하기위해 START 및 FACTOR에 대한 사용자 지정 설정을 할 수 있습니다. 이 작업을 수행할 때 각 테스트 인쇄를 시작할 때 TUNING_TOWER 명령을 실행해야 합니다.
zh_hant: 如果有助於確定最佳pressure advance設置，則可以為 START 和 FACTOR 選擇自定義設置。執行此操作時，請務必在每次測試打印開始時發出 TUNING_TOWER 命令。

source: Typical pressure advance values are between 0.050 and 1.000 (the high end usually only with bowden extruders). If there is no significant improvement with a pressure advance up to 1.000, then pressure advance is unlikely to improve the quality of prints. Return to a default configuration with pressure advance disabled.
es: Los valores típicos de Avance de presión se encuentran entre 0.050 y 1.000 (el extremo superior usualmente corresponde a los extrusores Bowden). Si no hay una mejora significativa con un Avance de presión al 1.000, entonces el Avance de presión es improbable que mejore la calidad de las impresiones. Retorne a la configuración por defecto con el Avance de presión deshabilitado.
ko: 일반적인 pressure advance 값은 0.050에서 1.000 사이입니다 (보우덴 압출기에서만 가장 높은 값). 최대 1.000 까지의 pressure advance 으로 유의미한 개선이 없으면 pressure advance 로 인해 인쇄 품질이 향상되지 않을 것입니다. 그러면 pressure advance 비활성화된 기본 구성으로 돌아갑니다.
zh_hant: 典型的pressure advance值在 0.050 和 1.000 之間（高端通常只有鮑登擠出機）。如果壓力推進高達 1.000 沒有顯著改善，則壓力推進不太可能提高打印質量。在禁用pressure advance的情況下返回默認配置。

source: Although this tuning exercise directly improves the quality of corners, it's worth remembering that a good pressure advance configuration also reduces ooze throughout the print.
es: Si bien este ejercicio del ajuste mejora directamente la calidad de las esquinas, vale recordar que una buena configuraciónde Avance de presión también reduce el rezumado durante toda la impresión.
ko: 이 튜닝 연습은 모서리의 품질을 직접적으로 향상시키지만 좋은 pressure advance 또한 인쇄물 전체에 노즐 흘러내림을 감소시킨다는 점에서 가치가 있습니다.
zh_hant: 雖然這種調整練習直接提高了角落的質量，但值得記住的是，良好的pressure advance配置也可以減少整個打印過程中的滲出。

source: At the completion of this test, set `pressure_advance = <calculated_value>` in the `[extruder]` section of the configuration file and issue a RESTART command. The RESTART command will clear the test state and return the acceleration and cornering speeds to their normal values.
es: En la finalización de esta prueba, establezca `pressure_advance = <valor_calculado>` en la sección `[extruder]` del archivo de configuración y envíe un comando RESTART. El comando RESTART quitará el estado de prueba y retornará la las velocidades de aceleración y esquinado a sus valores normales.
ko: 이 테스트가 완료되면 구성 파일의 `[extruder]` 섹션에서 `pressure_advance = <calculated_value>`를 설정하고 RESTART 명령을 실행합니다. RESTART 명령은 테스트 상태를 지우고 가속 및 코너링 속도를 정상 값으로 되돌립니다.
zh_hant: 完成此測試後，在配置文件的 `[extruder]` 部分中設置 `pressure_advance = <calculated_value>` 並發出 RESTART 命令。 RESTART 命令將清除測試狀態並將加速度和轉彎速度恢復到正常值。

source: Important Notes
es: Notas Importantes
ko: 중요 참고 사항
zh_hant: 重要提示

source: The pressure advance value is dependent on the extruder, the nozzle, and the filament. It is common for filament from different manufactures or with different pigments to require significantly different pressure advance values. Therefore, one should calibrate pressure advance on each printer and with each spool of filament.
es: El valor del Avance de presión es dependiente del extrusor, el rociador y el filamento. Es común que para filamentos de diferentes fabricantes o con diferentes pigmentos se requiera valores diferentes de Avance de presión. Entonces, uno debería calibrar el Avance de presión en cada impresora y cada bobina de filamento.
ko: Pressure advance 값은 extruder, 노즐 및 필라멘트에 따라 다릅니다. 다른 제조사의 필라멘트나 다른 안료의 필라멘트는 상당히 다른 pressure advance 값을 요구하는 것이 일반적입니다. 따라서 프린터와 필라멘트 가 변경되면 pressure advance을 보정해야 합니다.
zh_hant: Pressure advance值取決於擠出機、噴嘴和細絲。來自不同製造商或具有不同顏料的長絲通常需要顯著不同的pressure advance值。因此，應該校準每台打印機上的pressure advance量以及每根燈絲捲軸。

source: Printing temperature and extrusion rates can impact pressure advance. Be sure to tune the [extruder rotation_distance](Rotation_Distance.md#calibrating-rotation_distance-on-extruders) and [nozzle temperature](http://reprap.org/wiki/Triffid_Hunter%27s_Calibration_Guide#Nozzle_Temperature) prior to tuning pressure advance.
es: La temperatura de impresión y los tasas de extrusión pueden impactar el Avance de presión. Asegúrese de ajustar la [distancia de rotación (rotation_distance) del extrusor](Rotation_Distance.md#calibrating-rotation_distance-on-extruders) y la [temperatura del rociador](http://reprap.org/wiki/Triffid_Hunter%27s_Calibration_Guide#Nozzle_Temperature) antes de ajustar Avance de presión.
ko: 인쇄 온도와 압출 속도는 pressure advance 에 영향을 줄 수 있습니다. Pressure advance 를 조정하기 전에 [extruder rotation_distance](Rotation_Distance.md#calibrating-rotation_distance-on-extruders) 및 [nozzle temperature](http://reprap.org/wiki/Triffid_Hunter%27s_Calibration_Guide#Nozzle_Temperature) 를 조정해야 합니다.
zh_hant: 印刷溫度和擠出速率會影響pressure advance。請務必在調整pressure advance之前調整 [擠出機旋轉距離](Rotation_Distance.md#calibrating-rotation_distance-on-extruders) 和 [噴嘴溫度](http://reprap.org/wiki/Triffid_Hunter%27s_Calibration_Guide#Nozzle_Temperature)。

source: The test print is designed to run with a high extruder flow rate, but otherwise "normal" slicer settings. A high flow rate is obtained by using a high printing speed (eg, 100mm/s) and a coarse layer height (typically around 75% of the nozzle diameter). Other slicer settings should be similar to their defaults (eg, perimeters of 2 or 3 lines, normal retraction amount). It can be useful to set the external perimeter speed to be the same speed as the rest of the print, but it is not a requirement.
es: La prueba de impresión está designada para correr con una tasa alta de flujo de extrusor, pero con configuraciones "normales" para el rebanador. Una tasa alta de flujo se obtiene usando una velocidad alta de impresión (e.g. 100 mm/s) y una altura gruesa de capa (típicamente alrededor del 75% del diámetro del rociador). Otras configuraciones del rebanador deberían ser similar a sus valores por defect (e.g. perímetros de 2 o 3 líneas, cantidad normal de retracción). Puede ser útil el establecer la velocidad externa de perímetro a la misma velocidad que el resto de impresión, pero no es un requerimiento.
ko: 테스트 인쇄는 높은 extruder 유속으로 실행되도록 설계되었지만 그렇지 않은 경우 "normal" 슬라이서 설정입니다. 높은 인쇄 속도(예: 100mm/s) 와 coarse layer height (일반적으로 노즐 직경의 약 75%)를 사용하여 높은 유량을 얻을 수 있습니다. 다른 슬라이서 설정은 기본값과 유사해야 합니다 (예: 2 또는 3 라인의 둘레, nomal retraction amount). 외부 둘레 속도를 나머지 인쇄물과 같은 속도로 설정하는 것이 유용할 수 있지만 필수 사항은 아닙니다.
zh_hant: 測試打印設計為以高擠出機流速運行，但否則為“正常”切片機設置。通過使用高打印速度（例如，100mm/s）和粗層高度（通常約為噴嘴直徑的 75%）獲得高流速。其他切片器設置應與其默認設置相似（例如，2 或 3 行的周長，正常的縮回量）。將外部周邊速度設置為與打印的其餘部分相同的速度可能很有用，但這不是必需的。

source: It is common for the test print to show different behavior on each corner. Often the slicer will arrange to change layers at one corner which can result in that corner being significantly different from the remaining three corners. If this occurs, then ignore that corner and tune pressure advance using the other three corners. It is also common for the remaining corners to vary slightly. (This can occur due to small differences in how the printer's frame reacts to cornering in certain directions.) Try to choose a value that works well for all the remaining corners. If in doubt, prefer a lower pressure advance value.
es: Es común para la prueba de impresión el mostrar comportamientos diferentes en cada esquina. Comúnmente el rebanador dispondrá el cambio de capas en una esquina lo que puede resultar en que la misma sea significativamente diferente de las restantes tres. Si esto ocurre, entonces ignore la esquina y ajuste Avance de presión usando las otras tres esquinas. Es también común para las esquinas restantes el variar ligeramente. (Esto puede ocurrir debido a pequeñas diferencias en cómo el marco de la impresora reacciona al esquinado en determinadas direcciones.) Intente elegir un valor que funcione bien para todas las restantes esquinas. En la duda, prefiera un valor menor de Avance de presión.
ko: 테스트 인쇄는 각 모서리에서 다른 동작을 보이는 것이 일반적입니다. 종종 슬라이서는 한 모서리에서 레이어를 변경하도록 정렬하여 해당 모서리가 나머지 세 모서리와 크게 다를 수 있습니다. (제봉선 설정) 이 경우 해당 모서리를 무시하고 다른 세 모서리를 사용하여 pressure advance 을 조정하십시오. 나머지 모서리도 약간씩 달라지는 것이 일반적입니다. (이는 특정 방향의 코너링에 프린터 프레임이 반응하는 방식의 작은 차이로 인해 발생할 수 있습니다.) 나머지 모든 모서리에 잘 맞는 값을 선택하십시오. 확실하지 않은 경우 더 낮은 pressure advance 값을 선택하십시오.
zh_hant: 測試打印在每個角落顯示不同的行為是很常見的。通常，切片器會安排在一個角落更改圖層，這可能導致該角落與其餘三個角落明顯不同。如果發生這種情況，則忽略該角並使用其他三個角調整壓力推進。其餘的角也有輕微的變化也是很常見的。 （這可能是由於打印機框架對某些方向的拐角的反應存在微小差異。）嘗試選擇一個適用於所有剩餘拐角的值。如果有疑問，請選擇較低的pressure advance值。

source: If a high pressure advance value (eg, over 0.200) is used then one may find that the extruder skips when returning to the printer's normal acceleration. The pressure advance system accounts for pressure by pushing in extra filament during acceleration and retracting that filament during deceleration. With a high acceleration and high pressure advance the extruder may not have enough torque to push the required filament. If this occurs, either use a lower acceleration value or disable pressure advance.
es: Si un valor alto de Avance de presión (e.g. sobre 0.200) es usado, entonces uno puede encontrar que el extrusor omite cuando retorna a la aceleración normal de la impresora. El sistema de Avance de presión considera la presión mediante un empuje extra del filamentos durante la aceleración y retractando ese filamento durante la desaceleración. Con una alta aceleración y con un alto Avance de presión el extrusor puede no tener suficiente esfuerzo de torsión (torque) para empujar el filamento requerido. Si esto ocurre, o bien use un valor más bajo de aceleración o desactive el Avance de presión.
ko: 높은 pressure advance 값(예: 0.200 이상)이 사용되면 프린터의 정상 가속으로 돌아갈 때 익스트루더가 탈조되는 것을 발견할 수 있습니다. 높은 가속도와 높은 pressure advance 으로 익스트루더는 필요한 필라멘트를 밀어내기에 충분한 토크가 부족할 수 있습니다. 이 경우 더 낮은 가속 값을 사용하거나 pressure advance 을 비활성화하십시오.
zh_hant: 如果使用高壓提前值（例如，超過 0.200），則可能會發現擠出機在返回到打印機的正常加速度時會跳動。壓力推進系統通過在加速期間推入額外的燈絲並在減速期間縮回該燈絲來解釋壓力。在高加速度和高壓推進下，擠出機可能沒有足夠的扭矩來推動所需的長絲。如果發生這種情況，請使用較低的加速度值或禁用pressure advance。

source: Once pressure advance is tuned in Klipper, it may still be useful to configure a small retract value in the slicer (eg, 0.75mm) and to utilize the slicer's "wipe on retract option" if available. These slicer settings may help counteract ooze caused by filament cohesion (filament pulled out of the nozzle due to the stickiness of the plastic). It is recommended to disable the slicer's "z-lift on retract" option.
es: Una vez que el Avance de presión ha sido ajustado en Klipper, puede ser todavía útil el configurar un valor pequeño de retracción en el rebanador (e.g. 0.75 mm) y el utilizar la opción de "limpiar cuando se retrae" si está disponible. Esas configuraciones de rebanador puede ayudar a contrarrestar el rezumando causado por la cohesión del filamento (el filamento se ha salido del rociador debido a lo pegajoso del plástico). Se recomienda el deshabilitar la opción de "subir-z cuando se retrae".
ko: Klipper에서 pressure advance 이 튜닝 되면 슬라이서에서 small retract 값(예: 0.75mm) 을 구성하고 가능한 경우 슬라이서의 "wipe on retract option" 을 활용하는 것이 여전히 유용할 수 있습니다. 이러한 슬라이서 설정은 필라멘트 응고 (플라스틱의 끈적거림으로 인해 노즐에서 필라멘트가 빠져나옴) 으로 인한 스며나오는 것을 방지하는 데 도움이 될 수 있습니다. 슬라이서의 "z-lift on retract" 옵션을 비활성화하는 것이 좋습니다.
zh_hant: 一旦在 Klipper 中調整了pressure advance，在切片器中配置一個小的縮回值（例如 0.75 毫米）並使用切片器的“縮回時擦除選項”（如果可用）可能仍然有用。這些切片器設置可能有助於抵消由細絲內聚（由於塑料的粘性而從噴嘴中拉出細絲）引起的滲出。建議禁用切片器的“縮回時的 z-lift”選項。

source: The pressure advance system does not change the timing or path of the toolhead. A print with pressure advance enabled will take the same amount of time as a print without pressure advance. Pressure advance also does not change the total amount of filament extruded during a print. Pressure advance results in extra extruder movement during move acceleration and deceleration. A very high pressure advance setting will result in a very large amount of extruder movement during acceleration and deceleration, and no configuration setting places a limit on the amount of that movement.
es: El sistema de Avance de presión no cambia el tiempo o camino del cabezal. Una impresión con el Avance de presión habilitado tomará la misma cantidad de tiempo que una sin la misma. El Avance de presión también no cambia la cantidad total del filamento extrudido durante una impresión. El Avance de presión produce un movimiento extra del extrusor durante la aceleración y desaceleración. Una configuración muy alta de Avance de presión resultará en una muy grande cantidad de movimiento del extrusor durante la aceleración y desaceleración, y ninguna opción de configuración pone un límite sobre la cantidad de ese movimiento.
ko: Pressure advance 시스템은 툴 헤드의 타이밍이나 경로를 변경하지 않습니다. pressure advance 가 활성화된 인쇄는 pressure advance 이 없는 인쇄와 같은 시간이 걸립니다. pressure advance 은 또한 인쇄 중에 압출되는 필라멘트의 총량을 변경하지 않습니다. pressure advance 로 인해 이동 가속 및 감속 중에 익스트루더가 추가로 이동합니다. 매우 높은 pressure advance 설정은 가속 및 감속 중에 매우 많은 양의 압출기 이동을 초래하며 구성 설정은 해당 이동량에 제한을 두지 않습니다.
zh_hant: 壓力推進系統不會改變工具頭的時間或路徑。啟用壓力推進的打印將花費與沒有壓力推進的打印相同的時間。pressure advance也不會改變打印過程中擠出的長絲總量。在移動加速和減速過程中，pressure advance會導致額外的擠出機移動。非常高的pressure advance設置將導致擠出機在加速和減速過程中移動非常大，並且沒有配置設置對移動量進行限制。

source: Pressure advance
es: Avance de presión
