Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Probe_Calibrate.po
Languages: hu, zh_hans

source: Calibrating probe X and Y offsets
hu: A szonda X és Y eltolásának kalibrálása
zh_hans: 探针X/Y偏移校准

source: To calibrate the X and Y offset, navigate to the OctoPrint "Control" tab, home the printer, and then use the OctoPrint jogging buttons to move the head to a position near the center of the bed.
hu: Az X és Y eltolás kalibrálásához navigáljon az OctoPrint "Control" fülre, állítsa be a nyomtatót, majd az OctoPrint léptető gombjaival mozgassa a fejet az ágy közepéhez közeli pozícióba.
zh_hans: 为校正X、Y偏移值，首先打开OctoPrint中的“控制（control）”子页面，进行三轴的归零，然后用OctoPrint内的手调按钮将喷嘴移动到热床的中央位置。

source: Place a piece of blue painters tape (or similar) on the bed underneath the probe. Navigate to the OctoPrint "Terminal" tab and issue a PROBE command:
hu: Helyezzen egy darab kék festőszalagot (vagy hasonlót) az ágyra a szonda alá. Navigáljon az OctoPrint "Terminal" fülre, és adjon ki egy PROBE parancsot:
zh_hans: 探针下方的热床上贴上一片美纹纸（或类似的薄片）。转到OctoPrint的“命令行（Terminal）”子页，输入PROBE 命令并回车：

source: Place a mark on the tape directly under where the probe is (or use a similar method to note the location on the bed).
hu: Helyezzen egy jelet a szalagra közvetlenül a szonda alatt (vagy hasonló módszerrel jegyezze fel a helyet az ágyon).
zh_hans: 在探针正下方的美纹纸上，用记号笔标注探针触发的位置（或使用其他方法记录下探针触发时的物理位置）。

source: Issue a `GET_POSITION` command and record the toolhead XY location reported by that command. For example if one sees:
hu: Adjon ki egy `GET_POSITION` parancsot, és rögzítse a parancs által jelentett szerszámfej X-Y pozícióját. Például, ha a következőket látjuk:
zh_hans: 在命令行中输入`GET_POSITION`命令，回车，记录下此时打印头的XY位置。输出如下：

source: then one would record a probe X position of 46.5 and probe Y position of 27.
hu: akkor a szonda X pozíciója 46,5 és Y pozíciója 27.
zh_hans: 此时，我们可以知道探针触发的X坐标为46.5，Y坐标为27。

source: After recording the probe position, issue a series of G1 commands until the nozzle is directly above the mark on the bed. For example, one might issue:
hu: A szonda pozíciójának rögzítése után adjon ki egy sor G1 parancsot, amíg a fúvóka közvetlenül az ágyon lévő jelölés fölé nem kerül. Például a következőket:
zh_hans: 记录下上述的坐标后，在命令行使用一系列的 G1 命令，使喷嘴移动到热床的记号的正上方。例如：

source: to move the nozzle to an X position of 57 and Y of 30. Once one finds the position directly above the mark, use the `GET_POSITION` command to report that position. This is the nozzle position.
hu: a fúvóka 57-es X-pozícióba és 30-as Y-pozícióba történő mozgatásához. Ha megtaláltuk a közvetlenül a jelölés feletti pozíciót, a `GET_POSITION` paranccsal jelenthetjük ezt a pozíciót. Ez a fúvóka pozíciója.
zh_hans: 将喷嘴移动到X 57， Y 30上。当喷嘴的位置刚好位于几号上时，在命令行键入 `GET_POSITION` 获得此时喷嘴所在的坐标。

source: The x_offset is then the `nozzle_x_position - probe_x_position` and y_offset is similarly the `nozzle_y_position - probe_y_position`. Update the printer.cfg file with the given values, remove the tape/marks from the bed, and then issue a `RESTART` command so that the new values take effect.
hu: Az x_offset ekkor a `nozzle_x_position - probe_x_position` és az y_offset hasonlóan a `nozzle_y_position - probe_y_position`. Frissítse a printer.cfg fájlt a megadott értékekkel, távolítsa el a szalagot/jeleket az ágyról, majd adjon ki egy `RESTART` parancsot, hogy az új értékek hatályba lépjenek.
zh_hans: X偏移值为 `喷嘴X坐标值 - 探针X坐标值`， 类似地， Y偏移值为 `喷嘴Y坐标值 - 探针Y坐标值`。将上述数值更新到printer.cfg文件内，掀掉热床上的美纹纸/胶带，并重启Klipper以使设置生效。

source: Calibrating probe Z offset
hu: A szonda Z eltolás kalibrálása
zh_hans: 探针Z偏移值校准

source: Providing an accurate probe z_offset is critical to obtaining high quality prints. The z_offset is the distance between the nozzle and bed when the probe triggers. The Klipper `PROBE_CALIBRATE` tool can be used to obtain this value - it will run an automatic probe to measure the probe's Z trigger position and then start a manual probe to obtain the nozzle Z height. The probe z_offset will then be calculated from these measurements.
hu: A pontos z_offset beállítása kritikus fontos a jó minőségű nyomatok előállításához. A z_offset a fúvóka és az ágy közötti távolság, amikor a szonda működésbe lép. A Klipper `PROBE_CALIBRATE` eszköz használható ennek az értéknek a meghatározására - ez egy automatikus szondát futtat a szonda Z kioldási pozíciójának mérésére, majd egy kézi szondát indít a fúvóka Z magasságának meghatározására. A szonda z_offset értékét ezután ezekből a mérésekből számítja ki.
zh_hans: 准确的探针 z 偏移(z_offset)是高质量打印的基础。z 偏移是探针触发时探针和喷嘴之间的高度差。Klipper 中的 `PROBE_CALIBRATE`（探针校准）工具可用于测量这个值——首先，该工具会运行一次自动探测以获取探针的 z 触发位置，然后需要手动调整Z坐标以获取喷嘴碰触到热床时的 z 高度。然后将根据这些测量值计算探针的 z 偏移。

source: Start by homing the printer and then move the head to a position near the center of the bed. Navigate to the OctoPrint terminal tab and run the `PROBE_CALIBRATE` command to start the tool.
hu: Kezdje a nyomtató alaphelyzetbe állításával, majd mozgassa a fejet az ágy közepéhez közeli pozícióba. Navigáljon az OctoPrint terminál fülre, és futtassa a `PROBE_CALIBRATE` parancsot az eszköz indításához.
zh_hans: 首先进行三轴的归零，然后将喷嘴移动到热床的中央位置。转到OctoPrint的“命令行（Terminal）”子页，输入 `PROBE_CALIBRATE`以启动z_offset校准工具。

source: This tool will perform an automatic probe, then lift the head, move the nozzle over the location of the probe point, and start the manual probe tool. If the nozzle does not move to a position above the automatic probe point, then `ABORT` the manual probe tool and perform the XY probe offset calibration described above.
hu: Ez az eszköz automatikus mérést hajt végre, majd felemeli a fejet, mozgatja a fúvókát a mérőpont helye fölé, és elindítja a kézi mérést. Ha a fúvóka nem mozdul el az automatikus mérőpont feletti pozícióba, akkor `ABORT` a kézi mérőeszközzel, hajtsa végre a fent leírt X-Y szondaeltolás kalibrálását.
zh_hans: 工具首先会令探针进行一次自动探测，获取触发探针的z位置，之后，控制喷嘴上升，并将喷嘴的X/Y位置移动到探针对应位置上，并开始手动调平流程。如果喷嘴没有移动到探针进行自动探测的位置，输入`ABORT`以停止手动调平，并上文根据X、y偏移校准流程进行探针X、Y校准。

source: Once the manual probe tool starts, follow the steps described at ["the paper test"](Bed_Level.md#the-paper-test)) to determine the actual distance between the nozzle and bed at the given location. Once those steps are complete one can `ACCEPT` the position and save the results to the config file with:
hu: Miután a kézi mérő eszköz elindult, kövesse a ["a papírteszt"](Bed_Level.md#the-paper-test)] pontban leírt lépéseket a fúvóka és az ágy közötti tényleges távolság meghatározásához az adott helyen. Ha ezek a lépések befejeződtek, akkor `ACCEPT` a pozíció és elmentheti az eredményeket a config fájlba a következővel:
zh_hans: 进入手动调平的过程后，请按照[“纸片测试”](Bed_Level.md#the-paper-test)的流程，确定在探针探测位置上，喷嘴与热床之间的距离。完成上述流程后，使用`ACCEPT`命令将测量到的z_offset应用到当前配置，如需要保存配置到文件，则键入：

source: Note that if a change is made to the printer's motion system, hotend position, or probe location then it will invalidate the results of PROBE_CALIBRATE.
hu: Vegye figyelembe, hogy ha a nyomtató mozgásrendszerét, a nyomtatófej pozícióját vagy a szonda helyét megváltoztatja, az érvényteleníti a PROBE_CALIBRATE eredményeit.
zh_hans: 注意！如果修改了打印机的运动系统、喷嘴位置或探针位置中的任意一项，PROBE_CALIBRATE的结果将会需要重新测量。

source: If the probe has an X or Y offset and the bed tilt is changed (eg, by adjusting bed screws, running DELTA_CALIBRATE, running Z_TILT_ADJUST, running QUAD_GANTRY_LEVEL, or similar) then it will invalidate the results of PROBE_CALIBRATE. After making any of the above adjustments it will be necessary to run PROBE_CALIBRATE again.
hu: Ha a szonda X vagy Y eltolással rendelkezik, és az ágy dőlése megváltozik (pl. szintezőcsavarok beállításával, DELTA_CALIBRATE futtatásával, Z_TILT_ADJUST futtatásával, QUAD_GANTRY_LEVEL futtatásával vagy hasonlóval), akkor ez érvényteleníti a PROBE_CALIBRATE eredményeit. A fenti beállítások bármelyikének módosítása után újra kell kezdeni a PROBE_CALIBRATE futtatását.
zh_hans: 如果探针的物理X、Y偏移量，或热床的倾斜度发生变化（如 调整了热床调平螺母，进行DELTA_CALIBRATE，进行Z_TILT_ADJUST，进行QUAD_GANTRY_LEVEL或其他行为），也应进行一次PROBE_CALiRATE。

source: If the results of PROBE_CALIBRATE are invalidated, then any previous [bed mesh](Bed_Mesh.md) results that were obtained using the probe are also invalidated - it will be necessary to rerun BED_MESH_CALIBRATE after recalibrating the probe.
hu: Ha a PROBE_CALIBRATE eredményei érvénytelenek, akkor a szondával kapott korábbi [ágyháló](Bed_Mesh.md) eredmények is érvénytelenek. A szonda újrakalibrálása után újra kell futtatni a BED_MESH_CALIBRATE programot.
zh_hans: 上述使PROBE_CALIBRATE结果失效的行为，同样会使使用探针测量的[床网](Bed_Mesh.md)结果失效。推荐在完成PROBE_CALIBRATE后再进行一次BED_MESH_CALIBRATE。

source: Repeatability check
hu: Ismételt mérési teszt
zh_hans: 重复性测试

source: After calibrating the probe X, Y, and Z offsets it is a good idea to verify that the probe provides repeatable results. Start by homing the printer and then move the head to a position near the center of the bed. Navigate to the OctoPrint terminal tab and run the `PROBE_ACCURACY` command.
hu: A szonda X, Y és Z eltolásának kalibrálása után érdemes ellenőrizni, hogy a szonda megismételhető mérési eredményeket szolgáltat-e. Kezdje a nyomtató alaphelyzetbe állításával, majd mozgassa a fejet az ágy közepéhez közeli pozícióba. Navigáljon az OctoPrint terminál fülre, és futtassa a `PROBE_ACCURACY` parancsot.
zh_hans: 在完成探针的X、Y、Z偏移的校准后，推荐进行探针的重复性测试。首先对打印机进行三周归零，然后将喷嘴移动到热床的中央位置。进入OctoPrint的命令行界面，执行`PROBE_ACCURACY`命令。

source: This command will run the probe ten times and produce output similar to the following:
hu: Ez a parancs tízszer futtatja le a mérést, és az alábbiakhoz hasonló kimenetet ad:
zh_hans: 该命令会就地进行10次探针测量，并输出类似下方的结果：

source: Ideally the tool will report an identical maximum and minimum value. (That is, ideally the probe obtains an identical result on all ten probes.) However, it's normal for the minimum and maximum values to differ by one Z "step distance" or up to 5 microns (.005mm). A "step distance" is `rotation_distance/(full_steps_per_rotation*microsteps)`. The distance between the minimum and the maximum value is called the range. So, in the above example, since the printer uses a Z step distance of .0125, a range of 0.012500 would be considered normal.
hu: Ideális esetben az eszköz azonos maximális és minimális értéket mutat. (Vagyis ideális esetben a szonda mind a tíz mérésen azonos eredményt ad.) Azonban normális, hogy a minimális és maximális értékek egy Z "lépésköz" vagy akár 5 mikron (.005 mm) eltéréssel különböznek. A "lépésköz" `rotation_distance/(full_steps_per_rotation*microsteps)`. A minimális és a maximális érték közötti távolságot nevezzük tartománynak. Tehát a fenti példában, mivel a nyomtató 0,0125 Z-lépéstávolságot használ, a 0,01252500 tartományt tekintjük normálisnak.
zh_hans: 理想状况下，使用探针测量的所有结果应该一致（也就是10次测量的结果为同一值）。然而，测量结果的最大值和最小值之间差距 “一个z电机步长”或5微米，也是正常的情况。一个“电机步长”是`旋转一周的长度/(旋转一周需要的步数*驱动微步设置)`。测量最大值和最小值的差值称为偏差范围。故在上述的例子中，因为打印机的z步长为0.0125，因此误差范围在0.012500mm可以认为是正常值。

source: If new probe speed, samples count, or other settings are needed, then update the printer.cfg file and issue a `RESTART` command. If so, it is a good idea to [calibrate the z_offset](#calibrating-probe-z-offset) again. If repeatable results can not be obtained then don't use the probe for bed leveling. Klipper has several manual probing tools that can be used instead - see the [Bed Level document](Bed_Level.md) for further details.
hu: Ha új mérési sebességre, mérésszámra vagy egyéb beállításokra van szükség, akkor frissítse a printer.cfg fájlt, és adjon ki egy `RESTART` parancsot. Ha igen, akkor érdemes újra [kalibrálni a z_offsetet](#calibrating-probe-z-offset). Ha nem kap ismétlődő eredményeket, akkor ne használja a szondát ágy szintezésére. A Klipper számos kézi mérőeszközzel rendelkezik, amelyek helyette használhatók - további részletekért lásd a [Ágy szintezése dokumentumot](Bed_Level.md).
zh_hans: 要更改探针测试速度，重复采样或其他设置，应在修改printer.cfg使用`RESTART`命令以应用修改值。推荐在使用新设置值后再进行一次[Z偏移校准](#calibrating-probe-z-offset)。如果重复性测试结论不能接受，建议不要使用自动热床调平功能。Klipper提供了数种手动调平的工具，详情请见[打印床调平](Bed_Level.md)。

source: Location Bias Check
hu: Elhelyezkedés ellenőrzése
zh_hans: 局部偏差确定

source: Some probes can have a systemic bias that corrupts the results of the probe at certain toolhead locations. For example, if the probe mount tilts slightly when moving along the Y axis then it could result in the probe reporting biased results at different Y positions.
hu: Egyes szondák rendszerszintű torzítással rendelkezhetnek, amely bizonyos szerszámfejhelyeken elrontja a mérés eredményeit. Például, ha a szonda tartója az Y tengely mentén történő mozgás közben kissé megdől, akkor ez azt eredményezheti, hogy a szonda különböző Y pozíciókban torz eredményeket ad ki.
zh_hans: 一些探针可能具有与位置相关的系统性偏差。比如，由于探针安装失误，探针沿Y轴移动会产生倾斜，那么探针在沿Y轴进行测量得出的结果会存在偏差。

source: This is a common issue with probes on delta printers, however it can occur on all printers.
hu: Ez egy gyakori probléma a delta nyomtatók szondáinál, de más nyomtatónál is előfordulhat.
zh_hans: 上述状况往往出现在三角洲打印机上，然而，所有打印机均有可能发生上述状况。

source: One can check for a location bias by using the `PROBE_CALIBRATE` command to measuring the probe z_offset at various X and Y locations. Ideally, the probe z_offset would be a constant value at every printer location.
hu: A helyeltolódás ellenőrzése a `PROBE_CALIBRATE` parancs segítségével történhet a szonda z_offsetjének mérésével különböző X és Y helyeken. Ideális esetben a szonda z_offset értéke minden pozícióban állandó.
zh_hans: 我们可以在不同的XY位置上使用`PROBE_CALIBRATE`命令测量z_offset来确定位置偏差。理想情况下，z_offset在任意位置均为同一读值。

source: For delta printers, try measuring the z_offset at a position near the A tower, at a position near the B tower, and at a position near the C tower. For cartesian, corexy, and similar printers, try measuring the z_offset at positions near the four corners of the bed.
hu: A deltanyomtatók esetében próbálja meg a z_offset mérését az A, a B, és a C torony közelében is. Cartesian, corexy és hasonló nyomtatók esetében próbálja meg a z_offsetet az ágy négy sarkának közelében lévő pozíciókban mérni.
zh_hans: 对于三角洲打印机，请尝试依次在靠近A柱、B柱和C柱的位置测量z_offset。对于龙门、corexy或类似结构打印机，尝试在热床的四个角进行z_offset的测量。

source: Before starting this test, first calibrate the probe X, Y, and Z offsets as described at the beginning of this document. Then home the printer and navigate to the first XY position. Follow the steps at [calibrating probe Z offset](#calibrating-probe-z-offset) to run the `PROBE_CALIBRATE` command, `TESTZ` commands, and `ACCEPT` command, but do not run `SAVE_CONFIG`. Note the reported z_offset found. Then navigate to the other XY positions, repeat these `PROBE_CALIBRATE` steps, and note the reported z_offset.
hu: A vizsgálat megkezdése előtt először kalibrálja a szonda X-, Y- és Z-eltolódását a dokumentum elején leírtak szerint. Ezután állítsa be a nyomtatót, és navigáljon az első X-Y pozícióba. A `PROBE_CALIBRATE` parancs futtatásához kövesse a [calibrating probe Z offset](#calibrating-probe-z-offset) pontban leírt lépéseket, `TESTZ` parancsot, és az `ACCEPT` parancsot, de ne futtassa a `SAVE_CONFIG` parancsot. Figyeljük meg a talált z_offset értéket. Ezután navigáljon a többi X-Y pozícióhoz, ismételje meg ezeket a `PROBE_CALIBRATE` lépéseket, és jegyezze fel a mért z_offsetet.
zh_hans: 在进行上述测试前，应先按照本文档的开头部分对X、Y、Z的偏移值进行校准，然后对打印机进行归零，并将探针移动到首个目标XY位置。按照[探针Z偏移值校准](#探针Z偏移值校准)的步骤，运行`PROBE_CALIBRATE`，重复多次`TESTZ`命令，并在喷嘴触床时使用 `ACCEPT`命令，但是**切勿使用 `SAVE_CONFIG`**。手动记下此时的z_offset 。之后将探针移动到其他XY位置，重复上述的`PROBE_CALIBRATE`步骤，并分别记下z_offset。

source: If the difference between the minimum reported z_offset and the maximum reported z_offset is greater than 25 microns (.025mm) then the probe is not suitable for typical bed leveling procedures. See the [Bed Level document](Bed_Level.md) for manual probe alternatives.
hu: Ha a minimálisan és a maximálisan jelentett z_offset közötti különbség nagyobb, mint 25 mikron (.025 mm), akkor a szonda nem alkalmas a tipikus ágyszintezési műveletekre. A kézi mérési alternatívákat lásd az [Ágy szintezése dokumentumban](Bed_Level.md).
zh_hans: 如果上述方法中测出的最大z_offset 和最小z_offset 之间的差值大于25微米（.025mm），则该探针不适用于常规的热床调平。此时应参照 [热床调平](Bed_Level.md) 文档的手动调平部分进行调平。

source: Temperature Bias
hu: Hőmérséklet torzítás
zh_hans: 温度偏差

source: Many probes have a systemic bias when probing at different temperatures. For example, the probe may consistently trigger at a lower height when the probe is at a higher temperature.
hu: Sok szondának van egy rendszerszintű torzítása, amikor különböző hőmérsékleten mérnek. Például a szonda következetesen alacsonyabb magasságban mérhet a magasabb hőmérséklet következtében.
zh_hans: 对于多种形式的探针，在不同的温度下工作均具有一定的系统性偏差。比如，在高温下，探针可能总是在更低的高度下触发。

source: It is recommended to run the bed leveling tools at a consistent temperature to account for this bias. For example, either always run the tools when the printer is at room temperature, or always run the tools after the printer has obtained a consistent print temperature. In either case, it is a good idea to wait several minutes after the desired temperature is reached, so that the printer apparatus is consistently at the desired temperature.
hu: Javasoljuk, hogy az ágy szintező szerszámokat állandó hőmérsékleten működtesse, hogy figyelembe vegyék ezt a torzítást. Vagy szobahőmérsékleten szintezzen, vagy szintezzen miután a nyomtató elérte a nyomtatási hőmérsékletet. Mindkét esetben érdemes néhány percet várni a kívánt hőmérséklet elérése után, hogy a berendezés folyamatosan a kívánt hőmérsékleten legyen.
zh_hans: 针对这种偏差，建议在恒定的温度下进行热床调平。即，要么总是在室温下进行床网测量，要么总要在工作温度下进行。无论采取哪种方案，都推荐在达到目标温度数分钟后再进行测量，以便打印机始终处于目标温度。

source: To check for a temperature bias, start with the printer at room temperature and then home the printer, move the head to a position near the center of the bed, and run the `PROBE_ACCURACY` command. Note the results. Then, without homing or disabling the stepper motors, heat the printer nozzle and bed to printing temperature, and run the `PROBE_ACCURACY` command again. Ideally, the command will report identical results. As above, if the probe does have a temperature bias then be careful to always use the probe at a consistent temperature.
hu: A hőmérsékleti torzítás ellenőrzéséhez kezdje szobahőmérsékleten, majd állítsa be a nyomtatót. Mozgassa a fejet az ágy közepéhez közeli pozícióba, és futtassa a `PROBE_ACCURACY` parancsot. Figyelje meg az eredményeket. Ezután a léptetőmotorok kezdőpont felvétele vagy kikapcsolása nélkül melegítse fel a nyomtató fúvókáját és ágyát nyomtatási hőmérsékletre, és futtassa le ismét a `PROBE_ACCURACY` parancsot. Ideális esetben a parancs azonos eredményeket fog mutatni. A fentiekhez hasonlóan, ha a szondának valóban van hőmérsékleti torzítása, akkor ügyeljen arra, hogy mindig egyenletes hőmérsékleten használja méréskor.
zh_hans: 要测量温度偏差，首先确保打印机处于室温，对三轴进行归零，然后将打印头移动到热床中央，运行`PROBE_ACCURACY`命令。记下此时的读数。之后，在不归零或关闭电机的情况下，加热喷嘴和热床到工作温度，并再次运行`PROBE_ACCURACY`。理想情况下，两次探针测量会得出相同的结果。但若温度偏差存在，建议每次达到工作温度后再进行测量。

source: Probe calibration
hu: Szonda kalibrálása
zh_hans: 探针校准

source: This document describes the method for calibrating the X, Y, and Z offsets of an "automatic z probe" in Klipper. This is useful for users that have a `[probe]` or `[bltouch]` section in their config file.
hu: Ez a dokumentum a Klipperben található "automatikus z szonda" X, Y és Z eltolásának kalibrálási módszerét írja le. Ez azon felhasználók számára hasznos, akiknek van egy `[probe]` vagy `[bltouch]` szakasz a konfigurációs fájljukban.

source: If the results of the test show a range value that is greater than 25 microns (.025mm) then the probe does not have sufficient accuracy for typical bed leveling procedures. It may be possible to tune the probe speed and/or probe start height to improve the repeatability of the probe. The `PROBE_ACCURACY` command allows one to run tests with different parameters to see their impact - see the [G-Codes document](G-Codes.md#probe_accuracy) for further details. If the probe generally obtains repeatable results but has an occasional outlier, then it may be possible to account for that by using multiple samples on each probe - read the description of the probe `samples` config parameters in the [config reference](Config_Reference.md#probe) for more details.
hu: Ha a teszt eredménye 25 mikronnál (0,025 mm-nél) nagyobb tartományértéket mutat, akkor a szonda nem elég pontos a tipikus szintezési eljárásokhoz. Lehetséges a szonda sebességének és/vagy indulási magasságának hangolása a mérés ismételhetőségének javítása érdekében. A `PROBE_ACCURACY` parancs lehetővé teszi a tesztek futtatását különböző paraméterekkel, hogy lássa a hatásukat. További részletekért lásd a [G-Kódok dokumentumot](G-Codes.md#probe_accuracy). Ha a szonda általában egyforma eredményeket ad, de időnként előfordulnak kiugró értékek, akkor ezt úgy lehet kiküszöbölni, hogy minden egyes mérőponton több mérést hajtunk végre. Olvassa el a szonda `samples` konfigurációs paramétereinek leírását a [config hivatkozásban ](Config_Reference.md#probe) további részletekért.

source: This document describes the method for calibrating the x, y, and z offsets of an "automatic z probe" in Klipper. This is useful for users that have a `[probe]` or `[bltouch]` section in their config file.
zh_hans: 该文档介绍了如何在 Klipper 中校准自动 z 探针x，y 和 z 偏移。依据本文，用户可以简单地完成 ` [probe] ` 或 ` [bltouch] ` 段落的配置。

source: If the results of the test show a range value that is greater than 25 microns (.025mm) then the probe does not have sufficient accuracy for typical bed leveling procedures. It may be possible to tune the probe speed and/or probe start height to improve the repeatability of the probe. The `PROBE_ACCURACY` command allows one to run tests with different parameters to see their impact - see the [G-Codes document](G-Codes.md) for further details. If the probe generally obtains repeatable results but has an occasional outlier, then it may be possible to account for that by using multiple samples on each probe - read the description of the probe `samples` config parameters in the [config reference](Config_Reference.md#probe) for more details.
zh_hans: 如果测量的结果显示误差范围大于25微米（0.025mm），受测的探针则不能满足热床调平的要求。通过调整探针测试的速度和/或探针测试的起始高度，有可能获得更佳的可重复性。`PROBE_ACCURACY`命令允许用户以不同的条件进行测试，详情参考[G代码文档](G-Codes.md)。如果探针在多次测量中偶发性出现大偏差的读值，可以通过单点多次测量功能抑制偶发偏差，详情参考[配置参考](Config_Reference.md#probe)中探针`samples`部分。
