Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Protocol.po
Languages: fr, hu, it, ko, zh_hans

source: If the first example, the DECL_ENUMERATION() macro defines an enumeration for any command/response message with a parameter name of "spi_bus" or parameter name with a suffix of "_spi_bus". For those parameters the string "spi" is a valid value and it will be transmitted with an integer value of zero.
fr: Dans le premier exemple, la macro DECL_ENUMERATION() définit une énumération pour les messages de commande/réponse avec un nom de paramètre "spi_bus" ou un nom de paramètre avec un suffixe "_spi_bus". Pour ces paramètres, la chaîne "spi" sera une valeur valide et elle sera transmise comme une valeur entière égale à zéro.
hu: Ha az első példában a DECL_ENUMERATION() makró felsorolást definiál minden olyan parancs/válasz üzenethez, amelynek paraméterneve "spi_bus" vagy "_spi_bus" utótaggal rendelkezik. E paraméterek esetében az "SPI" karakterlánc érvényes érték, és nullás egész számértékkel kerül továbbításra.
it: Se il primo esempio, la macro DECL_ENUMERATION() definisce un'enumerazione per qualsiasi messaggio di comando/risposta con nome parametro "spi_bus" o nome parametro con suffisso "_spi_bus". Per quei parametri la stringa "spi" è un valore valido e verrà trasmessa con un valore intero pari a zero.
ko: 첫 번째 예의 경우 DECL_ENUMERATION() 매크로는 매개변수 이름이 "spi_bus"이 거나 접미사가 "\_spi_bus" 인 매개변수 이름이 있는 명령/응답 메시지에 대한 열거를 정의합니다. 이러한 매개변수의 경우 문자열 "spi"는 유효한 값이며 정수 값 0 으로 전송됩니다.
zh_hans: 在第一个例子中，DECL_ENUMERATION()宏定义了一个枚举量可以用于任意的命令/响应消息，这个枚举量的参数名称为 "spi_bus "或参数名称后缀为"_spi_bus "。对于此参数，字符串 "spi "是一个有效的值，它将以一个零的整数值被传递。

source: It's also possible to declare an enumeration range. In the second example, a "pin" parameter (or any parameter with a suffix of "_pin") would accept PC0, PC1, PC2, ..., PC7 as valid values. The strings will be transmitted with integers 16, 17, 18, ..., 23.
fr: Il est également possible de déclarer une plage d'énumération. Dans le deuxième exemple, un paramètre "pin" (ou tout paramètre avec le suffixe "_pin") accepterait PC0, PC1, PC2, ..., PC7 comme valeurs valides. Les chaînes seront transmises comme des entiers 16, 17, 18, ..., 23.
hu: Lehetőség van felsorolási tartomány kijelölésére is. A második példában egy "pin" paraméter (vagy bármely paraméter, amelynek utótagja "_pin") elfogadná a PC0, PC1, PC2, ..., PC7 értékeket. A karakterláncokat a 16, 17, 18, ..., ..., 23 egész számokkal kell továbbítani.
it: È anche possibile dichiarare un intervallo di enumerazione. Nel secondo esempio, un parametro "pin" (o qualsiasi parametro con suffisso "_pin") accetterebbe PC0, PC1, PC2, ..., PC7 come valori validi. Le stringhe verranno trasmesse con numeri interi 16, 17, 18, ..., 23.
ko: 열거 범위를 선언하는 것도 가능합니다. 두 번째 예에서 "pin" 매개변수 (또는 "\_pin" 접미사가 있는 매개변수) 는 PC0, PC1, PC2, ..., PC7 을 유효한 값으로 허용합니다. 문자열은 정수 16, 17, 18, ..., 23으로 전송됩니다.
zh_hans: 也可以声明一个枚举范围。在第二个例子中，"pin "参数（或任何后缀为"_pin "的参数）将接受PC0、PC1、PC2、...、PC7作为有效值。字符串将被转化成整数16、17、18...23进行传输。

source: Declaring constants
fr: Déclaration de constantes
hu: Állandók deklarálása
it: Dichiarazione di costanti
ko: 상수 선언
zh_hans: 声明常量

source: Constants can also be exported. For example, the following:
fr: Les constantes peuvent être exportées. Par exemple, les éléments suivants :
hu: A konstansok is exportálhatók. Például a következőképp:
it: Le costanti possono anche essere esportate. Ad esempio, quanto segue:
ko: 상수도 내보낼 수 있습니다. 예를 들면 다음과 같습니다:
zh_hans: 常量也可以被导出。例子如下：

source: would export a constant named "SERIAL_BAUD" with a value of 250000 from the micro-controller to the host. It is also possible to declare a constant that is a string - for example:
fr: exporterait une constante nommée "SERIAL_BAUD" avec une valeur de 250000 du microcontrôleur vers l'hôte. Il est également possible de déclarer une constante de type chaîne - par exemple :
hu: egy "SERIAL_BAUD" nevű, 250000 értékű konstanst exportálna a mikrokontrollerből a gazdagépre. Lehetőség van olyan konstans deklarálására is, amely egy karakterlánc - például:
it: esporterebbe una costante denominata "SERIAL_BAUD" con un valore di 250000 dal microcontrollore all'host. È anche possibile dichiarare una costante che è una stringa, ad esempio:
ko: 마이크로 컨트롤러에서 호스트로 값이 250000 인 "SERIAL_BAUD" 라는 상수를 내보냅니다. 문자열인 상수를 선언하는 것도 가능합니다. 예를 들면 다음과 같습니다:
zh_hans: 可以从微控制器向主机输出一个名为 "SERIAL_BAUD "，值为250000的常数。也可以将字符串声明成常量-例如：

source: Low-level message encoding
fr: Encodage des message de bas niveau
hu: Alacsony szintű üzenetkódolás
it: Codifica dei messaggi di basso livello
ko: 저수준 메시지 인코딩
zh_hans: 底层消息编码

source: To accomplish the above RPC mechanism, each command and response is encoded into a binary format for transmission. This section describes the transmission system.
fr: Pour accomplir le mécanisme "RPC" ci-dessus, chaque commandes et réponses sont codées dans un format binaire pour la transmission. Cette section décrit le système de transmission.
hu: A fenti RPC-mechanizmus megvalósításához minden egyes parancs és válasz bináris formátumba van kódolva az átvitelhez. Ez a szakasz az átviteli rendszert írja le.
it: Per realizzare il meccanismo RPC di cui sopra, ogni comando e risposta viene codificato in un formato binario per la trasmissione. Questa sezione descrive il sistema di trasmissione.
ko: 위의 RPC 메커니즘을 수행하기 위해 각 명령과 응답은 전송을 위해 바이너리 형식으로 인코딩됩니다. 이 섹션에서는 전송 시스템에 대해 설명합니다.
zh_hans: 为了实现上述RPC机制，每个命令和响应都被编码成二进制格式进行传输。本节介绍这个传输系统。

source: Message Blocks
fr: Blocs de message
hu: Üzenetblokkok
it: Blocchi di messaggi
ko: 메시지 블록
zh_hans: 消息块

source: All data sent from host to micro-controller and vice-versa are contained in "message blocks". A message block has a two byte header and a three byte trailer. The format of a message block is:
fr: Toutes les données envoyées de l'hôte au microcontrôleur et vice-versa sont contenues dans des "blocs de message". Un bloc de message a un en-tête de deux octets et une fin de trois octets. Le format d'un bloc de message est :
hu: A gazdagéptől a mikrovezérlőnek és fordítva küldött összes adat "üzenetblokkban" található. Az üzenetblokk két bájtos fejléccel és három bájtos üzenettel rendelkezik. Az üzenetblokkok formátuma a következő:
it: Tutti i dati inviati dall'host al microcontrollore e viceversa sono contenuti in "blocchi di messaggi". Un blocco di messaggi ha un'intestazione di due byte e un trailer di tre byte. Il formato di un blocco di messaggi è:
ko: 호스트에서 마이크로 컨트롤러로 또는 그 반대로 전송되는 모든 데이터는 "message blocks"에 포함됩니다. 메시지 블록에는 2바이트 헤더와 3바이트 트레일러가 있습니다. 메시지 블록의 형식은 다음과 같습니다:
zh_hans: 所有从主机到微控制器以及从微控制器到主机的数据都包含在 "消息块 "中。一个消息块有一个两字节的头和一个三字节的尾。信息块的格式如下：

source: The length byte contains the number of bytes in the message block including the header and trailer bytes (thus the minimum message length is 5 bytes). The maximum message block length is currently 64 bytes. The sequence byte contains a 4 bit sequence number in the low-order bits and the high-order bits always contain 0x10 (the high-order bits are reserved for future use). The content bytes contain arbitrary data and its format is described in the following section. The crc bytes contain a 16bit CCITT [CRC](https://en.wikipedia.org/wiki/Cyclic_redundancy_check) of the message block including the header bytes but excluding the trailer bytes. The sync byte is 0x7e.
fr: L'octet de longueur contient le nombre d'octets dans le bloc de message, y compris les octets d'en-tête et de fin (la longueur minimale du message est donc de 5 octets). La longueur maximale d'un bloc de message est de 64 octets. L'octet de séquence contient un numéro de séquence de 4 bits dans les bits de poids faible et les bits de poids fort contiennent toujours 0x10 (les bits de poids fort sont réservés pour une utilisation future). Les octets de contenu contiennent les données du message et leur format est décrit dans la section suivante. Les octets crc contiennent un [CCITT CRC 16 bits](https://en.wikipedia.org/wiki/Cyclic_redundancy_check) du bloc de message incluant les octets d'en-tête mais excluant les octets de fin. L'octet de synchronisation est 0x7e.
hu: A hosszbájt tartalmazza az üzenetblokkban lévő bájtok számát, beleértve a fejlécet és a követőbájtokat (így az üzenet minimális hossza 5 bájt). Az üzenetblokk maximális hossza jelenleg 64 bájt. A szekvencia bájt egy 4 bites szekvencia számot tartalmaz az alacsony rendű bitekben, a magas rendű bitek pedig mindig 0x10-et tartalmaznak (a magas rendű bitek későbbi használatra vannak fenntartva). A tartalmi bájtok tetszőleges adatokat tartalmaznak, és formátumukat a következő szakasz ismerteti. A crc bájtok tartalmazzák az üzenetblokk 16 bites CCITT [CRC](https://en.wikipedia.org/wiki/Cyclic_redundancy_check) értékét, beleértve a fejlécbájtokat, de kivéve az üzenetbájtokat. A szinkronizálási bájt 0x7e.
it: Il byte di lunghezza contiene il numero di byte nel blocco di messaggi inclusi i byte di intestazione e trailer (quindi la lunghezza minima del messaggio è 5 byte). La lunghezza massima del blocco di messaggi è attualmente di 64 byte. Il byte di sequenza contiene un numero di sequenza di 4 bit nei bit di ordine inferiore e i bit di ordine superiore contengono sempre 0x10 (i bit di ordine superiore sono riservati per un uso futuro). I byte di contenuto contengono dati arbitrari e il relativo formato è descritto nella sezione seguente. I byte crc contengono un CCITT [CRC](https://en.wikipedia.org/wiki/Cyclic_redundancy_check) a 16 bit del blocco di messaggi inclusi i byte di intestazione ma esclusi i byte di trailer. Il byte di sincronizzazione è 0x7e.
ko: 길이 바이트는 헤더 및 트레일러 바이트를 포함하는 메시지 블록의 바이트 수를 포함합니다 (따라서 최소 메시지 길이는 5바이트입니다). 최대 메시지 블록 길이는 현재 64바이트입니다. 시퀀스 바이트는 하위 비트에 4비트 시퀀스 번호를 포함하고 상위 비트는 항상 0x10을 포함합니다 (상위 비트는 향후 사용을 위해 예약됨). 콘텐츠 바이트는 임의의 데이터를 포함하며 그 형식은 다음 섹션에 설명되어 있습니다. crc 바이트는 헤더 바이트를 포함하지만 트레일러 바이트를 제외한 메시지 블록의 16비트 CCITT [CRC](https://en.wikipedia.org/wiki/Cyclic_redundancy_check)를 포함합니다. 동기화 바이트는 0x7e입니다.
zh_hans: 长度字节指示消息块中的字节数，包括头和尾的字节（因此消息的最短长度为5字节）。目前最大的消息块长度为64字节。序号字节的低4位是序列号，高4位总是0x10（高4位保留给未来用）。内容字节包含任意数据，其格式在下一节中描述。crc字节包含消息块的16位CCITT[CRC](https://en.wikipedia.org/wiki/Cyclic_redundancy_check)，CRC计算包括头字节但不包括尾字节。同步字节为0x7e。

source: The format of the message block is inspired by [HDLC](https://en.wikipedia.org/wiki/High-Level_Data_Link_Control) message frames. Like in HDLC, the message block may optionally contain an additional sync character at the start of the block. Unlike in HDLC, a sync character is not exclusive to the framing and may be present in the message block content.
fr: Le format du bloc de message est inspiré des trames de message [HDLC](https://en.wikipedia.org/wiki/High-Level_Data_Link_Control). Comme dans HDLC, le bloc de message peut éventuellement contenir un caractère de synchronisation supplémentaire au début du bloc. Contrairement à HDLC, un caractère de synchronisation n'est pas propre au header et peut être présent dans le contenu du bloc de message.
hu: Az üzenetblokk formátumát a [HDLC](https://en.wikipedia.org/wiki/High-Level_Data_Link_Control) üzenetkeretek ihlették. A HDLC-hez hasonlóan az üzenetblokk opcionálisan tartalmazhat egy további szinkronizálási karaktert a blokk elején. A HDLC-vel ellentétben a szinkronizálási karakter nem kizárólagos a keretben, és jelen lehet az üzenetblokk tartalmában.
it: Il formato del blocco di messaggi si ispira ai telegrammi [HDLC](https://en.wikipedia.org/wiki/High-Level_Data_Link_Control). Come in HDLC, il blocco di messaggi può contenere facoltativamente un carattere di sincronizzazione aggiuntivo all'inizio del blocco. A differenza di HDLC, un carattere di sincronizzazione non è esclusivo del framing e può essere presente nel contenuto del blocco di messaggi.
ko: 메시지 블록의 형식은 [HDLC](https://en.wikipedia.org/wiki/High-Level_Data_Link_Control) 메시지 프레임에서 영감을 받았습니다. HDLC 에서와 같이 메시지 블록은 선택적으로 블록 시작 부분에 추가 동기화 문자를 포함할 수 있습니다. HDLC 와 달리 동기화 문자는 프레이밍에만 국한되지 않으며 메시지 블록 콘텐츠에 존재할 수 있습니다.
zh_hans: 消息块的格式是受[HDLC](https://en.wikipedia.org/wiki/High-Level_Data_Link_Control)消息帧的启发。与HDLC一样，消息块在开始时可以选择包含一个额外的同步字符。与HDLC不同的是，同步字符并不专属于框架，也可以出现在消息块内容中（不需要转义）。

source: Message Block Contents
fr: Contenu du bloc de message
hu: Üzenetblokk tartalma
it: Contenuto del blocco messaggi
ko: 메시지 블록 내용
zh_hans: 消息块内容

source: Each message block sent from host to micro-controller contains a series of zero or more message commands in its contents. Each command starts with a [Variable Length Quantity](#variable-length-quantities) (VLQ) encoded integer command-id followed by zero or more VLQ parameters for the given command.
fr: Chaque bloc de message envoyé de l'hôte au microcontrôleur contient une série de zéro ou plusieurs commandes de message dans son contenu. Chaque commande commence par une [Quantité de longueur variable](#variable-length-quantities) (VLQ) encodé entier command-id suivi de zéro ou plusieurs paramètres VLQ pour la commande donnée.
hu: Minden egyes, a gazdagépről a mikrokontrollernek küldött üzenetblokk tartalma nulla vagy több üzenetparancsból álló sorozatot tartalmaz. Minden parancs egy [Változó hosszúságú mennyiség](#valtozo-hosszusagu-mennyiseg) (VLQ) kódolt egész számú parancs azonosítóval kezdődik, amelyet az adott parancsra vonatkozó nulla vagy több VLQ paraméter követ.
it: Ogni blocco di messaggi inviato dall'host al microcontrollore contiene una serie di zero o più comandi di messaggi. Ogni comando inizia con un [Quantità a lunghezza variabile](#quantità-a-lunghezza-variabile) (VLQ) command-id seguito da zero o più parametri VLQ per il comando dato.
ko: 호스트에서 마이크로 컨트롤러로 전송된 각 메시지 블록에는 내용에 일련의 0 개 이상의 메시지 명령이 포함되어 있습니다. 각 명령은 [Variable Length Quantity](#variable-length-quantities)(VLQ)로 인코딩된 정수 command-id로 시작하고 그 뒤에 주어진 명령에 대한 0 개 이상의 VLQ 매개변수가 옵니다.
zh_hans: 每个从主机发送至微控制器的消息块，其内容都包含一系列零个或多个消息命令。每条命令以[可变长度数值](#variable-length-quantities)(VLQ)编码的整数command-id开始，后面是这个命令的零或多个VLQ参数。

source: As an example, the following four commands might be placed in a single message block:
fr: Par exemple, les quatre commandes suivantes peuvent être placées dans un seul bloc de message :
hu: A következő négy parancsot például egyetlen üzenetblokkba helyezhetjük:
it: Ad esempio, i seguenti quattro comandi possono essere inseriti in un unico blocco di messaggi:
ko: 예를 들어 다음 네 가지 명령을 단일 메시지 블록에 넣을 수 있습니다:
zh_hans: 例如，以下四个命令可以被放在一个消息块中：

source: and encoded into the following eight VLQ integers:
fr: et codé dans les huit entiers VLQ suivants :
hu: és a következő nyolc VLQ egész számba kódolva:
it: e codificato nei seguenti otto interi VLQ:
ko: 그리고 다음 8개의 VLQ 정수로 인코딩됩니다:
zh_hans: 并编码为下面八个VLQ整数：

source: In order to encode and parse the message contents, both the host and micro-controller must agree on the command ids and the number of parameters each command has. So, in the above example, both the host and micro-controller would know that "id_update_digital_out" is always followed by two parameters, and "id_get_config" and "id_get_clock" have zero parameters. The host and micro-controller share a "data dictionary" that maps the command descriptions (eg, "update_digital_out oid=%c value=%c") to their integer command-ids. When processing the data, the parser will know to expect a specific number of VLQ encoded parameters following a given command id.
fr: Afin d'encoder et d'analyser le contenu du message, l'hôte et le microcontrôleur doivent s'accorder sur les identifiants de commande et le nombre de paramètres de chaque commande. Ainsi, dans l'exemple ci-dessus, l'hôte et le microcontrôleur savent que "id_update_digital_out" est toujours suivi de deux paramètres, et "id_get_config" et "id_get_clock" n'ont aucun paramètre. L'hôte et le microcontrôleur partagent un "dictionnaire de données" qui mappe les descriptions de commande (par exemple, "update_digital_out oid=%c value=%c") à leurs identifiants de commande "entiers". Lors du traitement des données, l'analyseur saura s'attendre à un nombre spécifique de paramètres codés VLQ après un identifiant de commande donné.
hu: Az üzenet tartalmának kódolásához és elemzéséhez a gazdagépnek és a mikrokontrollernek meg kell egyeznie a parancs azonosítóiban és az egyes parancsok paramétereinek számában. Így a fenti példában mind a gazdagép, mind a mikrokontroller tudja, hogy az "id_update_digital_out" parancsot mindig két paraméter követi, és az "id_get_config" és a "id_get_clock" parancsnak nulla paramétere van. A gazdagép és a mikrokontroller megosztja az "adatszótárat", amely a parancsleírásokat (pl. "update_digital_out oid=%c value=%c") egész számú parancs-azonosítókra képezi le. Az adatok feldolgozása során az elemző tudni fogja, hogy egy adott parancs-id után meghatározott számú VLQ-kódolt paramétert várjon.
it: Per codificare e analizzare il contenuto del messaggio, sia l'host che il microcontrollore devono concordare gli ID comando e il numero di parametri di ciascun comando. Quindi, nell'esempio sopra, sia l'host che il microcontrollore saprebbero che "id_update_digital_out" è sempre seguito da due parametri e "id_get_config" e "id_get_clock" hanno zero parametri. L'host e il microcontrollore condividono un "dizionario dei dati" che mappa le descrizioni dei comandi (ad esempio, "update_digital_out oid=%c value=%c") ai loro ID di comando interi. Durante l'elaborazione dei dati, il parser saprà di aspettarsi un numero specifico di parametri codificati VLQ a seguito di un determinato ID comando.
ko: 메시지 내용을 인코딩하고 구문 분석하려면 호스트와 마이크로 컨트롤러 모두 명령 ID 와 각 명령이 갖는 매개변수 수에 동의해야 합니다. 따라서 위의 예에서 호스트와 마이크로 컨트롤러 모두 "id_update_digital_out" 뒤에는 항상 두 개의 매개변수가 오고 "id_get_config" 및 "id_get_clock" 에는 매개변수가 0 개 있다는 것을 알 수 있습니다. 호스트와 마이크로 컨트롤러는 명령 설명 (예: "update_digital_out oid=%c 값=%c")을 정수로 매핑하는 "data dictionary" 을 공유합니다. 데이터를 처리할 때 파서는 주어진 명령 ID 다음에 오는 특정 수의 VLQ 인코딩 매개변수를 예상한다는 것을 알게 됩니다.
zh_hans: 为了对信息内容进行编解码，主机和微控制器都必须确保使用的命令的ID和每个命令对应的参数数量一致。因此，在上面的例子中，主机和微控制器都知道 "id_update_digital_out "后面总是跟着两个参数，而 "id_get_config "和 "id_get_clock "没有参数。主机和微控制器共享一个 "数据字典"，这个数据字典将命令描述（例如，"update_digital_out oid=%c value=%c"）映射到它们的整数命令ID。当处理数据时，解析器将知道一个给定的命令ID后预期有特定数量的VLQ编码参数。

source: The message contents for blocks sent from micro-controller to host follow the same format. The identifiers in these messages are "response ids", but they serve the same purpose and follow the same encoding rules. In practice, message blocks sent from the micro-controller to the host never contain more than one response in the message block contents.
fr: Le contenu des messages pour les blocs envoyés du microcontrôleur à l'hôte suit le même format. Les identifiants de ces messages sont des "identifiants de réponse", mais ils ont le même objectif et suivent les mêmes règles de codage. En pratique, les blocs de message envoyés du microcontrôleur à l'hôte ne contiennent jamais plus d'une réponse dans le contenu du bloc de message.
hu: A mikrokontrollerről a gazdagépnek küldött blokkok üzenettartalma ugyanezt a formátumot követi. Ezekben az üzenetekben szereplő azonosítók "válasz azonosítók", de ugyanazt a célt szolgálják és ugyanazokat a kódolási szabályokat követik. A gyakorlatban a mikrokontrollerről a gazdagépnek küldött üzenetblokkok soha nem tartalmaznak egynél több választ az üzenetblokk tartalmában.
it: Il contenuto del messaggio per i blocchi inviati dal microcontrollore all'host segue lo stesso formato. Gli identificatori in questi messaggi sono "ID di risposta", ma servono allo stesso scopo e seguono le stesse regole di codifica. In pratica, i blocchi di messaggi inviati dal microcontrollore all'host non contengono mai più di una risposta nel contenuto del blocco di messaggi.
ko: 마이크로 컨트롤러에서 호스트로 전송된 블록의 메시지 내용은 동일한 형식을 따릅니다. 이러한 메시지의 식별자는 "response ids" 이지만 동일한 용도로 사용되며 동일한 인코딩 규칙을 따릅니다. 실제로 마이크로 컨트롤러에서 호스트로 보낸 메시지 블록은 메시지 블록 내용에 둘 이상의 응답을 포함하지 않습니다.
zh_hans: 从微控制器发送到主机的块的消息内容遵循相同的格式。这些消息中的标识符是 "响应ID"，但它们的作用相同，并遵循相同的编码规则。事实上，从微控制器发送到主机的消息块在消息块内容中只包含一个响应。

source: Variable Length Quantities
fr: Quantités de longueur variable
hu: Változó hosszúságú mennyiségek
it: Quantità di lunghezza variabile
ko: 가변 길이 수량
zh_hans: 可变长度数值

source: See the [wikipedia article](https://en.wikipedia.org/wiki/Variable-length_quantity) for more information on the general format of VLQ encoded integers. Klipper uses an encoding scheme that supports both positive and negative integers. Integers close to zero use less bytes to encode and positive integers typically encode using less bytes than negative integers. The following table shows the number of bytes each integer takes to encode:
fr: Voir l'[article wikipedia sur les VLQ](https://en.wikipedia.org/wiki/Variable-length_quantity) pour plus d'informations sur le format général des entiers codés VLQ. Klipper utilise un schéma de codage qui prend en charge les entiers positifs et négatifs. Les entiers proches de zéro utilisent moins d'octets pour coder et les entiers positifs codés utilisent moins d'octets - en général - que les entiers négatifs. Le tableau suivant indique le nombre d'octets nécessaires à l'encodage de chaque entier :
hu: A VLQ kódolt egész számok általános formátumáról lásd a [wikipedia cikket](https://en.wikipedia.org/wiki/Variable-length_quantity). A Klipper olyan kódolási sémát használ, amely támogatja a pozitív és negatív egész számokat is. A nullához közeli egészek kevesebb bájtot használnak a kódoláshoz, és a pozitív egészek kódolása általában kevesebb bájtot használ, mint a negatív egészeké. A következő táblázat mutatja, hogy az egyes egész számok kódolásához hány bájtra van szükség:
it: Consulta l'[articolo di Wikipedia](https://en.wikipedia.org/wiki/Variable-length_quantity) per ulteriori informazioni sul formato generale degli interi codificati VLQ. Klipper utilizza uno schema di codifica che supporta numeri interi positivi e negativi. Gli interi prossimi allo zero utilizzano meno byte per codificare e gli interi positivi in genere codificano utilizzando meno byte degli interi negativi. La tabella seguente mostra il numero di byte che ogni intero impiega per codificare:
ko: VLQ 로 인코딩된 정수의 일반 형식에 대한 자세한 내용은 [wikipedia article](https://en.wikipedia.org/wiki/Variable-length_quantity) 를 참조하세요. Klipper는 양수 및 음수 정수를 모두 지원하는 인코딩 체계를 사용합니다. 0 에 가까운 정수는 인코딩하는 데 더 적은 바이트를 사용하고 양의 정수는 일반적으로 음의 정수보다 적은 바이트를 사용하여 인코딩합니다. 다음 표는 각 정수가 인코딩하는 데 걸리는 바이트 수를 보여줍니다:
zh_hans: 关于VLQ编码的整数的一般格式的更多信息，请参见[wikipedia article](https://en.wikipedia.org/wiki/Variable-length_quantity)。Klipper使用支持正负整数的编码方案。接近零的整数使用较少的字节来编码，正整数的编码通常比负整数的使用字节更少。下表显示了每个整数的编码所需的字节数：

source: Integer
hu: Egész
it: Intero
zh_hans: 整数

source: Encoded size
fr: Taille encodée
hu: Kódolt méret
it: Dimensione codificata
zh_hans: 编码长度

source: Variable length strings
fr: Chaînes de longueur variable
hu: Változó hosszúságú karakterláncok
it: Stringhe di lunghezza variabile
ko: 가변 길이 문자열
zh_hans: 可变长度字符串
