Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Protocol.po
Languages: fr, hu, it, ko, zh_hans

source: The Klipper messaging protocol is used for low-level communication between the Klipper host software and the Klipper micro-controller software. At a high level the protocol can be thought of as a series of command and response strings that are compressed, transmitted, and then processed at the receiving side. An example series of commands in uncompressed human-readable format might look like:
fr: Le protocole de messagerie Klipper est utilisé pour la communication de bas niveau entre le logiciel hôte Klipper et le logiciel du microcontrôleur Klipper. À un niveau élevé, le protocole peut être considéré comme une série de chaînes de commandes et de réponses qui sont compressées, transmises, puis traitées du côté réception. Un exemple d'une séries de commandes dans un format non compressé lisible par l'homme pourrait ressembler à :
hu: A Klipper üzenetküldő protokoll a Klipper gazdagép szoftver és a Klipper mikrovezérlő szoftver közötti alacsony szintű kommunikációra szolgál. Magas szinten a protokoll felfogható parancs és válaszkarakterláncok sorozatának, amelyeket tömörítenek, továbbítanak, majd feldolgoznak a fogadó oldalon. Egy példa parancssorozat tömörítetlen, ember által olvasható formátumban így nézhet ki:
it: Il protocollo di messaggistica Klipper viene utilizzato per la comunicazione di basso livello tra il software host Klipper e il software microcontrollore Klipper. Ad alto livello il protocollo può essere pensato come una serie di stringhe di comando e risposta che vengono compresse, trasmesse e quindi elaborate sul lato ricevente. Una serie di esempio di comandi in formato non compresso leggibile dall'uomo potrebbe essere simile a:
ko: Klipper 메시징 프로토콜은 Klipper 호스트 소프트웨어와 Klipper 마이크로 컨트롤러 소프트웨어 간의 저수준 통신에 사용됩니다. 높은 수준에서 프로토콜은 압축, 전송 및 수신 측에서 처리되는 일련의 명령 및 응답 문자열로 생각할 수 있습니다. 사람이 읽을 수 있는 압축되지 않은 형식의 예제 명령은 다음과 같습니다:
zh_hans: Klipper消息协议用于Klipper主机软件和Klipper微控制器软件之间的低层通信。在上层看，该协议可以被认为是一系列的命令和响应字符串，它们被压缩、传输，然后在接收方进行处理。以下是一个例子，包含一组未经压缩的人类可读格式的命令：

source: See the [mcu commands](MCU_Commands.md) document for information on available commands. See the [debugging](Debugging.md) document for information on how to translate a G-Code file into its corresponding human-readable micro-controller commands.
fr: Voir le document [commandes mcu](MCU_Commands.md) pour plus d'informations sur les commandes disponibles. Voir le document [deboguage](Debugging.md) pour plus d'informations sur la façon de traduire un fichier G-Code en commandes de microcontrôleur lisibles (par l'homme).
hu: Az elérhető parancsokról az [mcu parancsok](MCU_Commands.md) dokumentumban olvashat bővebben. Tekintse meg a [hibakeresés](Debugging.md) dokumentumot a G-kód fájl megfelelő, ember által olvasható mikrovezérlő parancsaira történő lefordításával kapcsolatban.
it: Vedere il documento [mcu commands](MCU_Commands.md) per informazioni sui comandi disponibili. Vedere il documento [debugging](Debugging.md) per informazioni su come tradurre un file G-Code nei corrispondenti comandi del microcontrollore leggibili dall'uomo.
ko: 사용 가능한 명령에 대한 정보는 [mcu commands](MCU_Commands.md) 문서를 참조하십시오. G-Code 파일을 사람이 읽을 수 있는 마이크로 컨트롤러 명령으로 변환하는 방법에 대한 정보는 [debugging](Debugging.md) 문서를 참조하십시오.
zh_hans: 有关可用命令的信息，请参阅 [mcu 命令](MCU_Commands.md)文档。有关如何将 G-Code 文件转换为其相应的可读的微控制器命令信息，请参阅[调试](Debugging.md)文档。

source: This page provides a high-level description of the Klipper messaging protocol itself. It describes how messages are declared, encoded in binary format (the "compression" scheme), and transmitted.
fr: Cette page fournit une description de haut niveau du protocole de communication de Klipper. Elle décrit comment les messages sont déclarés, encodés au format binaire (le format de "compression") et transmis.
hu: Ez az oldal magának a Klipper üzenetküldő protokollnak a magas szintű leírását tartalmazza. Leírja az üzenetek deklarálását, bináris formátumú kódolását (a séma "tömörítését") és továbbítását.
it: Questa pagina fornisce una descrizione di alto livello del protocollo di messaggistica Klipper. Descrive come i messaggi sono dichiarati, codificati in formato binario (lo schema di "compressione") e trasmessi.
ko: 이 페이지는 Klipper 메시징 프로토콜 자체에 대한 높은 수준의 설명을 제공합니다. 메시지가 선언되고 이진 형식("compression" 체계)으로 인코딩되고 전송되는 방법을 설명합니다.
zh_hans: 本页提供了Klipper消息传递协议本身的高层描述。它描述了消息是如何被声明、以二进制格式编码（"压缩 "方案）和传输的。

source: The goal of the protocol is to enable an error-free communication channel between the host and micro-controller that is low-latency, low-bandwidth, and low-complexity for the micro-controller.
fr: L'objectif du protocole est de permettre un canal de communication sans erreur entre l'hôte et le microcontrôleur avec une faible latence, une faible bande passante et une faible complexité pour le microcontrôleur.
hu: A protokoll célja, hogy hibamentes kommunikációs csatornát tegyen lehetővé a gazdagép és a mikrovezérlő között, amely alacsony késleltetésű, alacsony sávszélességű és alacsony bonyolultságú a mikrovezérlő számára.
it: L'obiettivo del protocollo è abilitare un canale di comunicazione privo di errori tra l'host e il microcontrollore che sia a bassa latenza, bassa larghezza di banda e bassa complessità per il microcontrollore.
ko: 프로토콜의 목표는 호스트와 마이크로 컨트롤러 사이에 오류가 없는 통신 채널을 가능하게 하여 마이크로 컨트롤러에 대해 낮은 대기 시간, 낮은 대역폭 및 낮은 복잡성을 제공하는 것입니다.
zh_hans: 该协议的目标是在主机和微控制器之间建立一个无错误的通信通道，对微控制器来说是低延迟、低带宽和低复杂度的。

source: Micro-controller Interface
fr: Interface du micro-contrôleur
hu: Mikrovezérlő interfész
it: Interfaccia microcontrollore
ko: 마이크로 컨트롤러 인터페이스
zh_hans: 微控制器接口

source: The Klipper transmission protocol can be thought of as a [RPC](https://en.wikipedia.org/wiki/Remote_procedure_call) mechanism between micro-controller and host. The micro-controller software declares the commands that the host may invoke along with the response messages that it can generate. The host uses that information to command the micro-controller to perform actions and to interpret the results.
fr: Le protocole de transmission Klipper peut être considéré comme un mécanisme d' [Appel de procédure à distance](https://en.wikipedia.org/wiki/Remote_procedure_call) entre le microcontrôleur et l'hôte. Le logiciel du microcontrôleur déclare les commandes que l'hôte peut invoquer ainsi que les messages de réponse qu'il peut générer. L'hôte utilise ces informations pour ordonner au microcontrôleur d'effectuer des actions et d'interpréter les résultats.
hu: A Klipper átviteli protokoll egy [RPC](https://hu.wikipedia.org/wiki/Remote_procedure_call) mechanizmusnak tekinthető a mikrovezérlő és a gazdagép között. A mikrovezérlő szoftver deklarálja azokat a parancsokat, amelyeket a gazdagép meghívhat, az általa generált válaszüzenetekkel együtt. A gazdagép ezeket az információkat arra használja fel, hogy parancsot adjon a mikrokontrollernek a műveletek végrehajtására és az eredmények értelmezésére.
it: Il protocollo di trasmissione Klipper può essere pensato come un meccanismo [RPC](https://en.wikipedia.org/wiki/Remote_procedure_call) tra microcontrollore e host. Il software del microcontrollore dichiara i comandi che l'host può richiamare insieme ai messaggi di risposta che può generare. L'host utilizza tali informazioni per comandare al microcontrollore di eseguire azioni e interpretare i risultati.
ko: Klipper 전송 프로토콜은 마이크로 컨트롤러와 호스트 간의 [RPC](https://en.wikipedia.org/wiki/Remote_procedure_call) 메커니즘으로 생각할 수 있습니다. 마이크로 컨트롤러 소프트웨어는 호스트가 생성할 수 있는 응답 메시지와 함께 호출할 수 있는 명령을 선언합니다. 호스트는 해당 정보를 사용하여 마이크로 컨트롤러가 작업을 수행하고 결과를 해석하도록 명령합니다.
zh_hans: Klipper传输协议可以被认为是微控制器和主机之间的一个[RPC](https://en.wikipedia.org/wiki/Remote_procedure_call)机制。微控制器软件声明了主机可以调用的命令，以及它可以产生的响应信息。主机使用这些信息来命令微控制器执行动作并解释结果。

source: Declaring commands
fr: Déclaration des commandes
hu: Parancsok deklarálása
it: Dichiarazione dei comandi
ko: 명령 선언
zh_hans: 宣布命令

source: The micro-controller software declares a "command" by using the DECL_COMMAND() macro in the C code. For example:
fr: Le logiciel du microcontrôleur déclare une "commande" en utilisant la macro DECL_COMMAND() dans le code C. Par exemple :
hu: A mikrokontroller szoftvere deklarál egy "parancsot" a DECL_COMMAND() makró használatával a C kódban. Például:
it: Il software del microcontrollore dichiara un "comando" utilizzando la macro DECL_COMMAND() nel codice C. Per esempio:
ko: 마이크로 컨트롤러 소프트웨어는 C 코드에서 DECL_COMMAND() 매크로를 사용하여 "command"을 선언합니다. 예를 들어:
zh_hans: 微控制器软件通过使用C代码中的DECL_COMMAND()宏来声明一个 “命令”。例如：

source: The above declares a command named "update_digital_out". This allows the host to "invoke" this command which would cause the command_update_digital_out() C function to be executed in the micro-controller. The above also indicates that the command takes two integer parameters. When the command_update_digital_out() C code is executed, it will be passed an array containing these two integers - the first corresponding to the 'oid' and the second corresponding to the 'value'.
fr: Ce qui précède déclare une commande nommée "update_digital_out". Cela permet à l'hôte "d'appeler" cette commande qui entraînerait l'exécution de la fonction C command_update_digital_out() dans le microcontrôleur. Ce qui précède indique également que la commande prend deux paramètres entiers. Lorsque le code C command_update_digital_out() est exécuté, un tableau contenant ces deux entiers lui sera transmis - le premier correspondant à 'oid' et le second correspondant à 'value'.
hu: A fenti egy "update_digital_out" nevű parancsot deklarál. Ez lehetővé teszi a gazdagép számára, hogy ezt a parancsot "invoke", ami a command_update_digital_out() C függvény végrehajtását eredményezi a mikrovezérlőben. A fentiek azt is jelzik, hogy a parancs két egész paramétert vesz fel. A command_update_digital_out() C kód végrehajtásakor egy tömb kerül átadásra, amely ezt a két egész számot tartalmazza. Az első az 'oid'-nak, a második a 'value'-nak felel meg.
it: Quanto sopra dichiara un comando denominato "update_digital_out". Ciò consente all'host di "richiamare" questo comando che causerebbe l'esecuzione della funzione C command_update_digital_out() nel microcontrollore. Quanto sopra indica anche che il comando accetta due parametri interi. Quando viene eseguito il codice C command_update_digital_out(), verrà passata una matrice contenente questi due numeri interi: il primo corrispondente all'"oid" e il secondo corrispondente al "valore".
ko: 그는 위에서 "update_digital_out" 이라는 명령을 선언합니다. 이것은 호스트가 이 명령을 "invoke" 하여 command_update_digital_out() C 함수가 마이크로 컨트롤러에서 실행되도록 합니다. 위의 내용은 명령이 두 개의 정수 매개변수를 취함을 나타냅니다. command_update_digital_out() C 코드가 실행되면 이 두 정수를 포함하는 배열이 전달됩니다. 첫 번째는 'oid'에 해당하고 두 번째는 'value'에 해당합니다.
zh_hans: 以上声明了一个名为 "update_digital_out "的命令。这允许主机 “invoke”这个命令，这将使得command_update_digital_out()C函数在微控制器中被执行。上述内容还表明，该命令需要两个整数参数。当command_update_digital_out()C代码被执行时，它将被传递一个包含这两个整数的数组--第一个对应于 "oid"，第二个对应于 "value"。

source: In general, the parameters are described with printf() style syntax (eg, "%u"). The formatting directly corresponds to the human-readable view of commands (eg, "update_digital_out oid=7 value=1"). In the above example, "value=" is a parameter name and "%c" indicates the parameter is an integer. Internally, the parameter name is only used as documentation. In this example, the "%c" is also used as documentation to indicate the expected integer is 1 byte in size (the declared integer size does not impact the parsing or encoding).
fr: En général, les paramètres sont décrits avec une syntaxe de style printf() (par exemple, "%u"). Le formatage correspond directement à une vue "lisible" (par un Humain) des commandes (par exemple, "update_digital_out oid=7 value=1"). Dans l'exemple ci-dessus, "value=" est un nom de paramètre et "%c" indique que le paramètre est un entier. En interne, le nom du paramètre n'est utilisé que comme documentation. Dans cet exemple, le "%c" est également utilisé comme documentation pour indiquer que l'entier attendu a une taille de 1 octet (la taille déclarée de l'entier n'a pas d'impact sur l'analyse ou l'encodage).
hu: Általában a paraméterek leírása printf() stílusú szintaxissal történik (pl. "%u"). A formázás közvetlenül megfelel a parancsok ember által olvasható nézetének (pl. "update_digital_out oid=7 value=1"). A fenti példában a "value=" a paraméter neve, a "%c" pedig azt jelzi, hogy a paraméter egész szám. Belsőleg a paraméternév csak dokumentációként használatos. Ebben a példában a "%c" is használható dokumentációként, amely jelzi, hogy a várt egész szám 1 bájt méretű (a deklarált egész szám nem befolyásolja az elemzést vagy a kódolást).
it: In generale, i parametri sono descritti con la sintassi di stile printf() (ad esempio, "%u"). La formattazione corrisponde direttamente alla visualizzazione leggibile dei comandi (ad es. "update_digital_out oid=7 value=1"). Nell'esempio precedente, "value=" è un nome di parametro e "%c" indica che il parametro è un numero intero. Internamente, il nome del parametro viene utilizzato solo come documentazione. In questo esempio, "%c" viene utilizzato anche come documentazione per indicare che l'intero previsto ha una dimensione di 1 byte (la dimensione intera dichiarata non influisce sull'analisi o sulla codifica).
ko: 일반적으로 매개변수는 printf() 스타일 구문(예: "%u")으로 설명됩니다. 형식은 사람이 읽을 수 있는 명령입니다. (예: "update_digital_out oid=7 value=1"). 위의 예에서 "value=" 는 매개변수 이름이고 "%c" 는 매개변수가 정수임을 나타냅니다. 내부적으로 매개변수 이름은 문서로만 사용됩니다. 이 예에서 "%c" 는 예상 정수 크기가 1바이트임을 나타내는 문서로도 사용됩니다 (선언된 정수 크기는 구문 분석 또는 인코딩에 영향을 미치지 않음).
zh_hans: 一般来说，参数是用printf()风格的语法描述的（例如，"%u"）。这种格式化直接对应于人类可读的命令（例如，"update_digital_out oid=7 value=1"）。在上面的例子中，"value="是一个参数名称，"%c "表示该参数是一个整数。在内部，参数名只作为记录使用。在这个例子中，"%c "也是作为记录使用的，表示预期的整数是1字节宽度（声明的整数宽度不影响编解码）。

source: The micro-controller build will collect all commands declared with DECL_COMMAND(), determine their parameters, and arrange for them to be callable.
fr: La compilation du micrologiciel du microcontrôleur collectera toutes les commandes déclarées avec DECL_COMMAND(), déterminera leurs paramètres et s'arrangera pour qu'elles soient appelables.
hu: A mikrovezérlő szerkesztő összegyűjti a DECL_COMMAND()-al deklarált összes parancsot, meghatározza azok paramétereit, és gondoskodik a meghívásukról.
it: La build del microcontrollore raccoglierà tutti i comandi dichiarati con DECL_COMMAND(), ne determinerà i parametri e farà in modo che siano richiamabili.
ko: 마이크로 컨트롤러 빌드는 DECL_COMMAND() 로 선언된 모든 명령을 수집하고 해당 매개변수를 결정하며 호출 가능하도록 정렬합니다.
zh_hans: 微控制器固件构建的时候包含所有用DECL_COMMAND()声明的命令，确定其参数，并使得它们可以被调用。

source: To send information from the micro-controller to the host a "response" is generated. These are both declared and transmitted using the sendf() C macro. For example:
fr: Pour envoyer des informations du microcontrôleur à l'hôte, des "réponses" sont générées. Celles-ci sont à la fois déclarées et transmises à l'aide de la macro C sendf(). Par example :
hu: A mikrovezérlőtől a gazdagépnek történő információ küldéséhez "válasz" jön létre. Ezek deklarálása és továbbítása a sendf() C makró használatával történik. Például:
it: Per inviare informazioni dal microcontrollore all'host viene generata una "risposta". Questi sono sia dichiarati che trasmessi usando la macro C sendf(). Per esempio:
ko: 마이크로 컨트롤러에서 호스트로 정보를 보내기 위해 "response" 가 생성됩니다. 이것들은 모두 sendf() C 매크로를 사용하여 선언되고 전송됩니다. 예를 들어:
zh_hans: 当从微控制器向主机发送信息时会产生一个 "响应"。这些都是使用sendf()C语言宏来声明和发送的。例如：

source: The above transmits a "status" response message that contains two integer parameters ("clock" and "status"). The micro-controller build automatically finds all sendf() calls and generates encoders for them. The first parameter of the sendf() function describes the response and it is in the same format as command declarations.
fr: Ce qui précède transmet un message de réponse "status" qui contient deux paramètres entiers ("clock" et "status"). La construction du microcontrôleur trouve automatiquement tous les appels sendf() et génère des encodeurs pour eux. Le premier paramètre de la fonction sendf() décrit la réponse et il est dans le même format que les déclarations de commande.
hu: A fenti egy "állapot" válaszüzenetet küld, amely két egész paramétert ("óra" és "állapot") tartalmaz. A mikrovezérlő szerkesztő automatikusan megtalálja az összes sendf() hívást, és kódolókat generál hozzájuk. A sendf() függvény első paramétere írja le a választ, és formátuma megegyezik a parancsdeklarációkkal.
it: Quanto sopra trasmette un messaggio di risposta di "stato" che contiene due parametri interi ("clock" e "status"). La build del microcontrollore trova automaticamente tutte le chiamate sendf() e genera codificatori per esse. Il primo parametro della funzione sendf() descrive la risposta ed è nello stesso formato delle dichiarazioni di comando.
ko: 위는 두 개의 정수 매개변수("clock" 및 "status")를 포함하는 "status" 응답 메시지를 전송합니다. 마이크로 컨트롤러 빌드는 모든 sendf() 호출을 자동으로 찾고 이에 대한 인코더를 생성합니다. sendf() 함수의 첫 번째 매개변수는 응답을 설명하며 명령 선언과 동일한 형식입니다.
zh_hans: 以上传输了一个 "状态 "响应消息，其中包含两个整数参数（"时钟 "和 "状态"）。微控制器的构建会自动找到所有sendf()的调用，并为其生成编码器。sendf()函数的第一个参数描述了响应，它的格式与命令声明相同。

source: The host can arrange to register a callback function for each response. So, in effect, commands allow the host to invoke C functions in the micro-controller and responses allow the micro-controller software to invoke code in the host.
fr: L'hôte peut enregistrer une fonction de rappel pour chaque réponse. Ainsi, les commandes permettent à l'hôte d'invoquer des fonctions C dans le microcontrôleur et les réponses permettent au logiciel du microcontrôleur d'invoquer du code dans l'hôte.
hu: A gazdagép gondoskodhat arról, hogy minden válaszhoz visszahívási funkciót regisztráljon. Tehát valójában a parancsok lehetővé teszik a gazdagép számára, hogy meghívja a C függvényeket a mikrovezérlőben, a válaszok pedig lehetővé teszik, hogy a mikrovezérlő szoftvere kódot hívjon meg a gazdagépben.
it: L'host può organizzare la registrazione di una funzione di richiamata per ogni risposta. Quindi, in effetti, i comandi consentono all'host di invocare le funzioni C nel microcontrollore e le risposte consentono al software del microcontrollore di richiamare il codice nell'host.
ko: 호스트는 각 응답에 대한 콜백 함수를 등록하도록 조정할 수 있습니다. 따라서 실제로 명령을 통해 호스트는 마이크로 컨트롤러에서 C 기능을 호출할 수 있고 응답을 통해 마이크로 컨트롤러 소프트웨어는 호스트에서 코드를 호출할 수 있습니다.
zh_hans: 主机可以为每个响应注册一个回调函数。因此，实际上，命令允许主机在微控制器上调用C函数，响应允许微控制器软件在主机上调用代码。

source: The sendf() macro should only be invoked from command or task handlers, and it should not be invoked from interrupts or timers. The code does not need to issue a sendf() in response to a received command, it is not limited in the number of times sendf() may be invoked, and it may invoke sendf() at any time from a task handler.
fr: La macro sendf() ne doit être appelée qu'à partir de commandes ou de gestionnaires de tâches, et elle ne doit pas être appelée à partir d'interruptions ou de timers. Le code n'a pas besoin d'émettre un sendf() en réponse à une commande reçue, le nombre d'appels à sendf() n'est pas limié, et il est possible d'appeler sendf() à tout moment à partir d'un gestionnaire de tâches.
hu: A sendf() makró csak parancs vagy feladatkezelőkből hívható meg, és nem hívható meg megszakításokból vagy időzítőkből. A kódnak nem kell sendf()-t kiadnia a kapott parancsra válaszul, nincs korlátozva a sendf() meghívásának száma, és a sendf()-t bármikor meghívhatja egy feladatkezelőből.
it: La macro sendf() deve essere invocata solo da gestori di comandi o attività e non deve essere invocata da interrupt o timer. Il codice non ha bisogno di emettere un sendf() in risposta a un comando ricevuto, non è limitato nel numero di volte in cui sendf() può essere invocato e può invocare sendf() in qualsiasi momento da un task handler.
ko: sendf() 매크로는 명령 또는 작업 처리기에서만 호출해야 하며 인터럽트나 타이머에서 호출하면 안 됩니다. 코드는 수신된 명령에 대한 응답으로 sendf()를 발행할 필요가 없으며, sendf()가 호출될 수 있는 횟수에 제한이 없으며 태스크 핸들러에서 언제든지 sendf()를 호출할 수 있습니다.
zh_hans: sendf()宏只能从命令或任务处理程序中调用，而不能从中断或定时器中调用。代码不需要在收到命令的响应中发出sendf()，代码也不限制sendf()的调用次数，任务处理程序在在任何时候都可以调用sendf()。

source: Output responses
fr: Réponses de sortie
hu: Kimeneti válaszok
it: Risposte in output
ko: 출력 응답
zh_hans: 输出响应

source: To simplify debugging, there is also an output() C function. For example:
fr: Pour simplifier le débogage, il existe également une fonction C output(). Par exemple :
hu: A hibakeresés egyszerűsítése érdekében van egy output() C függvény is. Például:
it: Per semplificare il debug, esiste anche una funzione C output(). Per esempio:
ko: 디버깅을 단순화하기 위해 output() C 함수도 있습니다. 예를 들어:
zh_hans: 为了简化调试，也有一个output()C函数。例如：

source: The output() function is similar in usage to printf() - it is intended to generate and format arbitrary messages for human consumption.
fr: La fonction output() est similaire à printf() - elle est destinée à générer et formater des messages de débogage avec un affichage dans un format compréhensible (ndt : par un humain normalement constitué :-)).
hu: Az output() függvény a printf() függvényhez hasonlóan használható. Célja tetszőleges üzenetek generálása és formázása emberi feldolgozásra.
it: La funzione output() è simile nell'uso a printf() - è intesa per generare e formattare messaggi arbitrari per il 'consumo umano'.
ko: output() 함수는 printf()와 사용법이 유사합니다 - 이는 사람이 소비할 임의의 메시지를 생성하고 형식화하기 위한 것입니다.
zh_hans: output()函数的用法与printf()相似–它的目的是生成和格式化任意的信息供人阅读。

source: Declaring enumerations
fr: Déclarer des énumérations
hu: Felsorolások deklarálása
it: Dichiarazione di enumerazioni
ko: 열거형 선언
zh_hans: 声明枚举

source: Enumerations allow the host code to use string identifiers for parameters that the micro-controller handles as integers. They are declared in the micro-controller code - for example:
fr: Les énumérations permettent au code hôte d'utiliser des identificateurs de type chaîne pour des paramètres que le microcontrôleur gère comme des entiers. Ils sont déclarés dans le code du microcontrôleur - par exemple :
hu: A felsorolások lehetővé teszik a gazdakód számára, hogy a mikrokontroller által egész számokként kezelt paraméterekhez karakterlánc-azonosítókat használjon. Ezeket a mikrokontroller kódjában kell deklarálni - például:
it: Le enumerazioni consentono al codice host di utilizzare identificatori di stringa per i parametri che il microcontrollore gestisce come numeri interi. Sono dichiarati nel codice del microcontrollore, ad esempio:
ko: 열거를 통해 호스트 코드는 마이크로 컨트롤러가 정수로 처리하는 매개변수에 대한 문자열 식별자를 사용할 수 있습니다. 그것들은 마이크로 컨트롤러 코드에서 선언됩니다. 예를 들면 다음과 같습니다:
zh_hans: 枚举允许主机代码对微控制器作为整数处理的参数使用字符串标识。它们在微控制器代码中被声明-例如：
