Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Protocol.po
Languages: fr, hu, it, ko, zh_hans

source: The protocol facilitates a "window" transmission system so that the host can have many outstanding message blocks in-flight at a time. (This is in addition to the many commands that may be present in a given message block.) This allows maximum bandwidth utilization even in the event of transmission latency. The timeout, retransmit, windowing, and ack mechanism are inspired by similar mechanisms in [TCP](https://en.wikipedia.org/wiki/Transmission_Control_Protocol).
fr: Le protocole facilite un système de transmission "fenêtré" : l'hôte peut avoir de nombreux blocs de messages en cours à la fois. (Ceci s'ajoute aux nombreuses commandes qui peuvent être présentes dans un bloc de message.) Cela permet une utilisation maximale de la bande passante même en cas de latence de transmission. Les mécanismes de temporisation, de retransmission, de fenêtrage et d'accusé de réception sont inspirés de mécanismes similaires de [TCP](https://en.wikipedia.org/wiki/Transmission_Control_Protocol).
hu: A protokoll megkönnyíti az "ablakos" átviteli rendszert, így a fogadó egyszerre több függőben lévő üzenetblokkal rendelkezhet. (Ez azon a sok parancson kívül, amelyek egy adott üzenetblokkban jelen lehetnek.) Ez lehetővé teszi a sávszélesség maximális kihasználását még átviteli késedelem esetén is. Az időkorlátozás, az újraküldés, az ablakozás és az ack mechanizmus a [TCP](https://hu.wikipedia.org/wiki/Transmission_Control_Protocol) hasonló mechanizmusai alapján készült.
it: Il protocollo facilita un sistema di trasmissione "finestra" in modo che l'host possa avere molti blocchi di messaggi in sospeso in viaggio alla volta. (Questo è in aggiunta ai molti comandi che possono essere presenti in un determinato blocco di messaggi.) Ciò consente il massimo utilizzo della larghezza di banda anche in caso di latenza di trasmissione. Il meccanismo di timeout, ritrasmissione, windowing e ack si ispira a meccanismi simili in [TCP](https://en.wikipedia.org/wiki/Transmission_Control_Protocol).
ko: 이 프로토콜은 호스트가 한 번에 많은 미해결 메시지 블록을 처리할 수 있도록 "window" 전송 시스템을 용이하게 합니다. (이는 주어진 메시지 블록에 있을 수 있는 많은 명령에 추가됩니다.) 이를 통해 전송 대기 시간의 경우에도 최대 대역폭 활용이 가능합니다. 타임아웃, 재전송, 윈도우 및 승인 메커니즘은 [TCP](https://en.wikipedia.org/wiki/Transmission_Control_Protocol) 의 유사한 메커니즘에서 영감을 받았습니다.
zh_hans: 协议实现了 "窗口 "传输系统，因此主机可以在同一时间允许多未完成的消息块在发送。(这是对一个消息块中可以包含多个命令的补充）。通过这种方式，即使在传输延迟的情况下也能最大化地利用带宽。超时、重传、窗口化和响应机制是受到[TCP](https://en.wikipedia.org/wiki/Transmission_Control_Protocol)中类似机制的启发。

source: In the other direction, message blocks sent from micro-controller to host are designed to be error-free, but they do not have assured transmission. (Responses should not be corrupt, but they may go missing.) This is done to keep the implementation in the micro-controller simple. There is no automatic retransmission system for responses - the high-level code is expected to be capable of handling an occasional missing response (usually by re-requesting the content or setting up a recurring schedule of response transmission). The sequence number field in message blocks sent to the host is always one greater than the last received sequence number of message blocks received from the host. It is not used to track sequences of response message blocks.
fr: Dans l'autre sens, les blocs de messages envoyés du microcontrôleur à l'hôte sont aussi conçus pour être sans erreur, mais ils n'ont pas de validation de transmission. (Les réponses ne doivent pas être corrompues, mais elles peuvent disparaître.) Cette conception a été choisie pour garder une mise en œuvre simple dans le microcontrôleur. Il n'y a pas de système de retransmission automatique des réponses - le code de haut niveau devrait être capable de gérer une réponse manquante occasionnelle (généralement en redemandant le contenu ou en établissant un calendrier récurrent de transmission des réponses). Le champ du numéro de séquence dans les blocs de message envoyés à l'hôte est toujours supérieur d'une unité au dernier numéro de séquence envoyé par l'hôte. Il n'est pas utilisé pour suivre les séquences de blocs de message de réponse.
hu: A másik irányban a mikrokontrollerről a gazdagéphez küldött üzenetblokkokat úgy tervezték, hogy hibamentesek legyenek, de nincs biztosított átvitelük. (A válaszok nem lehetnek hibásak, de előfordulhat, hogy eltűnnek.) Ez azért történik, hogy a mikrokontrollerben egyszerű legyen a megvalósítás. Nincs automatikus újraküldési rendszer a válaszok számára. A magas szintű kódtól elvárható, hogy képes legyen kezelni az esetenként hiányzó válaszokat (általában a tartalom újrakérdezésével vagy a válaszküldés ismétlődő ütemezésének beállításával). Az állomásnak küldött üzenetblokkok sorszámmezője mindig eggyel nagyobb, mint az utolsó, az állomásról kapott üzenetblokkok sorszáma. Nem a válaszüzenetblokkok sorrendjének nyomon követésére szolgál.
it: Nell'altra direzione, i blocchi di messaggi inviati dal microcontrollore all'host sono progettati per essere privi di errori, ma non hanno una trasmissione sicura. (Le risposte non dovrebbero essere danneggiate, ma potrebbero scomparire.) Questo viene fatto per mantenere semplice l'implementazione nel microcontrollore. Non esiste un sistema di ritrasmissione automatica delle risposte: ci si aspetta che il codice di alto livello sia in grado di gestire una risposta mancante occasionale (di solito richiedendo nuovamente il contenuto o impostando un programma ricorrente di trasmissione della risposta). Il campo del numero di sequenza nei blocchi di messaggi inviati all'host è sempre uno maggiore dell'ultimo numero di sequenza di blocchi di messaggi ricevuti dall'host. Non viene utilizzato per tenere traccia di sequenze di blocchi di messaggi di risposta.
ko: 다른 방향으로, 마이크로 컨트롤러에서 호스트로 전송되는 메시지 블록은 오류가 없도록 설계되지만 전송이 보장되지는 않습니다. (응답은 손상되지 않아야 하지만 누락될 수 있습니다.) 이것은 마이크로 컨트롤러에서 구현을 단순하게 유지하기 위해 수행됩니다. 응답을 위한 자동 재전송 시스템은 없습니다 - 고급 코드는 가끔 누락된 응답을 처리할 수 있을 것으로 예상됩니다 (일반적으로 콘텐츠를 다시 요청하거나 응답 전송의 반복 일정을 설정하여). 호스트로 전송된 메시지 블록의 시퀀스 번호 필드는 항상 호스트에서 수신한 메시지 블록의 마지막 수신 시퀀스 번호보다 하나 더 큽니다. 응답 메시지 블록의 시퀀스를 추적하는 데 사용되지 않습니다.
zh_hans: 另一方向，从微控制器发送到主机的信息块被设计成无差错，但并不保证传输。(响应不会出错，但可能会丢失。)这样做是为了保持微控制器的实现简单。响应没有自动重传系统--高层代码应该能够处理偶尔丢失的响应（通常通过重新请求内容或设置响应传输的循环调度）。发送给主机的信息块中的顺序号字段总是比从主机收到的信息块的最后接收顺序号大1。顺序号并不用于跟踪响应消息块的顺序。

source: output("The value of %u is %s with size %u.", x, buf, buf_len);
fr: output("La valeur de %u est %s avec une taille de %u.", x, buf, buf_len);
it: output("Il valore di%u è %s con dimensione %u.", x, buf, buf_len);

source: <1 byte length><1 byte sequence><n-byte content><2 byte crc><1 byte sync>
it: <1 byte lunghezza><1 byte sequenza><n-byte contenuto><2 byte crc><1 byte sync>

source: Protocol
fr: Protocole
hu: Protokoll
it: Protocollo
zh_hans: 协议

source: Declaring responses
fr: Déclaration des réponses
hu: Válaszok deklarálása
ko: 응답 선언
zh_hans: 声明响应
