Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Releases.po
Languages: hu, it, ko

source: History of Klipper releases. Please see [installation](Installation.md) for information on installing Klipper.
hu: A Klipper kiadások története. A Klipper telepítésével kapcsolatos információkért lásd a [telepítés](Installation.md) dokumentumot.
it: Storico delle versioni di Klipper. Vedi [installation](Installation.md) per informazioni sull'installazione di Klipper.
ko: Klipper 배포의 역사. Klipper 설치에 대한 정보는 [installation](Installation.md)을 참조하십시오.

source: Available on 20201020. Major changes in this release:
hu: Elérhető a 20201020. Főbb változások ebben a kiadásban:
it: Disponibile su 20201020. Modifiche principali in questa versione:
ko: 20201020에 사용 가능. 이번 배포의 주요 변경 사항들:

source: Support for "Input Shaping" - a mechanism to counteract printer resonance. It can reduce or eliminate "ringing" in prints.
hu: Az "Input Shaping" a nyomtató rezonanciájának ellensúlyozására szolgáló mechanizmus támogatása. Csökkentheti vagy megszüntetheti a "gyűrődést" a nyomatokon.
it: Supporto per "Input Shaping" - un meccanismo per contrastare la risonanza della stampante. Può ridurre o eliminare il "ringing" nelle stampe.
ko: "Input Shaping" 지원 - 프린터 공명에 대응하는 메커니즘. 출력물의 "울림"을 감소시키거나 제거 할 수 있습니다.

source: New "Smooth Pressure Advance" system. This implements "Pressure Advance" without introducing instantaneous velocity changes. It is also now possible to tune pressure advance using a "Tuning Tower" method.
hu: Új "Smooth Pressure Advance" rendszer. Ezt a "Pressure Advance" rendszer a pillanatnyi sebesség változások bevezetése nélkül valósítja meg. Mostantól lehetőség van a nyomás előtolás beállítására is a "Tuning Tower" módszerrel.
it: Nuovo sistema "Smooth Pressure Advance". Questo implementa "Pressure Advance" senza introdurre variazioni di velocità istantanee. Ora è anche possibile regolare l'anticipo della pressione utilizzando un metodo "Tuning Tower".
ko: 새로운 "Smooth Pressure Advance" 시스템. 이것은 순간적인 속도 변화를 도입하지 않고 "압력 전진"을 개선한다. 그것은 "Tuning Tower"를 사용하여 압력 전진을 조정하는것도 가능합니다.

source: New "webhooks" API server. This provides a programmable JSON interface to Klipper.
hu: Új "webhooks" API-kiszolgáló. Ez egy programozható JSON interfészt biztosít a Klipperhez.
it: Nuovo server API "webhook". Ciò fornisce un'interfaccia JSON programmabile a Klipper.
ko: 새로운 "webhooks" API 서버. 이것은 klipper에 대한 프로그래밍 가능한 JSON 인터페이스를 제공합니다.

source: The LCD display and menu are now configurable using the Jinja2 template language.
hu: Az LCD kijelző és a menü mostantól a Jinja2 sablonnyelv segítségével konfigurálható.
it: Il display LCD e il menu sono ora configurabili utilizzando la lingua del modello Jinja2.
ko: LCD 디스플레이와 메뉴는 Jinja2 템플릿 언어를 사용하여 구성할 수 있습니다.

source: The TMC2208 stepper motor drivers can now be used in "standalone" mode with Klipper.
hu: A TMC2208 léptetőmotor-meghajtók mostantól "standalone" üzemmódban is használhatók a Klipperrel.
it: I driver per motori passo-passo TMC2208 possono ora essere utilizzati in modalità "standalone" con Klipper.
ko: TMC2208 스테퍼 모터 드라이버는 klipper에서 "독립형" 모드로 사용될 수 있습니다.

source: Improved BL-Touch v3 support.
hu: Továbbfejlesztett BL-Touch v3 támogatás.
it: Supporto BL-Touch v3 migliorato.
ko: BL-Touch v3 지원이 개선되었습니다.

source: Improved USB identification. Klipper now has its own USB identification code and micro-controllers can now report their unique serial numbers during USB identification.
hu: Javított USB-azonosítás. A Klipper mostantól saját USB-azonosító kóddal rendelkezik, és a mikrovezérlők mostantól az USB-azonosítás során jelenthetik egyedi sorozatszámukat.
it: Identificazione USB migliorata. Klipper ora ha il proprio codice di identificazione USB e i microcontrollori possono ora riportare i loro numeri di serie univoci durante l'identificazione USB.
ko: USB 식별이 향상되었습니다. Klipper에는 이제 자체 USB 식별 코드를 가지고 있고, 마이크로 컨트롤러는 USB 식별 중 그들의 고유한 일련 번호를 보고할 수 있습니다.

source: New kinematic support for "Rotary Delta" and "CoreXZ" printers.
hu: Új kinematikai támogatás a "Rotary Delta" és "CoreXZ" nyomtatókhoz.
it: Nuovo supporto cinematico per stampanti "Rotary Delta" e "CoreXZ".
ko: "Rotary Delta" 및 "CoreXZ" 프린터들에 대한 새로운 운동학적 지원.

source: Micro-controller improvements: support for stm32f070, support for stm32f207, support for GPIO pins on "Linux MCU", stm32 "HID bootloader" support, Chitu bootloader support, MKS Robin bootloader support.
hu: Mikrovezérlő fejlesztések: az STM32F070 támogatása, az STM32F207 támogatása, a GPIO tűk támogatása a "Linux MCU" rendszeren, STM32 "HID bootloader" támogatás, Chitu bootloader támogatás, MKS Robin bootloader támogatás.
it: Miglioramenti del microcontrollore: supporto per stm32f070, supporto per stm32f207, supporto per pin GPIO su "Linux MCU", supporto per "bootloader HID" stm32, supporto per bootloader Chitu, supporto per bootloader MKS Robin.
ko: 마이크로 컨트롤러 개선: stm32f070 지원, stm32f207 지원, "Linux MCU"의 GPIO 핀 지원, stm32 "HID 부트로더" 지원, Chitu 부트로더 지원, MKS Robin 부트로더 지원.

source: Improved handling of Python "garbage collection" events.
hu: A Python "szemétgyűjtési" események jobb kezelése.
it: Gestione migliorata degli eventi di "garbage collection" di Python.
ko: Python "쓰레기 수집" 이벤트 처리가 향상되었습니다.

source: Many additional modules added: adc_scaled, adxl345, bme280, display_status, extruder_stepper, fan_generic, hall_filament_width_sensor, htu21d, homing_heaters, input_shaper, lm75, print_stats, resonance_tester, shaper_calibrate, query_adc, graph_accelerometer, graph_extruder, graph_motion, graph_shaper, graph_temp_sensor, whconsole
hu: Számos további modul lett hozzáadva: adc_scaled, adxl345, bme280, display_status, extruder_stepper, fan_generic, hall_filament_width_sensor, htu21d, homing_heaters, input_shaper, lm75, print_stats, resonance_tester, shaper_calibrate, query_adc, graph_accelerometer, graph_extruder, graph_motion, graph_shaper, graph_temp_sensor, whconsole
it: Molti moduli aggiuntivi aggiunti: adc_scaled, adxl345, bme280, display_status, extruder_stepper, fan_generic, hall_filament_width_sensor, htu21d, homing_heaters, input_shaper, lm75, print_stats, resonance_tester, shaper_calibrate, query_adc, graph_accelerometer, graph_extruder, graph_motion, graph_shaper, graph_temp_sensor, whconsole
ko: 많은 추가 모듈이 추가됨: adc_scaled, adxl345, bme280, display_status, extruder_stepper, fan_generic, Hall_filament_width_sensor, htu21d, homing_heaters, input_shaper, lm75, print_stats, resonance_tester, shaper_calibration, query_adc, graph_accelerometer, graph_extruder, graph_motion, graph_shaper, graph_temp_sensor, whconsole

source: Several bug fixes and code cleanups.
hu: Számos hibajavítás és kódtisztítás.
it: Correzione di diversi bug e pulizia del codice.
ko: 여러 버그 수정 및 코드 정리.

source: Available on 20201028. Release containing only bug fixes.
hu: Elérhető a 20201028. Csak hibajavításokat tartalmazó kiadás.
it: Disponibile su 20201028. Versione contenente solo correzioni di bug.
ko: 20201028에서 사용 가능. 버그 수정만 포함된 배포.

source: Available on 20191021. Major changes in this release:
hu: Elérhető a 20191021. Főbb változások ebben a kiadásban:
it: Disponibile su 20191021. Modifiche principali in questa versione:
ko: 20191021에서 사용 가능. 이번 배포의 주요 변경 사항:

source: New G-Code command template support. G-Code in the config file is now evaluated with the Jinja2 template language.
hu: Új G-kód parancssablon támogatás. A konfigurációs fájlban lévő G-kódot mostantól a Jinja2 sablonnyelvvel értékeli ki a rendszer.
it: Nuovo supporto per il modello dei comandi G-Code. Il G-Code nel file di configurazione viene ora valutato con il linguaggio dei template Jinja2.
ko: 새로운 G-Code 명령 템플릿 지원. 구성 파일의 G 코드는 이제 Jinja2 템플릿 언어로 평가됩니다.

source: Improvements to Trinamic stepper drivers:
hu: A Trinamic léptető meghajtók javítása:
it: Miglioramenti ai driver per stepper Trinamic:
ko: Trinamic 스테퍼 드라이버 개선 사항들:

source: New support for TMC2209 and TMC5160 drivers.
hu: Új támogatás a TMC2209 és TMC5160 illesztőprogramokhoz.
it: Nuovo supporto per i driver TMC2209 e TMC5160.
ko: TMC2209 및 TMC5160 드라이버에 대한 새로운 지원.

source: Improved DUMP_TMC, SET_TMC_CURRENT, and INIT_TMC G-Code commands.
hu: Továbbfejlesztett DUMP_TMC, SET_TMC_CURRENT és INIT_TMC G-kód parancsok.
it: Migliorati i comandi G-Code DUMP_TMC, SET_TMC_CURRENT e INIT_TMC.
ko: DUMP_TMC, SET_TMC_CURRENT 및 INIT_TMC G-Code 명령이 개선되었습니다.

source: Improved support for TMC UART handling with an analog mux.
hu: Javított támogatás a TMC UART kezeléséhez analóg mux-al.
it: Supporto migliorato per la gestione di TMC UART con un mux analogico.
ko: 아날로그 mux로 다뤄지는 TMC UART 지원이 향상되었습니다.

source: Improved homing, probing, and bed leveling support:
hu: Javított célmeghatározás, mérés és tárgyasztal szintezési támogatás:
it: Supporto migliorato per homing, sonda e livellamento del piatto:
ko: 향상된 호밍, 프로빙 및 베드 레벨링 지원:

source: New manual_probe, bed_screws, screws_tilt_adjust, skew_correction, safe_z_home modules added.
hu: Új manual_probe, bed_screws, screws_tilt_adjust, skew_correction, safe_z_home modulok hozzáadása.
it: Aggiunti nuovi moduli manual_probe, bed_screws, Screws_tilt_adjust, skew_correction, safe_z_home.
ko: 새로운 manual_probe, bed_screws, screws_tilt_adjust, skew_correction, safe_z_home 모듈들이 추가되었습니다.

source: Enhanced multi-sample probing with median, average, and retry logic.
hu: Továbbfejlesztett többmintás mérés mediánnal, átlagolással és újrapróbálási logikával.
it: Sondaggio multi-campione migliorato con logica mediana, media e tentativi.
ko: 중앙값, 평균 및 재시도 논리가 포함된 다중 샘플 프로빙이 향상되었습니다.

source: Improved documentation for BL-Touch, probe calibration, endstop calibration, delta calibration, sensorless homing, and endstop phase calibration.
hu: Javított dokumentáció a BL-Touch, a szondakalibrálás, a végállás kalibrálás, a delta kalibrálás, az érzékelő nélküli kezdőpont és a végállás fázis kalibrálásához.
it: Documentazione migliorata per BL-Touch, calibrazione della sonda, calibrazione endstop, calibrazione delta, homing sensorless e calibrazione della fase finecorsa.
ko: BL-Touch, 프로브 교정, 엔드스톱 교정, 델타 캘리브레이션, 센서리스 원점 복귀 및 엔드스톱 위상 교정에 대한 문서 개선되었습니다.

source: Improved homing support on a large Z axis.
hu: Továbbfejlesztett kezdőpont támogatás a Z tengelyen.
it: Supporto della corsa di riferimento migliorato su un asse Z grande.
ko: 큰 Z축에 대한 원점 복귀 지원이 향상되었습니다.

source: Many Klipper micro-controller improvements:
hu: Számos Klipper mikrokontroller fejlesztés:
it: Molti miglioramenti del microcontrollore Klipper:
ko: 많은 Klipper 마이크로 컨트롤러 개선 사항들:

source: Klipper ported to: SAM3X8C, SAM4S8C, SAMD51, STM32F042, STM32F4
hu: Klipper portolva: SAM3X8C, SAM4S8C, SAMD51, STM32F042, STM32F4
it: Klipper portato su: SAM3X8C, SAM4S8C, SAMD51, STM32F042, STM32F4
ko: Klipper 포팅: SAM3X8C, SAM4S8C, SAMD51, STM32F042, STM32F4

source: New USB CDC driver implementations on SAM3X, SAM4, STM32F4.
hu: Új USB CDC-illesztőprogramok SAM3X, SAM4, STM32F4 rendszerekhez.
it: Nuove implementazioni del driver CDC USB su SAM3X, SAM4, STM32F4.
ko: SAM3X, SAM4, STM32F4에서 새로운 USB CDC 드라이버 구현.

source: Enhanced support for flashing Klipper over USB.
hu: Továbbfejlesztett támogatás a Klipper USB-n keresztül történő égetéséhez.
it: Supporto avanzato per il flashing di Klipper su USB.
ko: USB를 통해 깜박이는 Klipper에 대한 지원이 향상되었습니다.

source: Software SPI support.
hu: Szoftveres SPI-támogatás.
it: Supporto SPI software.
ko: 소프트웨어 SPI 지원.

source: Greatly improved temperature filtering on the LPC176x.
hu: Jelentősen javult a hőmérséklet-szűrés az LPC176x-en.
it: Filtraggio della temperatura notevolmente migliorato sull'LPC176x.
ko: LPC176x의 온도 필터링이 크게 향상되었습니다.

source: Early output pin settings can be configured in the micro-controller.
hu: A korai kimeneti érintkezők beállításai a mikrovezérlőben konfigurálhatók.
it: Le impostazioni dei pin di uscita possono essere configurate nel microcontrollore.
ko: 초기 출력 핀 설정은 마이크로 컨트롤러에서 구성될 수 있습니다.

source: New website with the Klipper documentation: http://klipper3d.org/
hu: Új weboldal a Klipper dokumentációval: http://klipper3d.org/
it: Nuovo sito web con la documentazione di Klipper: http://klipper3d.org/
ko: Klipper 문서가 있는 새 웹사이트: http://klipper3d.org/

source: Klipper now has a logo.
hu: A Klippernek már van logója.
it: Klipper ora ha un logo.
ko: 이제 Klipper에 로고가 있습니다.

source: Experimental support for polar and "cable winch" kinematics.
hu: A poláris és a "kábelcsörlő" kinematika kísérleti alátámasztása.
it: Supporto sperimentale alla cinematica polare e "cable winch".
ko: Polar 및 "cable winch" 운동학에 대한 실험적 지원.

source: The config file can now include other config files.
hu: A konfigurációs fájl mostantól más konfigurációs fájlokat is tartalmazhat.
it: Il file di configurazione ora può includere altri file di configurazione.
ko: 이제 구성 파일에 다른 구성 파일이 포함될 수 있습니다.

source: Many additional modules added: board_pins, controller_fan, delayed_gcode, dotstar, filament_switch_sensor, firmware_retraction, gcode_arcs, gcode_button, heater_generic, manual_stepper, mcp4018, mcp4728, neopixel, pause_resume, respond, temperature_sensor tsl1401cl_filament_width_sensor, tuning_tower
hu: Számos további modul hozzá lett adva: board_pins, controller_fan, delayed_gcode, dotstar, filament_switch_sensor, firmware_retraction, gcode_arcs, gcode_button, heater_generic, manual_stepper, mcp4018, mcp4728, neopixel, pause_resume, respond, temperature_sensor tsl1401cl_filament_width_sensor, tuning_tower
it: Molti moduli aggiuntivi aggiunti: board_pins, controller_fan, delay_gcode, dotstar, filament_switch_sensor, firmware_retraction, gcode_arcs, gcode_button, heater_generic, manual_stepper, mcp4018, mcp4728, neopixel, pause_resume, respond, temperature_sensor tsl1401cl_filament_width_sensor, tuning_tower
ko: 많은 추가 모듈이 추가되었습니다: board_pins, controller_fan, delay_gcode, dotstar, filament_switch_sensor, firmware_retraction, gcode_arcs, gcode_button, heater_generic, manual_stepper, mcp4018, mcp4728, 네오픽셀, pause_resume, 응답, temperature_sensor tsl1401cl_filament_width_sensor,tuning_tower

source: Many additional commands added: RESTORE_GCODE_STATE, SAVE_GCODE_STATE, SET_GCODE_VARIABLE, SET_HEATER_TEMPERATURE, SET_IDLE_TIMEOUT, SET_TEMPERATURE_FAN_TARGET
hu: Számos további parancsot adtunk hozzá: RESTORE_GCODE_STATE, SAVE_GCODE_STATE, SET_GCODE_VARIABLE, SET_HEATER_TEMPERATURE, SET_IDLE_TIMEOUT, SET_TEMPERATURE_FAN_TARGET
it: Molti comandi aggiuntivi aggiunti: RESTORE_GCODE_STATE, SAVE_GCODE_STATE, SET_GCODE_VARIABLE, SET_HEATER_TEMPERATURE, SET_IDLE_TIMEOUT, SET_TEMPERATURE_FAN_TARGET
ko: 많은 추가 명령어들이 추가되었습니다: RESTORE_GCODE_STATE, SAVE_GCODE_STATE, SET_GCODE_VARIABLE, SET_HEATER_TEMPERATURE, SET_IDLE_TIMEOUT, SET_TEMPERATURE_FAN_TARGET

source: Available on 20181220. Major changes in this release:
hu: Elérhető a 20181220. Főbb változások a kiadásban:
it: Disponibile su 20181220. Modifiche principali in questa versione:
ko: 20181220에서 사용 가능. 이번 배포의 주요 변경 사항:

source: Klipper now supports "mesh" bed leveling
hu: A Klipper mostantól támogatja a "háló" tárgyasztal szintezés állítást
it: Klipper ora supporta il livellamento del piatto "mesh"
ko: Klipper는 이제 "메쉬" 베드 레벨링을 지원합니다

source: New support for "enhanced" delta calibration (calibrates print x/y dimensions on delta printers)
hu: Új támogatás a "továbbfejlesztett" delta kalibrációhoz (kalibráld a nyomtatás x/y méreteit delta nyomtatókon)
it: Nuovo supporto per la calibrazione delta "potenziata" (calibra le dimensioni x/y di stampa su stampanti delta)
ko: "향상된" 델타 보정에 대한 새로운 지원(델타 프린터의 인쇄 x/y를 보정합니다)

source: Support for run-time configuration of Trinamic stepper motor drivers (tmc2130, tmc2208, tmc2660)
hu: A Trinamic léptetőmotor-meghajtók (tmc2130, tmc2208, tmc2660) futásidejű konfigurációjának támogatása
it: Supporto per la configurazione a runtime dei driver per motori passo-passo Trinamic (tmc2130, tmc2208, tmc2660)
ko: Trinamic 스테퍼 모터 드라이버의 런타임 구성 지원 (tmc2130, tmc2208, tmc2660)

source: Improved temperature sensor support: MAX6675, MAX31855, MAX31856, MAX31865, custom thermistors, common pt100 style sensors
hu: Javított hőmérséklet-érzékelő támogatás: MAX6675, MAX31855, MAX31856, MAX31865, egyedi termisztorok, általános PT100 típusú érzékelők
it: Migliorato il supporto del sensore di temperatura: MAX6675, MAX31855, MAX31856, MAX31865, termistori personalizzati, sensori stile pt100 comuni
ko: 향상된 온도 센서 지원: MAX6675, MAX31855, MAX31856, MAX31865, 맞춤형 서미스터, 일반 pt100 스타일 센서들

source: Several new modules: temperature_fan, sx1509, force_move, mcp4451, z_tilt, quad_gantry_level, endstop_phase, bltouch
hu: Számos új modul: temperature_fan, sx1509, force_move, mcp4451, z_tilt, quad_gantry_level, endstop_phase, bltouch
it: Diversi nuovi moduli: temperature_fan, sx1509, force_move, mcp4451, z_tilt, quad_gantry_level, endstop_phase, bltouch
ko: 몇 가지 새로운 모듈들: temperature_fan, sx1509, force_move, mcp4451, z_tilt, quad_gantry_level, endstop_phase, bltouch

source: Several new commands added: SAVE_CONFIG, SET_PRESSURE_ADVANCE, SET_GCODE_OFFSET, SET_VELOCITY_LIMIT, STEPPER_BUZZ, TURN_OFF_HEATERS, M204, custom g-code macros
hu: Számos új parancs hozzáadása: SAVE_CONFIG, SET_PRESSURE_ADVANCE, SET_GCODE_OFFSET, SET_VELOCITY_LIMIT, STEPPER_BUZZ, TURN_OFF_HEATERS, M204, egyedi G-kód makrók
it: Aggiunti diversi nuovi comandi: SAVE_CONFIG, SET_PRESSURE_ADVANCE, SET_GCODE_OFFSET, SET_VELOCITY_LIMIT, STEPPER_BUZZ, TURN_OFF_HEATERS, M204, macro g-code personalizzate
ko: 몇 가지 새로운 명령이 추가됨: SAVE_CONFIG, SET_PRESSURE_ADVANCE, SET_GCODE_OFFSET, SET_VELOCITY_LIMIT, STEPPER_BUZZ, TURN_OFF_HEATERS, M204, custom g-code macros

source: Expanded LCD display support:
hu: Kibővített LCD-kijelző támogatás:
it: Supporto display LCD esteso:
ko: 확장된 LCD 디스플레이 지원:

source: Support for run-time menus
hu: Futásidejű menük támogatása
it: Supporto per i menu a runtime
ko: 런타임 메뉴 지원

source: New display icons
hu: Új kijelző ikonok
it: Nuove icone di visualizzazione
ko: 새로운 디스플레이 아이콘들

source: Support for "uc1701" and "ssd1306" displays
hu: A "uc1701" és "ssd1306" kijelzők támogatása
it: Supporto per i display "uc1701" e "ssd1306"
ko: "uc1701" 및 "ssd1306" 디스플레이 지원

source: Additional micro-controller support:
hu: További mikrokontroller támogatás:
it: Supporto per microcontrollore aggiuntivo:
ko: 추가 마이크로 컨트롤러 지원:

source: Klipper ported to: LPC176x (Smoothieboards), SAM4E8E (Duet2), SAMD21 (Arduino Zero), STM32F103 ("Blue pill" devices), atmega32u4
hu: Klipper portolva: LPC176x (Smoothieboards), SAM4E8E (Duet2), SAMD21 (Arduino Zero), STM32F103 ("Blue pill" eszközök), atmega32u4
it: Klipper portato su: LPC176x (Smoothieboards), SAM4E8E (Duet2), SAMD21 (Arduino Zero), STM32F103 (dispositivi "blue pill"), atmega32u4
ko: Klipper 포팅: LPC176x (Smoothieboards), SAM4E8E (Duet2), SAMD21 (Arduino Zero), STM32F103 ("Blue pill" devices), atmega32u4

source: New Generic USB CDC driver implemented on AVR, LPC176x, SAMD21, and STM32F103
hu: Új generikus USB CDC vezérlő implementálva AVR, LPC176x, SAMD21 és STM32F103 platformokra
it: Nuovo driver USB CDC generico implementato su AVR, LPC176x, SAMD21 e STM32F103
ko: AVR, LPC176x, SAMD21, and STM32F103에 대해 구현된 새로운 일반 USB CDC 드라이버

source: Performance improvements on ARM processors
hu: Teljesítményjavulás ARM processzorokon
it: Miglioramenti delle prestazioni sui processori ARM
ko: ARM 프로세서의 성능 향상

source: The kinematics code was rewritten to use an "iterative solver"
hu: A kinematikai kódot átírtuk, hogy egy "iteratív megoldót" használjon
it: Il codice della cinematica è stato riscritto per utilizzare un "risolutore iterativo"
ko: 운동학 코드는 "iterative solver"를 사용하도록 다시 작성되었습니다

source: New automatic test cases for the Klipper host software
hu: Új automatikus tesztelési esetek a Klipper gazdagép szoftverhez
it: Nuovi test case automatici per il software host Klipper
ko: Klipper 호스트 소프트웨어를 위한 새로운 자동 테스트 케이스

source: Many new example config files for common off-the-shelf printers
hu: Számos új példa konfigurációs fájl a szokásos nyomtatókhoz
it: Molti nuovi file di configurazione di esempio per le stampanti standard comuni
ko: 일반적인 기성 프린터에 대한 많은 새로운 예제 구성 파일

source: Documentation updates for bootloaders, benchmarking, micro-controller porting, config checks, pin mapping, slicer settings, packaging, and more
hu: Dokumentációfrissítések rendszerbetöltőkhöz, teljesítményértékeléshez, mikrovezérlő portoláshoz, konfigurációs ellenőrzésekhez, tű hozzárendeléshez, szeletelőbeállításokhoz, csomagoláshoz és egyebekhez
it: Aggiornamenti della documentazione per bootloader, benchmarking, porting del microcontroller, controlli di configurazione, mappatura dei pin, impostazioni dello slicer, packaging e altro ancora
ko: 부트로더, 벤치마킹, 마이크로 컨트롤러 포팅, 구성 검사, 핀 매핑, 슬라이서 설정, 패키징 등에 대한 문서 업데이트

source: Several bug fixes and code cleanups
hu: Számos hibajavítás és kódtisztítás
it: Diverse correzioni di bug e pulizia del codice
ko: 여러 버그 수정 및 코드 정리

source: Available on 20180331. Major changes in this release:
hu: Elérhető a 20180331. Főbb változások ebben a kiadásban:
it: Disponibile su 20180331. Modifiche principali in questa versione:
ko: 20180331에서 사용 가능. 이번 배포의 주요 변경 사항:

source: Enhanced heater and thermistor hardware failure checks
hu: Továbbfejlesztett fűtőberendezés és termisztor hardverhiba ellenőrzések
it: Controlli avanzati dei guasti hardware del riscaldatore e del termistore
ko: 향상된 히터 및 서미스터 하드웨어 오류 검사

source: Support for Z probes
hu: Z-szondák támogatása
it: Supporto per sonde Z
ko: Z 프로브 지원

source: Initial support for automatic parameter calibration on deltas (via a new delta_calibrate command)
hu: A delták automatikus paraméterkalibrálásának kezdeti támogatása (egy új delta_calibrate parancson keresztül)
it: Supporto iniziale per la calibrazione automatica dei parametri sulle delta (tramite un nuovo comando delta_calibrate)
ko: 델타에 대한 자동 매개변수 교정에 대한 초기 지원 (새로운 delta_calibration 명령을 통해)

source: Initial support for bed tilt compensation (via bed_tilt_calibrate command)
hu: A tárgyasztal dőléskiegyenlítésének kezdeti támogatása (a bed_tilt_calibrate paranccsal)
it: Supporto iniziale per la compensazione dell'inclinazione del piatto (tramite il comando bed_tilt_calibrate)
ko: 베드 기울기 보정에 대한 초기 지원(bed_tilt_calibration 명령을 통해)

source: Initial support for "safe homing" and homing overrides
hu: A "biztonságos kezdőpont" és a kezdőpont felülbírálásának kezdeti támogatása
it: Supporto iniziale per "homing sicuro" e di homing overrides
ko: "safe homing" 및 귀환 재정의에 대한 초기 지원

source: Initial support for displaying status on RepRapDiscount style 2004 and 12864 displays
hu: Kezdeti támogatás az állapot megjelenítéséhez a RepRapDiscount 2004 és 12864 stílusú kijelzőkön
it: Supporto iniziale per la visualizzazione dello stato sui display RepRapDiscount stile 2004 e 12864
ko: RepRapDiscount 스타일 2004 및 12864 디스플레이에서 상태 표시에 대한 초기 지원

source: New multi-extruder improvements:
hu: Új multi-extruder fejlesztések:
it: Nuovi miglioramenti multi-estrusore:
ko: 새로운 다중 압출기 개선 사항:

source: Support for shared heaters
hu: A megosztott fűtőtestek támogatása
it: Supporto per riscaldatori condivisi
ko: 공유 히터 지원

source: Initial support for dual carriages
hu: Kezdeti támogatás kettős kocsikhoz
it: Supporto iniziale per carrelli doppi
ko: 이중 캐리지에 대한 초기 지원

source: Support for configuring multiple steppers per axis (eg, dual Z)
hu: Több léptető tengelyenkénti konfigurálásának támogatása (pl. kettős Z)
it: Supporto per la configurazione di più stepper per asse (ad es. doppia Z)
ko: 축당 여러 스테퍼 구성 지원(예: 이중 Z)

source: Support for custom digital and pwm output pins (with a new SET_PIN command)
hu: Egyedi digitális és PWM kimeneti tűk támogatása (új SET_PIN paranccsal)
it: Supporto per pin di output digitali e pwm personalizzati (con un nuovo comando SET_PIN)
ko: 사용자 디지털 및 pwm 출력 핀 지원(새로운 SET_PIN 명령어로)
