Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Releases.po
Languages: hu, it, ko

source: Initial support for a "virtual sdcard" that allows printing directly from Klipper (helps on machines too slow to run OctoPrint well)
hu: Kezdeti támogatás egy "virtuális SDcard" számára, amely lehetővé teszi a nyomtatást közvetlenül a Klipper-ről (segít a túl lassú gépeken, hogy az OctoPrint jól fusson)
it: Supporto iniziale per una "sdcard virtuale" che consente di stampare direttamente da Klipper (aiuta su macchine troppo lente per eseguire bene OctoPrint)
ko: Klipper에서 직접 인쇄할 수 있는 "가상 sdcard"에 대한 초기 지원 (OctoPrint를 제대로 실행하기에는 너무 느린 장비들에 도움이 됨)

source: Support for setting different arm lengths on each tower of a delta
hu: Különböző karhosszúságok beállításának támogatása a delta minden egyes tornyán
it: Supporto per impostare diverse lunghezze del braccio su ciascuna torre di una delta
ko: 델타의 각 타워에 서로 다른 암 길이 설정 지원

source: Support for G-Code M220/M221 commands (speed factor override / extrude factor override)
hu: A G-kód M220/M221 parancsok támogatása (sebességtényező felülbírálása / extrudálási tényező felülbírálása)
it: Supporto per i comandi G-Code M220/M221 (override del fattore di velocità/override del fattore di estrusione)
ko: G-Code M220/M221 명령어 지원(속도 계수 재정의/압출 계수 재정의)

source: Several documentation updates:
hu: Számos dokumentáció frissítés:
it: Diversi aggiornamenti della documentazione:
ko: 여러 문서 업데이트:

source: New multiple MCU config example
hu: Új több MCU konfigurációs példa
it: Nuovo esempio di configurazione di MCU multipli
ko: 새로운 다중 MCU 구성 예제

source: New bltouch sensor config example
hu: Új BL-Touch érzékelő konfigurációs példa
it: Nuovo esempio di configurazione del sensore bltouch
ko: 새로운 bltouch 센서 구성 예제

source: New FAQ, config check, and G-Code documents
hu: Új GYIK, konfigurációs ellenőrzés és G-kód dokumentumok
it: Nuove FAQ, controllo della configurazione e documenti G-Code
ko: 새로운 FAQ, 구성 확인 및 G-Code 문서

source: Initial support for continuous integration testing on all github commits
hu: Kezdeti támogatás a folyamatos integráció teszteléséhez az összes végleges GitHub fejlesztésben
it: Supporto iniziale per test di integrazione continui su tutti i commit di github
ko: 모든 github 커밋에 대한 지속적인 통합 테스트를 위한 초기 지원

source: Available on 20171025. Major changes in this release:
hu: Elérhető a 20171025. Főbb változások ebben a kiadásban:
it: Disponibile su 20171025. Modifiche principali in questa versione:
ko: 20171025에서 사용 가능. 이번 배포의 주요 변경 사항:

source: Support for printers with multiple extruders.
hu: Több extruder-el rendelkező nyomtatók támogatása.
it: Supporto per stampanti con più estrusori.
ko: 여러 압출기들을 갖는 프린터 지원.

source: Initial support for running on the Beaglebone PRU. Initial support for the Replicape board.
hu: Kezdeti támogatás a Beaglebone PRU-n való futtatáshoz. Kezdeti támogatás a Replicape alaplaphoz.
it: Supporto iniziale per l'esecuzione su Beaglebone PRU. Supporto iniziale per la scheda Replicape.
ko: Beaglebone PRU에서 실행하기 위한 초기 지원. Replicape 보드에 대한 초기 지원.

source: Initial support for running the micro-controller code in a real-time Linux process.
hu: Kezdeti támogatás a mikrokontroller kódjának valós idejű Linux-folyamatban történő futtatásához.
it: Supporto iniziale per l'esecuzione del codice del microcontrollore in un processo Linux in tempo reale.
ko: 실시간 Linux 프로세스에서 마이크로 컨트롤러 코드를 실행하기 위한 초기 지원.

source: Support for multiple micro-controllers. (For example, one could control an extruder with one micro-controller and the rest of the printer with another.) Software clock synchronization is implemented to coordinate actions between micro-controllers.
hu: Több mikrovezérlő támogatása. (Például egy extruder vezérelhető egy mikrokontrollerrel, a nyomtató többi része pedig egy másikkal.) A mikrovezérlők közötti műveletek összehangolásához szoftveres órajel-szinkronizálás van implementálva.
it: Supporto per microcontrollori multipli. (Ad esempio, si potrebbe controllare un estrusore con un microcontrollore e il resto della stampante con un altro.) La sincronizzazione dell'orologio del software è implementata per coordinare le azioni tra i microcontrollori.
ko: 여러 마이크로 컨트롤러를 지원합니다. (예를 들어, 하나의 마이크로 컨트롤러로 압출기를 제어하고 다른 마이크로 컨트롤러로 나머지 프린터를 제어할 수 있습니다.) 소프트웨어 클록 동기화는 마이크로 컨트롤러 간의 작업을 조정하기 위해 구현됩니다.

source: Stepper performance improvements (20Mhz AVRs up to 189K steps per second).
hu: Léptető teljesítményének javítása (20Mhz-es AVR-ek akár 189K lépés/másodpercig).
it: Miglioramenti delle prestazioni stepper (AVR da 20 Mhz fino a 189.000 passi al secondo).
ko: 스테퍼 성능 향상(20Mhz AVRs over 189K steps per second).

source: Support for controlling servos and support for defining nozzle cooling fans.
hu: Támogatás a szervók vezérléséhez és a fejhűtő ventilátorok meghatározásához.
it: Supporto per il controllo dei servocomandi e supporto per la definizione delle ventole di raffreddamento degli ugelli.
ko: 서보 제어 지원 및 노즐 냉각 팬 정의 지원.

source: Available on 20170503. Major changes in this release:
hu: Elérhető a 20170503. Főbb változások ebben a kiadásban:
it: Disponibile su 20170503. Modifiche principali in questa versione:
ko: 20170503에서 사용 가능. 이번 배포의 주요 변경 사항:

source: Improved installation on Raspberry Pi machines. Most of the install is now scripted.
hu: Javított telepítés Raspberry Pi gépekre. A telepítés nagy része most már szkriptelt.
it: Installazione migliorata su macchine Raspberry Pi. La maggior parte dell'installazione è ora basata su script.
ko: Raspberry Pi 머신에서 설치가 개선되었습니다. 이제 대부분의 설치가 스크립트로 작성됩니다.

source: Support for corexy kinematics
hu: A corexy kinematika támogatása
it: Supporto per la cinematica corexy
ko: corexy 운동학 지원

source: Documentation updates: New Kinematics document, new Pressure Advance tuning guide, new example config files, and more
hu: Dokumentáció frissítések: Új Kinematika dokumentum, új Pressure Advance tuning útmutató, új példa konfigurációs fájlok, stb
it: Aggiornamenti della documentazione: nuovo documento Cinematica, nuova guida all'ottimizzazione di Pressure Advance, nuovi file di configurazione di esempio e altro ancora
ko: 문서 업데이트: 새로운 Kinematics 문서, 새로운 Pressure Advance 조정 가이드, 새로운 예제 구성 파일 등

source: Stepper performance improvements (20Mhz AVRs over 175K steps per second, Arduino Due over 460K)
hu: Léptető teljesítmény javulása (20Mhz AVR több mint 175K lépés/másodperc, Arduino Due több mint 460K)
it: Miglioramenti delle prestazioni dello stepper (AVR da 20 Mhz su 175.000 passi al secondo, Arduino Due oltre 460.000)
ko: 스테퍼 성능 향상 (20Mhz AVRs over 175K steps per second, Arduino Due over 460K)

source: Support for automatic micro-controller resets. Support for resets via toggling USB power on Raspberry Pi.
hu: A mikrokontroller automatikus visszaállításának támogatása. A Raspberry Pi USB tápellátásának kapcsolásával történő visszaállítás támogatása.
it: Supporto per il ripristino automatico del microcontrollore. Supporto per il ripristino tramite l'attivazione dell'alimentazione USB su Raspberry Pi.
ko: 자동 마이크로 컨트롤러 재설정 지원. Raspberry Pi에서 USB 전원 전환을 통한 재설정 지원.

source: The pressure advance algorithm now works with look-ahead to reduce pressure changes during cornering.
hu: A nyomás előtolás algoritmus mostantól look-ahead funkcióval működik, hogy csökkentse a kanyarodás közbeni nyomásváltozásokat.
it: L'algoritmo di avanzamento della pressione ora funziona con il look-ahead per ridurre le variazioni di pressione in curva.
ko: 압력 진행 알고리즘은 이제 코너링 중 압력 변화를 줄이기 위해 미리보기와 함께 작동합니다.

source: Support for limiting the top speed of short zigzag moves
hu: A rövid cikcakk mozgások maximális sebességének korlátozása
it: Supporto per limitare la velocità massima di brevi movimenti a zigzag
ko: 짧은 지그재그 이동의 최고 속도 제한 지원

source: Support for AD595 sensors
hu: AD595 érzékelők támogatása
it: Supporto per sensori AD595
ko: AD595 센서 지원

source: Available on 20161223. Major changes in this release:
hu: Elérhető a 20161223. Főbb változások ebben a kiadásban:
it: Disponibile su 20161223. Modifiche principali in questa versione:
ko: 20161223에서 사용 가능. 이번 배포의 주요 변경 사항:

source: Improved documentation
hu: Javított dokumentáció
it: Documentazione migliorata
ko: 개선된 문서

source: Support for robots with delta kinematics
hu: Delta kinematikai robotok támogatása
it: Supporto per robot con cinematica delta
ko: 델타 운동학이 있는 로봇 지원

source: Support for Arduino Due micro-controller (ARM cortex-M3)
hu: Arduino Due mikrokontroller támogatása (ARM cortex-M3)
it: Supporto per microcontrollore Arduino Due (ARM cortex-M3)
ko: Arduino Due 마이크로 컨트롤러(ARM cortex-M3) 지원

source: Support for USB based AVR micro-controllers
hu: USB alapú AVR mikrovezérlők támogatása
it: Supporto USB per microcontrollori basati su AVR
ko: USB 기반 AVR 마이크로 컨트롤러 지원

source: Support for "pressure advance" algorithm - it reduces ooze during prints.
hu: Támogatás a "nyomás előtolás" algoritmushoz - ez csökkenti a nyomatok során keletkező szivárgást.
it: Supporto per l'algoritmo di "pressure advance": riduce la trasudazione durante le stampe.
ko: "압력 진행" 알고리즘 지원 - 인쇄 중 노즐 흘러내림을 줄입니다.

source: New "stepper phased based endstop" feature - enables higher precision on endstop homing.
hu: Új "léptetőfázis-alapú végállás" funkció - nagyobb pontosságot tesz lehetővé a kezdőpont végállásában.
it: Nuova funzione "stopper phased based" - consente una maggiore precisione sull'homing.
ko: 새로운 "스테퍼 단계 기반 엔드스톱" 기능 - 엔드스톱 원점 복귀에서 더 높은 정밀도를 가능하게 합니다.

source: Support for "extended g-code" commands such as "help", "restart", and "status".
hu: A "kiterjesztett G-kód" parancsok támogatása, mint például a "help", "restart" és "status".
it: Supporto per comandi "extended g-code" come "help", "restart" e "status".
ko: "help", "restart" 및 "status"와 같은 "확장된 g-code" 명령 지원. 터미널에서 "다시 시작" 명령을 실행하여 Klipper 구성을 다시 로드하고 호스트 소프트웨어를 다시 시작하도록 지원합니다.

source: Support for reloading the Klipper config and restarting the host software by issuing a "restart" command from the terminal.
hu: A Klipper konfiguráció újratöltésének és a gazdaszoftver újraindításának támogatása a "restart" parancs terminálból történő kiadásával.
it: Supporto per ricaricare la configurazione di Klipper e riavviare il software host emettendo un comando di "restart" dal terminale.
ko: 스테퍼 성능 개선 (20Mhz AVRs up to 158K steps per second).

source: Stepper performance improvements (20Mhz AVRs up to 158K steps per second).
hu: Lépegető teljesítményének javítása (20Mhz-es AVR-ek akár 158K lépés/másodpercig).
it: Miglioramenti delle prestazioni stepper (AVR da 20 Mhz fino a 158.000 passi al secondo).
ko: 향상된 오류 보고. 어떻게 해결해야하는 방법에 대한 도움말과 함께 대부분의 오류가 터미널을 통해 표시됩니다.

source: Improved error reporting. Most errors now shown via the terminal along with help on how to resolve.
hu: Javított hibajelentés. A legtöbb hiba mostantól a terminálon keresztül jelenik meg, a megoldásra vonatkozó segítséggel együtt.
it: Segnalazione errori migliorata. La maggior parte degli errori ora viene mostrata tramite il terminale insieme all'aiuto su come risolverli.
ko: 향상된 오류 보고. 어떻게 해결해야하는 방법에 대한 도움말과 함께 대부분의 오류가 터미널을 통해 표시됩니다.

source: Initial release of Klipper. Available on 20160525. Major features available in the initial release include:
hu: A Klipper első kiadása. Elérhető a 20160525. A kezdeti kiadásban elérhető főbb funkciók a következők:
it: Rilascio iniziale di Klipper. Disponibile su 20160525. Le principali funzionalità disponibili nella versione iniziale includono:
ko: Klipper의 초기 릴리스. 20160525에서 사용 가능. 초기 배포에서 사용할 수 있는 주요 기능은 다음과 같습니다:

source: Basic support for cartesian printers (steppers, extruder, heated bed, cooling fan).
hu: Alapvető támogatás cartesian nyomtatókhoz (stepperek, extruder, fűtött tárgyasztal, hűtőventilátor).
it: Supporto di base per stampanti cartesiane (stepper, estrusore, piatto riscaldato, ventola di raffreddamento).
ko: 직교형 프린터에 대한 기본 지원(스테퍼, 압출기, 히팅 베드, 냉각 팬).

source: Support for common g-code commands. Support for interfacing with OctoPrint.
hu: A gyakori G-Kód parancsok támogatása. Az OctoPrint interfész támogatása.
it: Supporto per i comandi g-code comuni. Supporto per interfacciarsi con OctoPrint.
ko: 일반적인 g-code 명령을 지원. OctoPrint와의 인터페이스 지원.

source: Acceleration and lookahead handling
hu: Gyorsulás és előretekintő kezelés
it: Accelerazione e gestione lookahead
ko: 가속 및 예견 처리

source: Support for AVR micro-controllers via standard serial ports
hu: AVR mikrovezérlők támogatása szabványos soros portokon keresztül
it: Supporto per microcontrollori AVR tramite porte seriali standard
ko: 표준 직렬 포트를 통한 AVR 마이크로 컨트롤러 지원

source: Releases
hu: Kiadás
it: Versioni
ko: 릴리즈

source: Available on 20210929. Major changes in this release:
hu: Elérhető a 20210929. Fontosabb változások ebben a kiadásban:
it: Disponibile su 20210929. Principali modifiche in questa versione:

source: Support for "Multi-MCU Homing". It is now possible for a stepper motor and its endstop to be wired to separate micro-controllers. This simplifies wiring of Z probes on "toolhead boards".
hu: A "Multi-MCU Homing" támogatása. Mostantól lehetőség van arra, hogy egy léptetőmotor és a végállás külön mikrovezérlőkhöz legyen csatlakoztatva. Ez leegyszerűsíti a Z-érzékelők kábelezését a "nyomtatófejen".
it: Supporto per "Homing multi-MCU". È ora possibile collegare un motore passo-passo e il relativo fine corsa a microcontrollori separati. Ciò semplifica il cablaggio delle sonde Z sulle "schede portautensili".

source: Klipper now has a [Community Discord Server](https://discord.klipper3d.org) and a [Community Discourse Server](https://community.klipper3d.org).
hu: Klipper mostantól rendelkezik egy [Közösségi Discord Szerver](https://discord.klipper3d.org) és egy [Közösségi Társalgó Szerver](https://community.klipper3d.org)-rel.
it: Klipper ora ha un [Community Discord Server](https://discord.klipper3d.org) e un [Community Discourse Server](https://community.klipper3d.org).

source: The [Klipper website](https://www.klipper3d.org) now uses the "mkdocs" infrastructure. There is also a [Klipper Translations](https://github.com/Klipper3d/klipper-translations) project.
hu: A [Klipper weboldal](https://www.klipper3d.org) mostantól az "mkdocs" infrastruktúrát használja. Létezik egy [Klipper Fordítások](https://github.com/Klipper3d/klipper-translations) projekt is.
it: Il [sito Web di Klipper](https://www.klipper3d.org) ora utilizza l'infrastruttura "mkdocs". Esiste anche un progetto [Klipper Translations](https://github.com/Klipper3d/klipper-translations).

source: Automated support for flashing firmware via sdcard on many boards.
hu: Automatizált támogatás a firmware SDkártyán keresztüli égetéséhez számos lapon.
it: Supporto automatizzato per il flashing del firmware tramite sdcard su molte schede.

source: New kinematic support for "Hybrid CoreXY" and "Hybrid CoreXZ" printers.
hu: Új kinematikai támogatás a "Hybrid CoreXY" és "Hybrid CoreXZ" nyomtatókhoz.
it: Nuovo supporto cinematico per le stampanti "Hybrid CoreXY" e "Hybrid CoreXZ".

source: Klipper now uses `rotation_distance` to configure stepper motor travel distances.
hu: A Klipper mostantól a `rotation_distance` funkciót használja a léptetőmotorok mozgási távolságának beállításához.
it: Klipper ora usa `rotation_distance` per configurare le distanze di viaggio del motore passo-passo.

source: The main Klipper host code can now directly communicate with micro-controllers using CAN bus.
hu: A Klipper fő gazdakódja mostantól közvetlenül kommunikálhat a mikrovezérlőkkel a CAN-buszon keresztül.
it: Il codice host principale di Klipper ora può comunicare direttamente con i microcontrollori utilizzando il bus CAN.

source: New "motion analysis" system. Klipper's internal motion updates and sensor results can be tracked and logged for analysis.
hu: Új "mozgáselemző" rendszer. A Klipper 'belső mozgásfrissítések és az érzékelő eredményei nyomon követhetők és naplózhatók elemzés céljából.
it: Nuovo sistema di "analisi del movimento". Gli aggiornamenti di movimento interni di Klipper e i risultati dei sensori possono essere tracciati e registrati per l'analisi.

source: Trinamic stepper motor drivers are now continuously monitored for error conditions.
hu: A Trinamic léptetőmotor-meghajtókat mostantól folyamatosan ellenőrzik a hibaállapotok szempontjából.
it: I driver per motori passo-passo Trinamic sono ora costantemente monitorati per rilevare eventuali condizioni di errore.

source: Support for the rp2040 micro-controller (Raspberry Pi Pico boards).
hu: Az rp2040 mikrokontroller támogatása (Raspberry Pi Pico lapok).
it: Supporto per il microcontrollore rp2040 (schede Raspberry Pi Pico).

source: The "make menuconfig" system now utilizes kconfiglib.
hu: A "make menuconfig" rendszer mostantól a kconfiglib-et használja.
it: Il sistema "make menuconfig" ora utilizza kconfiglib.

source: Many additional modules added: ds18b20, duplicate_pin_override, filament_motion_sensor, palette2, motion_report, pca9533, pulse_counter, save_variables, sdcard_loop, temperature_host, temperature_mcu
hu: Hozzáadva számos további modul: ds18b20, duplicate_pin_override, filament_motion_sensor, palette2, motion_report, pca9533, pulse_counter, save_variables, sdcard_loop, temperature_host, temperature_mcu
it: Molti moduli aggiuntivi aggiunti: ds18b20, duplicate_pin_override, filament_motion_sensor, palette2, motion_report, pca9533, pulse_counter, save_variables, sdcard_loop, temperature_host, temperature_mcu
