Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Resonance_Compensation.po
Languages: hu, it, ko, zh_hant

source: No, `input_shaper` feature has pretty much no impact on the print times by itself. However, the value of `max_accel` certainly does (tuning of this parameter described in [this section](#selecting-max_accel)).
hu: Nem, a `input_shaper` funkció önmagában nincs hatással a nyomtatási időre. A `max_accel` értéke azonban bizonyosan befolyásolja (ennek a paraméternek a hangolása [ebben a szakaszban](#selecting-max_accel) le van írva).
it: No, la funzione `input_shaper` non ha praticamente alcun impatto sui tempi di stampa da sola. Tuttavia, il valore di `max_accel` lo fa certamente (regolazione di questo parametro descritta in [questa sezione](#selecting-max_accel)).
ko: 아니요, 'input_shaper' 기능 자체는 인쇄 시간에 거의 영향을 미치지 않습니다. 그러나 `max_accel`의 값은 확실히 영향을 미칩니다.([이 섹션](#selecting-max_accel)에 설명된 이 매개변수의 조정).
zh_hant: 不，`input_shaper` 功能本身對打印時間幾乎沒有影響。但是，`max_accel` 的值肯定會起作用（在 [this section](#selecting-max_accel) 中描述了此參數的調整）。

source: Technical details
hu: Műszaki részletek
it: Dettagli tecnici
ko: 기술적 세부 사항
zh_hant: 技術細節

source: Input shapers
hu: Bemeneti változók
it: Input shaper

source: Input shapers used in Klipper are rather standard, and one can find more in-depth overview in the articles describing the corresponding shapers. This section contains a brief overview of some technical aspects of the supported input shapers. The table below shows some (usually approximate) parameters of each shaper.
hu: A Klipperben használt bemeneti formázók meglehetősen szabványosak, és részletesebb áttekintést a megfelelő formázókat leíró cikkekben találhatunk. Ez a szakasz a támogatott bemeneti formázók néhány technikai szempontjának rövid áttekintését tartalmazza. Az alábbi táblázat az egyes shaperek néhány (általában hozzávetőleges) paraméterét mutatja.
it: Gli shaper di input utilizzati in Klipper sono piuttosto standard e si può trovare una panoramica più approfondita negli articoli che descrivono gli shaper corrispondenti. Questa sezione contiene una breve panoramica di alcuni aspetti tecnici degli input shaper supportati. La tabella seguente mostra alcuni parametri (solitamente approssimativi) di ciascun shaper.
ko: Klipper에서 사용되는 input shapers는 다소 표준적이며 해당 shapers를 설명하는 문서에서 더 자세한 개요를 찾을 수 있습니다. 이 섹션에는 지원되는 input shapers의 일부 기술적인 측면에 대한 간략한 개요가 포함되어 있습니다. 아래 표는 각 shpaer의 일부(대개 대략적인) 매개변수를 보여줍니다.
zh_hant: Klipper 中使用的 input shaper相當標準，可以在描述相應整形器的文章中找到更深入的概述。本節簡要概述了受支持的input shaper的一些技術方面。下表顯示了每個整形器的一些（通常是近似的）參數。

source: Input <br> shaper
hu: Bemeneti <br> változó

source: Shaper <br> duration
hu: Változó <br> időtartam
zh_hant: Shaper <br> 時段

source: Vibration reduction 20x <br> (5% vibration tolerance)
hu: Rezonancia csökkentés 20x <br> (5% rezgéstűrés)
it: Riduzione delle vibrazioni 20x <br> (5% di tolleranza alle vibrazioni)
zh_hant: 減振 20 倍 <br>（5% 振動容限）

source: Vibration reduction 10x <br> (10% vibration tolerance)
hu: Rezonancia csökkentés 10x <br> (10% rezgéstűrés)
it: Riduzione delle vibrazioni 10 volte <br> (tolleranza alle vibrazioni del 10%)
zh_hant: 減振 10 倍 <br>（10% 振動容限）

source: A note on vibration reduction: the values in the table above are approximate. If the damping ratio of the printer is known for each axis, the shaper can be configured more precisely and it will then reduce the resonances in a bit wider range of frequencies. However, the damping ratio is usually unknown and is hard to estimate without a special equipment, so Klipper uses 0.1 value by default, which is a good all-round value. The frequency ranges in the table cover a number of different possible damping ratios around that value (approx. from 0.05 to 0.2).
hu: Megjegyzés a rezonancia csökkentéssel kapcsolatban: a fenti táblázatban szereplő értékek hozzávetőlegesek. Ha a nyomtató csillapítási aránya minden egyes tengely esetében ismert, akkor a formázó pontosabban konfigurálható, és ekkor a rezonanciákat egy kicsit szélesebb frekvenciatartományban csökkenti. A csillapítási arány azonban általában ismeretlen, és speciális berendezés nélkül nehéz megbecsülni, ezért a Klipper alapértelmezés szerint 0,1 értéket használ, ami egy jó általános érték. A táblázatban szereplő frekvenciatartományok számos különböző lehetséges csillapítási arányt fednek le ezen érték körül (kb. 0,05-től 0,2-ig).
it: Una nota sulla riduzione delle vibrazioni: i valori nella tabella sopra sono approssimativi. Se il rapporto di smorzamento della stampante è noto per ciascun asse, lo shaper può essere configurato in modo più preciso e ridurrà quindi le risonanze in una gamma di frequenze leggermente più ampia. Tuttavia, il rapporto di smorzamento è solitamente sconosciuto ed è difficile da stimare senza un'attrezzatura speciale, quindi Klipper utilizza il valore 0,1 per impostazione predefinita, che è un buon valore a tutto tondo. Le gamme di frequenza nella tabella coprono un numero di diversi possibili rapporti di smorzamento attorno a quel valore (da 0,05 a 0,2 circa).
ko: 진동 감소에 대한 참고 사항: 위 표의 값은 대략적인 값입니다. 프린터의 감쇠비가 각 축에 대해 알려지면 shaper를 더 정확하게 구성할 수 있으며 그러면 좀 더 넓은 범위의 주파수에서 공진을 줄일 수 있습니다. 그러나 감쇠비는 일반적으로 알려지지 않고 특별한 장비 없이는 추정하기 어렵기 때문에 Klipper는 기본적으로 0.1 값을 사용하며 이는 좋은 만능 값입니다. 표의 주파수 범위는 해당 값(약 0.05 ~ 0.2) 주변에서 가능한 다양한 감쇠비를 포함합니다.
zh_hant: 關於減振的說明：上表中的值是近似值。如果打印機的阻尼比對於每個軸都是已知的，那麼整形器可以更精確地配置，然後它將在更寬的頻率範圍內減少共振。但是阻尼比通常是未知的，如果沒有特殊的設備很難估計，所以 Klipper 默認使用 0.1 值，這是一個很好的綜合值。表中的頻率範圍涵蓋了該值附近的許多不同可能的阻尼比（大約從 0.05 到 0.2）。

source: Also note that EI, 2HUMP_EI, and 3HUMP_EI are tuned to reduce vibrations to 5%, so the values for 10% vibration tolerance are provided only for the reference.
hu: Vegye figyelembe azt is, hogy az EI, 2HUMP_EI és 3HUMP_EI úgy van beállítva, hogy a rezonanciákat 5%-ra csökkentse, ezért a 10%-os rezonanciára vonatkozó értékek csak referenciaként szolgálnak.
it: Si noti inoltre che EI, 2HUMP_EI e 3HUMP_EI sono sintonizzati per ridurre le vibrazioni al 5%, quindi i valori per la tolleranza alle vibrazioni del 10% sono forniti solo per riferimento.
ko: 또한 EI, 2HUMP_EI 및 3HUMP_EI는 진동을 5%로 줄이도록 조정되었으며,따라서 10% 진동 허용 오차 값은 참고용으로만 제공됩니다.
zh_hant: 另請注意，EI、2HUMP_EI 和 3HUMP_EI 已調整為將振動降低到 5%，因此 10% 振動容限的值僅供參考。

source: **How to use this table:**
hu: **Hogyan használjuk ezt a táblázatot:**
it: **Come utilizzare questa tabella:**
ko: **이 표를 사용하는 방법:**
zh_hant: **如何使用此表：**

source: Shaper duration affects the smoothing in parts - the larger it is, the more smooth the parts are. This dependency is not linear, but can give a sense of which shapers 'smooth' more for the same frequency. The ordering by smoothing is like this: ZV < MZV < ZVD ≈ EI < 2HUMP_EI < 3HUMP_EI. Also, it is rarely practical to set shaper_freq = resonance freq for shapers 2HUMP_EI and 3HUMP_EI (they should be used to reduce vibrations for several frequencies).
hu: A formázó időtartama befolyásolja az alkatrészek simítását - minél nagyobb, annál simábbak az alkatrészek. Ez a függőség nem lineáris, de érzékelteti, hogy ugyanazon frekvencia esetén melyik shaper 'simító' simít jobban. A simítás szerinti sorrend így néz ki: ZV < MZV < ZVD ≈ EI < 2HUMP_EI < 3HUMP_EI. Továbbá, a 2HUMP_EI és 3HUMP_EI alakítók esetében ritkán praktikus a shaper_freq = rezonancia frekvencia értéket beállítani (ezeket több frekvencia rezgéseinek csökkentésére kell használni).
it: La durata dello shaper influisce sull0 smoothing delle parti: più è grande, più le parti sono lisce. Questa dipendenza non è lineare, ma può dare un'idea di quali shaper "levigano" di più per la stessa frequenza. L'ordinamento per smoothing è il seguente: ZV < MZV < ZVD ≈ EI < 2HUMP_EI < 3HUMP_EI. Inoltre, raramente è pratico impostare shaper_freq = resonance freq per gli shaper 2HUMP_EI e 3HUMP_EI (dovrebbero essere usati per ridurre le vibrazioni per diverse frequenze).
ko: Shaper 지속 시간은 부품의 smoothing에 영향을 줍니다. 크기가 클수록 부품이 더 부드러워집니다. 이 종속성은 선형이 아니지만 동일한 주파수에 대해 어떤 shapers가 더 '매끄러운' 느낌을 줄 수 있습니다. Smoothing에 의한 순서는 다음과 같습니다: ZV < MZV < ZVD ≈ EI < 2HUMP_EI < 3HUMP_EI. 또한 shapers 2HUMP_EI 및 3HUMP_EI에 대해 shaper_freq = 공진 주파수를 설정하는 것은 거의 실용적이지 않습니다(여러 주파수에 대한 진동을 줄이는 데 사용해야 함).
zh_hant: Shaper 持續時間會影響零件的平滑度 - 它越大，零件越平滑。這種依賴性不是線性的，但可以讓您了解對於相同頻率哪些整形器更“平滑”。平滑排序是這樣的：ZV < MZV < ZVD ≈ EI < 2HUMP_EI < 3HUMP_EI。此外，為整形器 2HUMP_EI 和 3HUMP_EI 設置 shaper_freq = 共振頻率很少實用（它們應該用於減少多個頻率的振動）。

source: One can estimate a range of frequencies in which the shaper reduces vibrations. For example, MZV with shaper_freq = 35 Hz reduces vibrations to 5% for frequencies [33.6, 36.4] Hz. 3HUMP_EI with shaper_freq = 50 Hz reduces vibrations to 5% in range [27.5, 75] Hz.
hu: Megbecsülhető az a frekvenciatartomány, amelyben a formázó csökkenti a rezgéseket. Például a shaper_freq = 35 Hz-es MZV a [33,6, 36,4] Hz-es frekvencián 5%-ra csökkenti a rezgéseket. A 3HUMP_EI shaper_freq = 50 Hz esetén a [27,5, 75] Hz tartományban 5%-ra csökkenti a rezgéseket.
it: Si può stimare una gamma di frequenze in cui lo shaper riduce le vibrazioni. Ad esempio, MZV con shaper_freq = 35 Hz riduce le vibrazioni al 5% per le frequenze [33,6, 36,4] Hz. 3HUMP_EI con shaper_freq = 50 Hz riduce le vibrazioni al 5% nell'intervallo [27,5, 75] Hz.
ko: Shaper가 진동을 줄이는 주파수 범위를 추정할 수 있습니다. 예를 들어 shaper_freq = 35Hz인 MZV는 주파수 [33.6, 36.4]Hz에 대해 진동을 5%로 줄입니다. shaper_freq = 50Hz인 3HUMP_EI는 [27.5, 75]Hz 범위에서 진동을 5%로 줄입니다.
zh_hant: 人們可以估計整形器減少振動的頻率範圍。例如，shaper_freq = 35 Hz 的 MZV 將頻率 [33.6, 36.4] Hz 的振動降低到 5%。 shaper_freq = 50 Hz 的 3HUMP_EI 在 [27.5, 75] Hz 範圍內將振動降低到 5%。

source: One can use this table to check which shaper they should be using if they need to reduce vibrations at several frequencies. For example, if one has resonances at 35 Hz and 60 Hz on the same axis: a) EI shaper needs to have shaper_freq = 35 / (1 - 0.2) = 43.75 Hz, and it will reduce resonances until 43.75 * (1 + 0.2) = 52.5 Hz, so it is not sufficient; b) 2HUMP_EI shaper needs to have shaper_freq = 35 / (1 - 0.35) = 53.85 Hz and will reduce vibrations until 53.85 * (1 + 0.35) = 72.7 Hz - so this is an acceptable configuration. Always try to use as high shaper_freq as possible for a given shaper (perhaps with some safety margin, so in this example shaper_freq ≈ 50-52 Hz would work best), and try to use a shaper with as small shaper duration as possible.
hu: A táblázat segítségével ellenőrizheti, hogy melyik változót kell használnia, ha több frekvencián kell csökkentenie a rezgéseket. Például, ha ugyanazon a tengelyen 35 Hz-es és 60 Hz-es rezonanciák vannak: a) az EI alakítónak a shaper_freq = 35 / (1 - 0,2) = 43,75 Hz-re van szüksége, és 43,75 * (1 + 0,2) = 52-ig csökkenti a rezonanciákat tehát az 52.5 Hz, nem elegendő. b) a 2HUMP_EI alakítónak shaper_freq = 35 / (1 - 0,35) = 53,85 Hz-nek kell lennie, és 53,85 * (1 + 0,35) = 72,7 Hz-ig csökkenti a rezgéseket - tehát ez egy elfogadható konfiguráció. Mindig próbáljon meg minél magasabb shaper_freq-et használni egy adott shaperhez (esetleg némi biztonsági tartalékkal, így ebben a példában a shaper_freq ≈ 50-52 Hz lenne a legjobb), és próbáljon meg minél kisebb shaper időtartamú értéket használni.
it: Si può usare questa tabella per verificare quale shaper dovrebbero usare se hanno bisogno di ridurre le vibrazioni a diverse frequenze. Ad esempio, se si hanno risonanze a 35 Hz e 60 Hz sullo stesso asse: a) EI shaper deve avere shaper_freq = 35 / (1 - 0,2) = 43,75 Hz, e ridurrà le risonanze fino a 43,75 * (1 + 0,2 ) = 52,5 Hz, quindi non è sufficiente; b) 2HUMP_EI shaper deve avere shaper_freq = 35 / (1 - 0,35) = 53,85 Hz e ridurrà le vibrazioni fino a 53,85 * (1 + 0,35) = 72,7 Hz - quindi questa è una configurazione accettabile. Cerca sempre di usare shaper_freq il più alto possibile per un dato shaper (magari con un certo margine di sicurezza, quindi in questo esempio shaper_freq ≈ 50-52 Hz funzionerebbe meglio), e prova a usare uno shaper con la minor durata possibile dello shaper.
ko: 이 표를 사용하여 여러 주파수에서 진동을 줄여야 하는 경우 사용해야 하는 shaper를 확인할 수 있습니다. 예를 들어, 동일한 축에서 35Hz와 60Hz에서 공진이 있는 경우: a) EI shaper는 shaper_freq = 35 / (1 - 0.2) = 43.75Hz를 가져야 하며 43.75 * (1 + 0.2) = 52.5Hz까지 공진을 감소시키므로 충분하지 않습니다; b) 2HUMP_EI shaper는 shaper_freq = 35 / (1 - 0.35) = 53.85Hz를 가져야 하며 53.85 * (1 + 0.35) = 72.7Hz까지 진동을 감소시키므로 이것이 허용되는 구성입니다. 항상 주어진 shaper에 대해 가능한 한 높은 shaper_freq를 사용하려고 시도하고 (아마도 약간의 안전 여유가 있으므로 이 예에서는 shaper_freq ≈ 50-52Hz가 가장 잘 작동함) shaper 지속 시간이 가능한 짧은 shaper를 사용하려고 합니다.
zh_hant: 如果他們需要減少多個頻率的振動，可以使用此表來檢查他們應該使用哪個整形器。例如，如果在同一軸上有 35 Hz 和 60 Hz 的共振： a) EI 整形器需要 shaper_freq = 35 / (1 - 0.2) = 43.75 Hz，它將減少共振直到 43.75 * (1 + 0.2 ) = 52.5 Hz，因此還不夠； b) 2HUMP_EI shaper 需要 shaper_freq = 35 / (1 - 0.35) = 53.85 Hz 並且會減少振動直到 53.85 * (1 + 0.35) = 72.7 Hz - 所以這是一個可接受的配置。對於給定的整形器，始終嘗試使用盡可能高的 shaper_freq（可能有一些安全餘量，因此在本例中 shaper_freq ≈ 50-52 Hz 效果最佳），並嘗試使用整形器持續時間盡可能短的整形器。

source: If one needs to reduce vibrations at several very different frequencies (say, 30 Hz and 100 Hz), they may see that the table above does not provide enough information. In this case one may have more luck with [scripts/graph_shaper.py](../scripts/graph_shaper.py) script, which is more flexible.
hu: Ha valakinek több nagyon különböző frekvencián (mondjuk 30 Hz és 100 Hz) kell csökkentenie a rezgéseket, láthatja, hogy a fenti táblázat nem nyújt elegendő információt. Ebben az esetben több szerencsénk lehet a [scripts/graph_shaper.py](../scripts/graph_shaper.py) szkripttel, amely rugalmasabb.
it: Se è necessario ridurre le vibrazioni a diverse frequenze molto diverse (ad esempio, 30 Hz e 100 Hz), è possibile che la tabella sopra non fornisca informazioni sufficienti. In questo caso si può avere più fortuna con lo script [scripts/graph_shaper.py](../scripts/graph_shaper.py), che è più flessibile.
ko: 매우 다른 여러 주파수(예: 30Hz 및 100Hz)에서 진동을 줄여야 하는 경우 위의 표가 충분한 정보를 제공하지 않는다는 것을 알 수 있습니다. 이 경우 더 유연한 [scripts/graph_shaper.py](../scripts/graph_shaper.py) 스크립트를 사용하면 더 운이 좋을 수 있습니다.
zh_hant: 如果需要減少幾個非常不同的頻率（例如 30 Hz 和 100 Hz）的振動，他們可能會發現上表沒有提供足夠的信息。在這種情況下，使用更靈活的 [scripts/graph_shaper.py](../scripts/graph_shaper.py) 腳本可能會更幸運。

source: [input_shaper] shaper_freq_x: ... # frequency for the X mark of the test model shaper_freq_y: ... # frequency for the Y mark of the test model
hu: [input_shaper] shaper_freq_x: ... # a tesztmodell X jelének frekvenciája shaper_freq_y: ... # a tesztmodell Y jelének frekvenciája
it: [input_shaper] shaper_freq_x: ... # frequenza per il segno X del modello di prova shaper_freq_y: ... # frequenza per il segno Y del modello di prova

source: Basic tuning requires measuring the ringing frequencies of the printer by printing a test model.
hu: Az alaphangoláshoz a nyomtató gyűrődési frekvenciájának mérése szükséges egy tesztmodell nyomtatásával.
it: La regolazione di base richiede la misurazione delle frequenze di ringing della stampante stampando un modello di prova.
zh_hant: 基本調試需要通過打印測試模型來測量打印機的環紋頻率。

source: If `square_corner_velocity` parameter was changed, revert it back to 5.0. It is not advised to increase it when using input shaper because it can cause more smoothing in parts - it is better to use higher acceleration value instead.
hu: Ha a `square_corner_velocity` paramétert megváltoztattuk, állítsuk vissza az 5.0-ra. Nem tanácsos növelni, ha bemeneti alakítót használ, mert ez nagyobb simítást okozhat az alkatrészekben - helyette jobb, ha nagyobb gyorsulási értéket használ.
it: Se il parametro `square_corner_velocity` è stato modificato, ripristinalo a 5.0 . Non è consigliabile aumentarlo quando si utilizza l'input shaper perché può causare un maggiore smussamento smoothing delle parti: è invece meglio utilizzare un valore di accelerazione più elevato.
zh_hant: 如果 `square_corner_velocity` 參數已更改，請將其恢復為 5.0。使用input shaper時不建議增加它，因為它會導致零件更平滑 - 最好使用更高的加速度值。

source: Increase `max_accel_to_decel` by issuing the following command: `SET_VELOCITY_LIMIT ACCEL_TO_DECEL=7000`
hu: Növelje a `max_accel_to_decel` értéket a következő parancs kiadásával: `SET_VELOCITY_LIMIT ACCEL_TO_DECEL=7000`
it: Aumenta `max_accel_to_decel` inserendo il seguente comando: `SET_VELOCITY_LIMIT ACCEL_TO_DECEL=7000`
zh_hant: 通過發出以下命令增加 `max_accel_to_decel`：`SET_VELOCITY_LIMIT ACCEL_TO_DECEL=7000`

source: Disable Pressure Advance: `SET_PRESSURE_ADVANCE ADVANCE=0`
hu: Nyomás szabályozás kikapcsolása: `SET_PRESSURE_ADVANCE ADVANCE=0`
it: Disabilita la Pressure Advance: `SET_PRESSURE_ADVANCE ADVANCE=0`
zh_hant: 禁用Pressure Advance：`SET_PRESSURE_ADVANCE ADVANCE=0`

source: Execute the command: `TUNING_TOWER COMMAND=SET_VELOCITY_LIMIT PARAMETER=ACCEL START=1500 STEP_DELTA=500 STEP_HEIGHT=5` Basically, we try to make ringing more pronounced by setting different large values for acceleration. This command will increase the acceleration every 5 mm starting from 1500 mm/sec^2: 1500 mm/sec^2, 2000 mm/sec^2, 2500 mm/sec^2 and so forth up until 7000 mm/sec^2 at the last band.
hu: Végezze el a parancsot: `TUNING_TOWER COMMAND=SET_VELOCITY_LIMIT PARAMETER=ACCEL START=1500 STEP_DELTA=500 STEP_HEIGHT=5` Alapvetően a gyorsulás különböző nagy értékeinek beállításával próbáljuk a gyűrődést hangsúlyosabbá tenni. Ez a parancs 1500 mm/sec^2-től kezdve 5 mm-enként növeli a gyorsulást: 1500 mm/sec^2, 2000 mm/sec^2, 2500 mm/sec^2 és így tovább, egészen 7000 mm/sec^2-ig az utolsó sávra.
it: Eseguire il comando: `TUNING_TOWER COMMAND=SET_VELOCITY_LIMIT PARAMETER=ACCEL START=1500 STEP_DELTA=500 STEP_HEIGHT=5` Fondamentalmente, cerchiamo di rendere più pronunciato il ringing impostando diversi valori elevati per l'accelerazione. Questo comando aumenterà l'accelerazione ogni 5 mm a partire da 1500 mm/sec^2: 1500 mm/sec^2, 2000 mm/sec^2, 2500 mm/sec^2 e così via fino a 7000 mm/sec^2 per l'ultima fascia.
zh_hant: 執行命令： `TUNING_TOWER COMMAND=SET_VELOCITY_LIMIT PARAMETER=ACCEL START=1500 STEP_DELTA=500 STEP_HEIGHT=5` 基本上，我們嘗試通過設置不同的大加速度值來使環紋更加明顯。此命令將從 1500 mm/sec^2 開始每 5 mm 增加加速度：1500 mm/sec^2、2000 mm/sec^2、2500 mm/sec^2 等等，直到 7000 mm/sec^2最後一個區域。

source: Do (8) - (10) for Y mark as well.
hu: A (8)-(10) pontokat az Y jel esetében is végezzük el.
it: Esegui (8) - (10) anche per il segno Y.
zh_hant: 對 Y 標記也執行 (8) - (10)。

source: Print the ringing test model as follows:
hu: Nyomtassa ki a gyűrődési tesztmodellt az alábbiak szerint:
it: Stampare il modello di prova di ringing come segue:
zh_hant: 打印環形測試模型如下：

source: Restart the firmware: `RESTART`
hu: Indítsa újra a firmware-t: `RESTART`
it: Riavviare il firmware: `RESTART`
zh_hant: 重啟固件：`RESTART`

source: Prepare for test: `SET_VELOCITY_LIMIT ACCEL_TO_DECEL=7000`
hu: Készüljön fel a tesztre: `SET_VELOCITY_LIMIT ACCEL_TO_DECEL=7000`
it: Prepararsi per il test: `SET_VELOCITY_LIMIT ACCEL_TO_DECEL=7000`
zh_hant: 準備測試：`SET_VELOCITY_LIMIT ACCEL_TO_DECEL=7000`

source: Execute: `SET_INPUT_SHAPER SHAPER_TYPE=MZV`
hu: Adja ki a parancsot: `SET_INPUT_SHAPER SHAPER_TYPE=MZV `
it: Eseguire: `SET_INPUT_SHAPER SHAPER_TYPE=MZV`
zh_hant: 執行：`SET_INPUT_SHAPER SHAPER_TYPE=MZV`

source: Execute the command: `TUNING_TOWER COMMAND=SET_VELOCITY_LIMIT PARAMETER=ACCEL START=1500 STEP_DELTA=500 STEP_HEIGHT=5`
hu: Adja ki a parancsot: `TUNING_TOWER COMMAND=SET_VELOCITY_LIMIT PARAMETER=ACCEL START=1500 STEP_DELTA=500 STEP_HEIGHT=5`
it: Eseguire il comando: `TUNING_TOWER COMMAND=SET_VELOCITY_LIMIT PARAMETER=ACCEL START=1500 STEP_DELTA=500 STEP_HEIGHT=5`
zh_hant: 執行命令：`TUNING_TOWER COMMAND=SET_VELOCITY_LIMIT PARAMETER=ACCEL START=1500 STEP_DELTA=500 STEP_HEIGHT=5`

source: Now try EI input shaper. To try it, repeat steps (1)-(6) from above, but executing at step 4 the following command instead: `SET_INPUT_SHAPER SHAPER_TYPE=EI`.
hu: Most próbálja ki az EI bemeneti alakítót. Ehhez ismételje meg a fenti (1)-(6) lépéseket, de a 4. lépésnél hajtsa végre a következő parancsot: `SET_INPUT_SHAPER SHAPER_TYPE=EI`.
it: Ora prova l'input shaper EI. Per provarlo, ripeti i passaggi (1)-(6) da sopra, ma eseguendo invece al passaggio 4 il seguente comando : `SET_INPUT_SHAPER SHAPER_TYPE=EI`.
zh_hant: 現在嘗試 EI input shaper。要嘗試它，請從上面重複步驟 (1)-(6)，但在步驟 4 中執行以下命令：`SET_INPUT_SHAPER SHAPER_TYPE=EI`。

source: You should have a printed test for the shaper you chose from the previous step (if you don't, print the test model sliced with the [suggested parameters](#tuning) with the pressure advance disabled `SET_PRESSURE_ADVANCE ADVANCE=0` and with the tuning tower enabled as `TUNING_TOWER COMMAND=SET_VELOCITY_LIMIT PARAMETER=ACCEL START=1500 STEP_DELTA=500 STEP_HEIGHT=5`). Note that at very high accelerations, depending on the resonance frequency and the input shaper you chose (e.g. EI shaper creates more smoothing than MZV), input shaping may cause too much smoothing and rounding of the parts. So, max_accel should be chosen such as to prevent that. Another parameter that can impact smoothing is `square_corner_velocity`, so it is not advisable to increase it above the default 5 mm/sec to prevent increased smoothing.
hu: Az előző lépésben kiválasztott formázóhoz nyomtatott tesztet kell készítenie (ha nem nyomtatja ki a [javasolt paraméterekkel](#tuning) felszeletelt tesztmodellt a nyomás szabályozás kikapcsolásával `SET_PRESSURE_ADVANCE ADVANCE=0` és a tuningtorony engedélyezésével `TUNING_TOWER COMMAND=SET_VELOCITY_LIMIT PARAMETER=ACCEL START=1500 STEP_DELTA=500 STEP_HEIGHT=5`). Vegye figyelembe, hogy nagyon nagy gyorsulásoknál a rezonanciafrekvenciától és a választott bemeneti alakítótól függően (pl. az EI alakító nagyobb simítást hoz létre, mint az MZV) a bemeneti alakítás túl nagy simítást és az alkatrészek lekerekítését okozhatja. A max_accel értéket tehát úgy kell megválasztani, hogy ezt megakadályozza. Egy másik paraméter, amely hatással lehet a simításra, az `square_corner_velocity`, ezért nem tanácsos az alapértelmezett 5 mm/sec fölé növelni, hogy megakadályozzuk a fokozott simítást.
it: Dovresti avere un test stampato per lo shaper che hai scelto dal passaggio precedente (se non lo fai, stampa il modello di test affettato con i [parametri suggeriti](#tuning) con l'anticipo di pressione disabilitato `SET_PRESSURE_ADVANCE ADVANCE=0` e con la torre di regolazione abilitata come `TUNING_TOWER COMMAND=SET_VELOCITY_LIMIT PARAMETER=ACCEL START=1500 STEP_DELTA=500 STEP_HEIGHT=5`). Si noti che ad accelerazioni molto elevate, a seconda della frequenza di risonanza e dell'input shaper scelto (ad es. EI shaper crea più smussamento di MZV), l'input shaping può causare un'eccessiva levigatura -smoothing- e arrotondamento delle parti. Quindi, max_accel dovrebbe essere scelto in modo tale da impedirlo. Un altro parametro che può influire sul livellamento è `square_corner_velocity`, quindi non è consigliabile aumentarlo al di sopra del valore predefinito di 5 mm/sec per evitare un aumento del livellamento smooting.
zh_hant: 您應該對從上一步中選擇的整形器進行打印測試（如果沒有，請打印使用 [建議參數](#tuning) 切片的測試模型，禁用壓力提前 `SET_PRESSURE_ADVANCE ADVANCE=0` 並使用調諧塔啟用為 `TUNING_TOWER COMMAND=SET_VELOCITY_LIMIT PARAMETER=ACCEL START=1500 STEP_DELTA=500 STEP_HEIGHT=5`）。請注意，在非常高的加速度下，取決於共振頻率和您選擇的 input shaper（例如，EI 整形器比 MZV 產生更多的平滑）， input shaper可能會導致零件過度平滑和圓化。因此，應該選擇 max_accel 以防止這種情況發生。另一個可能影響平滑的參數是“square_corner_velocity”，因此不建議將其增加到默認的 5 毫米/秒以上，以防止增加平滑。

source: Choose the minimum out of the two acceleration values (from ringing and smoothing), and put it as `max_accel` into printer.cfg.
hu: Válassza ki a két gyorsulási érték közül a legkisebbet (a gyűrődésből és a simításból), és írja be `max_accel` néven a printer.cfg fájlba.
it: Scegli il minimo tra i due valori di accelerazione (da ringing e smoothing) e inseriscilo come `max_accel` in printer.cfg.
zh_hant: 從兩個加速度值（來自環紋和平滑）中選擇最小值，並將其作為`max_accel`放入printer.cfg。

source: Assuming that you have sliced the ringing model with suggested parameters, complete the following steps for each of the axes X and Y:
hu: Feltételezve, hogy felszeletelte a gyűrődési modellt a javasolt paraméterekkel, hajtsa végre a következő lépéseket az X és Y tengelyek mindegyikén:
it: Supponendo di aver suddiviso il modello di ringing con i parametri suggeriti, completare i seguenti passaggi per ciascuno degli assi X e Y:
zh_hant: 假設您已使用建議的參數對環紋模型進行切片，請針對 X 軸和 Y 軸中的每一個完成以下步驟：
