Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Resonance_Compensation.po
Languages: hu, it, ko, zh_hant

source: Calculate the new shaper_freq_x value via old shaper_freq_x * (39 + 5 * #band-number) / 66.
hu: Az új shaper_freq_x érték kiszámítása a régi shaper_freq_x * (39 + 5 * #band-number) / 66 segítségével.
it: Calcola il nuovo valore shaper_freq_x tramite il vecchio shaper_freq_x * (39 + 5 * #band-number) / 66.
ko: 이전 shaper_freq_x * (39 + 5 * #band-number) / 66 를 통해 새로운 shaper_freq_x 값을 계산합니다.
zh_hant: 通過舊的 shaper_freq_x * (39 + 5 * #band-number) / 66 計算新的 shaper_freq_x 值。

source: Repeat these steps for the Y axis in the same manner, replacing references to X axis with the axis Y (e.g. replace `shaper_freq_x` with `shaper_freq_y` in the formulae and in the `TUNING_TOWER` command).
hu: Ismételje meg ezeket a lépéseket az Y tengelyre ugyanígy, az X tengelyre való hivatkozásokat az Y tengelyre való hivatkozással helyettesítve (pl. cserélje ki a `shaper_freq_x`-t `shaper_freq_y`-ra a képletekben és a `TUNING_TOWER` parancsban).
it: Ripetere questi passaggi per l'asse Y allo stesso modo, sostituendo i riferimenti all'asse X con l'asse Y (ad es. sostituire `shaper_freq_x` con `shaper_freq_y` nelle formule e nel comando `TUNING_TOWER`).
ko: 같은 방식으로 Y축에 대해 이 단계를 반복하여 X축에 대한 참조를 Y축으로 바꿉니다(예: 수식 및 `TUNING_TOWER` 명령에서 `shaper_freq_x`를 `shaper_freq_y`로 교체).
zh_hant: 以相同的方式對 Y 軸重複這些步驟，將 X 軸的引用替換為 Y 軸（例如，在公式和`TUNING_TOWER`命令中將`shaper_freq_x`替換為`shaper_freq_y`）。

source: As an example, let's assume you have had measured the ringing frequency for one of the axis equal to 45 Hz. This gives start = 45 * 83 / 132 = 28.30 and factor = 45 / 66 = 0.6818 values for `TUNING_TOWER` command. Now let's assume that after printing the test model, the fourth band from the bottom gives the least ringing. This gives the updated shaper_freq_? value equal to 45 * (39 + 5 * 4) / 66 ≈ 40.23.
hu: Példaként tegyük fel, hogy az egyik tengelyen 45 Hz-es gyűrődési frekvenciát mértünk. Ez a start = 45 * 83 / 132 = 28,30 és a faktor = 45 / 66 = 0,6818 értéket ad a `TUNING_TOWER` parancshoz. Most tegyük fel, hogy a tesztmodell kinyomtatása után az alulról számított negyedik sáv adja a legkevesebb gyűrődést. Ekkor a frissített shaper_freq_? érték 45 * (39 + 5 * 4) / 66 ≈ 40,23.
it: Ad esempio, supponiamo di aver misurato la frequenza di ringing per uno degli assi pari a 45 Hz. Questo dà start = 45 * 83 / 132 = 28,30 e factor = 45 / 66 = 0,6818 valori per il comando `TUNING_TOWER`. Supponiamo ora che dopo aver stampato il modello di prova, la quarta fascia dal basso dia il minimo squillo. Questo dà lo shaper_freq_^ aggiornato al valore pari a 45 * (39 + 5 * 4) / 66 ≈ 40,23.
ko: 예를 들어 축 중 하나에 대해 45Hz와 동일한 벨소리 주파수를 측정했다고 가정해 보겠습니다. 이것은 `TUNING_TOWER` 명령에 대해 start = 45 * 83 / 132 = 28.30 1 및 factor = 45 / 66 = 0.6818 값을 제공합니다. 이제 테스트 모델을 인쇄한 후 아래쪽에서 네 번째 밴드가 가장 적은 rining 을 제공한다고 가정해 보겠습니다. 업데이트된 shaper_freq_? 값은 * (39 + 5 * 4) / 66 ≈ 40.23 와 같습니다.
zh_hant: 例如，假設您已經測量了一個軸的環紋頻率等於 45 Hz。這給出了“TUNING_TOWER”命令的 start = 45 * 83 / 132 = 28.30 和 factor = 45 / 66 = 0.6818 值。現在讓我們假設在打印測試模型後，從底部開始的第四個波段的環紋最少。這給出了更新的 shaper_freq_?值等於 45 * (39 + 5 * 4) / 66 ≈ 40.23。

source: After both new `shaper_freq_x` and `shaper_freq_y` parameters have been calculated, you can update `[input_shaper]` section in `printer.cfg` with the new `shaper_freq_x` and `shaper_freq_y` values.
hu: Miután mindkét új `shaper_freq_x` és `shaper_freq_y` paramétert kiszámította, frissítheti az `[input_shaper]` szakaszát a nyomtató `printer.cfg` fájljában az új `shaper_freq_x` és `shaper_freq_y` értékekkel.
it: Dopo aver calcolato entrambi i nuovi parametri `shaper_freq_x` e `shaper_freq_y`, puoi aggiornare la sezione `[input_shaper]` in `printer.cfg` con i nuovi valori `shaper_freq_x` e `shaper_freq_y`.
ko: 새로운 `shaper_freq_x` 및 `shaper_freq_y` 매개변수가 모두 계산된 후 `printer.cfg`의 `[input_shaper]` 섹션을 새로운 `shaper_freq_x` 및 `shaper_freq_y` 값으로 업데이트할 수 있습니다.
zh_hant: 在計算出新的 `shaper_freq_x` 和 `shaper_freq_y` 參數後，您可以使用新的 `shaper_freq_x` 和 `shaper_freq_y` 值更新 `printer.cfg` 中的 `[input_shaper]` 部分。

source: Pressure Advance
hu: Nyomás szabályozás

source: Unreliable measurements of ringing frequencies
hu: A gyűrődési frekvenciák megbízhatatlan mérései
it: Misurazioni inaffidabili delle frequenze di ringing
zh_hant: 環紋頻率測量不可靠

source: If you are unable to measure the ringing frequencies, e.g. if the distance between the oscillations is not stable, you may still be able to take advantage of input shaping techniques, but the results may not be as good as with proper measurements of the frequencies, and will require a bit more tuning and printing the test model. Note that another possibility is to purchase and install an accelerometer and measure the resonances with it (refer to the [docs](Measuring_Resonances.md) describing the required hardware and the setup process) - but this option requires some crimping and soldering.
hu: Ha nem tudja mérni a gyűrődési frekvenciákat, pl. ha a rezgések közötti távolság nem stabil, akkor még mindig kihasználhatja a bemeneti alakítási technikákat, de az eredmények nem biztos, hogy olyan jók lesznek, mint a frekvenciák megfelelő mérésével. Valamint egy kicsit több hangolást és a tesztmodell nyomtatását igényli. Megjegyzendő, hogy egy másik lehetőség egy gyorsulásmérő beszerzése és felszerelése, valamint a rezonanciák mérése (lásd a [dokumentumot](Measuring_Resonances.md), amely leírja a szükséges hardvert és a beállítási folyamatot) - de ez a lehetőség némi kézügyességet, krimpelést és forrasztást igényel.
it: Se non è possibile misurare le frequenze di ringing, ad es. se la distanza tra le oscillazioni non è stabile, potresti comunque essere in grado di sfruttare le tecniche di input shaping, ma i risultati potrebbero non essere buoni come con misurazioni corrette delle frequenze e richiederà un po' più di messa a punto e stampa del test modello. Si noti che un'altra possibilità è acquistare e installare un accelerometro e misurare le risonanze con esso (fare riferimento a [docs](Measuring_Resonances.md) che descrive l'hardware richiesto e il processo di installazione), ma questa opzione richiede un po' di crimpatura e saldatura.
ko: Ringing 주파수를 측정할 수 없는 경우, 예를 들어 진동 사이의 거리가 안정적이지 않은 경우에도 input shaping 기술을 사용할 수 있지만 결과는 주파수를 적절하게 측정하는 것만큼 좋지 않을 수 있으며 테스트 모델을 약간 더 조정하고 인쇄해야 합니다. 또 다른 가능성은 가속도계를 구입하여 설치하고 공진을 측정하는 것입니다 (필요한 하드웨어 및 설정 프로세스를 설명하는 [docs](Measuring_Resonances.md) 참조) - 그러나 이 옵션은 약간의 압착 및 납땜이 필요합니다.
zh_hant: 如果您無法測量環紋頻率，例如如果振蕩之間的距離不穩定，您仍然可以利用Input Shaper技術，但結果可能不如正確測量頻率那樣好，並且需要更多的調整和打印測試模型。請注意，另一種可能性是購買並安裝加速度計並用它測量共振（請參閱描述所需硬件和設置過程的 [docs](Measuring_Resonances.md)） - 但此選項需要一些壓接和焊接。

source: and print the model. Then print the model again, but before printing run instead
hu: és nyomtassa ki a modellt. Ezután nyomtassa ki a modellt újra, de a nyomtatás előtt futtassa az alábbiakat
it: e stampa il modello. Quindi stampare di nuovo il modello, ma prima di eseguire la stampa invece
ko: 모델을 인쇄합니다. 그런 다음 다시 모델을 인쇄하지만 인쇄하기 전에 다음을 실행합니다
zh_hant: 並打印模型。然後再次打印模型，但在打印之前運行

source: Then print the model for the 3rd time, but now run
hu: Ezután nyomtassuk ki a modellt harmadszorra, de most futtassuk le a következőt
it: Quindi stampa il modello per la terza volta, ma ora esegui
ko: 그런 다음 세 번째로 모델을 인쇄하기전에 다음을 실행합니다
zh_hant: 然後第三次打印模型，但現在運行

source: Essentially, we are printing the ringing test model with TUNING_TOWER using 2HUMP_EI shaper with shaper_freq = 60 Hz, 50 Hz, and 40 Hz.
hu: Lényegében a gyűrődési tesztmodellt TUNING_TOWER segítségével nyomtatjuk ki, 2HUMP_EI shaperrel, shaper_freq = 60 Hz, 50 Hz és 40 Hz.
it: In sostanza, stiamo stampando il modello di prova di ringing con TUNING_TOWER utilizzando lo shaper 2HUMP_EI con shaper_freq = 60 Hz, 50 Hz e 40 Hz.
ko: 기본적으로 shaper_freq = 60Hz, 50Hz 및 40Hz인 2HUMP_EI shaper를 사용하여 TUNING_TOWER로 rining 테스트 모델을 인쇄하고 있습니다.
zh_hant: 本質上，我們使用 2HUMP_EI shaper 和 shaper_freq = 60 Hz、50 Hz 和 40 Hz 打印帶有 TUNING_TOWER 的環紋測試模型。

source: If none of the models demonstrate improvements in ringing, then, unfortunately, it does not look like the input shaping techniques can help with your case.
hu: Ha egyik modell sem mutat javulást a gyűrődésben, akkor sajnos úgy tűnik, hogy a bemeneti alakítási technikák nem segíthetnek az Ön esetében.
it: Se nessuno dei modelli mostra miglioramenti nel ringing, allora, sfortunatamente non sembra che le tecniche di modellazione dell'input possano aiutare con il tuo caso.
ko: 어떤 모델도 rining 개선을 나타내지 않는다면 불행히도 input shaping 기술이 귀하의 경우에 도움이 될 수 없는 것 같습니다.
zh_hant: 如果沒有一個模型顯示環紋的改進，那麼很遺憾，input shaper技術似乎對您的情況沒有幫助。

source: Otherwise, it may be that all models show no ringing, or some show the ringing and some - not so much. Choose the test model with the highest frequency that still shows good improvements in ringing. For example, if 40 Hz and 50 Hz models show almost no ringing, and 60 Hz model already shows some more ringing, stick with 50 Hz.
hu: Máskülönben előfordulhat, hogy az összes modell nem mutat gyűrődést, vagy néhány modell gyűrődést mutat, néhány pedig nem annyira. Válassza ki azt a tesztmodellt, amelyik a legmagasabb frekvenciával készült, és még mindig jó javulást mutat a gyűrődések tekintetében. Ha például a 40 Hz-es és az 50 Hz-es modellek szinte egyáltalán nem mutatnak gyűrődést, a 60 Hz-es modell pedig már némileg több gyűrődést mutat, maradjon az 50 Hz-esnél.
it: Altrimenti, è possibile che tutti i modelli non mostrino ringing, o alcuni mostrino ringing e altri non così tanto. Scegli il modello di test con la frequenza più alta che mostra comunque buoni miglioramenti nel ringing. Ad esempio, se i modelli a 40 Hz e 50 Hz non mostrano quasi nessuno ringing e il modello a 60 Hz mostra già un po' più di ringing, attenersi a 50 Hz.
ko: 그렇지 않으면 모든 모델에서 ringing 보이지 않거나 일부 모델에서는 rining이 표시되고 일부는 그렇지 않을 수 있습니다. 여전히 rining이 개선된 가장 높은 주파수의 테스트 모델을 선택하십시오. 예를 들어, 40Hz 및 50Hz 모델에서 rining이 거의 나타나지 않고 60Hz 모델에서 이미 rining이 더 많이 나타나는 경우 50Hz를 사용합니다.
zh_hant: 否則，可能是所有型號都沒有響鈴，或者有些型號有響鈴，有些型號沒有響鈴。選擇頻率最高的測試模型，在環紋方面仍顯示出良好的改進。例如，如果 40 Hz 和 50 Hz 型號幾乎沒有環紋，而 60 Hz 型號已經顯示更多環紋，則堅持使用 50 Hz。

source: Now check if EI shaper would be good enough in your case. Choose EI shaper frequency based on the frequency of 2HUMP_EI shaper you chose:
hu: Most ellenőrizze, hogy az EI alakító elég jó lenne-e az Ön esetében. Válassza ki az EI alakító frekvenciáját az Ön által választott 2HUMP_EI alakító frekvenciája alapján:
it: Ora controlla se lo shaper EI sarebbe abbastanza buono nel tuo caso. Scegli la frequenza dello shaper EI in base alla frequenza dello shaper 2HUMP_EI che hai scelto:
ko: 이제 EI shaper가 귀하의 경우에 충분할지 확인하십시오. 선택한 2HUMP_EI shaper의 주파수를 기반으로 EI shaper 주파수를 선택합니다:
zh_hant: 現在檢查 EI 整形器在您的情況下是否足夠好。根據您選擇的 2HUMP_EI 整形器的頻率選擇 EI 整形器頻率：

source: For 2HUMP_EI 60 Hz shaper, use EI shaper with shaper_freq = 50 Hz.
hu: A 2HUMP_EI 60 Hz-es formázó esetében használjon EI formázót shaper_freq = 50 Hz-es frekvenciával.
it: Per lo shaper 2HUMP_EI 60 Hz, utilizzare lo shaper EI con shaper_freq = 50 Hz.
ko: 2HUMP_EI 60Hz shaper의 경우 shaper_freq = 50Hz인 EI shaper를 사용합니다.
zh_hant: 對於 2HUMP_EI 60 Hz 整形器，使用 shaper_freq = 50 Hz 的 EI 整形器。

source: For 2HUMP_EI 50 Hz shaper, use EI shaper with shaper_freq = 40 Hz.
hu: A 2HUMP_EI 50 Hz-es formázóhoz használjon EI formázót shaper_freq = 40 Hz értékkel.
it: Per lo shaper 2HUMP_EI 50 Hz, utilizzare lo shaper EI con shaper_freq = 40 Hz.
ko: 2HUMP_EI 50Hz shaper의 경우 shaper_freq = 40Hz인 EI shaper를 사용합니다.
zh_hant: 對於 2HUMP_EI 50 Hz 整形器，使用 shaper_freq = 40 Hz 的 EI 整形器。

source: For 2HUMP_EI 40 Hz shaper, use EI shaper with shaper_freq = 33 Hz.
hu: A 2HUMP_EI 40 Hz-es formázóhoz használjon EI formázót shaper_freq = 33 Hz értékkel.
it: Per lo shaper 2HUMP_EI 40 Hz, utilizzare lo shaper EI con shaper_freq = 33 Hz.
ko: 2HUMP_EI 40Hz shaper의 경우 shaper_freq = 33Hz인 EI shaper를 사용합니다.
zh_hant: 對於 2HUMP_EI 40 Hz 整形器，使用 shaper_freq = 33 Hz 的 EI 整形器。

source: Now print the test model one more time, running
hu: Most nyomtassuk ki a tesztmodellt még egyszer, a következő futtatásával
it: Ora stampa il modello di prova ancora una volta, eseguendola
ko: 이제 테스트 모델을 한 번 더 인쇄하여 실행합니다
zh_hant: 現在再打印一次測試模型，運行

source: providing the shaper_freq_x=... and shaper_freq_y=... as determined previously.
hu: a korábban meghatározott shaper_freq_x=... és shaper_freq_y=... értékek megadásával.
it: fornendo shaper_freq_x=... e shaper_freq_y=... come determinato in precedenza.
ko: 이전에 결정된 shaper_freq_x=... 및 shaper_freq_y=...를 제공합니다.
zh_hant: 提供之前確定的 shaper_freq_x=... 和 shaper_freq_y=...。

source: If EI shaper shows very comparable good results as 2HUMP_EI shaper, stick with EI shaper and the frequency determined earlier, otherwise use 2HUMP_EI shaper with the corresponding frequency. Add the results to `printer.cfg` as, e.g.
hu: Ha az EI alakító a 2HUMP_EI alakítóhoz hasonlóan jó eredményeket mutat, maradjon az EI alakító és a korábban meghatározott frekvencia mellett, ellenkező esetben használja a 2HUMP_EI alakítót a megfelelő frekvenciával. Adja hozzá az eredményeket a `printer.cfg` fájlhoz, pl. a következő módon.
it: Se lo shaper EI mostra buoni risultati comparabili con lo shaper 2HUMP_EI, attenersi con lo shaper EI e la frequenza determinata in precedenza, altrimenti utilizzare lo shaper 2HUMP_EI con la frequenza corrispondente. Aggiungi i risultati a `printer.cfg` come, ad es.
ko: EI shaper가 2HUMP_EI shaper와 매우 유사한 좋은 결과를 보인다면 EI shaper와 이전에 결정된 주파수를 고수하고, 그렇지 않으면 해당 주파수와 함께 2HUMP_EI shaper를 사용합니다. 결과를 `printer.cfg`에 추가합니다.
zh_hant: 如果 EI shaper 顯示出與 2HUMP_EI shaper 非常相似的良好結果，則堅持使用 EI shaper 和之前確定的頻率，否則使用具有相應頻率的 2HUMP_EI shaper。將結果添加到 `printer.cfg` 中，例如

source: Continue the tuning with [Selecting max_accel](#selecting-max_accel) section.
hu: Folytassa a hangolást a [max_accel kiválasztása](#selecting-max_accel) szakaszban.
it: Continua l'ottimizzazione con la sezione [Selecting max_accel](#selecting-max_accel).
ko: [max_accel 선택](#selecting-max_accel) 섹션으로 튜닝을 계속합니다.
zh_hant: 使用 [Selecting max_accel](#selecting-max_accel) 分區繼續調整。

source: Troubleshooting and FAQ
hu: Hibaelhárítás és GYIK
it: Risoluzione dei problemi e domande frequenti
ko: 문제해결 및 FAQ
zh_hant: 故障排除和常見問題解答

source: I cannot get reliable measurements of resonance frequencies
hu: Nem tudok megbízható méréseket végezni a rezonanciafrekvenciákról
it: Non riesco a ottenere misurazioni affidabili delle frequenze di risonanza
ko: 공진 주파수의 신뢰할 만한 측정을 얻을 수 없습니다
zh_hant: 我無法可靠地測量共振頻率

source: First, make sure it is not some other problem with the printer instead of ringing. If the measurements are not reliable because, say, the distance between the oscillations is not stable, it might mean that the printer has several resonance frequencies on the same axis. One may try to follow the tuning process described in [Unreliable measurements of ringing frequencies](#unreliable-measurements-of-ringing-frequencies) section and still get something out of the input shaping technique. Another possibility is to install an accelerometer, [measure](Measuring_Resonances.md) the resonances with it, and auto-tune the input shaper using the results of those measurements.
hu: Először is győződjön meg róla, hogy a gyűrődés helyett nem más probléma van a nyomtatóval. Ha a mérések nem megbízhatóak, mert például a rezgések közötti távolság nem stabil, az azt jelentheti, hogy a nyomtatónak több rezonanciafrekvenciája van ugyanazon a tengelyen. Megpróbálhatjuk követni a [Megbízhatatlan mérések a gyűrődési frekvenciákról](#unreliable-measurements-of-ringing-frequencies) szakaszban leírt hangolási eljárást, és még mindig ki lehet hozni valamit a bemeneti alakítási technikából. Egy másik lehetőség egy gyorsulásmérő beszerelése, majd rezonanciák [mérése](Measuring_Resonances.md) vele, és a bemeneti alakító automatikus hangolása e mérések eredményeinek felhasználásával.
it: Innanzitutto, assicurati che non ci siano altri problemi con la stampante invece del ringing. Se le misurazioni non sono affidabili perché, ad esempio, la distanza tra le oscillazioni non è stabile, potrebbe significare che la stampante ha più frequenze di risonanza sullo stesso asse. Si può provare a seguire il processo di sintonizzazione descritto nella sezione [Misurazioni inaffidabili delle frequenze di ringing](#unreliable-measurements-of-ringing-frequencies) e ottenere comunque qualcosa dalla tecnica di modellatura dell'input. Un'altra possibilità è installare un accelerometro, [misurare](Measuring_Resonances.md) le risonanze con esso e regolare automaticamente lo shaper di input utilizzando i risultati di tali misurazioni.
ko: 먼저 ringing 대신 프린터에 다른 문제가 없는지 확인합니다. 진동 사이의 거리가 안정적이지 않아 측정이 신뢰할 수 없는 경우 프린터가 동일한 축에 여러 공진 주파수를 가지고 있음을 의미할 수 있습니다. [rining 주파수의 신뢰할 수 없는 측정](#unreliable-measurements-of-ringing-frequencies) 섹션에 설명된 조정 프로세스를 따르고도 여전히 input shaping 기술에서 무언가를 얻을 수 있습니다. 또 다른 가능성은 가속도계를 설치하여 공진을 [측정](Measuring_Resonances.md)하고 이러한 측정 결과를 사용하여 input shaper를 자동 조정하는 것입니다.
zh_hant: 首先，確保打印機不是響鈴而不是其他問題。如果測量結果不可靠，例如，振蕩之間的距離不穩定，則可能意味著打印機在同一軸上有多個共振頻率。可以嘗試遵循 [Unreliable measurements of ringing frequencies](#unreliable-measurements-of-ringing-frequencies) 部分中描述的調整過程，仍然可以從input shaper技術中獲得一些東西。另一種可能性是安裝加速度計，[測量]

source: After enabling [input_shaper], I get too smoothed printed parts and fine details are lost
hu: Az [input_shaper] engedélyezése után túlságosan simított nyomtatott alkatrészeket kapok, és a finom részletek elvesznek
it: Dopo aver abilitato [input_shaper], ottengo parti stampate troppo levigate e i dettagli fini vengono persi
ko: [input_shaper] 를 활성화한 후 인쇄된 부분이 너무 매끄럽고 인쇄된 세부적인 부분이 손실됩니다
zh_hant: 啟用 [input_shaper] 後，打印部分過於平滑，細節丟失

source: Check the considerations in [Selecting max_accel](#selecting-max_accel) section. If the resonance frequency is low, one should not set too high max_accel or increase square_corner_velocity parameters. It might also be better to choose MZV or even ZV input shapers over EI (or 2HUMP_EI and 3HUMP_EI shapers).
hu: Ellenőrizze a [Max_accel kiválasztása](#selecting-max_accel) szakaszban található szempontokat. Ha a rezonanciafrekvencia alacsony, nem szabad túl magas max_accel értéket beállítani, vagy növelni a square_corner_velocity paramétereket. Az is lehet, hogy az EI (vagy a 2HUMP_EI és 3HUMP_EI) változók helyett jobb az MZV vagy akár a ZV bemeneti változókat választani.
it: Controllare le considerazioni nella sezione [Selecting max_accel](#selecting-max_accel). Se la frequenza di risonanza è bassa, non si dovrebbero impostare max_accel troppo alti o aumentare i parametri square_corner_velocity. Potrebbe anche essere meglio scegliere gli shaper di input MZV o anche ZV su EI (o gli shaper 2HUMP_EI e 3HUMP_EI).
ko: [max_accel 선택](#selecting-max_accel) 섹션에서 고려 사항을 확인하십시오. 공진 주파수가 낮으면 max_accel을 너무 높게 설정하거나 square_corner_velocity 매개변수를 증가시키지 않아야 합니다. EI(또는 2HUMP_EI 및 3HUMP_EI 셰이퍼)보다 MZV 또는 ZV input shaper를 선택하는 것이 더 나을 수도 있습니다.
zh_hant: 檢查 [選擇 max_accel](#selecting-max_accel) 部分中的注意事項。如果諧振頻率較低，則不應設置過高的 max_accel 或增加 square_corner_velocity 參數。最好選擇 MZV 甚至 ZV input shaper 而不是 EI（或 2HUMP_EI 和 3HUMP_EI 整形器）。

source: After successfully printing for some time without ringing, it appears to come back
hu: Miután egy ideig sikeresen nyomtatott gyűrődések nélkül, most úgy tűnik, hogy visszajött
it: Dopo aver stampato correttamente per un po' di tempo senza ringing, sembra tornare
ko: Ringing 없이 일정 시간동안 성공적으로 인쇄한 후 ringing 현상이 다시 나타나는 것처럼 보입니다
zh_hant: 成功打印一段時間後沒有環紋，它似乎又回來了

source: It is possible that after some time the resonance frequencies have changed. E.g. maybe the belts tension has changed (belts got more loose), etc. It is a good idea to check and re-measure the ringing frequencies as described in [Ringing frequency](#ringing-frequency) section and update your config file if necessary.
hu: Lehetséges, hogy egy idő után a rezonanciafrekvenciák megváltoztak. Pl. talán a szíjak feszessége megváltozott (a szíjak lazábbak lettek) stb. Jó ötlet a [Gyűrődési frekvencia](#ringing-frequency) szakaszban leírtak szerint ellenőrizni és újra megmérni a rezonanciafrekvenciákat, és szükség esetén frissíteni a konfigurációs fájlt.
it: È possibile che dopo qualche tempo le frequenze di risonanza siano cambiate. Per esempio. forse la tensione delle cinghie è cambiata (le cinghie si sono allentate di più), ecc. È una buona idea controllare e rimisurare le frequenze di ringing come descritto nella sezione [Frequenza di ringing](#ringing-frequency) e aggiornare il file di configurazione se necessario .
ko: 얼마 후 공진 주파수가 변경되었을 수 있습니다. 예를 들어 벨트 장력이 변경되었을 수 있습니다(벨트가 더 느슨해짐) 등. [Ringing frequency](#ringing-frequency) 섹션에 설명된 대로 울리는 주파수를 확인후 다시 측정하고 필요한 경우 구성 파일을 업데이트하는 것이 좋습니다.
zh_hant: 有可能在一段時間後共振頻率發生了變化。例如。可能是皮帶張力發生了變化（皮帶變得更鬆了）等。最好按照 [Ringing frequency](#ringing-frequency) 部分中的說明檢查並重新測量環紋頻率，並在必要時更新配置文件.

source: Is dual carriage setup supported with input shapers?
hu: Támogatott a kettős kocsi beállítása a bemeneti formázókkal?
it: La configurazione a doppio carrello è supportata con gli input shaper?
ko: Input shapers에서 이중 캐리지 설정이 지원됩니까?
zh_hant: input shaper是否支持雙步進匣設置？

source: There is no dedicated support for dual carriages with input shapers, but it does not mean this setup will not work. One should run the tuning twice for each of the carriages, and calculate the ringing frequencies for X and Y axes for each of the carriages independently. Then put the values for carriage 0 into [input_shaper] section, and change the values on the fly when changing carriages, e.g. as a part of some macro:
hu: Nincs külön támogatás a bemeneti formázókkal ellátott kettős kocsikhoz, de ez nem jelenti azt, hogy ez a beállítás nem fog működni. A hangolást kétszer kell lefuttatni mindkét kocsira, és az X- és Y-tengelyek gyűrődési frekvenciáit mindkét kocsira függetlenül kell kiszámítani. Ezután a 0. kocsira vonatkozó értékeket tegye az [input_shaper] szakaszba, és a kocsik váltásakor menet közben változtassa meg az értékeket, például valamilyen makró segítségével:
it: Non esiste un supporto dedicato per doppi carrelli con input shaper, ma ciò non significa che questa configurazione non funzionerà. Si dovrebbe eseguire la messa a punto due volte per ciascuno dei carrelli e calcolare le frequenze di ringing per gli assi X e Y per ciascuno dei carrelli in modo indipendente. Quindi inserisci i valori per il carrello 0 nella sezione [input_shaper] e modifica i valori al volo quando si cambiano i carrelli, ad es. come parte di alcune macro:
ko: Input shpaer가 있는 이중 캐리지에 대한 전용 지원은 없지만 이 설정이 작동하지 않는다는 의미는 아닙니다. 각 캐리지에 대해 튜닝을 두 번 실행하고 각 캐리지에 대해 독립적으로 X 및 Y 축에 대한 ringing 주파수를 계산해야 합니다. 그런 다음 캐리지 0의 값을 [input_shaper] 섹션에 입력하고 캐리지를 변경할 때 값을 즉시 변경합니다. 예. 일부 매크로의 일부로:
zh_hant: 沒有對帶有input shaper的雙筆架的專門支持，但這並不意味著此設置不起作用。應該對每個托架運行兩次調諧，並獨立計算每個托架的 X 軸和 Y 軸的環紋頻率。然後將托架 0 的值放入 [input_shaper] 部分，並在更改托架時即時更改值，例如作為一些宏的一部分：

source: And similarly when switching back to carriage 0.
hu: És ugyanígy a 0 kocsira való visszakapcsoláskor is.
it: E allo stesso modo quando si torna al carrello 0.
ko: 캐리지 0으로 다시 전환할 때도 마찬가지입니다.
zh_hant: 同樣當切換回步進匣 0 時。

source: Does input_shaper affect print time?
hu: Az input_shaper befolyásolja a nyomtatási időt?
it: L'input_shaper influisce sul tempo di stampa?
ko: input_shaper가 인쇄 시간에 영향을 줍니까?
zh_hant: input_shaper 會影響打印時間嗎？
