Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Resonance_Compensation.po
Languages: hu, it, ko, zh_hant

source: Resonance Compensation
hu: Rezonancia kompenzáció
it: Compensazione della risonanza
ko: 공진 보상
zh_hant: 共振補償

source: Klipper supports Input Shaping - a technique that can be used to reduce ringing (also known as echoing, ghosting or rippling) in prints. Ringing is a surface printing defect when, typically, elements like edges repeat themselves on a printed surface as a subtle 'echo':
hu: A Klipper támogatja a bemeneti formázást - egy olyan technikát, amely a nyomatok csengésének (más néven visszhang, szellemkép vagy hullámzás) csökkentésére használható. A gyűrűzés egy felületi nyomtatási hiba, amikor jellemzően az olyan elemek, mint az élek, finom 'visszhangként' ismétlődnek a nyomtatott felületen:
it: Klipper supporta Input Shaping, una tecnica che può essere utilizzata per ridurre il ringing (noti anche come echoing, ghosting o increspature) nelle stampe. Il ringing è un difetto di stampa della superficie quando, in genere, elementi come i bordi si ripetono su una superficie stampata come un sottile "eco":
ko: Klipper는 인쇄물에서 ringing(echoing, ghosting 또는 rippling 이라고도 함)을 줄이는 데 사용할 수 있는 기술인 입력 성형(input shaping)을 지원합니다. 일반적으로 가장자리와 같은 요소들이 인쇄된 표면에서 미묘한 'echo'로 반복될때 Ringing은 표면 인쇄 결함이 있습니다:
zh_hant: Klipper支援Input Shaper技術 -一種可以用來減少列印件上環紋（也被稱為echo、ghosting或ripping）的技術。振紋是一種表面打印缺陷，通常在邊角的位置表面重複出現，成為一種微妙的水波狀紋路：

source: Ringing is caused by mechanical vibrations in the printer due to quick changes of the printing direction. Note that ringing usually has mechanical origins: insufficiently rigid printer frame, non-tight or too springy belts, alignment issues of mechanical parts, heavy moving mass, etc. Those should be checked and fixed first, if possible.
hu: A gyűrődést a nyomtatási irány gyors változása miatt fellépő mechanikus rezgések okozzák. Vegye figyelembe, hogy a gyűrődés általában mechanikai eredetű: nem elég merev nyomtatókeret, nem feszes vagy túlságosan rugós szíjak, a mechanikus alkatrészek beállítási problémái, nagy mozgó tömeg stb. Ezeket kell először ellenőrizni és lehetőség szerint javítani.
it: I ringing sono causati da vibrazioni meccaniche nella stampante dovute a rapidi cambiamenti della direzione di stampa. Si noti che il ringing di solito ha origini meccaniche: telaio della stampante non sufficientemente rigido, cinghie non tese o troppo elastiche, problemi di allineamento delle parti meccaniche, massa in movimento pesante, ecc. Questi dovrebbero essere prima controllati e riparati, se possibile.
ko: Ringing은 인쇄 방향의 급격한 변화로 인한 프린터의 기계적 진동으로 인해 발생합니다. 링잉은 일반적으로 기계적 원인들을 가지고 있습니다: 강건성이 불충분한 프린터 프레임, 단단하지 않거나 너무 탄력 있는 벨트, 기계 부품의 정렬 문제, 무거운 이동 물체 등등. 가능하면 먼저 확인하고 고정해야 합니다.
zh_hant: 振紋是由印表機在快速改變列印方向時機械振動引起的。請注意，振紋通常源於機械方面的問題：印表機框架強度不足，皮帶不夠緊或太有彈性，機械部件的對準問題，移動質量大等。如果可能的話，應首先檢查和解決這些問題。

source: [Input shaping](https://en.wikipedia.org/wiki/Input_shaping) is an open-loop control technique which creates a commanding signal that cancels its own vibrations. Input shaping requires some tuning and measurements before it can be enabled. Besides ringing, Input Shaping typically reduces the vibrations and shaking of the printer in general, and may also improve the reliability of the stealthChop mode of Trinamic stepper drivers.
hu: Az [Input shaping](https://en.wikipedia.org/wiki/Input_shaping) egy olyan nyílt hurkú vezérlési technika, amely olyan utasító jelet hoz létre, amely megszünteti a saját rezgéseit. A bemeneti alakítás némi hangolást és méréseket igényel, mielőtt engedélyezhető lenne. A csengésen kívül az Input Shaping általában csökkenti a nyomtató rezgéseit és rázkódását, és javíthatja a Trinamic léptető meghajtók StealthChop üzemmódjának megbízhatóságát is.
it: [Input shaping](https://en.wikipedia.org/wiki/Input_shaping) è una tecnica di controllo ad anello aperto che crea un segnale di comando che annulla le proprie vibrazioni. La modellatura dell'ingresso richiede alcune regolazioni e misurazioni prima di poter essere abilitata. Oltre al ringing, Input Shaping riduce in genere le vibrazioni e le vibrazioni della stampante in generale e può anche migliorare l'affidabilità della modalità StealthChop dei driver stepper Trinamic.
ko: [Input shaping](https://en.wikipedia.org/wiki/Input_shaping)은 자체 진동을 취소하는 명령 신호를 생성하는 개방 루프 제어 기술입니다. Input shaping을 활성화하려면 약간의 조정과 측정이 필요합니다. Ringing 외에도 Input shaping은 일반적으로 프린터의 진동과 흔들림을 줄이고 Trinamic 스테퍼 드라이버의 stealthChop 모드의 안정성을 향상시킬 수 있습니다.
zh_hant: [Input Shaping](https://en.wikipedia.org/wiki/Input_shaping)是一種開環控制技術，它通過產生一個控制訊號來抵消自身的振動。Input Shaper在啟用之前需要進行一些調整和測量。除了振紋之外，input shaper通常可以減少印表機的振動和搖晃，也可以提高 Trinamic 步進驅動器的StealthChop模式的可靠性。

source: Tuning
hu: Hangolás
it: Messa a punto
ko: 조정
zh_hant: 調整

source: Slice the ringing test model, which can be found in [docs/prints/ringing_tower.stl](prints/ringing_tower.stl), in the slicer:
hu: Szeletelje fel a [docs/prints/ringing_tower.stl](prints/ringing_tower.stl) fájlban található gyűrűzési tesztmodellt a szeletelőben:
it: Carica il modello di prova per il ringing, che può essere trovato in [docs/prints/ringing_tower.stl](prints/ringing_tower.stl), nello slicer:
ko: [docs/prints/ringing_tower.stl](prints/ringing_tower.stl) 에 있는 ringing 테스트 모델을 슬라이서에서 슬라이스합니다:
zh_hant: 將環紋測試模型切片，該模型可以在[docs/prints/ringing_tower.stl](prints/ringing_tower.stl)中找到，在切片軟體中：

source: Suggested layer height is 0.2 or 0.25 mm.
hu: A javasolt rétegmagasság 0,2 vagy 0,25 mm.
it: L'altezza dello strato (layer) consigliata è 0,2 o 0,25 mm.
ko: 권장 레이어 높이는 0.2 또는 0.25mm입니다.
zh_hant: 建議的層高為 0.2 或 0.25 毫米。

source: Infill and top layers can be set to 0.
hu: A kitöltő és a felső rétegek 0-ra állíthatók.
it: I livelli di riempimento e superiori possono essere impostati su 0.
ko: 채우기 및 상단 레이어는 0으로 설정할 수 있습니다.
zh_hant: 填充和頂層層數可以被設定為0。

source: Use 1-2 perimeters, or even better the smooth vase mode with 1-2 mm base.
hu: Használjon 1-2 falat, vagy még jobb a sima váza mód 1-2 mm-es alappal.
it: Usa 1-2 perimetri, o meglio ancora la modalità vaso liscio con base da 1-2 mm.
ko: 1-2개의 둘레를 사용하거나 1-2mm 베이스를 갖는 부드러운 꽃병 모드를 사용하는 것이 좋습니다.
zh_hant: 使用 1-2 周長，或者使用 1-2 毫米底座的光滑花瓶模式更好。

source: Use sufficiently high speed, around 80-100 mm/sec, for **external** perimeters.
hu: A **külső** kerületeknél használjon kellően nagy sebességet, körülbelül 80-100 mm/mp.
it: Utilizzare velocità sufficientemente elevate, circa 80-100 mm/sec, per i perimetri **esterni**.
ko: **외부** 주변에 대해 약 80-100mm/초의 충분히 빠른 속도를 사용합니다.
zh_hant: **外部**周邊使用足夠高的速度，大約 80-100 毫米/秒。

source: Make sure that the minimum layer time is **at most** 3 seconds.
hu: Győződjön meg róla, hogy a minimális rétegidő ** legfeljebb ** 3 másodperc.
it: Assicurati che il tempo minimo per lo strato sia **al massimo** 3 secondi.
ko: 최소 레이어 시간이 **최대** 3초인지 확인합니다.
zh_hant: 確保最短的層耗時**最多是**3秒。

source: Make sure any "dynamic acceleration control" is disabled in the slicer.
hu: Győződjön meg róla, hogy a szeletelőben a "dinamikus gyorsításvezérlés" ki van kapcsolva.
it: Assicurati che qualsiasi "controllo dinamico dell'accelerazione" sia disabilitato nello slicer.
ko: 슬라이서에서 "동적 가속 제어"가 비활성화되어 있는지 확인합니다.
zh_hant: 確保切片軟體中禁用任何"動態加速度控制"功能。

source: Do not turn the model. The model has X and Y marks at the back of the model. Note the unusual location of the marks vs. the axes of the printer - it is not a mistake. The marks can be used later in the tuning process as a reference, because they show which axis the measurements correspond to.
hu: Ne fordítsa el a modellt. A modell hátulján X és Y jelölések vannak. Figyelje meg a jelek szokatlan elhelyezkedését a nyomtató tengelyeihez képest - ez nem hiba. A jelölések később a hangolási folyamat során referenciaként használhatók, mert megmutatják, hogy a mérések melyik tengelynek felelnek meg.
it: Non girare il modello. Il modello ha segni X e Y sul retro del modello. Nota la posizione insolita dei segni rispetto agli assi della stampante: non è un errore. I contrassegni possono essere utilizzati successivamente nel processo di ottimizzazione come riferimento, poiché mostrano a quale asse corrispondono le misurazioni.
ko: 모델을 돌리지 마십시오. 모델 뒷면에 X 및 Y 표시가 있습니다. 표시의 비정상적인 위치와 프린터 축에 유의하십시오. 이는 오류가 아닙니다. 표시는 측정값에 해당하는 축을 보여주기 때문에 나중에 조정 프로세스에서 참조로 사용될 수 있습니다.
zh_hant: 不要轉動模型。模型的背面標記了X和Y。注意這些標記與印表機軸線方向不相同--這不是一個錯誤。這些標記可以在以後的調整過程中作為參考，因為它們顯示了測量結果對應的軸。

source: Ringing frequency
hu: Gyűrődési frekvencia
it: Frequenza di ringing
ko: Ringing 빈도
zh_hant: 振紋頻率

source: First, measure the **ringing frequency**.
hu: Először is mérje meg a **gyűrődési frekvenciát**.
it: Innanzitutto, misura la **frequenza di ringing**.
ko: 먼저 **rining 주파수**를 측정합니다.
zh_hant: 首先，測量**振紋頻率**。

source: If you have already added `[input_shaper]` section to the printer.cfg, execute `SET_INPUT_SHAPER SHAPER_FREQ_X=0 SHAPER_FREQ_Y=0` command. If you get "Unknown command" error, you can safely ignore it at this point and continue with the measurements.
hu: Ha már hozzáadta az `[input_shaper]` részt a printer.cfg fájlhoz, akkor hajtsa végre a `SET_INPUT_SHAPER SHAPER_FREQ_X=0 SHAPER_FREQ_Y=0` parancsot. Ha "Ismeretlen parancs" hibát kap, nyugodtan figyelmen kívül hagyhatja ezen a ponton, és folytathatja a méréseket.
it: Se hai già aggiunto la sezione `[input_shaper]` a printer.cfg, esegui il comando `SET_INPUT_SHAPER SHAPER_FREQ_X=0 SHAPER_FREQ_Y=0`. Se ricevi l'errore "Comando sconosciuto- Unknown command", puoi tranquillamente ignorarlo a questo punto e continuare con le misurazioni.
ko: Printer.cfg에 `[input_shaper]` 섹션을 이미 추가한 경우 `SET_INPUT_SHAPER SHAPER_FREQ_X=0 SHAPER_FREQ_Y=0` 명령어를 실행합니다. "Unknown command" 오류가 발생하면 안전하게 이 오류를 무시하고 측정을 계속할 수 있습니다.
zh_hant: 如果你已經將`[input_shaper]`分段新增到print.cfg中，執行`SET_INPUT_SHAPER SHAPER_FREQ_X=0 SHAPER_FREQ_Y=0`命令。如果你得到"未知命令"錯誤，此時你可以安全地忽略它，繼續進行測量。

source: Print the test model sliced with the suggested parameters.
hu: Nyomtassa ki a szeletelt tesztmodellt a javasolt paraméterekkel.
it: Stampa il modello di test sliced con i parametri suggeriti.
ko: 제안된 매개변수로 슬라이스된 테스트 모델을 출력합니다.
zh_hant: 列印用建議的參數切片的測試模型。

source: You can stop the print earlier if the ringing is clearly visible and you see that acceleration gets too high for your printer (e.g. printer shakes too much or starts skipping steps).
hu: A nyomtatást korábban is leállíthatja, ha a gyűrődés jól látható, és úgy látja, hogy a gyorsulás túl nagy lesz a nyomtató számára (pl. a nyomtató túlságosan remeg, vagy elkezd lépéseket kihagyni).
it: Puoi interrompere la stampa prima se il ringing è chiaramente visibile e vedi che l'accelerazione diventa troppo alta per la tua stampante (ad es. la stampante trema troppo o inizia a saltare i passaggi).
ko: Ringing이 명확하게 보이고 프린터에 대한 가속도가 너무 높은 경우(예: 프린터가 너무 많이 흔들리거나 단계를 건너뛰기 시작하는 경우) 인쇄 출력을 중지할 수 있습니다.
zh_hant: 如果振紋清晰可見，並且發現加速度對你的印表機來說太高了（如印表機抖動太厲害或開始丟步），你可以提前停止列印。

source: Use X and Y marks at the back of the model for reference. The measurements from the side with X mark should be used for X axis *configuration*, and Y mark - for Y axis configuration. Measure the distance *D* (in mm) between several oscillations on the part with X mark, near the notches, preferably skipping the first oscillation or two. To measure the distance between oscillations more easily, mark the oscillations first, then measure the distance between the marks with a ruler or calipers:
hu: Használja a modell hátulján található X és Y jeleket a tájékozódáshoz. Az X-jelöléssel ellátott oldalról történő méréseket kell használni az X tengely *konfigurációhoz*, az Y-jelölést pedig az Y tengely konfigurációjához. Mérje meg a távolságot *D* (mm-ben) több rezgés között az X jelzésű alkatrészen, a bevágások közelében, lehetőleg az első egy-két rezgést kihagyva. Az oszcillációk közötti távolság könnyebb méréséhez először jelölje meg az oszcillációkat, majd mérje meg a jelölések közötti távolságot vonalzóval vagy tolómérővel:
it: Utilizzare i segni X e Y sul retro del modello come riferimento. Le misurazioni dal lato con il contrassegno X devono essere utilizzate per la *configurazione* dell'asse X e il contrassegno Y - per la configurazione dell'asse Y. Misurare la distanza *D* (in mm) tra più oscillazioni sulla parte con il segno X, in prossimità delle tacche, preferibilmente saltando la prima o due oscillazioni. Per misurare più facilmente la distanza tra le oscillazioni, contrassegnare prima le oscillazioni, quindi misurare la distanza tra i segni con un righello o un calibro:
ko: 참조를 위해 모델 뒷면의 X 및 Y 표시를 이용합니다. X 표시가 있는 쪽의 측정은 X축 *구성*에 사용하고 Y 표시는 Y축 구성에 사용해야 합니다. 노치 근처에서 X 표시가 있는 부품의 여러 진동 사이의 거리 *D*(mm)를 측정합니다. 가급적이면 첫 번째 진동 또는 두 번을 건너뜁니다. 진동 사이의 거리를 더 쉽게 측정하려면 먼저 진동을 표시한 다음 눈금자 또는 캘리퍼스로 표시 사이의 거리를 측정합니다:
zh_hant: 使用模型背面的 X 和 Y 標記作為參考。帶有 X 標記的一側的測量值應用於 X 軸*配置*，而 Y 標記 - 用於 Y 軸配置。在帶有 X 標記的零件上，在槽口附近測量幾次振動之間的距離 *D*（以毫米為單位），最好跳過第一次或兩次振動。為了更容易地測量振蕩之間的距離，請先標記振盪，然後用尺子或卡尺測量標記之間的距離：

source: Count how many oscillations *N* the measured distance *D* corresponds to. If you are unsure how to count the oscillations, refer to the picture above, which shows *N* = 6 oscillations.
hu: Számolja meg, hogy a mért távolság *N* hány rezgésnek *D* felel meg. Ha nem vagy biztos benne, hogyan számold a rezgéseket, nézd meg a fenti képet, ahol *N* = 6 rezgés.
it: Contare a quante oscillazioni *N* corrisponde la distanza misurata *D*. Se non sei sicuro di come contare le oscillazioni, fai riferimento all'immagine sopra, che mostra *N* = 6 oscillazioni.
ko: 측정 거리 *D*가 해당하는 진동수 *N*를 측정합니다. 진동수를 세는 방법을 잘 모르는 경우 *N* = 6 진동수를 표시하는 위의 그림을 참조합니다.
zh_hant: 計算測量距離 *D* 對應的振盪次數 *N*。如果您不確定如何計算振盪次數，請參考上圖，其中顯示 *N* = 6 次振盪。

source: Compute the ringing frequency of X axis as *V* &middot; *N* / *D* (Hz), where *V* is the velocity for outer perimeters (mm/sec). For the example above, we marked 6 oscillations, and the test was printed at 100 mm/sec velocity, so the frequency is 100 * 6 / 12.14 ≈ 49.4 Hz.
hu: Számítsuk ki az X tengely gyűrődési frekvenciáját *V* &middot; *N* / *D* (Hz), ahol *V* a külső kerületekre vonatkozó sebesség (mm/mp). A fenti példánál 6 rezgést jelöltünk meg, és a tesztet 100 mm/mp sebességgel nyomtattuk, így a frekvencia 100 * 6 / 12,14 ≈ 49,4 Hz.
it: Calcola la frequenza di squillo dell'asse X come *V* &middot; *N* / *D* (Hz), dove *V* è la velocità per i perimetri esterni (mm/sec). Per l'esempio sopra, abbiamo contrassegnato 6 oscillazioni e il test è stato stampato a una velocità di 100 mm/sec, quindi la frequenza è 100 * 6 / 12,14 ≈ 49,4 Hz.
ko: *V* &middot; *N* / *D*(Hz) 수식을 이용하여 X축의 ringing 주파수를 게산합니다. 여기서 *V*는 outer perimeters 속도(mm/sec)입니다. 위의 예에서 우리는 6개의 진동수를 표시했고 테스트는 100mm/sec 속도로 인쇄되었으므로 주파수는 100 * 6 / 12.14 ≈ 49.4Hz입니다.
zh_hant: 計算X軸環紋頻率為*V* &middot; *N* / *D* (Hz)，其中 *V* 是外周的速度 (mm/sec)。對於上面的示例，我們標記了 6 個振盪，並且測試以 100 毫米/秒的速度打印，因此頻率為 100 * 6 / 12.14 ≈ 49.4 Hz。

source: Note that ringing on the test print should follow the pattern of the curved notches, as in the picture above. If it doesn't, then this defect is not really a ringing and has a different origin - either mechanical, or an extruder issue. It should be fixed first before enabling and tuning input shapers.
hu: Vegye figyelembe, hogy a próbanyomaton a gyűrődésnek a fenti képen látható íves bevágások mintáját kell követnie. Ha nem így van, akkor ez a hiba nem igazán gyűrődés, és más eredetű - vagy mechanikai, vagy extruderprobléma. Ezt kell először kijavítani, mielőtt engedélyeznénk és hangolnánk a bemeneti formázókat.
it: Si noti che il ringing sulla stampa di prova dovrebbe seguire lo schema delle tacche curve, come nell'immagine sopra. In caso contrario, questo difetto non è in realtà un ringing e ha un'origine diversa: un problema meccanico o dell'estrusore. Dovrebbe essere risolto prima di abilitare e regolare gli shaper di input.
ko: 테스트 인쇄에서 ringing은 위의 그림과 같이 구부러진 노치의 패턴을 따라야 합니다. 그렇지 않은 경우 이 결함은 실제로 rining이 아니라 다른 원인(기계적 문제 또는 압출기 문제)이 있는 것입니다. Input shapers를 활성화하고 조정하기 전에 이 원인은 먼저 해결되어야 합니다.
zh_hant: 請注意，測試打印上的環紋應遵循彎曲凹槽的圖案，如上圖所示。如果不是，那麼這個缺陷並不是真正的環紋，而是有不同的起源——機械問題或擠出機問題。在啟用和input shapers之前，應該先修復它。

source: If the measurements are not reliable because, say, the distance between the oscillations is not stable, it might mean that the printer has several resonance frequencies on the same axis. One may try to follow the tuning process described in [Unreliable measurements of ringing frequencies](#unreliable-measurements-of-ringing-frequencies) section instead and still get something out of the input shaping technique.
hu: Ha a mérések nem megbízhatóak, mert például a rezgések közötti távolság nem stabil, az azt jelentheti, hogy a nyomtatónak több rezonanciafrekvenciája van ugyanazon a tengelyen. Megpróbálhatjuk helyette a [Megbízhatatlan mérések a gyűrődési frekvenciákról](#unreliable-measurements-of-ringing-frequencies) szakaszban leírt hangolási eljárást követni, és még mindig kaphatunk valami infót a bemeneti alakítási technikáról.
it: Se le misurazioni non sono affidabili perché, ad esempio, la distanza tra le oscillazioni non è stabile, potrebbe significare che la stampante ha più frequenze di risonanza sullo stesso asse. Si può invece provare a seguire il processo di sintonizzazione descritto nella sezione [Misurazioni inaffidabili delle frequenze di ringing](#unreliable-measurements-of-ringing-frequencies) e ottenere comunque qualcosa dalla tecnica di input shaping .
ko: 진동 사이의 거리가 안정적이지 않아 측정이 신뢰할 수 없는 경우라면 프린터가 동일한 축에 여러 공진 주파수를 가지고 있음을 의미할 수 있습니다. 대신 [Unreliable measurements of ringing frequencies](#unreliable-measurements-of-ringing-frequencies) 섹션에 설명된 조정 프로세스를 따르고 input shaping 기술에서 무언가를 얻을 수 있습니다.
zh_hant: 如果測量結果不可靠，例如，振蕩之間的距離不穩定，則可能意味著打印機在同一軸上有多個共振頻率。可以嘗試遵循 [不可靠的環紋頻率測量](#unreliable-measurements-of-ringing-frequencies) 部分中描述的調整過程，但仍然可以從input shaper技術中獲得一些東西。

source: Ringing frequency can depend on the position of the model within the buildplate and Z height, *especially on delta printers*; you can check if you see the differences in frequencies at different positions along the sides of the test model and at different heights. You can calculate the average ringing frequencies over X and Y axes if that is the case.
hu: A gyűrődési frekvencia függhet a modell ágyon belüli helyzetétől és a Z magasságtól, *különösen a delta nyomtatóknál*; ellenőrizheti, hogy a tesztmodell oldalai mentén és különböző magasságokban különböző pozíciókban lát-e különbséget a frekvenciákban. Ha ez a helyzet, akkor kiszámíthatja az X és Y tengelyen mért átlagos gyűrődési frekvenciákat.
it: La frequenza dei ringing può dipendere dalla posizione del modello all'interno della piastra di stampa e dall'altezza Z, *soprattutto sulle stampanti delta*; puoi controllare se vedi le differenze di frequenza in diverse posizioni lungo i lati del modello di prova e ad altezze diverse. È possibile calcolare le frequenze di squillo medie sugli assi X e Y, se questo è il caso.
ko: Ringing 빈도는 빌드플레이트 내 모델의 위치와 Z 높이, *특히 델타 프린터*에 따라 달라질 수 있습니다. 테스트 모델의 측면을 따라 다른 위치와 높이에서 주파수 차이가 있는지 확인할 수 있습니다. 이 경우 X 및 Y 축에 대한 평균 ringing 주파수를 계산할 수 있습니다.
zh_hant: 環紋頻率可能取決於模型在構建板內的位置和 Z 高度，*尤其是在 三角洲打印機上*；您可以檢查是否在測試模型兩側的不同位置和不同高度看到頻率差異。如果是這種情況，您可以計算 X 軸和 Y 軸上的平均環紋頻率。

source: If the measured ringing frequency is very low (below approx 20-25 Hz), it might be a good idea to invest into stiffening the printer or decreasing the moving mass - depending on what is applicable in your case - before proceeding with further input shaping tuning, and re-measuring the frequencies afterwards. For many popular printer models there are often some solutions available already.
hu: Ha a mért gyűrődési frekvencia nagyon alacsony (kb. 20-25 Hz alatti), akkor érdemes lehet a nyomtató merevítésére vagy a mozgó tömeg csökkentésére beruházni - attól függően, hogy mi alkalmazható az Ön esetében -, mielőtt a bemeneti alakítás további hangolását folytatná, és utána újra megmérné a frekvenciákat. Sok népszerű nyomtatómodell esetében gyakran már rendelkezésre áll néhány megoldás.
it: Se la frequenza di ringing misurata è molto bassa (inferiore a circa 20-25 Hz), potrebbe essere una buona idea investire nell'irrigidire la stampante o nel diminuire la massa mobile, a seconda di ciò che è applicabile nel tuo caso, prima di procedere con l'ulteriore input shaping e rimisurare le frequenze in seguito. Per molti modelli di stampanti popolari spesso sono già disponibili alcune soluzioni.
ko: 측정된 ringing 주파수가 매우 낮은 경우라면(약 20-25Hz 미만), 추가 input shaping 조정하고 주파수를 다시 측정전에 적용 가능한 사항에 따라 프린터를 강화하거나 이동 물체를 줄이는 데 투자하는 것이 좋습니다. 많은 인기 있는 프린터 모델의 경우 이미 사용 가능한 솔루션이 있는 경우가 많습니다.
zh_hant: 如果測得的環紋頻率非常低（低於大約 20-25 Hz），那麼在進行進一步的input shaper之前，最好投資於加強打印機或減少移動質量（取決於您的情況適用的情況）調整，然後重新測量頻率。對於許多流行的打印機型號，通常已經有一些可用的解決方案。

source: Note that the ringing frequencies can change if the changes are made to the printer that affect the moving mass or change the stiffness of the system, for example:
hu: Vegye figyelembe, hogy a gyűrődési frekvenciák változhatnak, ha a nyomtatóban olyan változtatásokat végeznek, amelyek hatással vannak a mozgó tömegre, vagy például megváltoztatják a gépváz merevségét:
it: Si noti che le frequenze di ringing possono cambiare se alla stampante vengono apportate modifiche che influiscono sulla massa in movimento o modificano la rigidità del sistema, ad esempio:
ko: 프린터가 이동 물체에 영향을 미치거나 시스템의 강성을 변경하는 경우 rining 주파수가 변경될 수 있습니다. 예를 들면 다음과 같습니다:
zh_hant: 請注意，如果對打印機進行了影響移動質量或改變系統剛度的更改，則環紋頻率可能會發生變化，例如：

source: Some tools are installed, removed or replaced on the toolhead that change its mass, e.g. a new (heavier or lighter) stepper motor for direct extruder or a new hotend is installed, heavy fan with a duct is added, etc.
hu: A szerszámfejre néhány olyan eszközt telepítenek, eltávolítanak vagy kicserélnek, amelyek megváltoztatják annak tömegét, pl. új (nehezebb vagy könnyebb) léptetőmotor a közvetlen extrudernek vagy új nyomtatófej telepítése, nehéz, tárgyhűtővel ellátott ventilátor beépítése stb.
it: Alcuni strumenti vengono installati, rimossi o sostituiti sulla testa di stampa che ne modificano la massa, ad es. viene installato un nuovo motore passo-passo (più pesante o più leggero) per estrusore diretto o viene installato un nuovo hotend, viene aggiunta una ventola pesante con un condotto, ecc.
ko: 일부 도구는 물체를 변경하는 toolhead에 설치, 제거 또는 교체됩니다. 예를들어 직접 압출기용 새로운(더 무겁거나 가벼운) 스테퍼 모터 또는 새로운 핫엔드 설치되거나, 덕트가 있는 무거운 팬 추가되거나 등.
zh_hant: 在改變其質量的工具頭上安裝、移除或更換了一些工具，例如安裝了用於直接擠出機或新熱端的新（更重或更輕）步進電機，添加了帶管道的重型風扇等。

source: Belts are tightened.
hu: A szíjak meghúzása.
it: Le cinghie sono tese.
ko: 벨트가 조여져 있습니다.
zh_hant: 皮帶收緊了。

source: Some addons to increase frame rigidity are installed.
hu: A váz merevségének növelésére szolgáló néhány kiegészítés telepítve van.
it: Sono installati alcuni componenti aggiuntivi per aumentare la rigidità del telaio.
ko: 프레임 강성을 높이기 위해 일부 애드온이 설치됩니다.
zh_hant: 安裝了一些增加框架剛度的插件。

source: Different bed is installed on a bed-slinger printer, or glass added, etc.
hu: Különböző ágy van telepítve egy Y ágyas nyomtatóra, vagy üveg hozzáadása stb.
it: Un piatto diverso è installato su una stampante a piatto mobile o aggiunto un vetro, ecc.
ko: bed-slinger 프린터에 다른 베드를 설치하거나 유리를 추가하는 등.
zh_hant: 在拋床打印機上安裝不同的床，或添加玻璃等。

source: If such changes are made, it is a good idea to at least measure the ringing frequencies to see if they have changed.
hu: Ha ilyen változtatásokat hajtanak végre, akkor érdemes legalább a gyűrődési frekvenciákat megmérni, hogy lássák, változtak-e azok.
it: Se vengono apportate tali modifiche, è una buona idea misurare almeno le frequenze di ringing per vedere se sono cambiate.
ko: 이러한 변경이 이루어지면 주파수가 변경되었는지 최소한 rining을 측정하는 것이 좋습니다.
zh_hant: 如果進行了此類更改，最好至少測量環紋頻率以查看它們是否已更改。

source: Input shaper configuration
hu: Bemeneti formázó konfigurációja
it: Configurazione del Input shaper
ko: Input shaper 구성
zh_hant: Input shaper配置
