Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Resonance_Compensation.po
Languages: hu, it, ko, zh_hant

source: Make sure Pressure Advance is disabled: `SET_PRESSURE_ADVANCE ADVANCE=0`
hu: Győződjön meg róla, hogy a Pressure Advance ki van kapcsolva: `SET_PRESSURE_ADVANCE ADVANCE=0`
it: Assicurati che Pressure Advance sia disabilitato: `SET_PRESSURE_ADVANCE ADVANCE=0`
zh_hant: 確保Pressure Advance被禁用：`SET_PRESSURE_ADVANCE ADVANCE=0`

source: Execute: `SET_INPUT_SHAPER SHAPER_TYPE=ZV`
hu: Adja ki a parancsot: `SET_INPUT_SHAPER SHAPER_TYPE=ZV `
it: Eseguire: `SET_INPUT_SHAPER SHAPER_TYPE=ZV`
zh_hant: 執行：`SET_INPUT_SHAPER SHAPER_TYPE=ZV`

source: From the existing ringing test model with your chosen input shaper select the acceleration that shows ringing sufficiently well, and set it with: `SET_VELOCITY_LIMIT ACCEL=...`
hu: A meglévő gyűrődési tesztmodellből a kiválasztott bemeneti alakítóval válassza ki azt a gyorsulást, amely kellően jól mutatja a gyűrődést, és állítsa be a következővel: `SET_VELOCITY_LIMIT ACCEL=...`
it: Dal modello di prova di ringing esistente con lo shaper di input scelto, seleziona l'accelerazione che mostra sufficientemente bene il ringing e impostala con: `SET_VELOCITY_LIMIT ACCEL=...`
zh_hant: 從具有您選擇的 input shaper的現有環紋測試模型中選擇顯示環紋足夠好的加速度，並將其設置為：`SET_VELOCITY_LIMIT ACCEL=...`

source: Execute the command: `TUNING_TOWER COMMAND=SET_INPUT_SHAPER PARAMETER=SHAPER_FREQ_X START=start FACTOR=factor BAND=5` using `start` and `factor` values calculated at step (5).
hu: Adja ki a parancsot: `TUNING_TOWER COMMAND=SET_INPUT_SHAPER PARAMETER=SHAPER_FREQ_X START=start FACTOR=factor BAND=5` a `start` és `factor` értékek felhasználásával, amelyeket az (5.) lépésben számítottunk.
it: Eseguire il comando: `TUNING_TOWER COMMAND=SET_INPUT_SHAPER PARAMETER=SHAPER_FREQ_X START=start FACTOR=factor BAND=5` usando i valori `start` e `factor` calcolati al punto (5).
zh_hant: 使用在步驟 (5) 計算的 `start` 和 `factor` 值執行命令：`TUNING_TOWER COMMAND=SET_INPUT_SHAPER PARAMETER=SHAPER_FREQ_X START=start FACTOR=factor BAND=5`。

source: If you use Pressure Advance, it may need to be re-tuned. Follow the [instructions](Pressure_Advance.md#tuning-pressure-advance) to find the new value, if it differs from the previous one. Make sure to restart Klipper before tuning Pressure Advance.
hu: Ha Pressure Advance-t használ, akkor lehet, hogy újra kell hangolni. Kövesse az [utasításokat](Pressure_Advance.md#tuning-pressure-advance) az új érték megtalálásához, ha az eltér az előzőtől. A Pressure Advance beállítása előtt mindenképpen indítsa újra a Klippert.
it: Se si utilizza Pressure Advance, potrebbe essere necessario risintonizzarlo. Seguire le [istruzioni](Pressure_Advance.md#tuning-pressure-advance) per trovare il nuovo valore, se diverso dal precedente. Assicurati di riavviare Klipper prima di regolare Pressure Advance.
zh_hant: 如果您使用 Pressure Advance，則可能需要重新調整。按照 [instructions](Pressure_Advance.md#tuning-pressure-advance) 找到新值，如果它與前一個不同。確保在調整 Pressure Advance 之前重新啟動 Klipper。

source: For tuning, add empty `[input_shaper]` section to your `printer.cfg`. Then, assuming that you have sliced the ringing model with suggested parameters, print the test model 3 times as follows. First time, prior to printing, run
hu: A hangoláshoz adjunk hozzá üres `[input_shaper]` szakaszt a `printer.cfg` fájlhoz. Ezután, feltételezve, hogy a javasolt paraméterekkel felszeletelte a gyűrődési modellt, nyomtassa ki 3-szor az alábbiak szerint. Első alkalommal, a nyomtatás előtt futtassa le a
it: Per l'ottimizzazione, aggiungi la sezione `[input_shaper]` vuota al tuo `printer.cfg`. Quindi, supponendo di aver fattolo slicing il modello di ringing con i parametri suggeriti, stampare il modello di prova 3 volte come segue. La prima volta, prima della stampa, eseguire
zh_hant: 要進行調整，請將空的 `[input_shaper]` 部分添加到您的 `printer.cfg`。然後，假設您已使用建議的參數對環紋模型進行切片，按如下方式打印測試模型 3 次。第一次，在打印之前，運行

source: |![Ringing test](img/ringing-test.jpg)|![3D Benchy](img/ringing-3dbenchy.jpg)|
zh_hant: |![振紋測試](img/ringing-test.jpg)|![3D Benchy](img/ringing-3dbenchy.jpg)|

source: Basic tuning requires measuring the ringing frequencies of the printer and adding a few parameters to `printer.cfg` file.
ko: 기본 조정을 위해서는 프린터의 ringing 빈도를 측정하고 `printer.cfg` 파일에 몇 가지 매개변수를 추가해야 합니다.

source: Increase `max_accel` and `max_accel_to_decel` parameters in your `printer.cfg` to 7000. Note that this is only needed for tuning, and more proper value will be selected in the corresponding [section](#selecting-max_accel).
ko: `printer.cfg`의 `max_accel` 및 `max_accel_to_decel` 매개변수를 7000으로 늘립니다. 이는 조저에만 필요하며 해당 [섹션](#selecting-max_accel)에서 더 적절한 값이 선택됩니다.

source: If `square_corner_velocity` parameter was changed, revert it back to 5.0. It is not advised to increase it when using the input shaper because it can cause more smoothing in parts - it is better to use higher acceleration value instead.
ko: `square_corner_velocity` 매개변수가 변경되었으면 다시 5.0으로 되돌립니다. Input shaper를 사용할 때 이 값을 늘리는 것은 부품에 더 많은 스무딩을 유발할 수 있으므로 권장하지 않습니다. 대신 더 높은 가속도 값을 사용하는 것이 좋습니다.

source: Restart the firmware: `RESTART`.
ko: 펌웨어를 다시 시작하십시오: `RESTART`.

source: Disable Pressure Advance: `SET_PRESSURE_ADVANCE ADVANCE=0`.
ko: Pressure Advance 비활성화: `SET_PRESSURE_ADVANCE ADVANCE=0`.

source: Execute the command `TUNING_TOWER COMMAND=SET_VELOCITY_LIMIT PARAMETER=ACCEL START=1250 FACTOR=100 BAND=5`. Basically, we try to make ringing more pronounced by setting different large values for acceleration. This command will increase the acceleration every 5 mm starting from 1500 mm/sec^2: 1500 mm/sec^2, 2000 mm/sec^2, 2500 mm/sec^2 and so forth up until 7000 mm/sec^2 at the last band.
ko: 명령을 실행 `TUNING_TOWER COMMAND=SET_VELOCITY_LIMIT PARAMETER=ACCEL START=1250 FACTOR=100 BAND=5`. 기본적으로 우리는 가속도에 대해 다른 큰 값을 설정하여 ringing을 더 두드러지게 하려고 합니다. 이 명령은 1500mm/sec^2에서 시작하여 5mm마다 가속도를 증가시킵니다: 1500mm/sec^2, 2000mm/sec^2, 2500mm/sec^2 등등 마지막 밴드에서 7000mm/sec^2까지.

source: Do (9) - (11) for Y mark as well.
ko: 마찬가지로 Y 표시에 대해서도 (9) - (11)을 수행합니다.

source: Print the ringing test model as follows (assuming you already have shaper_freq_x/y set and max_accel/max_accel_to_decel increased to 7000 in printer.cfg file):
ko: Ringing 테스트 모델을 다음과 같이 인쇄합니다(이미 shaper_freq_x/y가 설정되고 max_accel/max_accel_to_decel이 printer.cfg 파일에서 7000으로 증가했다고 가정):

source: Execute `SET_INPUT_SHAPER SHAPER_TYPE=MZV`.
ko: `SET_INPUT_SHAPER SHAPER_TYPE=MZV`를 실행합니다.

source: Execute the command `TUNING_TOWER COMMAND=SET_VELOCITY_LIMIT PARAMETER=ACCEL START=1250 FACTOR=100 BAND=5`.
ko: `TUNING_TOWER COMMAND=SET_VELOCITY_LIMIT PARAMETER=ACCEL START=1250 FACTOR=100 BAND=5`. 를 실행합니다.

source: Now try EI input shaper. To try it, repeat steps (1)-(5) from above, but executing at step 3 the following command instead: `SET_INPUT_SHAPER SHAPER_TYPE=EI`.
ko: 이제 EI input shaper를 사용해 보십시오. 이를 시도하려면 위의 (1)-(5) 단계를 반복하되 3단계에서 다음 명령을 대신 실행하세요: `SET_INPUT_SHAPER SHAPER_TYPE=EI`.

source: You should have a printed test for the shaper you chose from the previous step (if you don't, print the test model sliced with the [suggested parameters](#tuning) with the pressure advance disabled `SET_PRESSURE_ADVANCE ADVANCE=0` and with the tuning tower enabled as `TUNING_TOWER COMMAND=SET_VELOCITY_LIMIT PARAMETER=ACCEL START=1250 FACTOR=100 BAND=5`). Note that at very high accelerations, depending on the resonance frequency and the input shaper you chose (e.g. EI shaper creates more smoothing than MZV), input shaping may cause too much smoothing and rounding of the parts. So, max_accel should be chosen such as to prevent that. Another parameter that can impact smoothing is `square_corner_velocity`, so it is not advisable to increase it above the default 5 mm/sec to prevent increased smoothing.
ko: 이전 단계에서 선택한 shaper에 대한 인쇄된 테스트가 있어야 합니다 (그렇지 않은 경우 pressure advance 이 비활성화된 `SET_PRESSURE_ADVANCE ADVANCE=0` 및 tuning tower는 `TUNING_TOWER COMMAND=SET_VELOCITY_LIMIT PARAMETER=ACCEL START=1250 FACTOR=100 BAND=5` 로 활성화된 테스트모델 [suggested parameters](#tuning) 을 출력하세요). 매우 높은 가속도에서 공진 주파수와 선택한 input shaper 따라(예: EI shaper는 MZV보다 더 매끄럽게 생성) input shaping은 부품을 너무 많이 매끄럽게 하고 파트를 둥글게 할 수 있습니다. 따라서 이를 방지하기 위해 max_accel을 선택해야 합니다. 스무딩에 영향을 줄 수 있는 또 다른 매개변수는 `square_corner_velocity`이므로 smoothing 증가를 방지하기 위해 기본값인 5mm/sec 이상으로 높이는 것은 권장하지 않습니다.

source: Choose the minimum out of the two acceleration values (from ringing and smoothing), and put it as max_accel into printer.cfg (you can delete max_accel_or_decel or revert it to the old value).
ko: 두 가지 가속도 값(ringing 및 smoothing) 중에서 최소값을 선택하고 max_accel로 printer.cfg에 넣습니다(max_accel_or_decel을 삭제하거나 이전 값으로 되돌릴 수 있음).

source: Assuming that you have sliced the ringing model with suggested parameters and increased `max_accel` and `max_accel_to_decel` parameters in the `printer.cfg` to 7000 already, complete the following steps for each of the axes X and Y:
ko: 제안된 매개변수로 ringing 모델을 슬라이스하고 `printer.cfg`의 `max_accel` 및 `max_accel_to_decel` 매개변수를 이미 7000으로 증가했다고 가정하고 X 및 Y 축 각각에 대해 다음 단계를 완료하십시오:

source: Make sure Pressure Advance is disabled: `SET_PRESSURE_ADVANCE ADVANCE=0`.
ko: Pressure Advance이 비활성화되어 있는지 확인하십시오: `SET_PRESSURE_ADVANCE ADVANCE=0`.

source: Execute `SET_INPUT_SHAPER SHAPER_TYPE=ZV`.
ko: 다음을 실행합니다: `SET_INPUT_SHAPER SHAPER_TYPE=ZV`.

source: From the existing ringing test model with your chosen input shaper select the acceleration that shows ringing sufficiently well, and set it with: `SET_VELOCITY_LIMIT ACCEL=...`.
ko: 선택한 input shaper가 있는 기존 rining 테스트 모델에서 rining을 충분히 잘 보여주는 가속도를 선택하고 다음과 같이 설정합니다: `SET_VELOCITY_LIMIT ACCEL=...`.

source: Execute the command `TUNING_TOWER COMMAND=SET_INPUT_SHAPER PARAMETER=SHAPER_FREQ_X START=start FACTOR=factor BAND=5` using `start` and `factor` values calculated at step (4).
ko: 단계 (4)에서 계산된 `start` 및 `factor` 값을 사용하여 명령어를 실행합니다: `TUNING_TOWER COMMAND=SET_INPUT_SHAPER PARAMETER=SHAPER_FREQ_X START=start FACTOR=factor BAND=5`.

source: Do not forget to revert the changes to `max_accel` and `max_accel_to_decel` parameters in the `printer.cfg` after finishing this section.
ko: 이 섹션을 마친 후 `printer.cfg`의 `max_accel` 및 `max_accel_to_decel` 매개변수에 대한 변경 사항을 되돌리는 것을 잊지 마십시오.

source: If you use Pressure Advance, it may need to be re-tuned. Follow the [instructions](Pressure_Advance.md#tuning-pressure-advance) to find the new value, if it differs from the previous one. Make sure to restore the original values of `max_accel` and `max_accel_to_decel` parameters in the `printer.cfg` and restart Klipper before tuning Pressure Advance.
ko: Pressure Advance를 사용하면 다시 조정되어야 할 수 있습니다. 이전 값과 다른 경우[instructions](Pressure_Advance.md#tuning-pressure-advance)에 따라 새 값을 찾습니다. `printer.cfg`에서 `max_accel` 및 `max_accel_to_decel` 매개변수의 원래 값을 복원하고 Pressure Advance를 조정하기 전에 Klipper를 다시 시작해야 합니다.

source: For tuning, add empty `[input_shaper]` section to your `printer.cfg`. Then, assuming that you have sliced the ringing model with suggested parameters and increased `max_accel` and `max_accel_to_decel` parameters in the `printer.cfg` to 7000 already, print the test model 3 times as follows. First time, prior to printing, run
ko: 조정을 위해 `printer.cfg`에 빈 `[input_shaper]` 섹션을 추가합니다. 그런 다음 제안된 매개변수로 벨소리 모델을 슬라이스하고 `printer.cfg`의 `max_accel` 및 `max_accel_to_decel` 매개변수를 이미 7000 으로 증가했다고 가정하고 다음과 같이 테스트 모델을 3회 인쇄합니다. 처음으로 인쇄하기 전에 다음을 실행합니다
