Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Resonance_Compensation.po
Languages: hu, it, ko, zh_hant

source: After the ringing frequencies for X and Y axes are measured, you can add the following section to your `printer.cfg`:
hu: Az X és Y tengelyek gyűrődési frekvenciájának mérése után a következő szakaszt adhatja hozzá a `printer.cfg` fájlhoz:
it: Dopo aver misurato le frequenze di ringing per gli assi X e Y, puoi aggiungere la seguente sezione al tuo `printer.cfg`:
ko: X축과 Y축의 ringing 주파수를 측정한 후 `printer.cfg`에 다음 섹션을 추가할 수 있습니다:
zh_hant: 在測量 X 和 Y 軸的環紋頻率後，您可以將以下部分添加到您的 `printer.cfg` 中：

source: For the example above, we get shaper_freq_x/y = 49.4.
hu: A fenti példában a shaper_freq_x/y = 49.4.
it: Per l'esempio sopra, otteniamo shaper_freq_x/y = 49.4.
ko: 위의 예에서 shaper_freq_x/y = 49.4를 얻습니다.
zh_hant: 對於上面的示例，我們得到 shaper_freq_x/y = 49.4。

source: Choosing input shaper
hu: Bemeneti formázó kiválasztása
it: Scelta del input shaper
ko: Input shaper 선택
zh_hant: 選擇 input shaper

source: Klipper supports several input shapers. They differ in their sensitivity to errors determining the resonance frequency and how much smoothing they cause in the printed parts. Also, some of the shapers like 2HUMP_EI and 3HUMP_EI should usually not be used with shaper_freq = resonance frequency - they are configured from different considerations to reduce several resonances at once.
hu: A Klipper számos bemeneti formázót támogat. Ezek a rezonanciafrekvenciát meghatározó hibákra való érzékenységükben és abban különböznek, hogy milyen mértékű simítást okoznak a nyomtatott alkatrészekben. Emellett néhány shapert, például a 2HUMP_EI és a 3HUMP_EI formázókat általában nem szabad használni shaper_freq = rezonanciafrekvenciával - ezek különböző megfontolásokból vannak beállítva, hogy egyszerre több rezonanciát csökkentsenek.
it: Klipper supporta diversi input shaper. Si differenziano per la loro sensibilità agli errori che determinano la frequenza di risonanza e quanto smussamento provocano nelle parti stampate. Inoltre, alcuni degli shaper come 2HUMP_EI e 3HUMP_EI di solito non dovrebbero essere usati con shaper_freq = frequenza di risonanza: sono configurati in base a diverse considerazioni per ridurre diverse risonanze contemporaneamente.
ko: Klipper는 여러 input shapers를 지원합니다. 공진 주파수를 결정하는 오류에 대한 민감도와 인쇄된 부품에서 발생하는 smoothing 정도에 따라 input shapers 다릅니다. 또한 2HUMP_EI 및 3HUMP_EI와 같은 일부 shapers는 일반적으로 shaper_freq = 공진 주파수와 함께 사용하면 안 됩니다. 한 번에 여러 공진을 줄이기 위해 shapers 서로 다른 고려 사항에서 구성됩니다.
zh_hant: Klipper 支持多種 input shaper。它們對確定共振頻率的誤差的敏感性以及它們在打印部件中引起的平滑程度不同。此外，像 2HUMP_EI 和 3HUMP_EI 這樣的一些整形器通常不應該與 shaper_freq = 共振頻率一起使用——它們是從不同的考慮來配置的，以一次減少多個共振。

source: For most of the printers, either MZV or EI shapers can be recommended. This section describes a testing process to choose between them, and figure out a few other related parameters.
hu: A legtöbb nyomtatóhoz MZV vagy EI alakítók ajánlhatók. Ez a szakasz egy tesztelési eljárást ír le a kettő közötti választáshoz, valamint néhány egyéb kapcsolódó paraméter meghatározásához.
it: Per la maggior parte delle stampanti, possono essere consigliati shaper MZV o EI. Questa sezione descrive un processo di test per scegliere tra di loro e capire alcuni altri parametri correlati.
ko: 대부분의 프린터에는 MZV 또는 EI shapers가 권장됩니다. 이 섹션에서는 이들 중에서 선택하고 몇 가지 다른 관련 매개변수를 이해하기 위한 테스트 프로세스를 설명합니다.
zh_hant: 對於大多數打印機，可以推薦 MZV 或 EI 整形器。本節描述了在它們之間進行選擇的測試過程，並確定了一些其他相關參數。

source: If you see no ringing at this point, then MZV shaper can be recommended for use.
hu: Ha ezen a ponton nem lát gyűrődést, akkor az MZV formázó használatát lehet javasolni.
it: Se a questo punto non si vede alcun ringing, è possibile consigliare l'uso dello shaper MZV.
ko: 이 시점에서 ringing 이 보이지 않으면 MZV shaper 사용을 권장할 수 있습니다.
zh_hant: 如果此時您沒有看到環紋，則可以推薦使用 MZV 整形器。

source: If you do see some ringing, re-measure the frequencies using steps (8)-(10) described in [Ringing frequency](#ringing-frequency) section. If the frequencies differ significantly from the values you obtained earlier, a more complex input shaper configuration is needed. You can refer to Technical details of [Input shapers](#input-shapers) section. Otherwise, proceed to the next step.
hu: Ha mégis gyűrődést észlel, mérje meg újra a frekvenciákat a [Gyűrődési frekvencia](#ringing-frequency) szakaszban leírt (8)-(10) lépésekkel. Ha a frekvenciák jelentősen eltérnek a korábban kapott értékektől, akkor összetettebb bemeneti alakító konfigurációra van szükség. Lásd a [Bemeneti alakítók](#input-shapers) szakasz műszaki részleteit. Ellenkező esetben folytassa a következő lépéssel.
it: Se vedi dei ringing, rimisura le frequenze usando i passaggi (8)-(10) descritti nella sezione [Frequenza ringing](#frequenza-ringing). Se le frequenze differiscono in modo significativo dai valori ottenuti in precedenza, è necessaria una configurazione dello shaper di input più complessa. Puoi fare riferimento ai dettagli tecnici della sezione [Input shapers](#input-shapers). In caso contrario, procedere al passaggio successivo.
ko: Ringing이 보이면 [링잉 주파수](#ringing-frequency) 섹션에 설명된 단계 (8)-(10)을 사용하여 주파수를 다시 측정합니다. 주파수가 이전에 얻은 값과 크게 다른 경우 더 복잡한 input shaper 구성이 필요합니다. [Input shapers](#input-shapers) 섹션의 기술적 세부 사항을 참조할 수 있습니다.그렇지 않으면 다음 단계로 진행하십시오.
zh_hant: 如果您確實看到一些環紋，請使用 [環紋頻率](#ringing-frequency) 部分中描述的步驟 (8)-(10) 重新測量頻率。如果頻率與您之前獲得的值顯著不同，則需要更複雜的input shaper配置。您可以參考 [Choosing input shaper](#input-shapers) 部分的技術細節。否則，繼續下一步。

source: Compare two prints with MZV and EI input shaper. If EI shows noticeably better results than MZV, use EI shaper, otherwise prefer MZV. Note that EI shaper will cause more smoothing in printed parts (see the next section for further details). Add `shaper_type: mzv` (or ei) parameter to [input_shaper] section, e.g.:
hu: Két nyomat összehasonlítása MZV és EI bemeneti alakítóval. Ha az EI észrevehetően jobb eredményt mutat, mint az MZV, akkor használja az EI alakítót, egyébként inkább az MZV-t. Vegye figyelembe, hogy az EI shaper több simítást okoz a nyomtatott alkatrészeken (további részletekért lásd a következő szakaszt). Adja hozzá a `shaper_type: mzv` (vagy ei) paramétert az [input_shaper] szakaszhoz, pl.:
it: Confronta due stampe con input shaper MZV e EI. Se EI mostra risultati notevolmente migliori rispetto a MZV, utilizzare EI shaper, altrimenti preferire MZV. Si noti che lo shaper EI causerà una maggiore levigatura 'smoothing' nelle parti stampate (vedere la sezione successiva per ulteriori dettagli). Aggiungi il parametro `shaper_type: mzv` (o ei) alla sezione [input_shaper], ad esempio:
ko: MZV 및 EI input shaper로 두 개의 인쇄물을 비교합니다. EI가 MZV보다 눈에 띄게 더 나은 결과를 보이면 EI shaper를 사용하고, 그렇지 않으면 MZV를 선호합니다. EI shaper는 인쇄된 부분을 더 매끄럽게 만듭니다(자세한 내용은 다음 섹션 참조). `shaper_type: mzv` (또는 ei) 매개변수를 [input_shaper] 섹션에 추가합니다. 예:
zh_hant: 使用 MZV 和 EI input shaper比較兩個打印。如果 EI 顯示出明顯優於 MZV 的結果，請使用 EI 整形器，否則更喜歡 MZV。請注意，EI shaper 將使打印部件更加平滑（有關詳細信息，請參閱下一節）。將 `shaper_type: mzv`（或 ei）參數添加到 [input_shaper] 部分，例如：

source: A few notes on shaper selection:
hu: Néhány megjegyzés a formázó kiválasztásáról:
it: Alcune note sulla scelta dello shaper:
ko: Shaper 선택에 대한 몇 가지 참고 사항:
zh_hant: 關於整形器選擇的一些注意事項：

source: EI shaper may be more suited for bed slinger printers (if the resonance frequency and resulting smoothing allows): as more filament is deposited on the moving bed, the mass of the bed increases and the resonance frequency will decrease. Since EI shaper is more robust to resonance frequency changes, it may work better when printing large parts.
hu: Az EI-formázó alkalmasabb lehet az Y ágyas nyomtatókhoz (ha a rezonanciafrekvencia és az ebből eredő simítás lehetővé teszi): mivel több szál kerül a mozgó ágyra, az ágy tömege nő, és a rezonanciafrekvencia csökken. Mivel az EI shaper robusztusabb a rezonanciafrekvencia-változásokkal szemben, jobban működhet nagy méretű alkatrészek nyomtatásakor.
it: Lo shaper EI può essere più adatto per le stampanti a piatto mobile (se la frequenza di risonanza e il conseguente livellamento lo consentono): man mano che si deposita più filamento sul piatto mobile, la massa del piatto aumenta e la frequenza di risonanza diminuisce. Poiché lo shaper EI è più robusto alle variazioni della frequenza di risonanza, potrebbe funzionare meglio quando si stampano parti di grandi dimensioni.
ko: EI shaper는 베드 슬링거 프린터에 더 적합할 수 있습니다(공진 주파수 및 결과적인 smoothing 이 허용되는 경우): 더 많은 필라멘트가 움직이는 베드에 적층됨에 따라 베드의 질량이 증가하고 공진 주파수가 감소합니다. EI shaper는 공진 주파수 변화에 더 강하기 때문에 큰 부품을 인쇄할 때 더 잘 작동할 수 있습니다.
zh_hant: EI shaper 可能更適合於拋床打印機（如果共振頻率和由此產生的平滑允許）：隨著更多的細絲沉積在移動床上，床的質量會增加，共振頻率會降低。由於 EI 整形器對共振頻率變化更加穩健，因此在打印大型零件時可能會更好地工作。

source: Due to the nature of delta kinematics, resonance frequencies can differ a lot in different parts of the build volume. Therefore, EI shaper can be a better fit for delta printers rather than MZV or ZV, and should be considered for the use. If the resonance frequency is sufficiently large (more than 50-60 Hz), then one can even attempt to test 2HUMP_EI shaper (by running the suggested test above with `SET_INPUT_SHAPER SHAPER_TYPE=2HUMP_EI`), but check the considerations in the [section below](#selecting-max_accel) before enabling it.
hu: A delta kinematika természetéből adódóan a rezonanciafrekvenciák a térfogat különböző részein nagymértékben eltérhetnek. Ezért az EI alakító jobban illeszkedhet a delta nyomtatókhoz, mint az MZV vagy a ZV, és megfontolandó a használata. Ha a rezonanciafrekvencia kellően nagy (50-60 Hz-nél nagyobb), akkor akár meg is próbálkozhatunk a 2HUMP_EI shaper tesztelésével (a fent javasolt teszt futtatásával a `SET_INPUT_SHAPER SHAPER_TYPE=2HUMP_EI`), de ellenőrizze a [lenti](#selecting-max_accel) szakaszban található megfontolásokat, mielőtt engedélyezné.
it: A causa della natura della cinematica delta, le frequenze di risonanza possono differire molto in diverse parti del volume di costruzione. Pertanto, lo shaper EI può adattarsi meglio alle stampanti delta piuttosto che a MZV o ZV e dovrebbe essere considerato per l'uso. Se la frequenza di risonanza è sufficientemente grande (più di 50-60 Hz), si può anche provare a testare lo shaper 2HUMP_EI (eseguendo il test suggerito sopra con `SET_INPUT_SHAPER SHAPER_TYPE=2HUMP_EI`), ma controllare le considerazioni nella [sezione sotto ](#selecting-max_accel) prima di abilitarlo.
ko: 델타 운동학의 특성으로 인해 공진 주파수는 빌드 볼륨의 다른 부분에서 많이 다를 수 있습니다. 따라서 EI shaper는 MZV나 ZV보다 델타 프린터에 더 적합할 수 있으므로 사용을 고려해야 합니다. 공진 주파수가 충분히 큰 경우(50-60Hz 이상), 2HUMP_EI 셰이퍼를 테스트할 수도 있지만 (위의 제안된 테스트를 `SET_INPUT_SHAPER SHAPER_TYPE=2HUMP_EI`로 실행하여) 활성화하기 전에 [아래 섹션](#selecting-max_accel)에서 고려 사항을 확인하십시오.
zh_hant: 由於三角洲機型的性質，共振頻率在構建體積的不同部分可能會有很大差異。因此，EI shaper 可能比 MZV 或 ZV 更適合 delta 打印機，應考慮使用。如果共振頻率足夠大（超過 50-60 Hz），那麼甚至可以嘗試測試 2HUMP_EI 整形器（通過使用 `SET_INPUT_SHAPER SHAPER_TYPE=2HUMP_EI` 運行上面建議的測試），但請檢查 [下面的部分](#selecting-max_accel) 在啟用它之前。

source: Selecting max_accel
hu: A max_accel kiválasztása
it: Seleziona max_accel
ko: max_accel 선택
zh_hant: 選擇 max_accel

source: In order to select a suitable max_accel value, inspect the model for the chosen input shaper. First, take a note at which acceleration ringing is still small - that you are comfortable with it.
hu: A megfelelő max_accel érték kiválasztásához vizsgálja meg a kiválasztott bemeneti alakító modelljét. Először is jegyezze meg, hogy melyik gyorsulásnál még kicsi a gyorsulás-gyűrődése hogy Önnek ez megfeleljen.
it: Per selezionare un valore max_accel adatto, ispezionare il modello per lo shaper di input scelto. Per prima cosa, prendi nota a quale accelerazione il ringing è ancora piccolo - che ti vada bene.
ko: 적절한 max_accel 값을 선택하려면 선택한 input shaper에 대한 모델을 검사합니다. 먼저 가속도 ringing이 여전히 작은지 확인하십시오.
zh_hant: 為了選擇合適的 max_accel 值，請檢查所選 input shaper 的模型。首先，記下加速度環紋仍然很小的情況——您對此感到滿意。

source: Next, check the smoothing. To help with that, the test model has a small gap in the wall (0.15 mm):
hu: Ezután ellenőrizze a simítást. Ennek elősegítése érdekében a tesztmodellben egy kis rés van a falon (0,15 mm):
it: Quindi, controlla la levigatura - smoothing. Per aiutare in questo, il modello di prova ha un piccolo spazio nel muro (0,15 mm):
ko: 다음으로 smoothing을 확인합니다. 이를 돕기 위해 테스트 모델은 벽에 작은 틈(0.15mm)이 있습니다:
zh_hant: 接下來，檢查平滑。為了解決這個問題，測試模型在牆上有一個小間隙（0.15 毫米）：

source: As the acceleration increases, so does the smoothing, and the actual gap in the print widens:
hu: Ahogy nő a gyorsulás, úgy nő a simítás is, és a tényleges rés a nyomtatásban kiszélesedik:
it: All'aumentare dell'accelerazione, aumenta anche la levigatura-smoothing e lo spazio effettivo nella stampa si allarga:
ko: 가속도가 증가함에 따라 smoothing도 증가하고 인쇄물의 실제 틈이 넓어집니다:
zh_hant: 隨著加速度的增加，平滑度也會增加，打印中的實際間隙也會擴大：

source: In this picture, the acceleration increases left to right, and the gap starts to grow starting from 3500 mm/sec^2 (5-th band from the left). So the good value for max_accel = 3000 (mm/sec^2) in this case to avoid the excessive smoothing.
hu: Ezen a képen a gyorsulás balról jobbra növekszik, és a rés 3500 mm/sec^2-től (balról az 5. sáv) kezd nőni. Tehát ebben az esetben a max_accel = 3000 (mm/sec^2) a jó érték, hogy elkerüljük a túlzott simítást.
it: In questa immagine, l'accelerazione aumenta da sinistra a destra e il gap inizia a crescere a partire da 3500 mm/sec^2 (quinta banda da sinistra). Quindi il buon valore per max_accel = 3000 (mm/sec^2) in questo caso per evitare l'eccessivo smoothing.
ko: 이 그림에서 가속도는 왼쪽에서 오른쪽으로 증가하며 3500mm/sec^2(왼쪽에서 5번째 밴드) 부터 간격이 커지기 시작합니다. 따라서 이 경우 과도한 smoothing을 피하기 위해 max_accel = 3000(mm/sec^2)는 적절한 값입니다.
zh_hant: 在這張圖片中，加速度從左到右增加，間隙從 3500 mm/sec^2（左起第 5 個波段）開始增加。因此，在這種情況下，max_accel = 3000 (mm/sec^2) 的良好值可以避免過度平滑。

source: Note the acceleration when the gap is still very small in your test print. If you see bulges, but no gap in the wall at all, even at high accelerations, it may be due to disabled Pressure Advance, especially on Bowden extruders. If that is the case, you may need to repeat the print with the PA enabled. It may also be a result of a miscalibrated (too high) filament flow, so it is a good idea to check that too.
hu: Figyelje meg a gyorsulást, amikor a rés még mindig nagyon kicsi a próbanyomaton. Ha kidudorodásokat lát, de a falon egyáltalán nincs rés, még nagy gyorsulásnál is, az a kikapcsolt nyomáselőtolás miatt lehet, különösen a bowdenes extrudereken. Ha ez a helyzet, akkor lehet, hogy meg kell ismételni a nyomtatást engedélyezett PA-val. Ez lehet a rosszul kalibrált (túl magas) nyomtatószál-áramlás eredménye is, ezért ezt is érdemes ellenőrizni.
it: Nota l'accelerazione quando lo spazio è ancora molto piccolo nella stampa di prova. Se vedi rigonfiamenti, ma nessun vuoto nel muro, anche ad alte accelerazioni, potrebbe essere dovuto all'avanzamento della pressione disabilitato, specialmente sugli estrusori Bowden. In tal caso, potrebbe essere necessario ripetere la stampa con il PA abilitato. Potrebbe anche essere il risultato di un flusso di filamento non calibrato (troppo alto), quindi è una buona idea controllare anche quello.
ko: 테스트 인쇄에서 틈이 여전히 매우 작을 때 가속도에 유의하십시오. 팽창이 보이지만 높은 가속에서도 벽에 틈이 전혀 없다면 특히 Bowden 압출기에서 비활성화된 Pressure Advance 때문일 수 있습니다. 이 경우 PA가 활성화된 상태에서 인쇄를 반복해야 할 수도 있습니다. 또한 잘못 보정된(너무 높은) 필라멘트 흐름의 결과일 수 있으므로 이것도 확인하는 것이 좋습니다.
zh_hant: 請注意在您的測試打印中間隙仍然非常小時的加速度。如果您看到凸起，但壁上根本沒有間隙，即使在高加速度下，也可能是由於禁用了壓力推進，尤其是在鮑登擠出機上。如果是這種情況，您可能需要在啟用 PA 的情況下重複打印。這也可能是由於燈絲流量校準錯誤（過高）造成的，因此最好也檢查一下。

source: As a note, it may happen - especially at low ringing frequencies - that EI shaper will cause too much smoothing even at lower accelerations. In this case, MZV may be a better choice, because it may allow higher acceleration values.
hu: Megjegyzendő, hogy előfordulhat - különösen alacsony gyűrődési frekvenciáknál -, hogy az EI shaper még kisebb gyorsulásoknál is túl nagy simítást okoz. Ebben az esetben az MZV jobb választás lehet, mert nagyobb gyorsulási értékeket engedhet meg.
it: Come nota, può succedere, specialmente a basse frequenze di ringing, che lo shaper EI provochi un'eccessiva attenuazione anche a basse accelerazioni. In questo caso, MZV potrebbe essere una scelta migliore, perché potrebbe consentire valori di accelerazione più elevati.
ko: 참고로, 특히 낮은 ringing 주파수에서 EI shaper가 더 낮은 가속에서도 너무 많은 smoothing을 유발할 수 있습니다. 이 경우 더 높은 가속도 값을 허용할 수 있으므로 MZV가 더 나은 선택일 수 있습니다.
zh_hant: 需要注意的是，即使在較低的加速度下，EI 整形器也可能會導致過度平滑——尤其是在低環紋頻率下。在這種情況下，MZV 可能是更好的選擇，因為它可能允許更高的加速度值。

source: At very low ringing frequencies (~25 Hz and below) even MZV shaper may create too much smoothing. If that is the case, you can also try to repeat the steps in [Choosing input shaper](#choosing-input-shaper) section with ZV shaper, by using `SET_INPUT_SHAPER SHAPER_TYPE=ZV` command instead. ZV shaper should show even less smoothing than MZV, but is more sensitive to errors in measuring the ringing frequencies.
hu: Nagyon alacsony gyűrődési frekvenciákon (~25 Hz és az alatt) még az MZV shaper is túl sok simítást hozhat létre. Ha ez a helyzet, akkor megpróbálhatja megismételni a [Bemeneti formázó kiválasztása](#choosing-input-shaper) szakaszban leírt lépéseket ZV shaperrel is, a `SET_INPUT_SHAPER SHAPER_TYPE=ZV` parancs használatával. A ZV shapernek még kevesebb simítást kell mutatnia, mint az MZV-nek, de érzékenyebb a gyűrődési frekvenciák mérési hibáira.
it: A frequenze di ringing molto basse (~25 Hz e inferiori) anche lo shaper MZV può creare un effetto smussato eccessivo. In tal caso, puoi anche provare a ripetere i passaggi nella sezione [Scegliere input shaper](#choosing-input-shaper) con shaper ZV, usando invece il comando `SET_INPUT_SHAPER SHAPER_TYPE=ZV`. Lo shaper ZV dovrebbe mostrare un livellamento ancora inferiore rispetto a MZV, ma è più sensibile agli errori nella misurazione delle frequenze di ringing.
ko: 매우 낮은 ringing 주파수(~25Hz 이하)에서는 MZV shaper라도 너무 많은 smoothing을 생성할 수 있습니다. 이 경우 `SET_INPUT_SHAPER SHAPER_TYPE=ZV` 명령어를 대신 사용하여 ZV shaper로 [Choosing input shaper](#choosing-input-shaper) 섹션의 단계를 반복할 수도 있습니다. ZV shaper는 MZV보다 smoothing이 훨씬 낮아야 하지만 ringing 주파수를 측정할 때 오류에 더 민감합니다.
zh_hant: 在非常低的環紋頻率（~25 Hz 及以下）下，即使是 MZV 整形器也可能會產生過多的平滑。如果是這種情況，您也可以嘗試使用 ZV 整形器重複 [Choosing input shaper](#choosing-input-shaper) 部分中的步驟，改用 `SET_INPUT_SHAPER SHAPER_TYPE=ZV` 命令。 ZV 整形器應該比 MZV 顯示更少的平滑，但對測量環紋頻率的誤差更敏感。

source: Another consideration is that if a resonance frequency is too low (below 20-25 Hz), it might be a good idea to increase the printer stiffness or reduce the moving mass. Otherwise, acceleration and printing speed may be limited due too much smoothing now instead of ringing.
hu: Egy másik szempont, hogy ha a rezonanciafrekvencia túl alacsony (20-25 Hz alatt), akkor érdemes lehet növelni a nyomtató vázának merevségét vagy csökkenteni a mozgó tömeget. Ellenkező esetben a gyorsulás és a nyomtatási sebesség korlátozódhat a túl sok simítás miatt most a gyűrődés helyett.
it: Un'altra considerazione è che se una frequenza di risonanza è troppo bassa (inferiore a 20-25 Hz), potrebbe essere una buona idea aumentare la rigidità della stampante o ridurre la massa in movimento. In caso contrario, l'accelerazione e la velocità di stampa potrebbero essere limitate a causa di un'eccessivo smoothing invece del ringing.
ko: 매우 낮은 ringing 주파수(~25Hz 이하)에서는 MZV shaper라도 너무 많은 smoothing을 생성할 수 있습니다. 이 경우 'SET_INPUT_SHAPER SHAPER_TYPE=ZV' 명령어를 대신 사용하여 ZV shaper로 [input shaper 선택](#choosing-input-shaper) 섹션의 단계를 반복할 수도 있습니다. ZV shaper는 MZV보다 smoothing이 훨씬 낮아야 하지만 ringing 주파수를 측정할 때 오류에 더 민감합니다.
zh_hant: 另一個考慮因素是，如果共振頻率太低（低於 20-25 Hz），增加打印機剛度或減少移動質量可能是個好主意。否則，加速度和打印速度可能會由於現在過於平滑而不是環紋而受到限制。

source: Fine-tuning resonance frequencies
hu: A rezonanciafrekvenciák finomhangolása
it: Regolazione fine delle frequenze di risonanza
zh_hant: 微調共振頻率

source: Note that the precision of the resonance frequencies measurements using the ringing test model is sufficient for most purposes, so further tuning is not advised. If you still want to try to double-check your results (e.g. if you still see some ringing after printing a test model with an input shaper of your choice with the same frequencies as you have measured earlier), you can follow the steps in this section. Note that if you see ringing at different frequencies after enabling [input_shaper], this section will not help with that.
hu: Megjegyzendő, hogy a rezonanciafrekvenciák mérésének pontossága a gyűrődési tesztmodell segítségével a legtöbb célra elegendő, így további hangolás nem javasolt. Ha mégis meg akarja próbálni kétszeresen ellenőrizni az eredményeit (például ha még mindig lát némi gyűrődést, miután kinyomtatott egy tesztmodellt egy tetszőleges bemeneti alakítóval, ugyanazokkal a frekvenciákkal, mint amiket korábban mért), akkor kövesse az ebben a szakaszban leírt lépéseket. Vegye figyelembe, hogy ha az [input_shaper] engedélyezése után különböző frekvenciákon lát gyűrődést, ez a szakasz nem fog segíteni.
it: Si noti che la precisione delle misurazioni delle frequenze di risonanza utilizzando il modello di test di ringing è sufficiente per la maggior parte degli scopi, quindi si sconsiglia un'ulteriore messa a punto. Se vuoi ancora provare a ricontrollare i tuoi risultati (ad esempio se vedi ancora del ringing dopo aver stampato un modello di prova con un input shaper a tua scelta con le stesse frequenze che hai misurato in precedenza), puoi seguire i passaggi in questo sezione. Nota che se vedi ringing a frequenze diverse dopo aver abilitato [input_shaper], questa sezione non ti aiuterà.
ko: Ringing 테스트 모델을 사용하는 공진 주파수 측정의 정밀도는 대부분의 목적에 충분하므로 추가 조정은 권장되지 않습니다. 여전히 결과를 다시 확인하려는 경우(예: 이전에 측정한 것과 동일한 주파수로 선택한 input shaper를 사용하여 테스트 모델을 인쇄한 후에도 약간의 ringing이 있는 경우) 이 섹션의 단계를 따를 수 있습니다. [input_shaper]를 활성화한 후 다른 주파수에서 ringing이 표시되는 경우 이 섹션은 도움이 되지 않습니다.
zh_hant: 請注意，使用環紋測試模型的諧振頻率測量精度足以滿足大多數目的，因此不建議進一步調整。如果您仍想嘗試仔細檢查您的結果（例如，如果您在使用您選擇的input shaper打印一個測試模型後仍然看到一些環紋，您選擇的input shaper與您之前測量的頻率相同），您可以按照本文中的步驟操作部分。請注意，如果您在啟用 [input_shaper] 後看到不同頻率的環紋，則本節將無濟於事。

source: Calculate the necessary parameters for the `TUNING_TOWER` command to tune `shaper_freq_x` parameter as follows: start = shaper_freq_x * 83 / 132 and factor = shaper_freq_x / 66, where `shaper_freq_x` here is the current value in `printer.cfg`.
hu: Számítsa ki a `TUNING_TOWER` parancshoz szükséges paramétereket a `shaper_freq_x` paraméter hangolásához az alábbiak szerint: Itt a `shaper_freq_x` paraméter a nyomtató aktuális értéke a `printer.cfg` fájlban megadva.
it: Calcola i parametri necessari per il comando `TUNING_TOWER` per ottimizzare il parametro `shaper_freq_x` come segue: start = shaper_freq_x * 83 / 132 e factor = shaper_freq_x / 66, dove qui `shaper_freq_x` è il valore corrente in `printer.cfg`.
ko: `shaper_freq_x` 매개변수를 조정하기 위해 `TUNING_TOWER` 명령에 필요한 매개변수를 다음과 같이 계산합니다. start = shaper_freq_x * 83 / 132 및 factor = shaper_freq_x / 66, 여기서 `shaper_freq_x`는 `printer.cfg`의 현재 값입니다.
zh_hant: 計算 `TUNING_TOWER` 命令調整 `shaper_freq_x` 參數的必要參數如下： start = shaper_freq_x * 83 / 132 和 factor = shaper_freq_x / 66，其中 `shaper_freq_x` 這裡是 `printer.cfg` 中的當前值。

source: Print the test model.
hu: Nyomtassa ki a tesztmodellt.
it: Stampa il modello di prova.
ko: 테스트 모델을 인쇄합니다.
zh_hant: 打印測試模型。

source: Reset the original frequency value: `SET_INPUT_SHAPER SHAPER_FREQ_X=...`.
hu: Az eredeti frekvenciaérték visszaállítása: `SET_INPUT_SHAPER SHAPER_FREQ_X=...`.
it: Reimposta il valore della frequenza originale: `SET_INPUT_SHAPER SHAPER_FREQ_X=...`.
ko: 원래 주파수 값을 재설정합니다: `SET_INPUT_SHAPER SHAPER_FREQ_X=...`.
zh_hant: 重置原始頻率值：`SET_INPUT_SHAPER SHAPER_FREQ_X=...`。

source: Find the band which shows ringing the least and count its number from the bottom starting at 1.
hu: Keresse meg azt a sávot, amelyik a legkevésbé gyűrött, és számolja meg a számát alulról 1-től kezdve.
it: Trova la fascia che mostra meno ringing e conta il suo numero dal basso partendo da 1.
ko: 가장 적은 rining 밴드를 찾아 그 아래에서 1부터 숫자를 센다.
zh_hant: 找到環紋最少的區間，從 1 開始從底部開始計數。
