Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Rotation_Distance.po
Languages: hu, it, ko, zh_hant

source: Stepper motor drivers on Klipper require a `rotation_distance` parameter in each [stepper config section](Config_Reference.md#stepper). The `rotation_distance` is the amount of distance that the axis moves with one full revolution of the stepper motor. This document describes how one can configure this value.
hu: A Klipper léptetőmotor-meghajtók minden [léptető konfigurációs szakaszban](Config_Reference.md#stepper) megkövetelnek egy `rotation_distance` paramétert. A `rotation_distance` az a távolság, amelyet a tengely a léptetőmotor egy teljes fordulatával elmozdít. Ez a dokumentum leírja, hogyan lehet ezt az értéket beállítani.
it: I driver per motori passo-passo su Klipper richiedono un parametro `rotation_distance` in ciascuna [stepper config section](Config_Reference.md#stepper). La `distanza_rotazione` è la distanza percorsa dall'asse con un giro completo del motore passo-passo relativo. Questo documento descrive come configurare questo valore.
ko: Klipper의 스테퍼 모터 드라이버는 각 [스테퍼 구성 섹션](Config_Reference.md#stepper) 에 `rotation_distance` 매개변수가 필요합니다. 'rotation_distance'는 스테퍼 모터가 완전히 1회전할 때 축이 이동하는 거리의 양입니다. 이 문서에서는 이 값을 구성하는 방법을 설명합니다.
zh_hant: Klipper 上的步進電機驅動器在每個 [步進配置部分](Config_Reference.md#stepper) 中都需要一個 `rotation_distance` 參數。 `rotation_distance` 是步進電機旋轉一整圈時軸移動的距離。本文件描述瞭如何配置此值。

source: Obtaining rotation_distance from steps_per_mm (or step_distance)
hu: A rotation_distance kinyerése a steps_per_mm (vagy step_distance) értékből
it: Ottenere rotation_distance da steps_per_mm (o step_distance)
ko: steps_per_mm(또는 step_distance)에서 rotation_distance 가져오기
zh_hant: 從step_per_mm（或step_distance）獲取旋轉距離

source: The designers of your 3d printer originally calculated `steps_per_mm` from a rotation distance. If you know the steps_per_mm then it is possible to use this general formula to obtain that original rotation distance:
hu: A 3d nyomtató tervezői eredetileg `steps_per_mm` forgási távolságból számították ki. Ha ismeri a steps_per_mm értéket, akkor ezzel az általános képlettel megkaphatja ezt az eredeti forgási távolságot:
it: I progettisti della tua stampante 3d hanno originariamente calcolato `steps_per_mm` da una distanza di rotazione. Se conosci i passi_per_mm, è possibile utilizzare questa formula generale per ottenere la distanza di rotazione originale:
ko: 3d 프린터의 설계자는 원래 회전 거리에서 `steps_per_mm`를 계산했습니다. steps_per_mm를 알고 있다면 이 일반 공식을 사용하여 원래 회전 거리를 얻을 수 있습니다:
zh_hant: 你的 3D 印表機的設計師最初從旋轉距離計算 `steps_per_mm `。如果您知道steps_per_mm，則可以使用此通用公式獲得原始旋轉距離：

source: Or, if you have an older Klipper configuration and know the `step_distance` parameter you can use this formula:
hu: Vagy ha régebbi Klipper-konfigurációval rendelkezik, és ismeri a `step_distance` paramétert, akkor használhatja ezt a képletet:
it: Oppure, se hai una configurazione di Klipper precedente e conosci il parametro `step_distance` puoi usare questa formula:
ko: 또는 이전 Klipper 구성이 있고 `step_distance` 매개변수를 알고 있는 경우 다음 공식을 사용할 수 있습니다:
zh_hant: 或者，如果你有一個舊版本的Klipper配置並知道`step_distance`參數，你可以使用這個公式：

source: The `<full_steps_per_rotation>` setting is determined from the type of stepper motor. Most stepper motors are "1.8 degree steppers" and therefore have 200 full steps per rotation (360 divided by 1.8 is 200). Some stepper motors are "0.9 degree steppers" and thus have 400 full steps per rotation. Other stepper motors are rare. If unsure, do not set full_steps_per_rotation in the config file and use 200 in the formula above.
hu: A `<full_steps_per_rotation>` beállítást a léptetőmotor típusa határozza meg. A legtöbb léptetőmotor "1,8 fokos lépésszögű" és ezért 200 teljes lépés/fordulat (360 osztva 1,8-al 200). Egyes léptetőmotorok "0,9 fokos lépésszögűek" és így 400 teljes lépést tesznek meg fordulatonként. Más léptetőmotorok ritkábbak. Ha bizonytalan, ne állítsa be a full_steps_per_rotation értéket a konfigurációs fájlban, és használja a 200-at a fenti képletben.
it: L'impostazione `<full_steps_per_rotation>` è determinata dal tipo di motore passo-passo. La maggior parte dei motori passo-passo sono "passi passo a 1,8 gradi" e quindi hanno 200 passi completi per rotazione (360 diviso 1,8 fa 200). Alcuni motori passo passo sono "passo passo a 0,9 gradi" e quindi hanno 400 passi completi per rotazione. Altri motori passo-passo sono rari. In caso di dubbi, non impostare full_steps_per_rotation nel file di configurazione e utilizzare 200 nella formula sopra.
ko: `<full_steps_per_rotation>` 설정은 스테퍼 모터의 유형에 따라 결정됩니다. 대부분의 스테퍼 모터는 "1.8도 스테퍼"이므로 회전당 200개의 전체 단계가 있습니다 (360을 1.8로 나눈 값은 200). 일부 스테퍼 모터는 "0.9도 스테퍼"이므로 회전당 400개의 전체 단계가 있습니다. 다른 스테퍼 모터는 드뭅니다. 확실하지 않은 경우 구성 파일에서 full_steps_per_rotation을 설정하지 말고 위의 공식에서 200을 사용하십시오.
zh_hant: `<full_steps_per_rotation>` 設定由步進電機的型別決定。大多數步進電機是「1.8 度步進電機」，因此每轉 200 步（360 除以 1.8 等於 200）。一些步進電機是「0.9 度步進電機」，因此每轉有 400 整步。其他步進電機很少見。如果不確定，請不要在配置檔案中設定 full_steps_per_rotation 並在上面的公式中使用 200。

source: The `<microsteps>` setting is determined by the stepper motor driver. Most drivers use 16 microsteps. If unsure, set `microsteps: 16` in the config and use 16 in the formula above.
hu: A `<mikrolépések>` beállítást a léptetőmotor-meghajtó határozza meg. A legtöbb meghajtó 16 mikrolépést használ. Ha bizonytalan, állítsa be a `microsteps: 16` a konfigurációban, és használja a 16-ot a fenti képletben.
it: L'impostazione `<microsteps>` è determinata dal driver del motore passo-passo. La maggior parte dei driver utilizza 16 micropassi. Se non sei sicuro, imposta `microsteps: 16` nella configurazione e usa 16 nella formula sopra.
ko: `<microsteps>` 설정은 스테퍼 모터 드라이버에 의해 결정됩니다. 대부분의 드라이버는 16개의 마이크로스텝을 사용합니다. 확실하지 않은 경우 구성에서 'microsteps: 16'을 설정하고 위 공식에서 16을 사용합니다.
zh_hant: `<microsteps>`設定由取決於步進電機驅動型號。大多數驅動使用 16 個微步。如果不確定，請在配置中設定 `microsteps: 16`，並在上面的公式中使用 16。

source: Calibrating rotation_distance on extruders
hu: A rotation_distance kalibrálása extrudereken
it: Calibrazione rotation_distance sugli estrusori
ko: 압출기에서 rotation_distance 보정
zh_hant: 校準擠出機的 rotation_distance

source: On an extruder, the `rotation_distance` is the amount of distance the filament travels for one full rotation of the stepper motor. The best way to get an accurate value for this setting is to use a "measure and trim" procedure.
hu: Egy extruder esetében a `rotation_distance` az a távolság, amelyet a nyomtatószál léptetőmotor egy teljes fordulatán megtesz. Ennek a beállításnak a pontos értékét a "mérés és igazítás" eljárással lehet a legjobban meghatározni.
it: Su un estrusore, la `rotation_distance` è la distanza percorsa dal filamento per una rotazione completa del motore passo-passo. Il modo migliore per ottenere un valore accurato per questa impostazione è utilizzare una procedura di "misura e ritaglio".
ko: 압출기에서 `rotation_distance` 는 스테퍼 모터가 1회전하는 동안 필라멘트가 이동하는 거리입니다. 이 설정에 대한 정확한 값을 얻는 가장 좋은 방법은 "측정 및 다듬기" 절차를 사용하는 것입니다.
zh_hant: 在擠出機上，`rotation_distance`是指步進電機旋轉一圈後，耗材所走的距離。獲得這一設定準確值的最好方法是使用"測量並修正"的方法。

source: First start with an initial guess for the rotation distance. This may be obtained from [steps_per_mm](#obtaining-rotation_distance-from-steps_per_mm-or-step_distance) or by [inspecting the hardware](#extruder).
hu: Először is kezdjük a forgási távolság kezdeti becslésével. Ezt a [steps_per_mm](#obtaining-rotation_distance-from-steps_per_mm-or-step_distance) vagy [a hardver vizsgálata](#extruder) segítségével kaphatjuk meg.
it: Innanzitutto inizia con un'ipotesi iniziale per la distanza di rotazione. Questo può essere ottenuto da [steps_per_mm](#obtaining-rotation_distance-from-steps_per_mm-or-step_distance) o [ispezionando l'hardware](#extruder).
ko: 먼저 회전 거리에 대한 초기 추측으로 시작합니다. 이것은 [steps_per_mm](#obtaining-rotation_distance-from-steps_per_mm-or-step_distance) 또는 [하드웨어 검사](#extruder)에서 얻을 수 있습니다.
zh_hant: 從一個初始的旋轉距離猜測值開始。可以通過[steps_per_mm](#obtaining-rotation_distance-from-steps_per_mm-or-step_distance)或者通過[檢查硬體](#extruder)來。

source: Then use the following procedure to "measure and trim":
hu: Ezután a következő eljárást alkalmazza a "mérés és igazítás" elvégzéséhez:
it: Quindi utilizzare la seguente procedura per "misurare e tagliare":
ko: 다음 절차를 사용하여 "측정 및 다듬기"를 수행합니다:
zh_hant: 然後根據以下程式執行"測量和修正"：

source: Make sure the extruder has filament in it, the hotend is heated to an appropriate temperature, and the printer is ready to extrude.
hu: Győződjön meg arról, hogy az extruderben van-e nyomtatószál, a hotend megfelelő hőmérsékletre van-e melegítve, és a nyomtató készen áll-e az extrudálásra.
it: Assicurati che l'estrusore contenga del filamento, che l'hotend sia riscaldato a una temperatura appropriata e che la stampante sia pronta per l'estrusione.
ko: 압출기에 필라멘트가 있고 핫엔드가 적절한 온도로 가열되고 프린터가 압출할 준비가 되었는지 확인합니다.
zh_hant: 首先確保擠出機里有耗材，熱端被加熱到適當的溫度，並且印表機準備好擠出。

source: Use a marker to place a mark on the filament around 70mm from the intake of the extruder body. Then use a digital calipers to measure the actual distance of that mark as precisely as one can. Note this as `<initial_mark_distance>`.
hu: Jelölje meg a nyomtatószálat egy jelölővel az extrudertest szívónyílásától kb. 70 mm-re. Ezután egy digitális tolómérővel mérje meg a lehető legpontosabban ennek a jelölésnek a tényleges távolságát. Ezt jegyezze fel `<initial_mark_distance>`.
it: Utilizzare un pennarello per posizionare un segno sul filamento a circa 70 mm dall'ingresso del corpo dell'estrusore. Quindi usa un calibro digitale per misurare la distanza effettiva di quel segno nel modo più preciso possibile. Nota questo come `<initial_mark_distance>`.
ko: Extruder 본체의 흡입구에서 약 70mm 지점에 필라멘트에 마커를 사용하여 표시를 합니다. 그런 다음 디지털 캘리퍼스를 사용하여 해당 표시의 실제 거리를 가능한 한 정확하게 측정합니다. 이것을 `<initial_mark_distance>`로 기록하십시오.
zh_hant: 用記號筆在離擠出機入口約70毫米的位置上對耗材做一個標記。然後用數字卡尺儘可能精確地測量該標記的實際距離。將此記為`<initial_mark_distance> `。

source: Use the digital calipers to measure the new distance between the extruder body and the mark on the filament. Note this as `<subsequent_mark_distance>`. Then calculate: `actual_extrude_distance = <initial_mark_distance> - <subsequent_mark_distance>`
hu: A digitális tolómérővel mérje meg az extruder teste és a szálon lévő jelölés közötti új távolságot. Ezt jegyezze fel `<subsequent_mark_distance>`. Ezután számítsa ki: `actual_extrude_distance = <initial_mark_distance> - <subsequent_mark_distance>`
it: Utilizzare un calibro digitale per misurare la nuova distanza tra il corpo dell'estrusore e il segno sul filamento. Annota questa come `<subsequent_mark_distance>`. Quindi calcola: `actual_extrude_distance = <initial_mark_distance> - <subsequent_mark_distance>`
ko: 디지털 캘리퍼스를 사용하여 압출기 본체와 필라멘트 표시 사이의 새로운 거리를 측정합니다. 이것을 `<subsequent_mark_distance>`로 기록하십시오. 그런 다음 다음을 계산합니다: `actual_extrude_distance = <initial_mark_distance> - <subsequent_mark_distance>`
zh_hant: 使用數顯示卡尺測量擠出機主體與耗材上的標記之間的新距離。請注意該距離是 `<subsequent_mark_distance>`。然後計算：`actual_extrude_distance = <initial_mark_distance> - <subsequent_mark_distance>`

source: Calculate rotation_distance as: `rotation_distance = <previous_rotation_distance> * <actual_extrude_distance> / <requested_extrude_distance>` Round the new rotation_distance to three decimal places.
hu: A rotation_distance kiszámítása: `rotation_distance = <previous_rotation_distance> * <actual_extrude_distance> / <requested_extrude_distance>` Az új rotation_distance-t három tizedesjegyre kerekítjük.
it: Calcola rotation_distance come: `rotation_distance = <rotation_distance_precedente> * <actual_extrude_distance> / <requested_extrude_distance>` Arrotonda la nuova rotation_distance a tre cifre decimali.
ko: 다음과 같이 rotation_distance를 계산합니다: `rotation_distance = <previous_rotation_distance> * <actual_extrude_distance> / <requested_extrude_distance>` 새 rotation_distance를 소수점 이하 세 자리로 반올림합니다.
zh_hant: 計算running_distance為：`rotation_distance = <previous_rotation_distance> * <actual_extrude_distance> / <request_extrude_distance>`。將新的 rotation_distance 取整到小數點後3位。

source: If the actual_extrude_distance differs from requested_extrude_distance by more than about 2mm then it is a good idea to perform the steps above a second time.
hu: Ha az actual_extrude_distance több mint 2 mm-rel eltér a requested_extrude_distance-tól, akkor érdemes a fenti lépéseket másodszor is elvégezni.
it: Se la distanza_di_estrusione effettiva differisce dalla distanza_di_estrusione richiesta di oltre 2 mm circa, è una buona idea eseguire i passaggi precedenti una seconda volta.
ko: real_extrude_distance가 requests_extrude_distance와 약 2mm 이상 차이가 나는 경우 위의 단계를 두 번째로 수행하는 것이 좋습니다.
zh_hant: 如果實際擠出的距離與請求擠出的距離相差超過2毫米，那麼最好再執行一次上述步驟。

source: Note: Do *not* use a "measure and trim" type of method to calibrate x, y, or z type axes. The "measure and trim" method is not accurate enough for those axes and will likely lead to a worse configuration. Instead, if needed, those axes can be determined by [measuring the belts, pulleys, and lead screw hardware](#obtaining-rotation_distance-by-inspecting-the-hardware).
hu: Megjegyzés: Ne használjon *nem* "mérés és trimmelés" típusú módszert az x, y vagy z típusú tengelyek kalibrálására. A "measure and trim" módszer nem elég pontos ezekhez a tengelyekhez, és valószínűleg rosszabb konfigurációhoz vezet. Ehelyett, ha szükséges, ezeket a tengelyeket [a szíjak, a szíjtárcsák és az ólomcsavarok hardverének mérésével](#obtaining-rotation_distance-by-inspecting-the-hardware) lehet meghatározni.
it: Nota: *non* utilizzare un metodo di tipo "misura e ritaglia" per calibrare gli assi di tipo x, y o z. Il metodo "misura e taglia" non è sufficientemente accurato per quegli assi e probabilmente porterà a una configurazione peggiore. Invece, se necessario, quegli assi possono essere determinati [measuring the belts, pulleys, and lead screw hardware](#obtaining-rotation_distance-by-inspecting-the-hardware).
ko: 참고: x, y 또는 z 유형 축을 보정하기 위해 "측정 및 자르기" 유형의 방법을 *사용하지 마십시오*. "측정 및 다듬기" 방법은 해당 축에 대해 충분히 정확하지 않으며 구성이 더 나빠질 수 있습니다. 대신 필요한 경우 [벨트, 풀리 및 리드 스크류 하드웨어 측정](#obtaining-rotation_distance-by-inspecting-the-hardware) 을 통해 해당 축을 결정할 수 있습니다.
zh_hant: 注意：*不要*使用"測量並修正"類的方法來校準x、y或z型別的軸。對於這些軸來說，"測量和修剪"方法不夠精確，而且可能會導致更糟糕的配置。相反，如果需要，這些軸可以通過[j檢查皮帶、滑輪和絲桿](#obtaining-rotation_distance-by-inspecting-the-hardware)來確定。

source: Obtaining rotation_distance by inspecting the hardware
hu: A rotation_distance meghatározása a hardver vizsgálatával
it: Ottenere la rotation_distance ispezionando l'hardware
ko: 하드웨어 검사를 통해 rotation_distance 얻기
zh_hant: 通過檢查硬體獲得旋轉距離

source: It's possible to calculate rotation_distance with knowledge of the stepper motors and printer kinematics. This may be useful if the steps_per_mm is not known or if designing a new printer.
hu: Lehetséges a rotation_distance kiszámítása a léptetőmotorok és a nyomtató kinematikájának ismeretében. Ez hasznos lehet, ha a steps_per_mm nem ismert, vagy ha új nyomtatót tervezünk.
it: E' possibile calcolare rotation_distance conoscendo i motori passo-passo e la cinematica della stampante. Questo può essere utile se i passi_per_mm non sono noti o se si sta progettando una nuova stampante.
ko: 스테퍼 모터 및 프린터 운동학에 대한 지식으로 rotation_distance를 계산할 수 있습니다. 이것은 steps_per_mm를 알 수 없거나 새 프린터를 설계하는 경우에 유용할 수 있습니다.
zh_hant: 有了步進電機和印表機運動學方面的資訊，就可以計算旋轉距離。如果不知道每毫米的步數，或者正在設計一臺新的印表機，這可能有幫助。

source: Belt driven axes
hu: Szíjhajtású tengelyek
it: Assi con trasmissione a cinghia
ko: 벨트 구동 축
zh_hant: 皮帶驅動的軸

source: It is easy to calculate rotation_distance for a linear axis that uses a belt and pulley.
hu: Egyszerű kiszámítani a rotation_distance-t egy szíjat és csigát használó lineáris tengely esetében.
it: È facile calcolare rotation_distance per un asse lineare che utilizza una cinghia e una puleggia.
ko: 벨트와 풀리를 사용하는 선형 축에 대한 회전 거리를 쉽게 계산할 수 있습니다.
zh_hant: 計算使用皮帶和滑輪的直線軸的旋轉距離很簡單。

source: First determine the type of belt. Most printers use a 2mm belt pitch (that is, each tooth on the belt is 2mm apart). Then count the number of teeth on the stepper motor pulley. The rotation_distance is then calculated as:
hu: Először határozza meg a szíj típusát. A legtöbb nyomtató 2 mm-es fogosztást használ (azaz a szalag minden egyes foga 2 mm távolságra van egymástól). Ezután számolja meg a léptetőmotor szíjtárcsájának fogainak számát. A rotation_distance ezután a következőképpen számítható ki:
it: Per prima cosa determinare il tipo di cinghia. La maggior parte delle stampanti utilizza un passo della cinghia di 2 mm (ovvero, ogni dente sulla cinghia è a 2 mm di distanza). Quindi contare il numero di denti sulla puleggia del motore passo-passo. La distanza_rotazione viene quindi calcolata come:
ko: 먼저 벨트 유형을 결정하십시오. 대부분의 프린터는 2mm 벨트 피치를 사용합니다(즉, 벨트의 각 톱니가 2mm 떨어져 있음). 그런 다음 스테퍼 모터 풀리의 톱니 수를 세십시오. 그러면 rotation_distance가 다음과 같이 계산됩니다:
zh_hant: 首先確定皮帶的型別。大多數印表機使用2毫米的皮帶間距（也就是說，皮帶上的每個齒相距2毫米）。然後計算步進電機滑輪上的齒數。然後計算出rotation_distance （旋轉距離）為：

source: For example, if a printer has a 2mm belt and uses a pulley with 20 teeth, then the rotation distance is 40.
hu: Ha például egy nyomtató 2 mm-es fogosztású szíjjal rendelkezik, és 20 fogú tárcsát használ, akkor a forgási távolság 40.
it: Ad esempio, se una stampante ha una cinghia da 2 mm e utilizza una puleggia con 20 denti, la distanza di rotazione è 40.
ko: 예를 들어 프린터에 2mm 벨트가 있고 톱니가 20개인 풀리를 사용하는 경우 회전 거리는 40입니다.
zh_hant: 例如，如果一臺印表機有一條2毫米間距的皮帶並使用一個20齒的皮帶輪，那麼旋轉距離為40。

source: Axes with a lead screw
hu: Tengelyek trapézmenetes orsóval
it: Assi con vite di comando
ko: 리드 스크류가 있는 축
zh_hant: 使用絲桿的軸

source: It is easy to calculate the rotation_distance for common lead screws using the following formula:
hu: A rotation_distance a szokásos csavarok esetében könnyen kiszámítható a következő képlet segítségével:
it: È facile calcolare la rotation_distance per le comuni viti di trasmissione utilizzando la seguente formula:
ko: 다음 공식을 사용하여 일반 리드 나사의 회전 거리를 쉽게 계산할 수 있습니다:
zh_hant: 使用以下公式可以簡單的計算出常見的旋轉距離：

source: For example, the common "T8 leadscrew" has a rotation distance of 8 (it has a pitch of 2mm and has 4 separate threads).
hu: Például a szokásos "T8-as trapézmenetes orsó" forgási távolsága 8 (2 mm-es lépésközzel és 4 különálló menettel rendelkezik).
it: Ad esempio, la comune "madrevite T8" ha una rotation distance di 8 (ha un passo di 2 mm e ha 4 filetti separati).
ko: 예를 들어, 일반적인 "T8 리드스크류"는 회전 거리가 8입니다 (피치 2mm이고 별도의 나사산 4개 있음).
zh_hant: 例如，常見的"T8絲桿"的旋轉距離為8（它的間距為2mm，有4個獨立的螺紋）。

source: Older printers with "threaded rods" have only one "thread" on the lead screw and thus the rotation distance is the pitch of the screw. (The screw pitch is the distance between each groove on the screw.) So, for example, an M6 metric rod has a rotation distance of 1 and an M8 rod has a rotation distance of 1.25.
hu: A "menetes szárakkal" ellátott régebbi nyomtatóknak csak egy "menet" van a menetes száron, és így a forgási távolság a csavar lépésszöge. (A csavar lépésköze a csavaron lévő egyes hornyok közötti távolság.) Így például egy M6-os metrikus menetes szár forgási távolsága 1, és egy M8-as menetes száré pedig 1,25mm-es.
it: Le stampanti più vecchie con "barre filettate" hanno un solo "filo" sulla vite di comando e quindi la rotation distance è il passo della vite. (Il passo della vite è la distanza tra ciascuna scanalatura sulla vite.) Quindi, ad esempio, un'asta metrica M6 ha una rotation distance di 1 e un'asta M8 ha una rotation distance di 1,25.
ko: "나사산 막대"가 있는 구형 프린터에는 리드 나사에 하나의 "나사산"만 있으므로 회전 거리는 나사의 피치입니다. (나사 피치는 나사의 각 홈 사이의 거리입니다.) 예를 들어, M6 미터법 막대의 회전 거리가 1이고 M8 막대의 회전 거리가 1.25입니다.
zh_hant: 老式印表機的"螺紋桿"在導螺桿上只有一個"螺紋"，因此旋轉距離是螺桿的間距。(例如，M6公制桿的旋轉距離為1，M8桿的旋轉距離為1.25。

source: Extruder
it: Estrusore
ko: 압출기
zh_hant: 擠出機

source: It's possible to obtain an initial rotation distance for extruders by measuring the diameter of the "hobbed bolt" that pushes the filament and using the following formula: `rotation_distance = <diameter> * 3.14`
hu: Az extruderek kezdeti forgási távolságát úgy lehet meghatározni, hogy megmérjük a "szálmozgató kerék" átmérőjét, amely a szálakat tolja, és a következő képletet használjuk: `rotation_distance = <diameter> * 3.14`
it: È possibile ottenere una distanza di rotazione iniziale per gli estrusori misurando il diametro del "bullone dentato" che spinge il filamento e utilizzando la seguente formula: `rotation_distance = <diametro> * 3.14`
ko: 필라멘트를 밀어내는 "호브 볼트"의 직경을 측정하고 다음 공식을 사용하여 압출기의 초기 회전 거리를 얻을 수 있습니다: `rotation_distance = <직경> * 3.14`
zh_hant: 通過測量推動印絲的「滾齒螺栓」的直徑並使用以下公式，可以獲得擠出機的初始旋轉距離：「rotation_distance = <diameter> * 3.14」

source: If the extruder uses gears then it will also be necessary to [determine and set the gear_ratio](#using-a-gear_ratio) for the extruder.
hu: Ha az extruder fogaskerekeket használ, akkor [meg kell határozni és be kell állítani a gear_ratio-t](#using-a-gear_ratio) értéket az extruderhez.
it: Se l'estrusore utilizza ingranaggi, sarà anche necessario [determinare e impostare gear_ratio](#using-a-gear_ratio) per l'estrusore.
ko: 압출기가 기어를 사용하는 경우 압출기에 대한 [기어 비율을 결정하고 설정](#using-a-gear_ratio)도 필요합니다.
zh_hant: 如果擠出機使用齒輪，則還需要[確定和設定擠出機的齒輪比](#using-a-gear_ratio)。

source: The actual rotation distance on an extruder will vary from printer to printer, because the grip of the "hobbed bolt" that engages the filament can vary. It can even vary between filament spools. After obtaining an initial rotation_distance, use the [measure and trim procedure](#calibrating-rotation_distance-on-extruders) to obtain a more accurate setting.
hu: Az extruder tényleges forgási távolsága nyomtatóról nyomtatóra változik, mivel a "szálmozgató kerék" fogása, amely a szálakkal érintkezik, változhat. Ez még az egyes száltekercsek között is változhat. A kezdeti rotation_distance meghatározása után használja a [mérés és trimmelés eljárás](#calibrating-rotation_distance-on-extruders) műveletet a pontosabb beállításhoz.
it: La rotation distance effettiva su un estrusore varierà da stampante a stampante, perché la presa del "bullone dentato" che impegna il filamento può variare. Può anche variare tra le bobine di filamento. Dopo aver ottenuto una rotation distance iniziale, utilizzare la [procedura di misurazione e ritaglio](#calibrazione-distanza_rotazione-su-estrusori) per ottenere un'impostazione più accurata.
ko: 필라멘트와 맞물리는 "호브 볼트"의 그립이 다를 수 있기 때문에 압출기의 실제 회전 거리는 프린터마다 다릅니다. 필라멘트 스풀 간에도 다를 수 있습니다. 초기 회전 거리를 구한 후 [측정 및 다듬기 절차](#calibrating-rotation_distance-on-extruders)를 사용하여 보다 정확한 설정을 얻으십시오.
zh_hant: 擠出機上的實際旋轉距離因印表機而異，因為咬合印絲的「滾齒螺栓」的抓地力可能會有所不同。它甚至可以在印絲線軸之間變化。獲得初始rotation_distance後，使用[測量和修剪程式](#calibrating-rotation_distance-on-extruders) 以獲得更準確的設置。

source: Using a gear_ratio
hu: Gear_ratio használata
it: Usando un gear_ratio
ko: gear_ratio 사용
zh_hant: 使用 gear_ratio（齒輪比）

source: Setting a `gear_ratio` can make it easier to configure the `rotation_distance` on steppers that have a gear box (or similar) attached to it. Most steppers do not have a gear box - if unsure then do not set `gear_ratio` in the config.
hu: A `gear_ratio` beállítása megkönnyítheti a `rotation_distance` konfigurálását olyan léptetőknél, amelyekhez áttétel (vagy hasonló) van csatlakoztatva. A legtöbb léptető nem rendelkezik áttétellel. Ha nem biztos benne, akkor ne állítsa be a `gear_ratio` értéket a konfigurációban.
it: L'impostazione di un `gear_ratio` può semplificare la configurazione di `rotation_distance` su stepper a cui è collegato un gear box (o simile). La maggior parte degli stepper non ha un gear box - se non sei sicuro, non impostare `gear_ratio` nella configurazione.
ko: `gear_ratio` 를 설정하면 기어 박스(또는 이와 유사한 것)가 연결된 스테퍼에서 `rotation_distance` 를 더 쉽게 구성할 수 있습니다. 대부분의 스테퍼에는 기어 박스가 없습니다. 확실하지 않은 경우 구성에서 'gear_ratio'를 설정하지 마십시오.
zh_hant: 設定`gear_ratio`可以簡化`rotation_distance`在有齒輪箱（或類似）連線的步進電機的配置。大多數步進電機沒有齒輪箱--如果不確定，就不要在配置中設定`gear_ratio`。
