Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Rotation_Distance.po
Languages: hu, it, ko, zh_hant

source: When `gear_ratio` is set, the `rotation_distance` represents the distance the axis moves with one full rotation of the final gear on the gear box. If, for example, one is using a gearbox with a "5:1" ratio, then one could calculate the rotation_distance with [knowledge of the hardware](#obtaining-rotation_distance-by-inspecting-the-hardware) and then add `gear_ratio: 5:1` to the config.
hu: Ha `gear_ratio` be van állítva, a `rotation_distance` azt a távolságot jelöli, amelyet a tengely az áttételen lévő utolsó fogaskerék egy teljes elfordulásával megtesz. Ha például egy "5:1"-es áttételt használunk, akkor kiszámíthatjuk a rotation_distance-ot [a hardver ismeretében](#obtaining-rotation_distance-by-inspecting-the-hardware), majd hozzáadhatjuk a `gear_ratio: 5:1` értéket a konfigurációs fájlhoz.
it: Quando `gear_ratio` è impostato, `rotation_distance` rappresenta la distanza percorsa dall'asse con una rotazione completa dell'ingranaggio finale sulla scatola ingranaggi. Se, ad esempio, si utilizza un riduttore con un rapporto "5:1", è possibile calcolare la distanza_rotazione con [conoscenza dell'hardware](#obtaining-rotation_distance-by-inspecting-the-hardware) e quindi aggiungere ` gear_ratio: 5:1` alla configurazione.
ko: `gear_ratio` 가 설정되면 ` rotation_distance` 는 기어 박스의 최종 기어가 한 바퀴 완전히 회전할 때 축이 이동하는 거리를 나타냅니다. 예를 들어 "5:1" 비율의 기어박스를 사용하는 경우 [하드웨어 지식](#obtaining-rotation_distance-by-inspecting-the-hardware)으로 회전 거리를 계산한 다음 ` gear_ratio: 5:1`을 구성에 적용합니다.
zh_hant: 當`gear_ratio`被設定時，`rotation_distance`代表軸在齒輪箱上的最後一個齒輪旋轉一圈時的移動距離。例如，如果一個人正在使用一個具有"5:1"比率的齒輪箱，那麼他可以用[對硬體的瞭解](#obtaining-rotation_distance-by-inspecting-the-hardware)來計算旋轉距離，然後將`gear_ratio: 5:1`加入配置中。

source: For gearing implemented with belts and pulleys, it is possible to determine the gear_ratio by counting the teeth on the pulleys. For example, if a stepper with a 16 toothed pulley drives the next pulley with 80 teeth then one would use `gear_ratio: 80:16`. Indeed, one could open a common off the shelf "gear box" and count the teeth in it to confirm its gear ratio.
hu: A szíjakkal és szíjtárcsákkal megvalósított hajtóművek esetében a fogaskerekek fogainak megszámlálásával lehet meghatározni a gear_ratio-t. Ha például egy 16 fogazású szíjtárcsával rendelkező léptető meghajtja a, 80 fogazású szíjtárcsát, akkor a `gear_ratio: 80:16` értéket használjuk. Valóban, ki lehetne nyitni egy közönséges, "fogaskerékdobozt" és megszámolni a benne lévő fogakat, hogy megerősítsük a fogaskerék áttételét.
it: Per gli ingranaggi realizzati con cinghie e pulegge, è possibile determinare il gear_ratio contando i denti sulle pulegge. Ad esempio, se uno stepper con una puleggia a 16 denti guida la puleggia successiva con 80 denti, si utilizzerà `gear_ratio: 80:16`. In effetti, si potrebbe aprire una comune "scatola del cambio" pronta all'uso e contare i denti al suo interno per confermare il suo rapporto di trasmissione.
ko: 벨트와 풀리로 구현된 기어링의 경우 풀리의 톱니를 계산하여 gear_ratio 를 결정할 수 있습니다. 예를 들어 16개의 톱니가 있는 도르래가 있는 스테퍼가 80개의 톱니가 있는 다음 풀리를 구동하는 경우 `기어 비율: 80:16` 을 사용합니다. 실제로, 선반 "기어 박스" 에서 공통 기성품을 열고 기어비를 확인하기 위해 그 안에 있는 톱니 수를 세어 볼 수 있습니다.
zh_hant: 對於使用皮帶和皮帶輪實現的傳動裝置，可以通過計算皮帶輪上的齒來確定gear_ratio。例如，如果帶有16齒滑輪的步進器驅動下一個具有80齒的滑輪，那麼將使用"gear_ratio：80：16"。事實上，人們可以打開一個普通的現成「齒輪箱」，並計算其中的齒數以確認其齒輪比。

source: Note that sometimes a gearbox will have a slightly different gear ratio than what it is advertised as. The common BMG extruder motor gears are an example of this - they are advertised as "3:1" but actually use "50:17" gearing. (Using teeth numbers without a common denominator may improve overall gear wear as the teeth don't always mesh the same way with each revolution.) The common "5.18:1 planetary gearbox", is more accurately configured with `gear_ratio: 57:11`.
hu: Vegye figyelembe, hogy néha egy áttétel kissé eltér a hirdetett értéktől. A BMG extrudermotorok közös fogaskerekei példát mutatnak erre. A reklámok szerint "3:1", de valójában "50:17" áttételt használnak. (A közös nevező nélküli fogszámok használata javíthatja a fogaskerekek általános kopását, mivel a fogak nem mindig ugyanúgy fognak össze minden egyes fordulatnál.) A gyakori "5,18:1 bolygóműves sebességváltó", pontosabban a `gear_ratio: 57:11` értékkel van konfigurálva.
it: Si noti che a volte un gear-box avrà un rapporto di trasmissione leggermente diverso da quello in cui è pubblicizzato. I comuni ingranaggi del motore dell'estrusore BMG ne sono un esempio: sono pubblicizzati come "3:1" ma in realtà utilizzano ingranaggi "50:17". (L'uso di numeri di denti senza un denominatore comune può migliorare l'usura complessiva degli ingranaggi poiché i denti non sempre ingranano allo stesso modo ad ogni giro.) Il comune "riduttore epicicloidale 5.18:1" è configurato in modo più accurato con `gear_ratio: 57:11 `.
ko: 때때로 기어박스는 광고된 것과 약간 다른 기어비를 가질 수 있습니다. 일반적인 BMG 압출기 모터 기어가 이에 대한 예입니다. "3:1"로 광고되지만 실제로는 "50:17" 기어링을 사용합니다. (공통 분모 없이 톱니 수를 사용하면 톱니가 회전할 때마다 항상 같은 방식으로 맞물리는 것이 아니므로 전체 기어 마모를 개선할 수 있습니다.) 공통 "5.18:1 유성 기어박스"는 `gear_ratio: 57:11 `로 더 정확하게 구성됩니다.
zh_hant: 請注意，有時變速箱的齒輪比與宣傳的齒輪比略有不同。常見的BMG擠出機電機齒輪就是一個例子 - 它們被宣傳為"3：1"，但實際上使用"50：17"傳動裝置。（使用沒有公分母的齒數可以改善整體齒輪磨損，因為齒在每次旋轉時並不總是以相同的方式啮合。常見的"5.18：1行星齒輪箱"，更準確地配置了"gear_ratio：57：11"。

source: If several gears are used on an axis then it is possible to provide a comma separated list to gear_ratio. For example, a "5:1" gear box driving a 16 toothed to 80 toothed pulley could use `gear_ratio: 5:1, 80:16`.
hu: Ha egy tengelyen több fogaskerék van használatban, akkor a gear_ratio-nak egy vesszővel elválasztott listát lehet megadni. Például egy "5:1" fogaskerék, amely egy 16 fogazású és egy 80 fogazású tárcsát hajt, használhatja a `gear_ratio: 5:1, 80:16` értékeket.
it: Se su un asse vengono utilizzati più ingranaggi, è possibile fornire un elenco separato da virgole nel gear_ratio. Ad esempio, un cambio "5:1" che guida una puleggia da 16 a 80 denti potrebbe utilizzare `gear_ratio: 5:1, 80:16`.
ko: 대부분의 경우 gear_ratio는 일반 기어와 풀리에 정수의 톱니가 있으므로 정수로 정의해야 합니다. 그러나 벨트가 톱니 대신 마찰을 사용하여 풀리를 구동하는 경우 기어비에 부동 소수점 숫자를 사용하는 것이 합리적일 수 있습니다 (예: `gear_ratio: 107.237:16`).
zh_hant: 如果一個軸上使用了多個齒輪，那麼在 gear_ratio 中填寫一個逗號分隔的列表。例如，一個"5:1"齒輪箱驅動一個16齒的皮帶輪到80齒的皮帶輪，可以使用`gear_ratio: 5:1, 80:16`。

source: In most cases, gear_ratio should be defined with whole numbers as common gears and pulleys have a whole number of teeth on them. However, in cases where a belt drives a pulley using friction instead of teeth, it may make sense to use a floating point number in the gear ratio (eg, `gear_ratio: 107.237:16`).
hu: A legtöbb esetben a gear_ratio értékét egész számokkal kell megadni, mivel a fogaskerekek és a szíjtárcsák fogainak száma általában egész. Azokban az esetekben azonban, amikor a szíj fogak helyett súrlódással hajtja a szíjtárcsát, érdemes lehet lebegőpontos számot használni a fogaskerék-áttételben (pl. `gear_ratio: 107,237:16`).
it: Nella maggior parte dei casi, gear_ratio dovrebbe essere definito con numeri interi poiché ingranaggi e pulegge comuni hanno un numero intero di denti su di essi. Tuttavia, nei casi in cui una cinghia aziona una puleggia usando l'attrito invece dei denti, può avere senso utilizzare un numero in virgola mobile nel rapporto di trasmissione (ad esempio, `gear_ratio: 107.237:16`).
ko: 대부분의 경우 gear_ratio는 일반 기어와 풀리에 정수의 톱니가 있으므로 정수로 정의해야 합니다. 그러나 벨트가 톱니 대신 마찰을 사용하여 풀리를 구동하는 경우 기어비에 부동 소수점 숫자를 사용하는 것이 합리적일 수 있습니다(예: `gear_ratio: 107.237:16`).
zh_hant: 在大多數情況下，gear_ratio 應該用整數來定義，因為普通的齒輪和皮帶輪上只有整數的齒。然而，在皮帶利用摩擦力而不是齒來驅動皮帶輪的情況下，在齒輪比中使用一個浮點數可能是有意義的（例如，`gear_ratio: 107.237:16`）。

source: rotation_distance = <full_steps_per_rotation> * <microsteps> / <steps_per_mm>
it: rotation_distance = <passi_completi_per_rotazione> * <micropassi> / <passi_per_mm>

source: rotation_distance = <full_steps_per_rotation> * <microsteps> * <step_distance>
it: rotation_distance = <passi_completi_per_rotazione> * <micropassi> * <distanza_passo>

source: rotation_distance = <belt_pitch> * <number_of_teeth_on_pulley>
it: rotation_distance = <passo_cinghia> * <numero_di_denti_sulla_puleggia>

source: rotation_distance = <screw_pitch> * <number_of_separate_threads>
it: rotation_distance = <passo_vite> * <numero_di_filetti_separati>

source: Extrude 50mm of filament with the following command sequence: `G91` followed by `G1 E50 F60`. Note 50mm as `<requested_extrude_distance>`. Wait for the extruder to finish the move (it will take about 50 seconds). It is important to use the slow extrusion rate for this test as a faster rate can cause high pressure in the extruder which will skew the results. (Do not use the "extrude button" on graphical front-ends for this test as they extrude at a fast rate.)
hu: Extrudáljon 50 mm nyomtatószálat a következő parancsokkal: `G91`, majd `G1 E50 F60`. Az 50 mm-t jegyezze meg `<requested_extrude_distance>`. Várja meg, amíg az extruder befejezi a mozgást (ez körülbelül 50 másodpercig tart). Fontos, hogy lassú extrudálási sebességet használjon ehhez a teszthez, mivel a gyorsabb sebesség magas nyomást okozhat az extruderben, ami torzítja az eredményeket. (Ne használja az "extrude gombot" a grafikus előlapon ehhez a teszthez, mivel azok gyors ütemben extrudálnak.)
it: Estrudere 50 mm di filamento con la seguente sequenza di comandi: `G91` seguito da `G1 E50 F60`. Nota 50 mm come `<distanza_estrusione_richiesta>`. Attendi che l'estrusore finisca il movimento (ci vorranno circa 50 secondi). È importante utilizzare la velocità di estrusione lenta per questo test poiché una velocità più elevata può causare una pressione elevata nell'estrusore che distorce i risultati. (Non utilizzare il "pulsante estrudi" sui front-end grafici per questo test poiché si estrudono a una velocità elevata.)
zh_hant: 用以下命令序列擠出50mm長絲：「G91」，後跟「G1 E50 F60」。。注50mm為<requested_extrude_distance>』。等待擠出機完成移動（大約需要50秒）。在此測試中使用緩慢的擠出速率非常重要，因為較快的速率會導致擠出機中的高壓，從而扭曲結果。（請勿在圖形前端使用"拉伸按鈕"進行此測試，因為它們以快速的速度拉伸。

source: Almost all printers should have a whole number for `rotation_distance` on X, Y, and Z type axes. If the above formula results in a rotation_distance that is within .01 of a whole number then round the final value to that whole_number.
hu: Szinte minden nyomtatónak egész számot kell megadnia a `rotation_distance` X, Y és Z típusú tengelyeknél. Ha a fenti képlet olyan rotation_distance-ot eredményez, amely 0,01 egész számon belül van, akkor kerekítse a végső értéket erre az egész számra.
it: Quasi tutte le stampanti dovrebbero avere un numero intero per `rotation_distance` sugli assi di tipo X, Y e Z. Se la formula precedente risulta in una distanza_rotazione che è entro .01 da un numero intero, arrotonda il valore finale a quel numero_intero.
zh_hant: 幾乎所有印表機都應該在 X、Y 和 Z 型軸上具有「rotation_distance」整數。如果上述公式導致rotation_distance在整數的 .01 範圍內，則將最終值捨入為該whole_number。

source: Rotation distance
hu: Forgatási távolság
zh_hant: 旋轉距離

source: Almost all printers should have a whole number for `rotation_distance` on x, y, and z type axes. If the above formula results in a rotation_distance that is within .01 of a whole number then round the final value to that whole_number.
ko: 거의 모든 프린터에는 x, y 및 z 유형 축의 `rotation_distance` 에 대한 정수가 있어야 합니다. 위 수식으로 인해 회전 거리가 정수의 0.01 이내이면 최종 값을 해당 정수로 반올림합니다.

source: Extrude 50mm of filament with the following command sequence: `G91` followed by `G1 E50 F60`. Note 50mm as `<requested_extrude_distance>`. Wait for the extruder to finish the move (it will take about 50 seconds).
ko: 'G91' 다음에 'G1 E50 F60' 명령 순서로 필라멘트 50mm를 압출합니다. 50mm를 `<requested_extrude_distance>`로 기록합니다. 압출기가 이동을 마칠 때까지 기다립니다(약 50초 소요).
