Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/RPi_microcontroller.po
Languages: fr, hu, ko, zh_hans

source: This document describes the process of running Klipper on a RPi and use the same RPi as secondary mcu.
fr: Ce document décrit le processus via lequel il est possible de lancer Klipper sur un Raspberry Pi et d'utiliser le même Raspberry Pi comme mcu secondaire.
hu: Ez a dokumentum leírja a Klipper futtatásának folyamatát egy RPi-n, és ugyanazt az RPi-t használja másodlagos MCU-ként.
ko: 이 문서는 RPi에서 Klipper를 실행하는 프로세스를 설명하며 보조 MCU와 동일한 RPi를 사용합니다.
zh_hans: 这个文档描述了在RPi上运行Klipper的过程，并使用相同的RPi作为辅助MCU。

source: Why use RPi as a secondary MCU?
fr: Pourquoi utiliser un RPi comme microcontrôleur secondaire ?
hu: Miért érdemes az RPi-t másodlagos MCU-ként használni?
ko: 보조 MCU로 RPi 를 사용하는 이유?
zh_hans: 为什么使用RPi作为辅助MCU？

source: Often the MCUs dedicated to controlling 3D printers have a limited and pre-configured number of exposed pins to manage the main printing functions (thermal resistors, extruders, steppers ...). Using the RPi where Klipper is installed as a secondary MCU gives the possibility to directly use the GPIOs and the buses (i2c, spi) of the RPi inside klipper without using Octoprint plugins (if used) or external programs giving the ability to control everything within the print GCODE.
fr: Souvent les microcontrôleurs dédiés au contrôle des imprimantes 3D disposent d'un nombre limité et pré-configuré de broches exposées pour gérer les principales fonctions d'impression (résistances thermiques, extrudeuses, steppers...). L'utilisation du RPi où Klipper est installé en tant que MCU secondaire donne la possibilité d'utiliser directement les GPIO et les bus (i2c, spi) du RPi à l'intérieur de klipper sans utiliser de plugins Octoprint (le cas échéant) ou de programmes externes donnant la possibilité de tout contrôler à l'intérieur l'impression GCODE.
hu: A 3D nyomtatók vezérlésére szolgáló MCU-k gyakran korlátozott és előre konfigurált számú szabad kimenettel rendelkeznek a fő nyomtatási funkciók (hőellenállások, extruderek, léptetők stb.) kezelésére. Az RPi használata, ahol a Klipper másodlagos MCU-ként van telepítve, lehetővé teszi a GPIO-k és az RPi kimeneteinek (I2C, SPI) közvetlen használatát a klipperben anélkül, hogy Octoprint bővítményeket (ha van ilyen) vagy külső programokat használva, amelyek lehetővé teszik, hogy mindent vezéreljen a Klipper-en belül a nyomtatási G-kód.
ko: 주 인쇄 기능들(열저항기, 압출기, 스텝모터 등)의 관리를 위해서 종종 3D프린터를 제어를 담당하는 MCU는 사전 구성된 제한적 핀수를 가지고 있습니다. Klipper가 보조 MCU로 설치된 RPi를 사용하면 Octoprint 플러그인(사용되는 경우) 또는 인쇄 GCODE 내에서 모든 것을 제어할 수 있는 기능을 제공하는 외부 프로그램을 사용하지 않고 Klipper 내부에서 RPi의 GPIO 및 버스(i2c, spi)를 직접 사용할 수 있는 가능성을 제공합니다.
zh_hans: 通常情况下，专门用于控制3D打印机的MCU有有限的、预先配置好的引脚来管理主要的打印功能（热敏电阻、挤出机、步进器...）。使用安装了Klipper的RPi作为辅助MCU，可以直接使用klipper内的GPIO和RPi的总线（i2c，spi），而不需要使用Octoprint插件（如果使用的话）或外部程序，从而能够控制打印GCODE内的一切。

source: **Warning**: If your platform is a *Beaglebone* and you have correctly followed the installation steps, the linux mcu is already installed and configured for your system.
fr: **Avertissement** : Si votre plate-forme est un *Beaglebone* et que vous avez correctement suivi les étapes d'installation, le mcu linux est déjà installé et configuré pour votre système.
hu: **Figyelmeztetés**: Ha a platformod egy *Beaglebone*, és helyesen követted a telepítés lépéseit, a Linux MCU már telepítve és konfigurálva van a rendszeredhez.
ko: **경고**: 당신의 플랫폼이 *Beaglebone*이고 설치 단계를 올바르게 따랐다면 linux mcu가 이미 시스템에 설치 및 구성되어 있는 것입니다.
zh_hans: **警告**。如果你的平台是*Beaglebone*，并且你已经正确地按照安装步骤进行了安装，那么linux mcu已经为你的系统安装和配置了。

source: Install the rc script
fr: Installer le script rc
hu: Az rc szkript telepítése
ko: rc 스크립트 설치
zh_hans: 安装 rc 脚本

source: If you want to use the host as a secondary MCU the klipper_mcu process must run before the klippy process.
fr: Si vous souhaitez utiliser l'hôte comme MCU secondaire, le processus klipper_mcu doit s'exécuter avant le processus klippy.
hu: Ha a gazdagépet másodlagos MCU-ként szeretnéd használni, a klipper_mcu folyamatnak a klippy folyamat előtt kell futnia.
ko: 호스트를 보조 MCU로 사용하려면 klipper_mcu 프로세스가 klippy 프로세스보다 먼저 실행되어야 합니다.
zh_hans: 如果你想把主机作为一个辅助MCU，klipper_mcu进程必须在klippy进程之前运行。

source: After installing Klipper, install the script. run:
fr: Après avoir installé Klipper, installez le script. Executez :
hu: A Klipper telepítése után telepítsd a szkriptet. run:
ko: Klipper를 설치한 후 스크립트를 설치합니다. 다음을 실행합니다:
zh_hans: 安装 Klipper 后，运行以下命令来安装脚本：

source: Building the micro-controller code
fr: Construire le code du microcontrôleur
hu: A mikrokontroller kódjának elkészítése
ko: 마이크로 컨트롤러 코드를 빌드하기
zh_hans: 构建微控制器代码

source: To compile the Klipper micro-controller code, start by configuring it for the "Linux process":
fr: Pour compiler le code du micro-contrôleur Klipper, commencez par le configurer pour le "Linux process" :
hu: A Klipper mikrokontroller kódjának lefordításához kezd a "Linux folyamat" konfigurálásával:
ko: Klipper 마이크로 컨트롤러 코드를 컴파일하려면 "리눅스 프로세스"를 위한 그 코드 구성부터 시작합니다:
zh_hans: 要编译的 Klipper 微控制器代码，需要先将编译配置设置为“Linux Process”：

source: In the menu, set "Microcontroller Architecture" to "Linux process," then save and exit.
fr: Dans le menu, définissez "Architecture du microcontrôleur" sur "Processus Linux", puis enregistrez et quittez.
hu: A menüben állítsd be a "Mikrokontroller architektúra" értéket "Linux process,"-re, majd mentsd és lépj ki.
ko: 메뉴에서 "마이크로 컨트롤러 아키텍쳐"를 "리눅스 프로세스"로 설정한 다음 저장하고 종료합니다.
zh_hans: 在菜单中，设置“Microcontroller Archetecture”（微控制器架构）为“Linux Process”（Linux 进程），然后保存(save)并退出(exit)。

source: To build and install the new micro-controller code, run:
fr: Pour compiler et installer le nouveau code du microcontrôleur, exécutez :
hu: Az új mikrokontroller kódjának elkészítéséhez és telepítéséhez futtasd a következőt:
ko: 새로운 마이크로 컨트롤러 코드를 빌드하고 설치하기 위해 다음을 실행시킵니다. :
zh_hans: 要构建和安装新的微控制器代码，请运行：

source: If klippy.log reports a "Permission denied" error when attempting to connect to `/tmp/klipper_host_mcu` then you need to add your user to the tty group. The following command will add the "pi" user to the tty group:
fr: Si klippy.log signale une erreur "Autorisation refusée" lors de la tentative de connexion à `/tmp/klipper_host_mcu`, vous devez ajouter votre utilisateur au groupe tty. La commande suivante ajoutera l'utilisateur "pi" au groupe tty :
hu: Ha a klippy.log a `/tmp/klipper_host_mcu`-hoz való kapcsolódási kísérletnél "Permission denied" hibát jelez, akkor a felhasználót hozzá kell adni a tty csoporthoz. A következő parancs hozzáadja a "pi" felhasználót a tty csoporthoz:
ko: `/tmp/klipper_host_mcu`에 연결을 시도할 때 klippy.log가 "권한 거부됨" 에러를 보고하는 경우 tty 그룹에 당신을 사용자에 추가해야 합니다. 다음 명령은 "pi" 사용자를 tty 그룹에 추가합니다:
zh_hans: 如果klippy.log在试图连接到`/tmp/klipper_host_mcu`时输出 "Permission denied" 错误，那么你需要将你的用户添加到tty用户组。下面的命令将把 "pi "用户添加到tty用户组中：

source: Remaining configuration
fr: Configuration restante
hu: Hátralevő konfiguráció
ko: 나머지 설정
zh_hans: 剩余的配置

source: Complete the installation by configuring Klipper secondary MCU following the instructions in [RaspberryPi sample config](../config/sample-raspberry-pi.cfg) and [Multi MCU sample config](../config/sample-multi-mcu.cfg).
fr: Terminez l'installation en configurant le MCU secondaire de Klipper en suivant les instructions dans [RaspberryPi exemlple de configuration](../config/sample-raspberry-pi.cfg) et [Exemples de configuration Multi MCU](../config/sample-multi-mcu.cfg).
hu: Fejezd be a telepítést a Klipper másodlagos MCU konfigurálásával a [RaspberryPi minta konfiguráció](../config/sample-raspberry-pi.cfg) és a [Multi MCU minta konfiguráció](../config/sample-multi-mcu.cfg) utasításai szerint.
ko: [RaspberryPi 샘플 구성](../config/sample-raspberry-pi.cfg) 및 [멀티 MCU 샘플 구성](../config/sample-multi-mcu.cfg)의 지침에 따라 Klipper 보조 MCU를 구성하여 설치 완료합니다.
zh_hans: 按照[RaspberryPi 参考配置](../config/sample-raspberry-pi.cfg)和[多微控制器参考配置](../config/sample-multi-mcu.cfg)中的说明配置Klipper 二级微控制器来完成安装。

source: Optional: Identify the correct gpiochip
fr: Facultatif : identifiez la bonne puce gpio
hu: Választható: A megfelelő GPIO chip azonosítása
ko: 선택 사항: 올바른 gpiochip 식별
zh_hans: 可选步骤：识别正确的 gpiochip

source: To install the *Linux GPIO character device - binary* on a debian based distro like octopi run:
fr: Pour installer le périphérique de caractères *Linux GPIO - binaire * sur une distribution basée sur Debian comme Octopi, exécutez :
hu: A *Linux GPIO character device - binary* telepítéséhez egy debian alapú disztribúció kell, mint például az octopi. Futtassa:
ko: octopi와 같은 데비안 기반 배포판에 *Linux GPIO 문자 장치 - 바이너리* 를 설치하려면 다음을 실행합니다:
zh_hans: 要在基于 Debian 的发行版（如 OctoPi）上安装 *Linux GPIO character device - binary*，请运行：

source: To check available gpiochip run:
fr: Pour vérifier la puce gpio disponible exécutez :
hu: A rendelkezésre álló GPIO chip ellenőrzéséhez futtasd:
ko: 사용 가능한 gpiochip 확인하려면 다음을 실행합니다:
zh_hans: 要检查可用的gpiochip，请运行：

source: To check the pin number and the pin availability tun:
fr: Pour vérifier la numérotation des broches du connecteur GPIO et leur disponibilité, exécutez :
hu: A tű számának és a tű elérhetőségének ellenőrzésére futtasd:
ko: 핀 번호와 핀 가용성 확인하려면 다음을 실행합니다:
zh_hans: 要检查针脚编号和针脚可用性，请运行：

source: ***Warning:*** only gpio marked as `unused` can be used. It is not possible for a *line* to be used by multiple processes simultaneously.
fr: ***Avertissement :*** seul les broches gpio marquées comme `inutilisées` peuvent être utilisées. Il n'est pas possible qu'une *ligne* soit utilisée par plusieurs processus simultanément.
hu: **Figyelmeztetés:** csak `unused` jelöléssel rendelkező GPIO használható. A *line* nem használható egyszerre több folyamatban.
ko: **경고:** `unused` 로 표시된 gpio만 사용할 수 있습니다. 여러 프로세스에서 동시에 *line* 을 사용할 수 없습니다.
zh_hans: ***警告：***只有标记为`unused`的 gpio 才可以被使用。一条*线路*不可能被多个进程同时使用。

source: For example on a RPi 3B+ where klipper use the GPIO20 for a switch:
fr: Par exemple sur un RPi 3B+ où klipper utilise le GPIO20 comme un interrupteur :
hu: Például egy RPi 3B+, ahol a klipper használja a GPIO20-at, egy kapcsoló:
ko: 예를 들어 RPi 3B+에서 Klipper는 스위치로 GPIO20를 이용합니다:
zh_hans: 例如，在树莓派 3B+上 将GPIO20作为 Klipper 的一个开关：

source: Optional: Hardware PWM
fr: Facultatif : PWM matériel
hu: Választható: Hardveres PWM
ko: 옵션: 하드웨어 PWM
zh_hans: 可选功能：硬件 PWM

source: Raspberry Pi's have two PWM channels (PWM0 and PWM1) which are exposed on the header or if not, can be routed to existing gpio pins. The Linux mcu daemon uses the pwmchip sysfs interface to control hardware pwm devices on Linux hosts. The pwm sysfs interface is not exposed by default on a Raspberry and can be activated by adding a line to `/boot/config.txt`:
fr: Les Raspberry Pi ont deux canaux PWM (PWM0 et PWM1) qui sont disponibles sur le connecteur ou, sinon, peuvent être redirigés vers des broches gpio existantes. Le service mcu Linux utilise l'interface pwmchip sysfs pour contrôler les périphériques matériels pwm sur les hôtes Linux. L'interface pwm sysfs n'est pas disponible par défaut sur un Raspberry et peut être activée en ajoutant une ligne à `/boot/config.txt` :
hu: A Raspberry Pi két PWM csatornával (PWM0 és PWM1) rendelkezik, amelyek a fejlécen láthatók, vagy ha nem, akkor a meglévő GPIO érintkezőkhöz irányíthatók. A Linux mcu démon a pwmchip sysfs interfészt használja a hardveres PWM eszközök vezérlésére a Linux gazdagépeken. A PWM sysfs interfész alapértelmezés szerint nincs kitéve a Raspberry-n, és a `/boot/config.txt` egy sor hozzáadásával aktiválható:
ko: Raspberry Pi에는 헤더에 노출되거나 그렇지 않은 경우 기존 gpio 핀으로 라우팅될 수 있는 두 개의 PWM 채널(PWM0 및 PWM1)을 가지고 있습니다. 리눅스 mcu 데몬은 리눅스 호스트의 하드웨어 pwm 장치들을 제어하기 위한 pwmchip sysfs 인터페이스를 사용합니다. pwm sysfs 인터페이스는 기본적으로 라즈베리에서 노출되지 않으며 `/boot/config.txt` 에 다음 행을 추가하여 활성화할 수 있습니다:
zh_hans: 树莓派有两个PWM通道（PWM0和PWM1），它们通常暴露在header中上，如果没有，可以路由到现有的 gpio 引脚。Linux mcu 守护程序使用 pwmchip sysfs 接口来控制 Linux 主机上的硬件 PWM 设备。pwm sysfs 接口在树莓上默认是隐藏的，可以通过在`/boot/config.txt`中加入一行设置来激活：

source: # Enable pwmchip sysfs interface dtoverlay=pwm,pin=12,func=4
fr: # Activer l'interface pwmchip sysfs dtoverlay=pwm,pin=12,func=4
hu: # A pwmchip sysfs felület engedélyezése dtoverlay=pwm,pin=12,func=4
zh_hans: # 启用 pwmchip sysfs 接口 dtoverlay=pwm,pin=12,func=4

source: This example enables only PWM0 and routes it to gpio12. If both PWM channels need to be enabled you can use `pwm-2chan`.
fr: Cet exemple active uniquement PWM0 et l'achemine vers gpio12. Si les deux canaux PWM doivent être activés, vous pouvez utiliser `pwm-2chan`.
hu: Ez a példa csak a PWM0-t engedélyezi, és a GPIO12-re irányítja. Ha mindkét PWM csatornát engedélyezni kell, használhatod a `pwm-2chan` parancsot.
ko: 이 예에서는 PWM0만 활성화하고 이를 gpio12로 라우팅합니다. 두 PWM 채널을 모두 활성화해야 하는 경우 `pwm-2chan` 을 사용할 수 있습니다.
zh_hans: 此示例仅启用 PWM0 并将其路由到 gpio12。如果需要同时启用两个 PWM 通道，则可以使用 `pwm-2chan`。

source: The overlay does not expose the pwm line on sysfs on boot and needs to be exported by echo'ing the number of the pwm channel to `/sys/class/pwm/pwmchip0/export`:
fr: La superposition n'expose pas la ligne pwm sur sysfs au démarrage et doit être redirigée en renvoyant le numéro du canal pwm vers `/sys/class/pwm/pwmchip0/export` :
hu: Az átfedés nem teszi ki a PWM sort a sysfs-en a rendszerindításkor, és azt a PWM csatorna számát a `/sys/class/pwm/pwmchip0/export` echo'ing-be kell exportálni:
ko: 오버레이는 부팅 시 sysfs의 pwm 라인을 노출하지 않으며 pwm 채널 번호를 `/sys/class/pwm/pwmchip0/export` 로 에코하여 내보내야 합니다:
zh_hans: overlay 在启动时不会在 sysfs 上暴露出 PWM 线路，需要通过echo将 PWM 通道的编号导出到 `/sys/class/pwm/pwmchip0/export`：

source: This will create device `/sys/class/pwm/pwmchip0/pwm0` in the filesystem. The easiest way to do this is by adding this to `/etc/rc.local` before the `exit 0` line.
fr: Cela créera le périphérique `/sys/class/pwm/pwmchip0/pwm0` dans le système de fichiers. La façon la plus simple de le faire est d'ajouter ceci à `/etc/rc.local` avant la ligne `exit 0`.
hu: Ez létrehozza a `/sys/class/pwm/pwmchip0/pwm0` eszközt a fájlrendszerben. A legegyszerűbb, ha ezt a `/etc/rc.local` sor előtt az `exit 0` sorba írjuk be.
ko: 그러면 파일 시스템에 `/sys/class/pwm/pwmchip0/pwm0` 장치가 생성됩니다. 이것을 하는 가장 쉬운 방법은 `exit 0` 행 앞에 `/etc/rc.local` 에 이것을 추가하는 것입니다.
zh_hans: 这将在文件系统中创建设备`/sys/class/pwm/kwmchip0/pwm0`。最简单的方法是在`/etc/rc.local`的`exit 0`行之前添加这行。

source: With the sysfs in place, you can now use either the pwm channel(s) by adding the following piece of configuration to your `printer.cfg`:
fr: Avec le sysfs en place, vous pouvez maintenant utiliser l'un ou l'autre des canaux pwm en ajoutant la configuration suivante à votre `printer.cfg` :
hu: Ha a sysfs a helyén van, akkor most már használhatod a PWM csatornát vagy csatornákat, ha a következő konfigurációt hozzáadod a `printer.cfg` fájlhoz:
ko: sysfs가 있으면 이제 다음 구성을 `printer.cfg`에 추가하여 pwm 채널을 사용할 수 있습니다:
zh_hans: 有了 sysfs，现在可以通过将以下配置添加到 `printer.cfg` 来使用 PWM 通道：

source: This will add hardware pwm control to gpio12 on the Pi (because the overlay was configured to route pwm0 to pin=12).
fr: Cela ajoutera un contrôle pwm matériel à gpio12 sur le Pi (car la superposition a été configurée pour acheminer pwm0 vers la broche = 12).
hu: Ez hozzáadja a hardveres PWM vezérlést a Pi GPIO12-höz (mivel az átfedés úgy volt konfigurálva, hogy a PWM0-t a pin=12-re irányítsa).
ko: 그러면 Pi의 하드웨어 pwm 제어가 gpio12에 추가됩니다(오버레이가 pwm0을 pin=12로 라우팅하도록 구성되었기 때문).
zh_hans: 这将为树莓派上的 gpio12 引脚添加硬件 PWM 控制（因为overlay被配置为将 pwm0 路由到 pin=12）。

source: RPi microcontroller
fr: Microcontrôleur RPi
hu: RPi mikrokontroller
zh_hans: RPi 微控制器

source: PWM0 can be routed to gpio12 and gpio18, PWM1 can be routed to gpio13 and gpio19:
fr: PWM0 peut être redirigé vers gpio12 et gpio18, PWM1 peut être redirigé vers gpio13 et gpio19 :
hu: A PWM0 a GPIO12 és a GPIO18 a PWM1 a GPIO13 és a GPIO19 felé irányítható:
zh_hans: PWM0 可以被路由到 gpio12 和 gpio18，PWM1 可以被路由到 gpio13 和 gpio19：

source: PWM
fr: PWM (Modulation en Largeur d'Impulsion)

source: gpio PIN
fr: Broche gpio
zh_hans: GPIO 引脚

source: Optional: Enabling SPI
fr: Facultatif : Activer SPI
hu: Választható: SPI engedélyezése

source: Make sure the Linux SPI driver is enabled by running `sudo raspi-config` and enabling SPI under the "Interfacing options" menu.
fr: Assurez-vous que le pilote SPI Linux est activé en exécutant `sudo raspi-config` et en activant SPI dans le menu « Options d’interface ».
hu: Győződjünk meg róla, hogy a Linux SPI-illesztőprogram engedélyezve van a `sudo raspi-config` futtatásával és az SPI engedélyezésével az "Interfacing options" menüben.

source: The chosen pin can thus be used within the configuration as `gpiochip<n>/gpio<o>` where **n** is the chip number as seen by the `gpiodetect` command and **o** is the line number seen by the`gpioinfo` command.
fr: La broche choisie peut donc être utilisée dans la configuration comme `gpiochip<n>/gpio<o>` où **n** est le numéro de puce tel qu'il est vu par la commande `gpiodetect` et **o** est le numéro de ligne vu par la commande `gpioinfo`.
hu: A kiválasztott tű így a konfiguráción belül `gpiochip<n>/gpio<o> néven használható;` ahol **n** a `gpiodetect` által látott chipszám parancs által látott sorszám, és **o** a`gpioinfo` parancs által látott sorszám.

source: On Raspberry Pi and on many clones the pins exposed on the GPIO belong to the first gpiochip. They can therefore be used on klipper simply by referring them with the name `gpio0..n`. However, there are cases in which the exposed pins belong to gpiochips other than the first. For example in the case of some OrangePi models or if a Port Expander is used. In these cases it is useful to use the commands to access the *Linux GPIO character device* to verify the configuration.
fr: Sur Raspberry Pi et sur de nombreux clones, les broches disponibles sur le connecteur GPIO appartiennent à la première puce gpio. Ils peuvent donc être utilisés sur klipper simplement en les référençant avec le nom `gpio0..n`. Cependant, il existe des cas dans lesquels les broches disponibles appartiennent à des puces gpio autres que la première. Par exemple dans le cas de certains modèles OrangePi ou si un "Port Expander" est utilisé. Dans ces cas, il est utile d'utiliser les commandes pour accéder au *Périphérique de caractères GPIO Linux* pour vérifier la configuration.
hu: A Raspberry Pi-n és sok klónon a GPIO-n látható tűk az első GPIO chip-hez tartoznak. Ezért a Klipper-ben egyszerűen úgy használhatók, hogy a `gpio0..n` névvel hivatkozunk rájuk. Vannak azonban olyan esetek, amikor a kitett tűk az elsőtől eltérő GPIO chipek-hez tartoznak. Például egyes OrangePi modellek esetében, vagy ha Port Expander-t használunk. Ezekben az esetekben hasznos a *Linux GPIO karakteres eszköz *Linux GPIO eszköz* elérésére szolgáló parancsok használata a konfiguráció ellenőrzéséhez.

source: Optional: Enabling I2C
fr: Facultatif : Activer I2C
hu: Választható: I2C engedélyezése

source: Make sure the Linux I2C driver is enabled by running `sudo raspi-config` and enabling I2C under the "Interfacing options" menu. If planning to use I2C for the MPU accelerometer, it is also required to set the baud rate to 400000 by: adding/uncommenting `dtparam=i2c_arm=on,i2c_arm_baudrate=400000` in `/boot/config.txt` (or `/boot/firmware/config.txt` in some distros).
fr: Assurez-vous que le pilote Linux I2C est activé en exécutant `sudo raspi-config` et en activant I2C dans le menu "Interfacing options". Si vous prévoyez d'utiliser I2C pour l'accéléromètre MPU, il est également nécessaire de définir le débit en bauds sur 400 000 en : ajoutant/décommentant `dtparam=i2c_arm=on,i2c_arm_baudrate=400000` dans `/boot/config. txt` (ou `/boot/firmware/config.txt` dans certaines distributions).
hu: Győződjünk meg róla, hogy a Linux I2C illesztőprogram engedélyezve van a `sudo raspi-config` futtatásával és az I2C engedélyezésével az "Interfacing options" menüben. Ha az MPU gyorsulásmérőjének I2C használatát tervezzük, akkor az átviteli sebességet is 400000-re kell állítani a következő módon: `dtparam=i2c_arm=on,i2c_arm_baudrate=400000` hozzáadása/elhagyása a `/boot/config-ban.txt` (vagy `/boot/firmware/config.txt` néhány disztróban).

source: On Rasperry and on many clones the pins exposed on the GPIO belong to the first gpiochip. They can therefore be used on klipper simply by referring them with the name `gpio0..n`. However, there are cases in which the exposed pins belong to gpiochips other than the first. For example in the case of some OrangePi models or if a Port Expander is used. In these cases it is useful to use the commands to access the *Linux GPIO character device* to verify the configuration.
ko: Rasperry 및 많은 클론에서 GPIO에 노출된 핀은 첫 번째 gpiochip에 속합니다. 따라서 `gpio0..n`이라는 이름으로 참조하기만 하면 Klipper에서 사용할 수 있습니다. 다만, 노출된 핀이 1차 이외의 gpiochip에 속하는 경우가 있습니다. 예를들어 일부 OrangePi 모델의 경우 또는 포트 확장기가 사용되는 경우. 이러한 경우 명령을 사용하여 *Linux GPIO 문자 장치* 에 액세스하여 구성을 확인하는 것이 유용합니다.
zh_hans: 在树莓派和许多克隆上，暴露在 GPIO 上的引脚属于第一个 gpiochip。因此，它们只需用`gpio0...n`的名字来引用就可以在 Klipper 上直接使用。然而，在有些情况下，暴露的引脚不属于第一个 gpiochip。例如，在使用一些 OrangePi 型号时或者使用了端口扩展器。在这些情况下，使用命令访问 *Linux GPIO character device* 来验证实际配置。

source: The chosen pin can thus be used within the configuration as `gpiochip<n>/gpio<o>` where **n** is the chip number as seen by the `gpiodetect` command and **o** is the line number seen by the` gpioinfo` command.
ko: 따라서 선택한 핀은 구성 내에서 `gpiochip<n>/gpio<o>`로 사용할 수 있습니다. 여기서 **n**은 `gpiodetect` 명령으로 볼 수 있는 칩 번호이고 **o**는 `gpioinfo` 명령으로 볼 수 라인 번호입니다.
zh_hans: 因此，所选引脚可以在配置中用 `gpiochip<n>/gpio<o>`引用，其中 **n** 是由 `gpiodetect` 命令看到的芯片编号**o** 是 ` gpioinfo` 命令看到的行号。

source: Enabling SPI
ko: SPI 활성화
zh_hans: 启用 SPI

source: Make sure the Linux SPI driver is enabled by running sudo raspi-config and enabling SPI under the "Interfacing options" menu.
ko: sudo raspi-config를 실행하고 "인터페이싱 옵션" 메뉴에서 SPI를 활성화하여 Linux SPI 드라이버가 활성화되어 있는지 확인합니다.
zh_hans: 通过运行 sudo raspi-config 并在"Interfacing Options"菜单下启用 SPI，确保Linux SPI驱动程序被启用。

source: Func
zh_hans: 功能

source: PWM0 can be routed to gpio12 and gpio18, PWM1 can be routed to gpio13 and gpio19: |PWM|gpio PIN|Func| |---|--------|----| | 0| 12| 4| | 0| 18| 2| | 1| 13| 4| | 1| 19| 2|
ko: PWM0은 gpio12 및 gpio18로 라우팅할 수 있고 PWM1은 gpio13 및 gpio19로 라우팅할 수 있습니다:|PWM|gpio PIN|Func| |---|--------|----| | 0| 12| 4| | 0| 18| 2| | 1| 13| 4| | 1| 19| 2|
