Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Slicers.po
Languages: fr, hu, ru, zh_hant

source: This document provides some tips for configuring a "slicer" application for use with Klipper. Common slicers used with Klipper are Slic3r, Cura, Simplify3D, etc.
fr: Ce document fournit certains conseils concernant la configuration d'une application "Slicer" pour une utilisation avec Klipper. Des slicers les plus courants utilisés avec Klipper sont Sli3r, Cura, Simplify3D, etc.
hu: Ez a dokumentum néhány tippet ad a Klipperrel használható "szeletelő" alkalmazás konfigurálásához. A Klipperrel együtt használt gyakori szeletelőprogramok a Slic3r, Cura, Simplify3D stb.
ru: В этом документе содержится несколько советов по настройке приложения "slicer" для использования с Klipper. Распространенными слайсерами, используемыми с Klipper, являются Slic3r, Cura, Simplify3Dи др.
zh_hant: 本文件提供了與 Klipper 一起使用的一些切片軟體配置技巧。 Klipper 常用的切片軟體有 Slic3r、Cura、Simplify3D 等。

source: Set the G-Code flavor to Marlin
fr: Définissez le parfum g-code sur 'Marlin'
hu: Állítsa be a G-kód ízét Marlinra
ru: Установите для G-кода значение Marlin
zh_hant: 將 G-Code 風格設定為 Marlin

source: Many slicers have an option to configure the "G-Code flavor". The default is frequently "Marlin" and that works well with Klipper. The "Smoothieware" setting also works well with Klipper.
fr: De nombreux trancheurs ont une option pour configurer le "Parfum G-Code". La valeur par défaut est souvent "Marlin" et cela fonctionne bien avec Klipper. La valeur "Smoothieware" fonctionne également bien avec Klipper.
hu: Sok szeletelőprogram rendelkezik a "G-kód ízének" konfigurálási lehetőséggel. Az alapértelmezett gyakran a "Marlin", és ez jól működik a Klipperrel. A "Smoothieware" beállítás szintén jól működik a Klipperrel.
ru: Во многих слайсерах есть возможность настроить "предпочтение G-кода". По умолчанию часто используется "Marlin", и это хорошо работает с Klipper. Настройка "Smoothieware" также хорошо работает с Klipper.
zh_hant: 很多切片軟體可以設定「G程式碼風格」選項。Klipper支援通常預設的「Marlin」；Klipper 也相容「Smoothieware」風格。

source: Slicers will often allow one to configure "Start G-Code" and "End G-Code" sequences. It is often convenient to define custom macros in the Klipper config file instead - such as: `[gcode_macro START_PRINT]` and `[gcode_macro END_PRINT]`. Then one can just run START_PRINT and END_PRINT in the slicer's configuration. Defining these actions in the Klipper configuration may make it easier to tweak the printer's start and end steps as changes do not require re-slicing.
fr: Les trancheurs permettent souvent de configurer les séquences "Start G-Code" et "End G-Code". Il est souvent pratique de définir des macros personnalisées dans le fichier de configuration de Klipper - telles que : `[gcode_macro START_PRINT]` et `[gcode_macro END_PRINT]`. Ensuite, on peut simplement indiquer START_PRINT et END_PRINT dans la configuration du slicer. La définition de ces actions dans la configuration de Klipper peut faciliter la modification des étapes de début et de fin de l'imprimante, car les modifications ne nécessitent pas de nouveau découpage.
hu: A szeletelők gyakran lehetővé teszik a "Start G-kód" és "End G-kód" szekvenciák konfigurálását. Ehelyett gyakran kényelmes egyéni makrókat definiálni a Klipper config fájlban - például: `[gcode_macro START_PRINT]` és `[gcode_macro END_PRINT]`. Ezután csak a START_PRINT és END_PRINT futtatását kell elvégezni a szeletelő konfigurációjában. Ha ezeket a műveleteket a Klipper konfigurációban definiáljuk, könnyebbé válhat a nyomtató indítási és befejezési lépéseinek finomhangolása, mivel a változtatások nem igényelnek újbóli szeletelést.
ru: Часто слайсеры позволяют настраивать последовательности "Start G-Code" и "End G-Code". Часто вместо этого удобно определить пользовательские макросы в конфигурационном файле Klipper - например: `[gcode_macro START_PRINT]` и `[gcode_macro END_PRINT]`. Тогда можно просто выполнить START_PRINT и END_PRINT в конфигурации слайсера. Определение этих действий в конфигурации клиппера может облегчить настройку начального и конечного шагов принтера, поскольку изменения не требуют повторной нарезки.
zh_hant: 切片軟體通常可以配置一個"開始G程式碼 "(Start G-Code)和 "結束G程式碼 "(End G-Code)序列。但在 Klipper 配置檔案中定義自定義宏通常更簡便，例如：`[gcode_macro START_PRINT]` 和 `[gcode_macro END_PRINT]` 。然後就可以在切片軟體的配置中使用 START_PRINT 和 END_PRINT 。在 Klipper 的配置中定義這些動作可能會簡化印表機的開始和結束步驟的配置，因為修改不需要重新切片。

source: See [sample-macros.cfg](../config/sample-macros.cfg) for example START_PRINT and END_PRINT macros.
fr: Voir [sample-macros.cfg](../config/sample-macros.cfg) par exemple les macros START_PRINT et END_PRINT.
hu: Lásd a [sample-macros.cfg](../config/sample-macros.cfg) a START_PRINT és END_PRINT makrók példáját.
ru: Примеры макросов START_PRINT и END_PRINT см. в [sample-macros.cfg](../config/sample-macros.cfg).
zh_hant: 參見[sample-macros.cfg](../config/sample-macros.cfg)中的示例 START_PRINT 和END_PRINT 宏。

source: See the [config reference](Config_Reference.md#gcode_macro) for details on defining a gcode_macro.
fr: Voir la [référence de configuration](Config_Reference.md#gcode_macro) pour plus de détails sur la définition de macros G-Code.
hu: A gcode_macro definiálásának részleteiért lásd a [config reference](Config_Reference.md#gcode_macro).
ru: Подробнее об определении gcode_macro см. в [config reference](Config_Reference.md#gcode_macro).
zh_hant: 參見[配置參考](Config_Reference.md#gcode_macro)中關於定義 gcode_macro 的細節。

source: Large retraction settings may require tuning Klipper
fr: Un réglage de rétraction important peut nécessiter un réglage de Klipper
hu: Nagy visszahúzási értékek beállítása szükségessé tehetik a Klipper hangolását
ru: При больших настройках втягивания может потребоваться настройка клиппера
zh_hant: 大的回抽值可能意味著需要調優 Klipper

source: The maximum speed and acceleration of retraction moves are controlled in Klipper by the `max_extrude_only_velocity` and `max_extrude_only_accel` config settings. These settings have a default value that should work well on many printers. However, if one has configured a large retraction in the slicer (eg, 5mm or greater) then one may find they limit the desired speed of retractions.
fr: La vitesse et l'accélération maximales des mouvements de rétraction sont contrôlés dans Klipper par les paramètres de configuration `max_extrude_only_velocity` et `max_extrude_only_accel`. Ces paramètres ont une valeur par défaut qui doit bien fonctionner sur de nombreuses imprimantes. Cependant, si l'on a configuré une grande rétraction dans le trancheur (par exemple, 5 mm ou plus), on peut constater qu'ils limitent la vitesse de rétraction souhaitée.
hu: A behúzási mozgások maximális sebességét és gyorsulását a Klipperben a `max_extrude_only_velocity` és `max_extrude_only_accel` konfigurációs beállítások szabályozzák. Ezeknek a beállításoknak van egy alapértelmezett értéke, amely sok nyomtatónál jól fog működni. Ha azonban valaki nagy behúzást állított be a szeletelőben (pl. 5 mm vagy nagyobb), akkor előfordulhat, hogy ezek korlátozzák a kívánt behúzási sebességet.
ru: Максимальная скорость и ускорение движений втягивания контролируются в Klipper настройками конфигурации `max_extrude_only_velocity` и `max_extrude_only_accel`. Эти параметры имеют значение по умолчанию, которое должно хорошо работать на многих принтерах. Однако если в слайсере настроено большое втягивание (например, 5 мм или более), то можно обнаружить, что они ограничивают желаемую скорость втягивания.
zh_hant: 在Klipper中，回抽的最大速度和加速度由 `max_extrude_only_velocity` 和 `max_extrude_only_accel` 參數控制。在大多數印表機上這些參數的預設值應該能很好地工作。然而，如果切片軟體中配置了一個大的回抽值(例如，5毫米或更大)，可能會發現期望的回抽速度受到了限制。

source: If using a large retraction, consider tuning Klipper's [pressure advance](Pressure_Advance.md) instead. Otherwise, if one finds the toolhead seems to "pause" during retraction and priming, then consider explicitly defining `max_extrude_only_velocity` and `max_extrude_only_accel` in the Klipper config file.
fr: Si vous utilisez une grande distance rétraction, envisagez plutôt de régler le [Pressure advance](Pressure_Advance.md) de Klipper. Dans la cas ou l'on trouve que la tête semble "s'arrêter" pendant la rétraction et l'amorçage, définissez explicitement `max_extrude_only_velocity` et `max_extrude_only_accel` dans le fichier de configuration de Klipper.
hu: Ha nagy visszahúzást használ, fontolja meg a Klipper [nyomás előtolás](Pressure_Advance.md) beállítását. Ellenkező esetben, ha úgy találjuk, hogy a nyomtatófej úgy tűnik, hogy "szünetel" a behúzás és az alapozás során, akkor fontolja meg a `max_extrude_only_velocity` és `max_extrude_only_accel` kifejezett meghatározását a Klipper konfigurációs fájlban.
ru: Если используется большое втягивание, рассмотрите возможность настройки [опережения давления](Pressure_Advance.md) Клиппера вместо этого. В противном случае, если вы обнаружите, что головка инструмента как бы "приостанавливается" во время втягивания и заливки, то подумайте о явном определении `max_extrude_only_velocity` и `max_extrude_only_accel` в конфигурационном файле Klipper.
zh_hant: 如果你正在使用一個大的回抽值，考慮調優 Klipper 的[提前壓力](Pressure_Advance.md)來代替。否則你可能會發現列印頭在回抽和啟動時暫停，此時可以考慮在 Klipper 配置檔案中設定`max_extrude_only_velocity`和`max_extrude_only_accel`參數來解決這個問題。

source: Do not enable "coasting"
fr: N'activez pas le mode "roue libre"
hu: Ne engedélyezze a "coasting-ot"
ru: Не включайте "движение накатом"
zh_hant: 不要啟用「滑行(coasting)」

source: The "coasting" feature is likely to result in poor quality prints with Klipper. Consider using Klipper's [pressure advance](Pressure_Advance.md) instead.
fr: Le mode "roue libre" est susceptible d'entraîner des impressions de mauvaise qualité avec Klipper. Envisagez d'utiliser à la place le [pressure Advance](Pressure_Advance.md) de Klipper.
hu: A "coasting" funkció valószínűleg rossz minőségű nyomatokat eredményez a Klipperrel. Fontolja meg helyette a Klipper [pressure advance](Pressure_Advance.md) használatát.
ru: Функция "накатом", скорее всего, приведет к плохому качеству отпечатков с Klipper. Вместо этого используйте [pressure advance](Pressure_Advance.md) от Klipper.
zh_hant: 和Klipper 一起使用「滑行(coasting)」功能可能會導致列印質量不佳。考慮使用 Klipper 的[提前壓力](Pressure_Advance.md)功能替代。

source: Specifically, if the slicer dramatically changes the extrusion rate between moves then Klipper will perform deceleration and acceleration between moves. This is likely to make blobbing worse, not better.
fr: Plus précisément, si le slicer modifie considérablement le taux d'extrusion entre les mouvements, Klipper effectuera une décélération et une accélération entre les mouvements. Cela risque d'aggraver les bavures, pas de les améliorer.
hu: Konkrétan, ha a szeletelő drasztikusan megváltoztatja az extrudálási sebességet a mozgások között, akkor a Klipper lassítást és gyorsítást hajt végre a mozgások között. Ez valószínűleg rontja a blobbingot, nem pedig javítja.
ru: В частности, если слайсер резко меняет скорость выдавливания между движениями, Klipper будет выполнять замедление и ускорение между движениями. Это, скорее всего, приведет к ухудшению, а не к улучшению качества.
zh_hant: 具體來說，如果切片軟體在移動之間大幅改變擠出率，那麼 Klipper 將在移動之間進行減速和加速。這更可能會造成更多的擠出顆粒(blobbing)，而不是更少。

source: In contrast, it is okay (and often helpful) to use a slicer's "retract" setting, "wipe" setting, and/or "wipe on retract" setting.
fr: En revanche, il est possible (et souvent utile) d'utiliser le réglage « rétracter », le réglage « essuyer » et/ou le réglage « essuyer lors de la rétractation » d'un trancheur.
hu: Ezzel szemben a szeletelőgép "visszahúzás" beállítása, "törlés" beállítása és/vagy "törlés visszahúzáskor" beállítása rendben van (és gyakran hasznos).
ru: В отличие от этого, можно (и часто полезно) использовать настройки "втягивание", "протирка" и/или "протирка при втягивании" ломтерезки.
zh_hant: 相反，使用切片軟體的"回抽"、"擦拭 "和/或 "縮回時擦拭 "設定通常是有益的。

source: Do not use "extra restart distance" on Simplify3d
fr: Ne pas utiliser la "distance de redémarrage supplémentaire" sur Simplify3d
hu: Ne használja az "extra újraindítási távolságot" a Simplify3d-nél
ru: Не используйте "дополнительное расстояние перезапуска" в Simplify3d
zh_hant: 不要在 Simplify3d 上使用「額外重啟距離(extra restart distance)」

source: This setting can cause dramatic changes to extrusion rates which can trigger Klipper's maximum extrusion cross-section check. Consider using Klipper's [pressure advance](Pressure_Advance.md) or the regular Simplify3d retract setting instead.
fr: Ce paramètre peut entraîner de gros changements dans le taux d'extrusion, ce qui peut déclencher la limite d'extrusion maximale de Klipper. Envisagez d'utiliser à la place le [pressure advance](Pressure_Advance.md) de Klipper (Pressure_Advance.md) ou le paramètre de rétractation standard de Simplify3d.
hu: Ez a beállítás drámai változásokat okozhat az extrudálási sebességben, ami kiválthatja a Klipper maximális extrudálási keresztmetszet ellenőrzését. Fontolja meg a Klipper [nyomás előtolás](Pressure_Advance.md) vagy a normál Simplify3d visszahúzási beállítás használatát helyette.
ru: Эта настройка может привести к резким изменениям скорости экструзии, что может вызвать срабатывание проверки максимального сечения экструзии Klipper. Вместо этого используйте [pressure advance](Pressure_Advance.md) или обычную настройку Simplify3d retract.
zh_hant: 這個設定會導致擠出速度的劇烈變化，從而觸發 Klipper 的最大擠出截面檢查。考慮使用 Klipper 的[提前](Pressure_Advance.md)或 Simplify3d 的常規回抽設定來代替。

source: Disable "PreloadVE" on KISSlicer
fr: Désactivez "PreloadVE" sur KISSlicer
hu: A "PreloadVE" letiltása a KISSlicer-en
ru: Отключите "PreloadVE" в KISSlicer
zh_hant: 在 KISSlicer 上禁用「PreloadVE」

source: If using KISSlicer slicing software then set "PreloadVE" to zero. Consider using Klipper's [pressure advance](Pressure_Advance.md) instead.
fr: Si vous utilisez le trancheur KISSlicer, réglez "PreloadVE" sur zéro. Envisagez d'utiliser à la place le [Pressure Advance](Pressure_Advance.md) de Klipper.
hu: Ha a KISSlicer szeletelőszoftvert használja, akkor állítsa a "PreloadVE" értéket nullára. Fontolja meg helyette a Klipper [nyomás előtolás](Pressure_Advance.md) használatát.
ru: Если используется программа для нарезки KISSlicer, установите "PreloadVE" на ноль. Вместо этого используйте [pressure advance](Pressure_Advance.md) программы Klipper.
zh_hant: 如果使用 KISSlicer 切片軟體，那麼需要把 "PreloadVE "設為0並考慮使用Klipper的[提前壓力](Pressure_Advance.md)代替。

source: Disable any "advanced extruder pressure" settings
fr: Désactivez tous les paramètres de "pression d'extrusion avancée"
hu: Tiltja a "fejlett nyomás előtolás" beállításokat
ru: Отключите все настройки "расширенного давления экструдера"
zh_hant: 禁用任何"提前擠出壓力"的設定

source: Some slicers advertise an "advanced extruder pressure" capability. It is recommended to keep these options disabled when using Klipper as they are likely to result in poor quality prints. Consider using Klipper's [pressure advance](Pressure_Advance.md) instead.
fr: Certains trancheurs présentent une fonction de "pression d'extrudeuse avancée". Il est recommandé de garder ces options désactivées lors de l'utilisation de Klipper car elles risquent d'entraîner des impressions de mauvaise qualité. Envisagez d'utiliser à la place la [Pressure Advance](Pressure_Advance.md) de Klipper.
hu: Néhány szeletelőgép "fejlett nyomás előtolás" képességet hirdet. A Klipper használata esetén ajánlott ezeket az opciókat kikapcsolva tartani, mivel valószínűleg rossz minőségű nyomatokat eredményeznek. Fontolja meg ehelyett a Klipper [nyomás előtolás](Pressure_Advance.md) használatát.
ru: Некоторые слайсеры рекламируют возможность "расширенного давления экструдера". При использовании Klipper рекомендуется отключать эти опции, так как они, скорее всего, приведут к плохому качеству отпечатков. Вместо этого используйте опцию Klipper [pressure advance](Pressure_Advance.md).
zh_hant: 一些切片軟體宣傳有 "高級擠出機壓力調整 "的功能。建議在使用 Klipper 時禁用這些功能，因為它們很可能會降低列印質量。考慮使用 Klipper 的[壓力提前](Pressure_Advance.md)代替。

source: Specifically, these slicer settings can instruct the firmware to make wild changes to the extrusion rate in the hope that the firmware will approximate those requests and the printer will roughly obtain a desirable extruder pressure. Klipper, however, utilizes precise kinematic calculations and timing. When Klipper is commanded to make significant changes to the extrusion rate it will plan out the corresponding changes to velocity, acceleration, and extruder movement - which is not the slicer's intent. The slicer may even command excessive extrusion rates to the point that it triggers Klipper's maximum extrusion cross-section check.
fr: Ces paramètres de trancheur peuvent demander au micrologiciel d'apporter des modifications non contrôlées au taux d'extrusion dans l'espoir que le micrologiciel se rapprochera de ces demandes et que l'imprimante obtiendra approximativement une pression d'extrudeuse souhaitable. Klipper, utilise des calculs cinématiques et une synchronisation précise. Lorsque Klipper reçoit l'ordre d'apporter des modifications importantes au taux d'extrusion, il planifiera les modifications correspondantes de la vitesse, de l'accélération et du mouvement de l'extrudeuse - ce qui n'est pas prévu par le trancheur. Le trancheur peut même commander des taux d'extrusion excessifs au point de déclencher la limite d'extrusion maximale de Klipper.
hu: Konkrétan ezek a szeletelő beállítások utasíthatják a firmware-t, hogy vad változtatásokat végezzen az extrudálási sebességben, abban a reményben, hogy a firmware közelíteni fogja ezeket a kéréseket, és a nyomtató nagyjából a kívánt extrudernyomást fogja elérni. A Klipper azonban pontos kinematikai számításokat és időzítést használ. Amikor a Klipper parancsot kap az extrudálási sebesség jelentős változtatására, megtervezi a sebesség, a gyorsulás és az extruder mozgásának megfelelő változásait - ami nem a szeletelő szándékában áll. A szeletelő akár túlzott extrudálási sebességet is parancsolhat, olyannyira, hogy az kiváltja a Klipper maximális extrudálási keresztmetszet ellenőrzését.
ru: В частности, эти настройки слайсера могут предписывать микропрограмме вносить дикие изменения в скорость экструзии в надежде, что микропрограмма приблизительно выполнит эти запросы и принтер примерно получит желаемое давление в экструдере. Klipper, однако, использует точные кинематические расчеты и синхронизацию. Когда Klipper получает команду внести значительные изменения в скорость экструзии, он планирует соответствующие изменения скорости, ускорения и движения экструдера, что не входит в намерения слайсера. Слайсер может даже задать чрезмерную скорость экструзии до такой степени, что сработает проверка Klipper на максимальное сечение экструзии.
zh_hant: 具體來說，這些切片軟體的設定產生的命令會韌體對擠出率進行劇烈的改變，希望韌體能接近這些請求值，使印表機獲得一個大致理想的擠出機壓力。然而，Klipper利用精確的運動學計算和計時。當Klipper被命令對擠出率進行重大改變時，它將計劃出速度、加速度和擠出機運動的相應變化--這不是切片軟體的意圖。切片軟體甚至可能產生過大的擠出速度，以至於觸發Klipper的最大擠出截面檢查。

source: Slicers
hu: Szeletelők
ru: Слайсеры
zh_hant: 切片軟體

source: START_PRINT macros
ru: Макрос START_PRINT

source: When using a START_PRINT macro or similar, it is useful to sometimes pass through parameters from the slicer variables to the macro.
ru: При использовании макроса START_PRINT или аналогичного ему полезно иногда передавать в макрос параметры из переменных слайсера.

source: In Cura, to pass through temperatures, the following start gcode would be used:
ru: В Cura для прохождения температур используется следующий стартовый g-код:

source: START_PRINT BED_TEMP={material_bed_temperature_layer_0} EXTRUDER_TEMP={material_print_temperature_layer_0}
ru: START_PRINT BED_TEMP={материал_кровать_температура_слоя_0} EXTRUDER_TEMP={материал_печать_температура_слоя_0}

source: In slic3r derivatives such as PrusaSlicer and SuperSlicer, the following would be used:
ru: В производных slic3r, таких как PrusaSlicer и SuperSlicer, используется следующее:

source: Also note that these slicers will insert their own heating codes when certain conditions are not met. In Cura, the existence of the `{material_bed_temperature_layer_0}` and `{material_print_temperature_layer_0}` variables is enough to mitigate this. In slic3r derivatives, you would use:
ru: Также следует учитывать, что эти слайсеры вставляют свои собственные коды нагрева при несоблюдении определенных условий. В Cura для уменьшения этого достаточно наличия переменных `{material_bed_temperature_layer_0}` и `{material_print_temperature_layer_0}`. В производных slic3r можно использовать:

source: before the macro call. Also note that SuperSlicer has a "custom gcode only" button option, which achieves the same outcome.
ru: перед вызовом макроса. Также отметим, что в SuperSlicer есть опция кнопки "только пользовательский gcode", которая позволяет добиться того же результата.

source: An example of a START_PRINT macro using these paramaters can be found in config/sample-macros.cfg
ru: Пример макроса START_PRINT с этими параметрами можно найти в файле config/sample-macros.cfg

source: Klipper gcode_macro
fr: Les macros G-code de Klipper
