Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Status_Reference.po
Languages: hu, ko, zh_hans

source: `mcu_build_versions`: Information on the build tools used to generate the micro-controller code (as reported by the micro-controller).
hu: `mcu_build_versions`: A mikrokontroller kódjának generálásához használt építőeszközökre vonatkozó információk (a mikrokontroller által jelentett módon).
ko: `mcu_build_versions`: 마이크로 컨트롤러 코드를 생성하는 데 사용되는 빌드 도구에 대한 정보(마이크로 컨트롤러가 보고한 대로).
zh_hans: `mcu_build_versions`：有关用于生成微控制器代码的构建工具的信息（由微控制器报告）。

source: `mcu_constants.<constant_name>`: Compile time constants reported by the micro-controller. The available constants may differ between micro-controller architectures and with each code revision.
hu: `mcu_constants.<constant_name>`: A mikrokontroller által jelentett fordítási idejű konstansok. A rendelkezésre álló konstansok mikrokontroller architektúránként és kódrevíziónként eltérőek lehetnek.
ko: `mcu_constants.<constant_name>`: 마이크로 컨트롤러에서 보고한 컴파일 시간 상수. 사용 가능한 상수는 마이크로 컨트롤러 아키텍처와 각 코드 개정판에 따라 다를 수 있습니다.
zh_hans: `mcu_constants.<常量名>`：由微控制器报告编译时使用的常量。可用的常量在不同的微控制器架构和每个代码修订版中可能有所不同。

source: `last_stats.<statistics_name>`: Statistics information on the micro-controller connection.
hu: `last_stats.<statistics_name>`: Statisztikai információk a mikrokontroller kapcsolatról.
ko: `last_stats.<statistics_name>`: 마이크로 컨트롤러 연결에 대한 통계 정보입니다.
zh_hans: `last_stats.<统计信息名>`：关于微控制器连接的统计信息。

source: The following information is available in [output_pin some_name](Config_Reference.md#output_pin) objects:
hu: A következő információk a [output_pin some_name](Config_Reference.md#output_pin) objektumokban érhetők el:
ko: 다음 정보는 [output_pin some_name](Config_Reference.md#output_pin) 개체에서 사용할 수 있습니다:
zh_hans: [output_pin <配置名称>](Config_Reference.md#output_pin) 对象提供以下信息：

source: `value`: The "value" of the pin, as set by a `SET_PIN` command.
hu: `value`: A `SET_PIN` paranccsal beállított "value" a tű értéke.
ko: `value`: `SET_PIN` 명령에 의해 설정된 핀의 "값".
zh_hans: `value`：由`SET_PIN`指令设置的引脚“值”。

source: The following information is available in the [palette2](Config_Reference.md#palette2) object:
hu: A következő információk a [palette2](Config_Reference.md#palette2) objektumban érhetők el:
ko: [palette2](Config_Reference.md#palette2) 개체에서 다음 정보를 사용할 수 있습니다:
zh_hans: [palette2](Config_Reference.md#palette2) 对象提供了以下信息：

source: `ping`: Amount of the last reported Palette 2 ping in percent.
hu: `ping`: Az utolsó jelentett Palette 2 ping összege százalékban.
ko: `ping`: 마지막으로 보고된 Palette 2 ping의 양(퍼센트)입니다.
zh_hans: `ping`。最后一次报告的Palette 2 ping值（百分比）。

source: `remaining_load_length`: When starting a Palette 2 print, this will be the amount of filament to load into the extruder.
hu: `remaining_load_length`: A Palette 2 nyomtatás indításakor ez lesz a nyomtatófejbe töltendő nyomtatószál mennyisége.
ko: `remaining_load_length`: Palette 2 인쇄를 시작할 때 압출기에 로드할 필라멘트의 양이 됩니다.
zh_hans: `remaining_load_length`：当开始一个使用 Palette 2 的打印时，这是需要加载到挤出机中的耗材长度。

source: `is_splicing`: True when the Palette 2 is splicing filament.
hu: `is_splicing`: True, ha a Palette 2 nyomtatószálat adagol.
ko: `is_splicing`: Palette 2가 필라멘트를 접합할 때 참입니다.
zh_hans: `is_splicing`：当Palette 2正在拼接耗材时为 True。

source: The following information is available in the [pause_resume](Config_Reference.md#pause_resume) object:
hu: A következő információk a [pause_resume](Config_Reference.md#pause_resume) objektumban érhetők el:
ko: [pause_resume](Config_Reference.md#pause_resume) 개체에서 다음 정보를 사용할 수 있습니다:
zh_hans: [palette2](Config_Reference.md#palette2) 对象提供了以下信息：

source: `is_paused`: Returns true if a PAUSE command has been executed without a corresponding RESUME.
hu: `is_paused`: True, ha egy PAUSE parancsot hajtottak végre a megfelelő RESUME parancs nélkül.
ko: `is_paused`: PAUSE 명령이 해당 RESUME 없이 실행된 경우 true를 반환합니다.
zh_hans: `is_paused`：如果执行了 PAUSE 命令而没有执行 RESUME，则返回 True。

source: The following information is available in the `print_stats` object (this object is automatically available if a [virtual_sdcard](Config_Reference.md#virtual_sdcard) config section is defined):
hu: A következő információk a `print_stats` objektumban érhetők el (ez az objektum automatikusan elérhető, ha a [virtual_sdcard](Config_Reference.md#virtual_sdcard) config szakasz definiálva van):
ko: 다음 정보는 `print_stats` 개체에서 사용할 수 있습니다 (이 개체는 [virtual_sdcard](Config_Reference.md#virtual_sdcard) 구성 섹션이 정의된 경우 자동으로 사용할 수 있음):
zh_hans: `print_stats` 对象提供了以下信息（如果定义了 [virtual_sdcard](Config_Reference.md#virtual_sdcard) 配置分段，则此对象自动可用）：

source: `filename`, `total_duration`, `print_duration`, `filament_used`, `state`, `message`: Estimated information about the current print when a virtual_sdcard print is active.
hu: `filename`, `total_duration`, `print_duration`, `filament_used`, `state`, `message`: Becsült információ az aktuális nyomtatásról, ha egy virtual_sdcard nyomtatás aktív.
ko: `filename`, `total_duration`, `print_duration`, `filament_used`, `state`, `message`: virtual_sdcard 인쇄가 활성화된 경우 현재 인쇄에 대한 예상 정보입니다.
zh_hans: `filename`、`total_duration`、`print_duration`、`filament_used`、`state`、`message`：virtual_sdcard 打印处于活动状态时有关当前打印的估测。

source: The following information is available in the [probe](Config_Reference.md#probe) object (this object is also available if a [bltouch](Config_Reference.md#bltouch) config section is defined):
hu: A következő információk a [szonda](Config_Reference.md#probe) objektumban érhetők el (ez az objektum akkor is elérhető, ha egy [bltouch](Config_Reference.md#bltouch) konfigurációs szakasz van definiálva):
ko: 다음 정보는 [probe](Config_Reference.md#probe) 개체에서 사용할 수 있습니다(이 개체는 [bltouch](Config_Reference.md#bltouch) 구성 섹션이 정의된 경우에도 사용할 수 있음):
zh_hans: [probe](Config_Reference.md#probe) 对象中提供了以下信息（如果定义了 [bltouch](Config_Reference.md#bltouch) 配置分段，则此对象也可用）：

source: `last_query`: Returns True if the probe was reported as "triggered" during the last QUERY_PROBE command. Note, if this is used in a macro, due to the order of template expansion, the QUERY_PROBE command must be run prior to the macro containing this reference.
hu: `last_query`: True értéket ad vissza, ha a szondát az utolsó QUERY_PROBE parancs során "triggered" -ként jelentették. Megjegyzés: ha ezt egy makróban használjuk, a sablon bővítési sorrendje miatt a QUERY_PROBE parancsot akkor ezt a hivatkozást tartalmazó makró előtt kell lefuttatni.
ko: `last_query`: 마지막 QUERY_PROBE 명령 동안 프로브가 "트리거된" 것으로 보고된 경우 True를 반환합니다. 이것이 매크로에서 사용되는 경우 템플릿 확장 순서로 인해 QUERY_PROBE 명령이 이 참조를 포함하는 매크로보다 먼저 실행되어야 합니다.
zh_hans: `last_query`：如果探针在上一个 QUERY_PROBE 命令期间报告为"已触发"，则返回 True。请注意，如果在宏中使用它，根据模板展开的顺序，必须在包含此引用的宏之前运行 QUERY_PROBE 命令。

source: `last_z_result`: Returns the Z result value of the last PROBE command. Note, if this is used in a macro, due to the order of template expansion, the PROBE (or similar) command must be run prior to the macro containing this reference.
hu: `last_z_result`: Az utolsó PROBE parancs Z eredményének értékét adja vissza. Figyelem, ha ezt egy makróban használjuk, a sablon bővítési sorrendje miatt a PROBE (vagy hasonló) parancsot akkor ezt a hivatkozást tartalmazó makró előtt kell lefuttatni.
ko: `last_z_result`: 마지막 PROBE 명령의 Z 결과 값을 반환합니다. 이것이 매크로에서 사용되는 경우 템플릿 확장 순서로 인해 PROBE(또는 유사한) 명령이 이 참조를 포함하는 매크로보다 먼저 실행되어야 합니다.

source: The following information is available in the `quad_gantry_level` object (this object is available if quad_gantry_level is defined):
hu: A következő információk a `quad_gantry_level` objektumban érhetők el (ez az objektum akkor érhető el, ha a quad_gantry_level definiálva van):
ko: 다음 정보는 `quad_gantry_level` 개체에서 사용할 수 있습니다 (이 개체는 quad_gantry_level이 정의된 경우 사용할 수 있음):
zh_hans: `quad_gantry_level` 对象提供了以下信息（如果定义了 quad_gantry_level，则该对象可用）：

source: `applied`: True if the gantry leveling process has been run and completed successfully.
hu: `applied`: True, ha a portál szintezési folyamata lefutott és sikeresen befejeződött.
ko: `applied`: 갠트리 레벨링 프로세스가 실행되고 성공적으로 완료된 경우 True입니다.
zh_hans: `applied`：如果龙门调平已运行并成功完成，则为 True。

source: The following information is available in the `query_endstops` object (this object is available if any endstop is defined):
hu: A következő információk a `query_endstops` objektumban érhetők el (ez az objektum akkor érhető el, ha bármilyen végálláskapcsoló definiálva van):
ko: `query_endstops` 개체에서 다음 정보를 사용할 수 있습니다 (이 개체는 endstop이 정의된 경우 사용할 수 있음):
zh_hans: `query_endstops` 对象提供以下信息（如果定义了任何限位，则该对象可用）：

source: `last_query["<endstop>"]`: Returns True if the given endstop was reported as "triggered" during the last QUERY_ENDSTOP command. Note, if this is used in a macro, due to the order of template expansion, the QUERY_ENDSTOP command must be run prior to the macro containing this reference.
hu: `last_query["<endstop>"]`: True értéket ad, ha az adott végálláskapcsolót az utolsó QUERY_ENDSTOP parancs során "triggered" -ként jelentették. Megjegyzés: ha ezt egy makróban használjuk, a sablon bővítési sorrendje miatt a QUERY_ENDSTOP parancsot akkor ezt a hivatkozást tartalmazó makró előtt kell lefuttatni.
ko: `last_query["<endstop>"]`: 지정된 엔드스톱이 마지막 QUERY_ENDSTOP 명령 중에 "트리거된" 것으로 보고된 경우 True를 반환합니다. 이것이 매크로에서 사용되는 경우 템플릿 확장 순서로 인해 QUERY_ENDSTOP 명령이 이 참조를 포함하는 매크로보다 먼저 실행되어야 합니다.
zh_hans: `last_query["<限位>"]`：如果在最后一次 QUERY_ENDSTOP 命令中，给定的 endstop 处于“触发”状态，则返回 True。注意，如果在宏中使用，由于模板扩展的顺序，QUERY_ENDSTOP 命令必须在包含这个引用的宏之前运行。

source: The following information is available in [servo some_name](Config_Reference.md#servo) objects:
hu: A következő információk a [szervó some_name](Config_Reference.md#servo) objektumokban érhetők el:
ko: 다음 정보는 [servo some_name](Config_Reference.md#servo) 개체에서 사용할 수 있습니다:
zh_hans: [servo some_name](Config_Reference.md#servo) 对象提供了以下信息：

source: `printer["servo <config_name>"].value`: The last setting of the PWM pin (a value between 0.0 and 1.0) associated with the servo.
hu: `printer["servo <config_name>"].value`: A szervóhoz tartozó PWM tű utolsó beállítása (0,0 és 1,0 közötti érték).
ko: `printer["servo <config_name>"].value`: 서보와 관련된 PWM 핀의 마지막 설정(0.0과 1.0 사이의 값).
zh_hans: `printer["servo <配置名>"].value`：与指定伺服相关 PWM 引脚的上一次设置的值（0.0 和 1.0 之间的值）。

source: The following information is available in the `system_stats` object (this object is always available):
hu: A következő információk a `system_stats` objektumban érhetők el (ez az objektum mindig elérhető):
ko: 다음 정보는 `system_stats` 개체에서 사용할 수 있습니다(이 개체는 항상 사용할 수 있음):
zh_hans: `system_stats` 对象提供了以下信息（该对象始终可用）：

source: `sysload`, `cputime`, `memavail`: Information on the host operating system and process load.
hu: `sysload`, `cputime`, `memavail`: Információ a gazdagép operációs rendszeréről és a folyamatok terheléséről.
ko: `sysload`, `cputime`, `memavail`: 호스트 운영 체제 및 프로세스 로드에 대한 정보입니다.
zh_hans: `sysload`、`cputime`、`memavail`：关于主机操作系统和进程负载的信息。

source: temperature sensors
hu: hőmérséklet érzékelők
zh_hans: 温度传感器

source: The following information is available in
hu: A következő információk a következő dokumentumban találhatók
ko: 다음 정보 사용할 수 있습니다
zh_hans: 以下信息可在

source: [bme280 config_section_name](Config_Reference.md#bmp280bme280bme680-temperature-sensor), [htu21d config_section_name](Config_Reference.md#htu21d-sensor), [lm75 config_section_name](Config_Reference.md#lm75-temperature-sensor), and [temperature_host config_section_name](Config_Reference.md#host-temperature-sensor) objects:
hu: [bme280 config_section_name](Config_Reference.md#bmp280bme280bme680-temperature-sensor), [htu21d config_section_name](Config_Reference.md#htu21d-sensor), [lm75 config_section_name](Config_Reference.md#lm75-temperature-sensor), és [temperature_host config_section_name](Config_Reference.md#host-temperature-sensor) objektumok:
ko: [bme280 config_section_name](Config_Reference.md#bmp280bme280bme680-temperature-sensor), [htu21d config_section_name](Config_Reference.md#htu21d-sensor), [lm75 config_section_name](Config_Reference.md#lm75-temperature-sensor), 그리고 [temperature_host config_section_name](Config_Reference.md#host-temperature-sensor) 객체에서:
zh_hans: [bme280 config_section_name](Config_Reference.md#bmp280bme280bme680-temperature-sensor)、[htu21d config_section_name](Config_Reference.md#htu21d-sensor)、[lm75 config_section_name](Config_Reference.md#lm75-temperature-sensor)和[temperature_host config_section_name](Config_Reference.md#host-temperature-sensor) 对象：

source: `temperature`: The last read temperature from the sensor.
hu: `temperature`: Az érzékelőtől utoljára kapott hőmérséklet.
ko: `temperature`: 센서에서 마지막으로 읽은 온도입니다.
zh_hans: `temperature`：上一次从传感器读取的温度。

source: `humidity`, `pressure`, `gas`: The last read values from the sensor (only on bme280, htu21d, and lm75 sensors).
hu: `humidity`, `pressure`, `gas`: Az érzékelőtől utoljára kapott értékek (csak a bme280, htu21d és lm75 érzékelők esetében).
ko: `humidity`, `pressure`, `gas`: 센서에서 마지막으로 읽은 값입니다 (bme280, htu21d 및 lm75 센서에만 해당).
zh_hans: `hemidity`、`pressure`和`gas`：传感器上一次读取的值（仅在bme280、htu21d和lm75传感器上）。

source: The following information is available in [temperature_fan some_name](Config_Reference.md#temperature_fan) objects:
hu: A következő információk a [temperature_fan some_name](Config_Reference.md#temperature_fan) objektumokban érhetők el:
ko: 다음 정보는 [temperature_fan some_name](Config_Reference.md#temperature_fan) 개체에서 사용할 수 있습니다:
zh_hans: [temperature_fan some_name](Config_Reference.md#temperature_fan) 对象提供了以下信息：

source: `target`: The target temperature for the fan.
hu: `target`: A ventilátor célhőmérséklete.
ko: `temperature`: 센서에서 마지막으로 읽은 온도입니다.
zh_hans: `target`：风扇目标温度。

source: The following information is available in [temperature_sensor some_name](Config_Reference.md#temperature_sensor) objects:
hu: A következő információk a [temperature_sensor some_name](Config_Reference.md#temperature_sensor) objektumokban érhetők el:
ko: 다음 정보는 [temperature_sensor some_name](Config_Reference.md#temperature_sensor) 개체에서 사용할 수 있습니다:
zh_hans: [temperature_sensor some_name](Config_Reference.md#temperature_sensor) 对象提供了以下信息：

source: `measured_min_temp`, `measured_max_temp`: The lowest and highest temperature seen by the sensor since the Klipper host software was last restarted.
hu: `measured_min_temp`, `measured_max_temp`: Az érzékelő által a Klipper gazdagép szoftver utolsó újraindítása óta mért legalacsonyabb és legmagasabb hőmérséklet.
ko: `measured_min_temp`, `measured_max_temp`: Klipper 호스트 소프트웨어가 마지막으로 다시 시작된 이후 센서에 표시되는 최저 및 최고 온도입니다.
zh_hans: `measured_min_temp`和`measured_max_temp`：自Klipper主机软件上次重新启动以来，传感器测量的最低和最高温度。

source: The following information is available in the `toolhead` object (this object is always available):
hu: A következő információk a `toolhead` objektumban érhetők el (ez az objektum mindig elérhető):
ko: `toolhead` 개체에서 다음 정보를 사용할 수 있습니다(이 개체는 항상 사용 가능):
zh_hans: `toolhead` 对象提供了以下信息（该对象始终可用）：

source: `position`: The last commanded position of the toolhead relative to the coordinate system specified in the config file. It is possible to access the x, y, z, and e components of this position (eg, `position.x`).
hu: `position`: A nyomtatófej utolsó parancsolt pozíciója a konfigurációs fájlban megadott koordináta rendszerhez képest. Lehetőség van ennek a pozíciónak az X, Y, Z és az E, komponenséhez hozzáférni (pl. `position.x`).
ko: `position`: 구성 파일에 지정된 좌표계에 상대적인 toolhead의 마지막 명령 위치입니다. 이 위치의 x, y, z 및 e 구성요소에 액세스하는 것이 가능합니다(예: `position.x`).

source: `extruder`: The name of the currently active extruder. For example, in a macro one could use `printer[printer.toolhead.extruder].target` to get the target temperature of the current extruder.
hu: `extruder`: A jelenleg aktív extruder neve. Például egy makróban használhatjuk a `printer[printer.toolhead.extruder].target` parancsot, hogy megkapjuk az aktuális extruder célhőmérsékletét.
ko: `extruder`: 현재 활성 압출기의 이름입니다. 예를 들어 매크로에서 `printer[printer.toolhead.extruder].target`을 사용하여 현재 압출기의 목표 온도를 얻을 수 있습니다.
zh_hans: `extruder`：当前活跃的挤出机的名称。例如，在宏中可以使用`printer[printer.toolhead.extruder].target`来获取当前挤出机的目标温度。

source: `homed_axes`: The current cartesian axes considered to be in a "homed" state. This is a string containing one or more of "x", "y", "z".
hu: `homed_axes`: Az aktuálisan "homed" állapotban lévőnek tekintett cartesian tengelyek. Ez egy karakterlánc, amely egy vagy több "X", "Y", "Z" értéket tartalmaz.
ko: `homed_axes`: "homed" 상태에 있는 것으로 간주되는 현재 직교 축입니다. "x", "y", "z" 중 하나 이상을 포함하는 문자열입니다.
zh_hans: `homed_axes`：当前被认为处于“已归位”状态的车轴。这是一个包含一个或多个"x"、"y"、"z"的字符串。

source: `axis_minimum`, `axis_maximum`: The axis travel limits (mm) after homing. It is possible to access the x, y, z components of this limit value (eg, `axis_minimum.x`, `axis_maximum.z`).
hu: `axis_minimum`, `axis_maximum`: A tengely mozgásának határai (mm) a kezdőpont felvétel után. Lehetőség van e határérték X, Y, Z összetevőinek elérésére (pl. `axis_minimum.x`, `axis_maximum.z`).
ko: `axis_minimum`, `axis_maximum`: 원점 복귀 후 축 이동 한계(mm). 이 제한 값의 x, y, z 구성 요소에 액세스할 수 있습니다 (예: `axis_minimum.x`, `axis_maximum.z`).
zh_hans: `axis_minimum`、`axis_maximum`：归位后的轴的行程限制（毫米）。可以访问此极限值的 x、y、z 分量（例如，`axis_minimum.x`、`axis_maximum.z`）。

source: `max_velocity`, `max_accel`, `max_accel_to_decel`, `square_corner_velocity`: The current printing limits that are in effect. This may differ from the config file settings if a `SET_VELOCITY_LIMIT` (or `M204`) command alters them at run-time.
hu: `max_velocity`, `max_accel`, `max_accel_to_decel`, `square_corner_velocity`: Az aktuálisan érvényben lévő nyomtatási korlátok. Ez eltérhet a konfigurációs fájl beállításaitól, ha a `SET_VELOCITY_LIMIT` (vagy `M204`) parancs megváltoztatja azokat használat közben.
ko: `max_velocity`, `max_accel`, `max_accel_to_decel`, `square_corner_velocity`: 유효한 현재 인쇄 제한입니다. 이는 `SET_VELOCITY_LIMIT`(또는 `M204`) 명령이 런타임에 변경하는 경우 구성 파일 설정과 다를 수 있습니다.
zh_hans: `max_velocity`、`max_accel`、`max_accel_to_decel`和`square_corner_velocity`：当前生效的打印机限制。如果 `SET_VELOCITY_LIMIT`（或 `M204`）命令在运行时改变它们，这些值可能与配置文件设置不同。

source: `stalls`: The total number of times (since the last restart) that the printer had to be paused because the toolhead moved faster than moves could be read from the G-Code input.
hu: `stalls`: Az összes alkalom száma (az utolsó újraindítás óta), amikor a nyomtatót szüneteltetni kellett, mert a nyomtatófej gyorsabban mozgott, mint ahány mozdulatot a G-kód bemenetről be lehetett olvasni.
ko: `stalls`: toolhead가 G-Code 입력에서 읽을 수 있는 것보다 빠르게 이동하여 프린터를 일시 중지해야 했던 총 횟수(마지막 다시 시작한 이후).
zh_hans: `stalls`：由于工具头移动速度快于从 G 代码输入读取的移动速度，因此打印机必须暂停的总次数（自上次重新启动以来）。

source: The following information is available in the [virtual_sdcard](Config_Reference.md#virtual_sdcard) object:
hu: A következő információk a [virtual_sdcard](Config_Reference.md#virtual_sdcard) objektumban érhetők el:
ko: [virtual_sdcard](Config_Reference.md#virtual_sdcard) 개체에서 다음 정보를 사용할 수 있습니다:
zh_hans: [virtual_sdcard](Config_Reference.md#virtual_sdcard)对象提供了以下信息：

source: `is_active`: Returns True if a print from file is currently active.
hu: `is_active`: True értéket ad, ha a fájlból való nyomtatás aktív.
ko: `is_active`: 파일에서 인쇄가 현재 활성화되어 있으면 True를 반환합니다.
zh_hans: `is_active`：如果正在从文件进行打印，则返回 True。

source: `progress`: An estimate of the current print progress (based of file size and file position).
hu: `progressz`: A nyomtatás aktuális előrehaladásának becslése (a fájlméret és a fájl pozíciója alapján).
ko: `progress`: 현재 인쇄 진행률 추정치(파일 크기 및 파일 위치 기반).
zh_hans: `progress`：对当前打印进度的估计（基于文件大小和文件位置）。

source: `file_position`: The current position (in bytes) of an active print.
hu: `file_position`: Az aktív nyomtatás aktuális pozíciója (bájtokban).
ko: `file_path`: 현재 로드된 파일의 전체 경로입니다.
zh_hans: `file_position`：当前打印的位置（以字节为单位）。

source: The following information is available in the `webhooks` object (this object is always available):
hu: A következő információk a `webhooks` objektumban érhetők el (ez az objektum mindig elérhető):
ko: `webhooks` 객체에서 다음 정보를 사용할 수 있습니다(이 객체는 항상 사용 가능):
zh_hans: `system_stats` 对象提供了以下信息（该对象始终可用）：

source: `state`: Returns a string indicating the current Klipper state. Possible values are: "ready", "startup", "shutdown", "error".
hu: `state`: A Klipper aktuális állapotát jelző karakterláncot adja vissza. A lehetséges értékek: "ready", "startup", "shutdown", "error".
ko: `state`: 현재 Klipper 상태를 나타내는 문자열을 반환합니다. 가능한 값은 "ready", "startup", "shutdown", "error"입니다.
zh_hans: `state`：返回一个表示当前 Klipper 状态的字符串。可能的值为："ready"、"startup"、"shutdown"和"error"。

source: `state_message`: A human readable string giving additional context on the current Klipper state.
hu: `state_message`: Egy ember által olvasható karakterlánc, amely további kontextust ad az aktuális Klipper állapotról.
ko: `state_message`: 현재 Klipper 상태에 대한 추가 컨텍스트를 제공하는 사람이 읽을 수 있는 문자열입니다.
zh_hans: `state_message`：提供了一个包含当前 Klipper 状态和上下文的可读字符串。

source: The following information is available in the `z_tilt` object (this object is available if z_tilt is defined):
hu: A következő információk a `z_tilt` objektumban érhetők el (ez az objektum akkor érhető el, ha a z_tilt definiálva van):
ko: 다음 정보는 `z_tilt` 개체에서 사용할 수 있습니다(이 개체는 z_tilt가 정의된 경우 사용할 수 있음):
zh_hans: `z_tilt` 对象提供了以下信息（如果定义了 z_tilt，则该对象可用）：

source: `applied`: True if the z-tilt leveling process has been run and completed successfully.
hu: `applied`: True, ha a Z végállás kiegyenlítési folyamat lefutott és sikeresen befejeződött.
ko: `applied`: z-tilt 레벨링 프로세스가 성공적으로 실행되고 완료된 경우 True 입니다.
zh_hans: `applied`：如果 z 倾斜调平过程已运行并成功完成，则为 True。

source: The following information is available in [dual_carriage](Config_Reference.md#dual_carriage) on a hybrid_corexy or hybrid_corexz robot
hu: A következő információk a [dual_carriage](Config_Reference.md#dual_carriage) alatt érhetőek el egy hybrid_corexy vagy hybrid_corexz gép esetében
ko: 다음 정보는 hybrid_corexy 또는 hybrid_corexz 로봇의 [dual_carriage](Config_Reference.md#dual_carriage)에서 확인할 수 있습니다

source: `mode`: The current mode. Possible values are: "FULL_CONTROL"
hu: `mode`: Az aktuális üzemmód. A lehetséges értékek: "FULL_CONTROL"
ko: `mode`: 현재 모드. 가능한 값은 "FULL_CONTROL"입니다

source: `active_carriage`: The current active carriage. Possible values are: "CARRIAGE_0", "CARRIAGE_1"
hu: `active_carriage`: Az aktuális aktív kocsi. Lehetséges értékek: "CARRIAGE_0", "CARRIAGE_1"
ko: `active_carriage`: 현재 활성 캐리지입니다. 가능한 값은 "CARRIAGE_0", "CARRIAGE_1"입니다

source: `file_path`: A full path to the file of currently loaded file.
hu: `file_path`: Az aktuálisan betöltött fájl teljes elérési útja.
ko: `file_path`: 현재 로드된 파일의 전체 경로입니다.

source: `file_size`: The file size (in bytes) of currently loaded file.
hu: `file_size`: Az aktuálisan betöltött fájl mérete (bájtokban).
ko: `file_path`: 현재 로드된 파일의 전체 경로입니다.

source: Status reference
hu: Állapot referencia

source: The following information is available in the `motion_report` object (this object is automatically available if any stepper config section is defined):
hu: A következő információk a `motion_report` objektumban érhetők el (ez az objektum automatikusan elérhető, ha bármilyen stepper konfigurációs szakasz definiálva van):
ko: `motion_report` 개체에서 다음 정보를 사용할 수 있습니다 (이 개체는 스테퍼 구성 섹션이 정의된 경우 자동으로 사용할 수 있음):

source: `live_position`: The requested toolhead position interpolated to the current time.
hu: `live_position`: A nyomtatófej kért pozíciója az aktuális időre interpolálva.
ko: `live_position`: 현재 시간으로 보간된 요청된 toolhead 위치입니다.

source: `live_velocity`: The requested toolhead velocity (in mm/s) at the current time.
hu: `live_velocity`: A nyomtatófej kért sebessége (mm/sec-ben) az aktuális időpontban.
ko: `live_velocity`: 현재 시간에 요청된 toolhead 속도(mm/s)입니다.

source: `live_extruder_velocity`: The requested extruder velocity (in mm/s) at the current time.
hu: `live_extruder_velocity`: A kért extruder sebesség (mm/sec-ben) az aktuális időpontban.
ko: `live_extruder_velocity`: 현재 시간에 요청된 압출기 속도(mm/s)입니다.
