Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Status_Reference.po
Languages: hu, ko, zh_hans

source: This document is a reference of printer status information available in Klipper [macros](Command_Templates.md), [display fields](Config_Reference.md#display), and via the [API Server](API_Server.md).
hu: Ez a dokumentum a Klipper [makrók](Command_Templates.md), [megjelenítési mezők](Config_Reference.md#display) és az [API Szerver](API_Server.md) segítségével elérhető nyomtató állapotinformációk referenciája.
ko: 이 문서는 Klipper [매크로](Command_Templates.md), [디스플레이 필드](Config_Reference.md#display) 및 [API 서버](API_Server.md)를 통해 사용할 수 있는 프린터 상태 정보에 대한 참조입니다.
zh_hans: 本文档是可用于 Klipper [宏](Command_Templates.md)、[显示字段](Config_Reference.md#display)以及[API服务器](API_Server.md) 的打印机状态信息的参考。

source: The fields in this document are subject to change - if using an attribute be sure to review the [Config Changes document](Config_Changes.md) when upgrading the Klipper software.
hu: Az ebben a dokumentumban szereplő mezők változhatnak. Ha egy attribútumot használ, a Klipper szoftver frissítésekor mindenképpen nézze át a [Konfigurációs változások dokumentumot](Config_Changes.md).
ko: 이 문서의 필드는 변경될 수 있습니다. 속성을 사용하는 경우 Klipper 소프트웨어를 업그레이드할 때 [구성 변경 문서](Config_Changes.md)를 검토해야 합니다.
zh_hans: 本文档中的字段可能会发生变化 - 如果使用了任何字段，在更新 Klipper 时，请务必查看[配置变化文档](Config_Changes.md)。

source: The following information is available in the [bed_mesh](Config_Reference.md#bed_mesh) object:
hu: A következő információk a [bed_mesh](Config_Reference.md#bed_mesh) objektumban érhetők el:
ko: [bed_mesh](Config_Reference.md#bed_mesh) 개체에서 다음 정보를 사용할 수 있습니다:
zh_hans: [bed_mesh](Config_Reference.md#bed_mesh) 对象中提供了以下信息：

source: `profile_name`, `mesh_min`, `mesh_max`, `probed_matrix`, `mesh_matrix`: Information on the currently active bed_mesh.
hu: `profile_name`, `mesh_min`, `mesh_max`, `probed_matrix`, `mesh_matrix`: Az aktuálisan aktív bed_mesh-re vonatkozó információk.
ko: `profile_name`, `mesh_min`, `mesh_max`, `probed_matrix`, `mesh_matrix`: 현재 활성화된 bed_mesh에 대한 정보입니다.
zh_hans: `profile_name`、`mesh_min`、`mesh_max`、`probed_matrix`、`mesh_matrix`：关于当前活跃的 bed_mesh 配置信息。

source: The following information is available in the `configfile` object (this object is always available):
hu: A következő információk a `configfile` objektumban találhatók (ez az objektum mindig elérhető):
ko: `configfile` 객체에서 다음 정보를 사용할 수 있습니다(이 객체는 항상 사용할 수 있음):
zh_hans: `configfile` 对象中提供了以下信息（该对象始终可用）：

source: `settings.<section>.<option>`: Returns the given config file setting (or default value) during the last software start or restart. (Any settings changed at run-time will not be reflected here.)
hu: `settings.<section>.<option>`: Visszaadja az adott konfigurációs fájl beállítását (vagy alapértelmezett értékét) a szoftver utolsó indítása vagy újraindítása során. (A használat közben megváltoztatott beállítások nem jelennek meg itt.)
ko: `settings.<section>.<option>`: 마지막 소프트웨어 시작 또는 다시 시작 중에 지정된 구성 파일 설정(또는 기본값)을 반환합니다. (런타임에 변경된 설정은 여기에 반영되지 않습니다.)
zh_hans: `settings.<分段>.<选项>`：返回最后一次软件启动或重启时给定的配置文件设置（或默认值）。(不会反映运行时的修改。）

source: `config.<section>.<option>`: Returns the given raw config file setting as read by Klipper during the last software start or restart. (Any settings changed at run-time will not be reflected here.) All values are returned as strings.
hu: `config.<section>.<option>`: Visszaadja az adott nyers konfigurációs fájl beállítását, ahogyan azt a Klipper a legutóbbi szoftverindítás vagy újraindítás során beolvasta. (A működés közben megváltoztatott beállítások nem jelennek meg itt.) Minden értéket stringként ad vissza.
ko: `config.<section>.<option>`: 마지막 소프트웨어 시작 또는 다시 시작 중에 Klipper가 읽은 대로 주어진 원시 구성 파일 설정을 반환합니다. (런타임에 변경된 설정은 여기에 반영되지 않습니다.) 모든 값은 문자열로 반환됩니다.
zh_hans: `config.<分段>.<选项>`：返回Klipper在上次软件启动或重启时读取的原始配置文件设置。(不会反映运行时的修改。)所有值都以字符串形式返回。

source: The following information is available in the `display_status` object (this object is automatically available if a [display](Config_Reference.md#display) config section is defined):
hu: A következő információk a `display_status` objektumban érhetők el (ez az objektum automatikusan elérhető, ha a [kijelző](Config_Reference.md#display) konfigurációs szakasz definiálva van):
ko: 다음 정보는 `display_status` 개체에서 사용할 수 있습니다 (이 개체는 [display](Config_Reference.md#display) 구성 섹션이 정의된 경우 자동으로 사용할 수 있음):
zh_hans: `display_status` 对象中提供以下信息（如果定义了 [display](Config_Reference.md#display) 配置分段，则该对象自动可用）：

source: `progress`: The progress value of the last `M73` G-Code command (or `virtual_sdcard.progress` if no recent `M73` received).
hu: `progress`: A legutóbbi `M73` G-kód parancs progress értéke (vagy `virtual_sdcard.progress`, ha nem érkezett legutóbbi `M73`).
ko: `progress`: 마지막 `M73` G-Code 명령의 진행 값 (또는 최근 'M73'이 수신되지 않은 경우 `virtual_sdcard.progress` ).
zh_hans: `progress`：最后一个 `M73` G代码命令报告的进度（如果没有收到`M73`，则会用`virtual_sdcard.progress`替代）。

source: `message`: The message contained in the last `M117` G-Code command.
hu: `message`: Az utolsó `M117` G-kódú parancsban szereplő üzenet.
ko: `message`: 마지막 `M117` G-Code 명령에 포함된 메시지입니다.
zh_hans: `message`：最后一条 `M117` G代码命令中包含的消息。

source: The following information is available in the [endstop_phase](Config_Reference.md#endstop_phase) object:
hu: A következő információk az [endstop_phase](Config_Reference.md#endstop_phase) objektumban érhetők el:
ko: [endstop_phase](Config_Reference.md#endstop_phase) 개체에서 다음 정보를 사용할 수 있습니다:
zh_hans: [endstop_phase](Config_Reference.md#endstop_phase) 对象中提供了以下信息：

source: `last_home.<stepper name>.phase`: The phase of the stepper motor at the end of the last home attempt.
hu: `last_home.<stepper name>.phase`: A léptetőmotor fázisa az utolsó kezdőpont felvételi kísérlet végén.
ko: `last_home.<stepper name>.phase`: 마지막 홈 시도 종료 시 스테퍼 모터의 위상입니다.
zh_hans: `last_home.<步进电机名>.phase`：最后一次归为尝试结束时步进电机的相位。

source: `last_home.<stepper name>.phases`: The total number of phases available on the stepper motor.
hu: `last_home.<stepper name>.phases`: A léptetőmotoron rendelkezésre álló fázisok száma.
ko: `last_home.<stepper name>.phases`: 스테퍼 모터에서 사용할 수 있는 총 위상 수입니다.
zh_hans: `last_home.<步进电机名称>.phase`：步进电机上可用的总相数。

source: `last_home.<stepper name>.mcu_position`: The position (as tracked by the micro-controller) of the stepper motor at the end of the last home attempt. The position is the total number of steps taken in a forward direction minus the total number of steps taken in the reverse direction since the micro-controller was last restarted.
hu: `last_home.<stepper name>.mcu_position`: A léptetőmotor pozíciója (ahogyan azt a mikrokontroller követi) a legutóbbi kezdőpont felvételi kísérlet végén. A pozíció az előremenő irányban megtett lépések száma mínusz a mikrokontroller utolsó újraindítása óta visszafelé megtett lépések számával.
ko: `last_home.<stepper name>.mcu_position`: 마지막 홈 시도가 끝날 때 스테퍼 모터의 위치(마이크로 컨트롤러에 의해 추적됨)입니다. 위치는 마이크로 컨트롤러가 마지막으로 다시 시작된 이후 순방향으로 취한 총 단계 수에서 역방향으로 취한 총 단계 수를 뺀 것입니다.
zh_hans: `last_home.<步进电机名称>.mcu_position`：步进电机在上次归位尝试结束时的位置（由微控制器跟踪）。该位置是自微控制器最后一次重启以来，向前走的总步数减去反向走的总步数。

source: The following information is available in [fan](Config_Reference.md#fan), [heater_fan some_name](Config_Reference.md#heater_fan) and [controller_fan some_name](Config_Reference.md#controller_fan) objects:
hu: A következő információk a [ventilátor](Config_Reference.md#fan), [heater_fan some_name](Config_Reference.md#heater_fan) és [controller_fan some_name](Config_Reference.md#controller_fan) objektumokban érhetők el:
ko: 다음 정보는 [fan](Config_Reference.md#fan), [heater_fan some_name](Config_Reference.md#heater_fan) 및 [controller_fan some_name](Config_Reference.md#controller_fan) 개체에서 사용할 수 있습니다:
zh_hans: [fan](Config_Reference.md#fan)、[heater_fan some_name](Config_Reference.md#heater_fan)和[controller_fan some_name](Config_Reference.md#controller_fan)对象提供了以下信息：

source: `speed`: The fan speed as a float between 0.0 and 1.0.
hu: `speed`: A ventilátor fordulatszáma lebegőértékben 0.0 és 1.0 között.
ko: `speed`: 0.0에서 1.0 사이의 부동 소수점으로 팬 속도입니다.
zh_hans: `speed`：风扇速度，0.0和1.0之间的浮点数。

source: `rpm`: The measured fan speed in rotations per minute if the fan has a tachometer_pin defined.
hu: `rpm`: A ventilátor mért fordulatszáma percenkénti fordulatszámban, ha a ventilátor rendelkezik tachometer_pin kimenettel.
ko: `rpm`: 팬에 tachometer_pin이 정의되어 있는 경우 측정된 팬 속도(분당 회전수).
zh_hans: `rpm`：如果风扇有一个 tachometer_pin，则测量的风扇速度，单位是每分钟转数。

source: The following information is available in [filament_switch_sensor some_name](Config_Reference.md#filament_switch_sensor) objects:
hu: A következő információk a [filament_switch_sensor some_name](Config_Reference.md#filament_switch_sensor) objektumokban érhetők el:
ko: 다음 정보는 [filament_switch_sensor some_name](Config_Reference.md#filament_switch_sensor) 개체에서 사용할 수 있습니다:
zh_hans: [filament_switch_sensor some_name](Config_Reference.md#filament_switch_sensor) 对象提供了以下信息：

source: `enabled`: Returns True if the switch sensor is currently enabled.
hu: `enabled`: True értéket ad vissza, ha a kapcsoló engedélyezve van.
ko: `enabled`: 스위치 센서가 현재 활성화되어 있으면 True를 반환합니다.
zh_hans: `enabled`：如果开关传感器当前已启用，则返回True。

source: `filament_detected`: Returns True if the sensor is in a triggered state.
hu: `filament_detected`: True értéket ad ha az érzékelő kioldott állapotban van.
ko: `filament_detected`: 센서가 트리거된 상태에 있으면 True를 반환합니다.
zh_hans: `filament_detected`：如果传感器处于触发状态，则返回 True。

source: The following information is available in [filament_motion_sensor some_name](Config_Reference.md#filament_motion_sensor) objects:
hu: A következő információk a [filament_motion_sensor some_name](Config_Reference.md#filament_motion_sensor) objektumokban érhetők el:
ko: 다음 정보는 [filament_motion_sensor some_name](Config_Reference.md#filament_motion_sensor) 개체에서 사용할 수 있습니다:
zh_hans: [filament_motion_sensor 传感器名](Config_Reference.md#filament_motion_sensor) 对象提供了以下信息：

source: `enabled`: Returns True if the motion sensor is currently enabled.
hu: `enabled`: True értéket ad, ha a mozgásérzékelő engedélyezve van.
ko: `enabled`: 모션 센서가 현재 활성화되어 있으면 True를 반환합니다.
zh_hans: `enabled`：如果当前启用了运动传感器，则返回 True。

source: The following information is available in the [firmware_retraction](Config_Reference.md#firmware_retraction) object:
hu: A következő információk a [firmware_retraction](Config_Reference.md#firmware_retraction) objektumban találhatók:
ko: [firmware_retraction](Config_Reference.md#firmware_retraction) 개체에서 다음 정보를 사용할 수 있습니다:
zh_hans: [firmware_retraction](Config_Reference.md#firmware_retraction) 对象提供了以下信息：

source: `retract_length`, `retract_speed`, `unretract_extra_length`, `unretract_speed`: The current settings for the firmware_retraction module. These settings may differ from the config file if a `SET_RETRACTION` command alters them.
hu: `retract_length`, `retract_speed`, `unretract_extra_length`, `unretract_speed`: A firmware_retraction modul aktuális beállításai. Ezek a beállítások eltérhetnek a konfigurációs állománytól, ha a `SET_RETRACTION` parancs megváltoztatja őket.
ko: `retract_length`, `retract_speed`, `unretract_extra_length`, `unretract_speed`: Firmware_retraction 모듈의 현재 설정입니다. 이 설정은 `SET_RETRACTION` 명령이 변경하는 경우 구성 파일과 다를 수 있습니다.
zh_hans: `retract_length`、`retract_speed`、`unretract_extra_length`、`unretract_speed`：firmware_retraction 模块的当前设置。如果 `SET_RETRACTION` 命令改变它们，这些设置可能与配置文件不同。

source: The following information is available in [gcode_macro some_name](Config_Reference.md#gcode_macro) objects:
hu: A következő információk a [gcode_macro some_name](Config_Reference.md#gcode_macro) objektumokban érhetők el:
ko: 다음 정보는 [gcode_macro some_name](Config_Reference.md#gcode_macro) 개체에서 사용할 수 있습니다:
zh_hans: [gcode_macro <名称>](Config_Reference.md#gcode_macro) 对象提供了以下信息：

source: `<variable>`: The current value of a [gcode_macro variable](Command_Templates.md#variables).
hu: `<variable>`: Egy [gcode_macro változó](Command_Templates.md#variables) aktuális értéke.
ko: `<variable>`: [gcode_macro 변수](Command_Templates.md#variables)의 현재 값입니다.
zh_hans: `<变量名>`：[gcode_macro 变量](Command_Templates.md#variables) 的当前值。

source: The following information is available in the `gcode_move` object (this object is always available):
hu: A következő információk a `gcode_move` objektumban érhetők el (ez az objektum mindig elérhető):
ko: `gcode_move` 개체에서 다음 정보를 사용할 수 있습니다(이 개체는 항상 사용 가능):
zh_hans: `gcode_move` 对象中提供了以下信息（该对象始终可用）：

source: `gcode_position`: The current position of the toolhead relative to the current G-Code origin. That is, positions that one might directly send to a `G1` command. It is possible to access the x, y, z, and e components of this position (eg, `gcode_position.x`).
hu: `gcode_position`: A nyomtatófej aktuális pozíciója az aktuális G-kód origóhoz képest. Vagyis olyan pozíciók, amelyeket közvetlenül egy `G1` parancsnak küldhetünk. Lehetőség van e pozíció X, Y, Z és az E, komponensének elérésére (pl. `gcode_position.x`).
ko: `gcode_position`: 현재 G-Code 원점을 기준으로 한 툴헤드의 현재 위치입니다. 즉, `G1` 명령에 직접 보낼 수 있는 위치입니다. 이 위치의 x, y, z, e 구성요소에 액세스하는 것이 가능합니다 (예: `gcode_position.x`).
zh_hans: `gcode_position`：工具头相对于当前 G 代码原点的当前位置。也就是可以直接被发送到`G1`命令的位置。可以分别访问这个位置的x、y、z和e分量（例如，`gcode_position.x`）。

source: `position`: The last commanded position of the toolhead using the coordinate system specified in the config file. It is possible to access the x, y, z, and e components of this position (eg, `position.x`).
hu: `position`: A nyomtatófej utolsó kiadott pozíciója a konfigurációs fájlban megadott koordináta rendszerrel. Lehetőség van ennek a pozíciónak az X, Y, Z és az E, komponenséhez hozzáférni (pl. `position.x`).
ko: `position`: 구성 파일에 지정된 좌표계를 사용하여 도구 헤드의 마지막으로 명령된 위치입니다. 이 위치의 x, y, z 및 e 구성요소에 액세스하는 것이 가능합니다(예: `position.x`).

source: `homing_origin`: The origin of the gcode coordinate system (relative to the coordinate system specified in the config file) to use after a `G28` command. The `SET_GCODE_OFFSET` command can alter this position. It is possible to access the x, y, and z components of this position (eg, `homing_origin.x`).
hu: `homing_origin`: A G-kód koordináta rendszer origója (a config fájlban megadott koordináta rendszerhez képest), amelyet a `G28` parancs után használni kell. A `SET_GCODE_OFFSET` parancs megváltoztathatja ezt a pozíciót. Lehetőség van ennek a pozíciónak az X, Y és Z komponenséhez hozzáférni (pl. `homing_origin.x`).
ko: `homing_origin`: `G28` 명령 이후에 사용할 gcode 좌표계(구성 파일에 지정된 좌표계에 상대적)의 원점입니다. `SET_GCODE_OFFSET` 명령은 이 위치를 변경할 수 있습니다. 이 위치의 x, y 및 z 구성요소(예: `homing_origin.x`)에 액세스할 수 있습니다.
zh_hans: `homing_origin`：在`G28`命令之后要使用的 G-Code 坐标系的原点（相对于配置文件中定义的坐标系）。`SET_GCODE_OFFSET` 命令可以改变这个位置。可以分别访问这个位置的x、y和z分量（例如，`homing_origin.x`）。

source: `speed`: The last speed set in a `G1` command (in mm/s).
hu: `speed`: Az utolsó, `G1` parancsban beállított sebesség (mm/sec-ben).
ko: `speed`: `G1` 명령에서 마지막으로 설정한 속도(mm/s)입니다.
zh_hans: `speed`：在`G1`命令中最后一次设定的速度（单位：mm/s）。

source: `speed_factor`: The "speed factor override" as set by an `M220` command. This is a floating point value such that 1.0 means no override and, for example, 2.0 would double requested speed.
hu: `speed_factor`: Az `M220` parancs által beállított "sebességtényező felülbírálása". Ez egy lebegőpontos érték, így 1.0 azt jelenti, hogy nincs felülbírálat, és például a 2.0 megduplázza a kért sebességet.
ko: `speed_factor`: `M220` 명령으로 설정한 "speed factor override"입니다. 1.0은 재정의가 없음을 의미하고 예를 들어 2.0은 요청된 속도의 두 배인 부동 소수점 값입니다.
zh_hans: `speed_factor`：通过 `M220` 命令设置的"速度因子覆盖"。这是一个浮点值，1.0 意味着没有覆盖，例如，2.0 将请求的速度翻倍。

source: `extrude_factor`: The "extrude factor override" as set by an `M221` command. This is a floating point value such that 1.0 means no override and, for example, 2.0 would double requested extrusions.
hu: `extrude_factor`: Az `M221` parancs által beállított "extrude factor override". Ez egy lebegőpontos érték, így 1.0 azt jelenti, hogy nincs felülbírálat, és például a 2.0 megduplázza a kért extrudálásokat.
ko: `extrude_factor`: `M221` 명령으로 설정한 "extrude factor override"입니다. 1.0은 재정의가 없음을 의미하고 예를 들어 2.0은 요청된 돌출을 두 배로 만드는 부동 소수점 값입니다.
zh_hans: `extrude_factor`：由`M221`命令设置的"挤出倍率覆盖" 。这是一个浮点值，1.0意味着没有覆盖，例如，2.0将使要求的挤出量翻倍。

source: `absolute_coordinates`: This returns True if in `G90` absolute coordinate mode or False if in `G91` relative mode.
hu: `absolute_coordinates`: True értéket ad, ha a `G90` abszolút koordináta módban van, vagy False értéket, ha a `G91` relatív módban van.
ko: `absolute_coordinates`: 이것은 `G90` 절대 좌표 모드에 있으면 True를 반환하고 `G91` 상대 모드에 있으면 False를 반환합니다.
zh_hans: `absolute_coordinates`：如果在 `G90` 绝对坐标模式下，则返回 True；如果在 `G91` 相对模式下，则返回 False。

source: `absolute_extrude`: This returns True if in `M82` absolute extrude mode or False if in `M83` relative mode.
hu: `absolute_extrude`: True értéket ad, ha az `M82` abszolút extrude módban van, vagy False értéket, ha az `M83` relatív módban van.
ko: `absolute_extrude`: 이것은 `M82` 절대 돌출 모드인 경우 True를 반환하고 `M83` 상대 모드인 경우 False를 반환합니다.
zh_hans: `absolute_extrude`：如果在`M82`绝对挤出模式，则返回True；如果在`M83`相对模式，则返回False。

source: The following information is available in the [hall_filament_width_sensor](Config_Reference.md#hall_filament_width_sensor) object:
hu: A következő információk a [hall_filament_width_sensor](Config_Reference.md#hall_filament_width_sensor) objektumban érhetők el:
ko: [hall_filament_width_sensor](Config_Reference.md#hall_filament_width_sensor) 개체에서 다음 정보를 사용할 수 있습니다:
zh_hans: [hall_filament_width_sensor](Config_Reference.md#hall_filament_width_sensor) 对象提供了以下信息：

source: `is_active`: Returns True if the sensor is currently active.
hu: `is_active`: True értéket ad, ha az érzékelő jelenleg aktív.
ko: `is_active`: 센서가 현재 활성 상태이면 True를 반환합니다.
zh_hans: `is_active`：如果传感器当前处于活动状态，返回True。

source: The following information is available for heater objects such as [extruder](Config_Reference.md#extruder), [heater_bed](Config_Reference.md#heater_bed), and [heater_generic](Config_Reference.md#heater_generic):
hu: A következő információk az olyan fűtőelemekhez állnak rendelkezésre, mint az [extruder](Config_Reference.md#extruder), [heater_bed](Config_Reference.md#heater_bed) és [heater_generic](Config_Reference.md#heater_generic):
ko: [extruder](Config_Reference.md#extruder), [heater_bed](Config_Reference.md#heater_bed) 및 [heater_generic](Config_Reference.md#heater_generic)과 같은 히터 개체에 대해 다음 정보를 사용할 수 있습니다:
zh_hans: 加热器对象，如[extruder](Config_Reference.md#extruder)、[heater_bed](Config_Reference.md#heater_bed)和[heater_generic](Config_Reference.md#heater_generic)，提供了以下信息：

source: `temperature`: The last reported temperature (in Celsius as a float) for the given heater.
hu: `temperature`: Az adott fűtőberendezés legutóbb jelentett hőmérséklete (Celsiusban, lebegőértékben).
ko: `temperature`: 지정된 히터에 대해 마지막으로 보고된 온도(섭씨 부동 소수점)입니다.
zh_hans: `temperature`：给定加热器最后报告的温度（以摄氏度为单位的浮点数）。

source: `target`: The current target temperature (in Celsius as a float) for the given heater.
hu: `target`: Az adott fűtőberendezés aktuális célhőmérséklete (Celsiusban, lebegőértékben).
ko: `target`: 지정된 히터에 대한 현재 목표 온도 (섭씨 부동 소수점)입니다.
zh_hans: `target`：给定加热器的当前目标温度（以摄氏度为单位的浮点数）。

source: `power`: The last setting of the PWM pin (a value between 0.0 and 1.0) associated with the heater.
hu: `power`: A fűtőtesthez tartozó PWM-tű utolsó értéke (0,0 és 1,0 közötti érték).
ko: `power`: 히터와 관련된 PWM 핀의 마지막 설정 (0.0에서 1.0 사이의 값).
zh_hans: `power`：与加热器相关的 PWM 引脚的最后设置（0.0和1.0之间的数值）。

source: `can_extrude`: If extruder can extrude (defined by `min_extrude_temp`), available only for [extruder](Config_Reference.md#extruder)
hu: `can_extrude`: Ha az extruder tud extrudálni (`min_extrude_temp` határozza meg), csak az [extruder](Config_Reference.md#extruder) esetében elérhető
ko: `can_extrude`: Extruder가 압출할 수 있는 경우 (`min_extrude_temp`로 정의), [extruder](Config_Reference.md#extruder)에만 사용 가능
zh_hans: `can_extrude`：挤出机是否可以挤出（由`min_extrude_temp`定义），仅可用于[extruder](Config_Reference.md#extruder)

source: The following information is available in the `heaters` object (this object is available if any heater is defined):
hu: A következő információk a `heaters` objektumban érhetők el (ez az objektum akkor érhető el, ha bármilyen fűtőberendezés definiálva van):
ko: `heaters` 개체에서 다음 정보를 사용할 수 있습니다 (이 개체는 히터가 정의된 경우 사용할 수 있음):
zh_hans: `heaters` 对象中提供以下信息（如果定义了任何加热器，则该对象可用）：

source: `available_heaters`: Returns a list of all currently available heaters by their full config section names, e.g. `["extruder", "heater_bed", "heater_generic my_custom_heater"]`.
hu: `available_heaters`: Visszaadja az összes jelenleg elérhető fűtőberendezés listáját a teljes config szekció nevével, pl. `["extruder", "heater_bed", "heater_generic my_custom_heater"]`.
ko: `available_heaters`: 전체 구성 섹션 이름별로 현재 사용 가능한 모든 히터 목록을 반환합니다. 예. `["extruder", "heater_bed", "heater_generic my_custom_heater"]`.
zh_hans: `available_heaters`：返回所有当前可用加热器的完整配置分段名称，例如 `["extruder"、"heater_bed"、"heater_generic my_custom_heater"]`。

source: `available_sensors`: Returns a list of all currently available temperature sensors by their full config section names, e.g. `["extruder", "heater_bed", "heater_generic my_custom_heater", "temperature_sensor electronics_temp"]`.
hu: `available_sensors`: Visszaadja az összes jelenleg elérhető hőmérséklet érzékelő listáját a teljes config szekció nevével, pl. `["extruder", "heater_bed", "heater_generic my_custom_heater", "temperature_sensor electronics_temp"]`.
ko: `available_sensors`: 전체 구성 섹션 이름별로 현재 사용 가능한 모든 온도 센서 목록을 반환합니다. 예. `["extruder", "heater_bed", "heater_generic my_custom_heater", "temperature_sensor electronics_temp"]`.
zh_hans: `available_sensors`：返回所有当前可用的温度传感器的完整配置分段名称列表，例如：`["extruder", "heater_bed", "heater_generic my_custom_heater", "temperature_sensor electronics_temp"] `。

source: The following information is available in the [idle_timeout](Config_Reference.md#idle_timeout) object (this object is always available):
hu: A következő információk az [idle_timeout](Config_Reference.md#idle_timeout) objektumban érhetők el (ez az objektum mindig elérhető):
ko: 다음 정보는 [idle_timeout](Config_Reference.md#idle_timeout) 개체에서 사용할 수 있습니다(이 개체는 항상 사용 가능):
zh_hans: [idle_timeout](Config_Reference.md#idle_timeout) 对象中提供了以下信息（该对象始终可用）：

source: `state`: The current state of the printer as tracked by the idle_timeout module. It is one of the following strings: "Idle", "Printing", "Ready".
hu: `state`: A nyomtató aktuális állapota, amelyet az idle_timeout modul követ. A következő karakterláncok egyike: "Idle", "Printing", "Ready".
ko: `state`: idle_timeout 모듈에서 추적한 프린터의 현재 상태입니다. "Idle", "Printing", "Ready" 문자열 중 하나입니다.
zh_hans: `state`：由 idle_timeout 模块跟踪的打印机的当前状态。它可以是以下字符串之一："Idle", "Printing", "Ready"。

source: `printing_time`: The amount of time (in seconds) the printer has been in the "Printing" state (as tracked by the idle_timeout module).
hu: `printing_time`: Az az idő (másodpercben), amíg a nyomtató "nyomtatás" állapotban volt (ahogyan azt az idle_timeout modul követi).
ko: `printing_time`: 프린터가 "인쇄 중" 상태에 있었던 시간(초)입니다 (idle_timeout 모듈에 의해 추적됨).
zh_hans: `printing_time`：打印机处于“Printing”状态的时间（以秒为单位）（由 idle_timeout 模块跟踪）。

source: The following information is available in [mcu](Config_Reference.md#mcu) and [mcu some_name](Config_Reference.md#mcu-my_extra_mcu) objects:
hu: A következő információk az [mcu](Config_Reference.md#mcu) és [mcu some_name](Config_Reference.md#mcu-my_extra_mcu) objektumokban érhetők el:
ko: 다음 정보는 [mcu](Config_Reference.md#mcu) 및 [mcu some_name](Config_Reference.md#mcu-my_extra_mcu) 개체에서 사용할 수 있습니다:
zh_hans: [mcu](Config_Reference.md#mcu)和[mcu 名称](Config_Reference.md#mcu-my_extra_mcu)对象中提供了以下信息。

source: `mcu_version`: The Klipper code version reported by the micro-controller.
hu: `mcu_version`: A mikrokontroller által jelentett Klipper kód verziója.
ko: `mcu_version`: 마이크로 컨트롤러에서 보고한 Klipper 코드 버전입니다.
zh_hans: `mcu_version`：由微控制器报告的 Klipper 代码版本。
