Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Status_Reference.po
Languages: hu, ko, zh_hans

source: `save_config_pending`: Returns true if there are updates that a `SAVE_CONFIG` command may persist to disk.
hu: `save_config_pending`: True értéket ad, ha vannak olyan frissítések, amelyeket a `SAVE_CONFIG` parancs a lemezen is megőrizhet.

source: `warnings`: A list of warnings about config options. Each entry in the list will be a dictionary containing a `type` and `message` field (both strings). Additional fields may be available depending on the type of warning.
hu: `figyelmeztetések`: A konfigurációs beállításokkal kapcsolatos figyelmeztetések listája. A lista minden egyes bejegyzése egy szótár lesz, amely tartalmaz egy `type` és egy `message` mezőt (mindkettő karakterlánc). A figyelmeztetés típusától függően további mezők is rendelkezésre állhatnak.

source: tmc drivers
hu: tmc motorvezérlők

source: The following information is available in [TMC stepper driver](Config_Reference.md#tmc-stepper-driver-configuration) objects (eg, `[tmc2208 stepper_x]`):
hu: A következő információk a [TMC léptető motorvezérlők](Config_Reference.md#tmc-motorvezerlo-konfiguracioja) objektumban érhetők el (pl. `[tmc2208 stepper_x]`):

source: `mcu_phase_offset`: The micro-controller stepper position corresponding with the driver's "zero" phase. This field may be null if the phase offset is not known.
hu: `mcu_phase_offset`: A mikrokontroller léptető pozíciója, amely megfelel a meghajtó "nulla" fázisának. Ez a mező lehet nulla, ha a fáziseltolás nem ismert.

source: `phase_offset_position`: The "commanded position" corresponding to the driver's "zero" phase. This field may be null if the phase offset is not known.
hu: `phase_offset_position`: A vezető "nulladik" fázisának megfelelő "parancsolt pozíció". Ez a mező lehet nulla, ha a fáziseltolás nem ismert.

source: `drv_status`: The results of the last driver status query. (Only non-zero fields are reported.) This field will be null if the driver is not enabled (and thus is not periodically queried).
hu: `drv_status`: A legutóbbi motorvezérlő állapotlekérdezés eredményei. (Csak a nem nulla mezők kerülnek jelentésre.) Ez a mező nulla lesz, ha a motorvezérlő nincs engedélyezve (és így nem kerül rendszeresen lekérdezésre).

source: `run_current`: The currently set run current.
hu: `run_current`: Az aktuálisan beállított működési áram.

source: `hold_current`: The currently set hold current.
hu: `hold_current`: Az aktuálisan beállított tartóáram.

source: `Diameter`: The last reading from the sensor in mm.
hu: `Diameter`: Az érzékelő utolsó leolvasása mm-ben.

source: `Raw`: The last raw ADC reading from the sensor.
hu: `Raw`: Az érzékelő utolsó nyers ADC-olvasása.

source: `profiles`: The set of currently defined profiles as setup using BED_MESH_PROFILE.
hu: `profiles`: A BED_MESH_PROFILE használatával beállított, jelenleg definiált profilok halmaza.

source: The following information is available in [angle some_name](Config_Reference.md#angle) objects:
hu: A következő információk az [angle some_name](Config_Reference.md#angle) objektumban érhetők el:

source: `temperature`: The last temperature reading (in Celsius) from a tle5012b magnetic hall sensor. This value is only available if the angle sensor is a tle5012b chip and if measurements are in progress (otherwise it reports `None`).
hu: `temperature`: A tle5012b mágneses hall-érzékelő utolsó hőmérsékleti értéke (Celsiusban). Ez az érték csak akkor érhető el, ha a szögérzékelő egy tle5012b chip, és ha a mérések folyamatban vannak (ellenkező esetben `None`).

source: The following information is available for each `[led led_name]`, `[neopixel led_name]`, `[dotstar led_name]`, `[pca9533 led_name]`, and `[pca9632 led_name]` config section defined in printer.cfg:
hu: A következő információk állnak rendelkezésre minden egyes `[led led_name]`, `[neopixel led_name` esetében, `[dotstar led_name]`, `[pca9533 led_name]`, és `[pca9632 led_name]` a nyomtatóban meghatározott printer.cfg fájlban:

source: `color_data`: A list of color lists containing the RGBW values for a led in the chain. Each value is represented as a float from 0.0 to 1.0. Each color list contains 4 items (red, green, blue, white) even if the underyling LED supports fewer color channels. For example, the blue value (3rd item in color list) of the second neopixel in a chain could be accessed at `printer["neopixel <config_name>"].color_data[1][2]`.
hu: `color_data`: A láncban lévő ledek RGBW értékeit tartalmazó színlisták listája. Minden értéket 0,0 és 1,0 közötti lebegőértékben ábrázolunk. Minden színlista 4 elemet tartalmaz (piros, zöld, kék, fehér), még akkor is, ha az alatta lévő LED kevesebb színcsatornát támogat. Például a lánc második neopixelének kék értéke (a színlista 3. eleme) a `printer["neopixel <config_name>"].color_data[1][2]` címen érhető el.

source: `save_config_pending_items`: Contains the sections and options that were changed and would be persisted by a `SAVE_CONFIG`.
hu: `save_config_pending_items`: Tartalmazza azokat a szakaszokat és opciókat, amelyeket megváltoztattak, és amelyeket egy `SAVE_CONFIG` elmenthetne.

source: The following information is available in the [exclude_object](Exclude_Object.md) object:
hu: A következő információk az [exclude_object](Exclude_Object.md) objektumban találhatók:

source: `objects`: An array of the known objects as provided by the `EXCLUDE_OBJECT_DEFINE` command. This is the same information provided by the `EXCLUDE_OBJECT VERBOSE=1` command. The `center` and `polygon` fields will only be present if provided in the original `EXCLUDE_OBJECT_DEFINE`
hu: `objektumok`: Az `EXCLUDE_OBJECT_DEFINE` parancs által megadott ismert objektumok tömbje. Ez ugyanaz az információ, amelyet az `EXCLUDE_OBJECT VERBOSE=1` parancs szolgáltat. A `center` és `polygon` mezők csak akkor lesznek jelen, ha az eredeti `EXCLUDE_OBJECT_DEFINE` parancsban szerepelnek.

source: Here is a JSON sample:
hu: Íme egy JSON-minta:

source: `excluded_objects`: An array of strings listing the names of excluded objects.
hu: `excluded_objects`: A kizárt objektumok neveit felsoroló karakterláncok tömbje.

source: `current_object`: The name of the object currently being printed.
hu: `current_object`: Az aktuálisan nyomtatott objektum neve.

source: The following information is available in the `manual_probe` object:
hu: A következő információk a `manual_probe` objektumban találhatók:

source: `is_active`: Returns True if a manual probing helper script is currently active.
hu: `is_active`: True értéket ad vissza, ha egy kézi mérési segédszkript jelenleg aktív.

source: `z_position`: The current height of the nozzle (as the printer currently understands it).
hu: `z_position`: A fúvóka aktuális magassága (ahogyan azt a nyomtató jelenleg értelmezi).

source: `z_position_lower`: Last probe attempt just lower than the current height.
hu: `z_position_lower`: Az utolsó mérés kísérlet éppen az aktuális magasságnál alacsonyabb.

source: `z_position_upper`: Last probe attempt just greater than the current height.
hu: `z_position_upper`: Az utolsó mérés kísérlet éppen nagyobb, mint az aktuális magasság.

source: The following information is available in the `Config_Reference.md#bed_screws` object:
hu: A következő információk a `Config_Reference.md#bed_screws` objektumban találhatók:

source: `is_active`: Returns True if the bed screws adjustment tool is currently active.
hu: `is_active`: True értéket ad vissza, ha a tárgyasztal csavarok beállítási eszköze jelenleg aktív.

source: `state`: The bed screws adjustment tool state. It is one of the following strings: "adjust", "fine".
hu: `state`: A tárgyasztal csavarok beállítási szerszámának állapota. A következő karakterláncok egyike: "adjust", "fine".

source: `current_screw`: The index for the current screw being adjusted.
hu: `current_screw`: Az aktuálisan beállított csavar indexe.

source: `accepted_screws`: The number of accepted screws.
hu: `accepted_screws`: Az elfogadott csavarok száma.

source: The following information is available for extruder_stepper objects (as well as [extruder](Config_Reference.md#extruder) objects):
hu: Az alábbi információk az extruder_stepper objektumok (valamint az [extruder](Config_Reference.md#extruder) objektumok) esetében állnak rendelkezésre:

source: `pressure_advance`: The current [pressure advance](Pressure_Advance.md) value.
hu: `pressure_advance`: Az aktuális [nyomás előtolás](Pressure_Advance.md) érték.

source: `smooth_time`: The current pressure advance smooth time.
hu: `smooth_time`: Az aktuális nyomás előtolásának simítási ideje.

source: For Delta printers the `cone_start_z` is the max z height at maximum radius (`printer.toolhead.cone_start_z`).
hu: A Delta nyomtatók esetében a `cone_start_z` a maximális sugaraknál mért maximális Z magasság (`printer.toolhead.cone_start_z`).

source: `info.total_layer`: The total layer value of the last `SET_PRINT_STATS_INFO TOTAL_LAYER=<value>` G-Code command.
hu: `info.total_layer`: Az utolsó `SET_PRINT_STATS_INFO TOTAL_LAYER=<value>` G-kódú parancs.

source: `info.current_layer`: The current layer value of the last `SET_PRINT_STATS_INFO CURRENT_LAYER=<value>` G-Code command.
hu: `info.current_layer`: Az aktuális réteg értéke az utolsó `SET_PRINT_STATS_INFO CURRENT_LAYER=<value>` G-kódú parancs.

source: The following information is available in the `z_thermal_adjust` object (this object is available if [z_thermal_adjust](Config_Reference.md#z_thermal_adjust) is defined).
hu: A következő információk a `z_thermal_adjust` parancsal érhetők el (ez a parancs akkor érhető el, ha a [z_thermal_adjust](Config_Reference.md#z_thermal_adjust) definiálva van).

source: `enabled`: Returns True if adjustment is enabled.
hu: `enabled`: True értéket ad vissza, ha a beállítás engedélyezve van.

source: `temperature`: Current (smoothed) temperature of the defined sensor. [degC]
hu: `temperature`: A meghatározott érzékelő aktuális (simított) hőmérséklete. [°C]

source: `measured_min_temp`: Minimum measured temperature. [degC]
hu: `measured_min_temp`: Minimális mért hőmérséklet. [°C]

source: `measured_max_temp`: Maximum measured temperature. [degC]
hu: `measured_max_temp`: Maximális mért hőmérséklet. [°C]

source: `current_z_adjust`: Last computed Z adjustment [mm].
hu: `current_z_adjust`: Utolsó számított Z-beállítás [mm].

source: `z_adjust_ref_temperature`: Current reference temperature used for calculation of Z `current_z_adjust` [degC].
hu: `z_adjust_ref_temperature`: A Z kiszámításához használt aktuális referencia-hőmérséklet `current_z_adjust` [°C].

source: `Diameter`, `Raw`: The last read values from the sensor.
ko: `Diameter`, `Raw`: 센서에서 마지막으로 읽은 값입니다.
zh_hans: `Diameter`、`Raw`：最后一次从传感器读取的值。

source: The following information is available for each `[neopixel led_name]` and `[dotstar led_name]` defined in printer.cfg:
ko: 다음 정보는 printer.cfg 에 정의된 각 `[neopixel led_name]` 및 `[dotstar led_name]`에 대해 사용할 수 있습니다:

source: `color_data`: An array of objects, with each object containing the RGBW values for a led in the chain. Note that not all configurations will contain a white value. Each value is represented as a float from 0 to 1. For example, the blue value of the second neopixel in a chain could be accessed at `printer["neopixel <config_name>"].color_data[1].B`.
ko: `color_data`: 체인의 led에 대한 RGBW 값을 포함하는 각 개체가 있는 개체의 배열입니다. 모든 구성에 흰색 값이 포함되는 것은 아닙니다. 각 값은 0에서 1 사이의 부동 소수점으로 표시됩니다. 예를 들어 체인에서 두 번째 네오픽셀의 파란색 값은 `printer["neopixel <config_name>"].colordata[1].B` 에서 액세스할 수 있습니다.
