Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/TMC_Drivers.po
Languages: de, fr, ko, zh_hans

source: If one wishes to reduce current to motors during print start routines, then consider issuing [SET_TMC_CURRENT](G-Codes.md#set_tmc_current) commands in a [START_PRINT macro](Slicers.md#klipper-gcode_macro) to adjust the current before and after normal printing moves.
fr: Si l'on souhaite réduire le courant vers les moteurs pendant les routines de démarrage d'impression, envisagez d'émettre des commandes [SET_TMC_CURRENT](G-Codes.md#set_tmc_current) dans une [MACRO START_PRINT](Slicers.md#klipper-gcode_macro) pour ajuster le courant avant et après les mouvements d'impression normaux.
zh_hans: 如果希望在打印预热时减少电机的电流，那么可以考虑在[START_PRINT宏](Slicers.md#klipper-gcode_macro)中写入[SET_TMC_CURRENT](G-Code.md#set_tmc_current)命令，在正常打印开始前后调整电流。

source: The `[DUMP_TMC command](G-Codes.md#dump_tmc) is a useful tool when configuring and diagnosing the drivers. It will report all fields configured by Klipper as well as all fields that can be queried from the driver.
fr: La `[commande DUMP_TMC](G-Codes.md#dump_tmc) est un outil utile lors de la configuration et du diagnostic des pilotes. Il signalera tous les champs configurés par Klipper ainsi que tous les champs pouvant être interrogés à partir du pilote.
zh_hans: `[DUMP_TMC 命令](G-Code.md#dump_tmc)是配置和诊断驱动程序的有效工具。它将报告所有由Klipper配置的字段，以及所有可以从驱动中查询到的字段。

source: In addition, almost all fields can be modified at run-time using the [SET_TMC_FIELD command](G-Codes.md#set_tmc_field).
fr: De plus, presque tous les champs peuvent être modifiés au moment de l'exécution à l'aide de la [commande SET_TMC_FIELD](G-Codes.md#set_tmc_field).
zh_hans: 此外，几乎所有的字段都可以在运行时使用[SET_TMC_FIELD命令](G-Codes.md#set_tmc_field)进行修改。

source: Then issue a `G28 X0` command and verify the axis does not move at all or quickly stops moving. If the axis does not stop, then issue an `M112` to halt the printer - something is not correct with the diag/sg_tst pin wiring or configuration and it must be corrected before continuing.
fr: Émettez ensuite une commande `G28 X0` et vérifiez que l'axe ne bouge pas du tout ou s'arrête rapidement. Si l'axe ne s'arrête pas, émettez un `M112` pour arrêter l'imprimante - quelque chose n'est pas correct avec le câblage ou la configuration de la broche diag/sg_tst et ce doit être corrigé avant de continuer.

source: An example CoreXY homing macro might look like:
de: Ein CoreXY Homing-Makro könnte beispielsweise so aussehen:
fr: Un exemple de macro de référencement CoreXY pourrait ressembler à :

source: [gcode_macro HOME] gcode: G90 # Home Z G28 Z0 G1 Z10 F1200 # Home Y G28 Y0 G1 Y5 F1200 # Home X G4 P2000 G28 X0 G1 X5 F1200
fr: [gcode_macro HOME] gcode: G90 # mise à l'origine Z G28 Z0 G1 Z10 F1200 # mise à l'origine Y G28 Y0 G1 Y5 F1200 # mise à l'origine X G4 P2000 G28 X0 G1 X5 F1200

source: TMC reports error: `... ShortToGND` OR `ShortToSupply`
fr: TMC signale une erreur : `... ShortToGND` OU `ShortToSupply`

source: Then issue a `G28 X0` command and verify the axis does not move at all. If the axis does move, then issue an `M112` to halt the printer - something is not correct with the diag/sg_tst pin wiring or configuration and it must be corrected before continuing.
ko: 그런 다음 `G28 X0` 명령을 실행하고 축이 전혀 움직이지 않는지 확인합니다. 축이 움직이면 `M112`를 실행하여 프린터를 중지합니다. diag/sg_tst 핀 배선 또는 구성이 올바르지 않으므로 계속하기 전에 수정해야 합니다.
zh_hans: 然后发一个 `G28 X0`命令，确保轴完全不动。如果轴移动了，立即一个`M112`命令停止打印机-可能是diag/sg_tst引脚的接线或配置有问题，必须在继续之前修正。

source: TMC reports error: `... ShortToGND` OR `LowSideShort`
zh_hans: TMC 报告错误: `... ShortToGND` 或着 `LowSideShort`

source: [stepper_x] rotation_distance: 40 homing_speed: 20 ...
de: [stepper_x] rotation_distance: 40 homing_speed:20 in English schrreiben

source: Enabling "Stealthchop" mode
ko: "Stealthchop" 모드 활성화

source: By default, Klipper places the TMC drivers in "spreadcycle" mode. If the driver supports "stealthchop" then it can be enabled by adding `stealthchop_threshold: 999999` to the TMC config section.
ko: 기본적으로 Klipper는 TMC 드라이버를 "spreadcycle" 모드로 설정합니다. 드라이버가 "stealthchop"을 지원하는 경우 TMC 구성 섹션에 `stealthchop_threshold: 999999`를 추가하여 활성화할 수 있습니다.

source: It is recommended to always use "spreadcycle" mode (by not specifying `stealthchop_threshold`) or to always use "stealthchop" mode (by setting `stealthchop_threshold` to 999999). Unfortunately, the drivers often produce poor and confusing results if the mode changes while the motor is at a non-zero velocity.
ko: 항상 "spreadcycle" 모드(`stealthchop_threshold`를 지정하지 않음)를 사용하거나 항상 `stealthchop_threshold`를 999999로 설정하여 `stealthchop` 모드를 사용하는 것이 좋습니다. 불행히도, 모터가 0이 아닌 속도에 있는 동안 모드가 변경되면 드라이버는 종종 좋지 않고 혼란스러운 결과를 생성합니다.

source: A StallGuard capable TMC stepper driver (tmc2130, tmc2209, tmc2660, or tmc5160).
ko: StallGuard 지원 TMC 스테퍼 드라이버(tmc2130, tmc2209, tmc2660 또는 tmc5160).

source: It can also be useful to have that macro set the driver current before homing and set a new current after the carriage has moved away. This also allows a hold_current to be set during prints (a hold_current is not recommended during sensorless homing).
ko: 또한 해당 매크로가 원점복귀 전에 드라이버 전류를 설정하고 캐리지가 멀리 이동한 후에 새 전류를 설정하도록 하는 것이 유용할 수 있습니다. 이것은 또한 인쇄 중에 hold_current를 설정할 수 있도록 합니다 (hold_current는 센서리스 원점복귀 중에는 권장되지 않음).

source: When using sensorless homing on CoreXY, make sure there is no `hold_current` in effect for either stepper during homing.
ko: CoreXY에서 센서리스 원점복귀를 사용할 때 원점복귀 중 두 스테퍼에 대해 `hold_current`가 적용되지 않는지 확인하십시오.

source: The `[DUMP_TMC command](G-Codes.md#tmc-stepper-drivers) is a useful tool when configuring and diagnosing the drivers. It will report all fields configured by Klipper as well as all fields that can be queried from the driver.
ko: `[DUMP_TMC 명령](G-Codes.md#tmc-stepper-drivers)은 드라이버를 구성하고 진단할 때 유용한 도구입니다. Klipper가 구성한 모든 필드와 드라이버에서 쿼리할 수 있는 모든 필드를 보고합니다.

source: In addition, almost all fields can be modified at run-time using the [SET_TMC_FIELD command](G-Codes.md#tmc-stepper-drivers).
ko: 또한 [SET_TMC_FIELD 명령](G-Codes.md#tmc-stepper-drivers)을 사용하여 런타임 시 거의 모든 필드를 수정할 수 있습니다.

source: Can I use stealthchop mode on an extruder with pressure advance?
ko: pressure advance 기능이 있는 압출기에서 stealthchop 모드를 사용할 수 있습니까?

source: Many people successfully use "stealthchop" mode with Klipper's pressure advance. Klipper implements [smooth pressure advance](Kinematics.md#pressure-advance) which does not introduce any instantaneous velocity changes.
ko: 많은 사람들이 Klipper의 pressure advance으로 "stealthchop" 모드를 성공적으로 사용합니다. Klipper는 즉각적인 속도 변화를 도입하지 않는 [smooth pressure advance](Kinematics.md#pressure-advance)을 구현합니다.

source: However, "stealthchop" mode may produce lower motor torque and/or produce higher motor heat. It may or may not be an adequate mode for your particular printer.
ko: 그러나 "stealthchop" 모드는 더 낮은 모터 토크를 생성하거나 더 높은 모터 열을 생성할 수 있습니다. 특정 프린터에 적합한 모드일 수도 있고 아닐 수도 있습니다.

source: **TMC reports error: ... ot=1(OvertempError!)"**: This indicates the motor driver disabled itself because it became too hot. Typical solutions are to decrease the stepper motor current, increase cooling on the stepper motor driver, and/or increase cooling on the stepper motor.
ko: **TMC reports error: ... ot=1(OvertempError!)"**: 이것은 모터 드라이버가 너무 뜨거워져서 스스로 비활성화되었음을 나타냅니다. 일반적인 솔루션은 스테퍼 모터 전류를 낮추고, 스테퍼 모터 드라이버의 냉각을 높이거나, 스테퍼 모터의 냉각을 높이는 것입니다.

source: **TMC reports error: ... ShortToGND** OR **LowSideShort**: This indicates the driver has disabled itself because it detected very high current passing through the driver. This may indicate a loose or shorted wire to the stepper motor or within the stepper motor itself.
ko: **TMC reports error: ... ShortToGND** OR **LowSideShort**: 이것은 드라이버를 통과하는 매우 높은 전류를 감지했기 때문에 드라이버가 스스로 비활성화되었음을 나타냅니다. 이것은 스테퍼 모터 또는 스테퍼 모터 자체 내부의 느슨하거나 단락된 와이어를 나타낼 수 있습니다.

source: This error may also occur if using stealthchop mode and the TMC driver is not able to accurately predict the mechanical load of the motor. (If the driver makes a poor prediction then it may send too much current through the motor and trigger its own over-current detection.) To test this, disable stealthchop mode and check if the errors continue to occur.
ko: 이 오류는 stealthchop 모드를 사용하고 TMC 드라이버가 모터의 기계적 부하를 정확하게 예측할 수 없는 경우에도 발생할 수 있습니다. (드라이버가 잘못된 예측을 하면 모터를 통해 너무 많은 전류를 보내고 자체 과전류 감지를 트리거할 수 있습니다.) 이를 테스트하려면 stealthchop 모드를 비활성화하고 오류가 계속 발생하는지 확인하십시오.

source: **TMC reports error: ... reset=1(Reset)** OR **CS_ACTUAL=0(Reset?)** OR **SE=0(Reset?)**: This indicates that the driver has reset itself mid-print. This may be due to voltage or wiring issues.
ko: **TMC reports error: ... reset=1(Reset)** OR **CS_ACTUAL=0(Reset?)** OR **SE=0(Reset?)**: 이것은 드라이버가 인쇄 중간에 재설정되었음을 나타냅니다. 이는 전압 또는 배선 문제로 인한 것일 수 있습니다.

source: **TMC reports error: ... uv_cp=1(Undervoltage!)**: This indicates the driver has detected a low-voltage event and has disabled itself. This may be due to wiring or power supply issues.
ko: **TMC reports error: ... uv_cp=1(Undervoltage!)**: 이는 드라이버가 저전압 이벤트를 감지하고 자체적으로 비활성화되었음을 나타냅니다. 이는 배선 또는 전원 공급 문제로 인한 것일 수 있습니다.

source: How do I tune spreadcycle/coolstep/etc. mode on my drivers?
ko: Spreadcycle/coolstep 등을 어떻게 조정합니까? 내 드라이버의 모드?
