Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/TMC_Drivers.po
Languages: de, fr, ko, zh_hans

source: This document provides information on using Trinamic stepper motor drivers in SPI/UART mode on Klipper.
de: Dieses Dokument enthält Informationen zur Verwendung von Trinamic-Schrittmotortreibern im SPI/UART-Modus auf Klipper.
fr: Ce document fournit des informations sur l'utilisation des pilotes de moteur pas à pas Trinamic en mode SPI/UART sur Klipper.
ko: 이 문서는 Klipper의 SPI/UART 모드에서 Trinamic 스테퍼 모터 드라이버를 사용하는 방법에 대한 정보를 제공합니다.
zh_hans: 这个文档提供了在Klipper上以SPI/UART模式使用Trinamic步进电机驱动器的信息。

source: Klipper can also use Trinamic drivers in their "standalone mode". However, when the drivers are in this mode, no special Klipper configuration is needed and the advanced Klipper features discussed in this document are not available.
de: Klipper kann die Trinamic-Treiber auch in ihrem "Standalone-Modus" verwenden. Wenn sich die Treiber jedoch in diesem Modus befinden, ist keine spezielle Klipper-Konfiguration erforderlich und die in diesem Dokument besprochenen erweiterten Klipper-Funktionen sind nicht verfügbar.
fr: Klipper peut également utiliser les pilotes Trinamic dans leur "mode autonome". Cependant, lorsque les pilotes sont dans ce mode, aucune configuration spéciale de Klipper n'est nécessaire et les fonctionnalités avancées de Klipper décrites dans ce document ne sont pas disponibles.
ko: Klipper는 "standalone mode"에서 Trinamic 드라이버를 사용할 수도 있습니다. 그러나 드라이버가 이 모드에 있으면 특별한 Klipper 구성이 필요하지 않으며 이 문서에서 설명하는 고급 Klipper 기능을 사용할 수 없습니다.
zh_hans: Klipper也可以在其 "standalone mode"下使用Trinamic驱动。然而，当驱动处于这种模式时，不需要特殊的Klipper配置，本文件中讨论的高级Klipper功能也无法使用。

source: In addition to this document, be sure to review the [TMC driver config reference](Config_Reference.md#tmc-stepper-driver-configuration).
de: Neben diesem Dokument sollten Sie sich die [TMC-Treiberkonfigurationsreferenz](Config_Reference.md#tmc-stepper-driver-configuration) ansehen.
fr: En plus de ce document, veillez à consulter la [référence de configuration du pilote TMC](Config_Reference.md#tmc-stepper-driver-configuration).
ko: 이 문서 외에 [TMC 드라이버 구성 참조](Config_Reference.md#tmc-stepper-driver-configuration)를 반드시 검토하십시오.
zh_hans: 除了这份文档，请务必查看[TMC驱动配置参考](Config_Reference.md#tmc-stepper-driver-configuration).

source: Sensorless Homing
de: Sensorloses Homing
fr: Mise à l'origine sans capteur(s)
ko: 센서리스 원점복귀
zh_hans: 无限位归零

source: Sensorless homing allows to home an axis without the need for a physical limit switch. Instead, the carriage on the axis is moved into the mechanical limit making the stepper motor lose steps. The stepper driver senses the lost steps and indicates this to the controlling MCU (Klipper) by toggling a pin. This information can be used by Klipper as end stop for the axis.
de: Sensorloses Homing ermöglicht das Einrichten einer Achse ohne die Notwendigkeit eines physischen Endschalters. Stattdessen wird der Schlitten an der Achse in den mechanischen Anschlag bewegt, wodurch der Schrittmotor Schritte verliert. Der Schrittmotortreiber erfasst die verlorenen Schritte und gibt dies an die steuernde MCU (Klipper) weiter, indem er einen Pin umschaltet. Diese Informationen können von Klipper als Endanschlag für die Achse verwendet werden.
fr: La mise à l'origine ans capteur permet de référencer un axe sans avoir besoin d'une fin de course physique. Au lieu de cela, le chariot sur l'axe est déplacé dans la limite mécanique, ce qui fait perdre des pas au moteur pas à pas. Le pilote pas à pas détecte les pas perdus et l'indique au MCU de contrôle (Klipper) en basculant une broche. Cette information peut être utilisée par Klipper comme fin de course pour l'axe.
ko: 센서리스 원점복귀는 물리적 리미트 스위치 없이도 축을 원점복귀할 수 있습니다. 대신 축의 캐리지가 기계적 한계지점으로 이동되어 스테퍼 모터가 step제어가 풀리게 됩니다. 스테퍼 드라이버는 손실된 단계를 감지하고 핀을 토글하여 제어 MCU(Klipper)에 이를 표시합니다. 이 정보는 Klipper에서 축의 끝점으로 사용할 수 있습니다.
zh_hans: 无传感器归位允许在不需要物理限位开关的情况下将一个轴归位。相反，轴上的滑车接触机械限位后，使步进电机失去步长。步进驱动器感应到失去的步数，并通过切换一个引脚向控制的微控制器（Klipper）告知这一点。该信息可被 Klipper 用作轴的限位。

source: This guide covers the setup of sensorless homing for the X axis of your (cartesian) printer. However, it works the same with all other axes (that require an end stop). You should configure and tune it for one axis at a time.
de: Dieser Leitfaden beschreibt die Einrichtung von sensorlosem Homing für die X-Achse Ihres (kartesischen) Druckers. Es funktioniert jedoch genauso mit allen anderen Achsen (die einen Endanschlag benötigen). Sie sollten es für eine Achse nach der anderen konfigurieren und abstimmen.
fr: Ce guide couvre la configuration de la mise à l'origine sans capteur pour l'axe X de votre imprimante (cartésienne). Cependant, cela fonctionne de la même manière avec tous les autres axes (qui nécessitent une butée fin de course). Vous devez le configurer et le régler pour un seul axe à la fois.
ko: 이 가이드는 (직교) 프린터의 X 축에 대한 센서리스 원점 복귀 설정을 다룹니다. 그러나 다른 모든 축(끝 정지가 필요한 축)과 동일하게 작동합니다. 한 번에 하나의 축에 대해 구성하고 조정해야 합니다.
zh_hans: 本指南介绍了如何设置（笛卡尔）打印机的X轴无传感器归位。这个方法也适合其他轴（需要一个限位）。每次应该只对一个轴进行配置和调整。

source: Limitations
de: Beschränkungen (Begriff bezieht sich auf Beschränkungen, Grenzen oder Einschränkungen)
fr: Limites
ko: 제한사항
zh_hans: 限制

source: Be sure that your mechanical components are able to handle the load of the carriage bumping into the limit of the axis repeatedly. Especially leadscrews might generate a lot of force. Homing a Z axis by bumping the nozzle into the printing surface might not be a good idea. For best results, verify that the axis carriage will make a firm contact with the axis limit.
de: Stellen Sie sicher, dass Ihre mechanischen Komponenten die Belastung aushalten können, wenn der Wagen wiederholt an die Grenze der Achse stößt. Insbesondere können Gewindestangen viel Kraft erzeugen. Es ist möglicherweise keine gute Idee, eine Z-Achse zu homen, indem die Düse gegen die Druckoberfläche stößt. Für beste Ergebnisse überprüfen Sie, ob der Achskarren fest mit der Achsgrenze in Kontakt kommen wird.
fr: Assurez-vous que vos composants mécaniques sont capables de supporter la charge du chariot heurtant à plusieurs reprises la fin de course de l'axe. Les vis sans fin, en particulier, peuvent générer une force importante. La prise d'origine d'un axe Z en écrasant la buse dans la surface d'impression n'est peut-être pas une bonne idée. Pour de meilleurs résultats, vérifiez que le chariot de l'axe établit un contact franc lors de la mise à l'origine.
ko: 기계 구성 요소가 축의 한계에 반복적으로 부딪치는 캐리지의 하중을 처리할 수 있는지 확인하십시오. 특히 리드스크류는 많은 힘을 발생시킬 수 있습니다. 노즐을 인쇄 표면에 부딪혀 Z축의 원점 복귀는 좋은 생각이 아닐 수 있습니다. 최상의 결과를 얻으려면 축 캐리지가 축 제한에 단단히 닿는지 확인하십시오.
zh_hans: 要确保你的机械部件能够承受滑车反复撞向轴的限位的负载。特别是丝杠可能会产生很大的力。通过将喷嘴撞向打印表面来确定Z轴的位置可能不是一个好主意。为了获得最佳效果，请确认轴滑车将与轴的限位紧密接触。

source: Further, sensorless homing might not be accurate enough for your printer. While homing X and Y axes on a cartesian machine can work well, homing the Z axis is generally not accurate enough and may result in an inconsistent first layer height. Homing a delta printer sensorless is not advisable due to missing accuracy.
de: Darüber hinaus ist das sensorlose Homing möglicherweise nicht genau genug für Ihren Drucker. Während das Anfahren der X- und Y-Achsen auf einer kartesischen Maschine gut funktionieren kann, ist das Anfahren der Z-Achse im Allgemeinen nicht genau genug und kann zu einer inkonsistenten Höhe der ersten Schicht führen. Das sensorlose Homing eines Delta-Druckers ist aufgrund mangelnder Genauigkeit nicht ratsam.
fr: De plus, la mise à l'origine sans capteur peut ne pas être suffisamment précise pour votre imprimante. Bien que la mise à l'origine des axes X et Y sur une machine cartésienne puisse bien fonctionner, la prise d'origine de l'axe Z n'est généralement pas assez précise et peut entraîner une hauteur de première couche incohérente. Le référencement d'une imprimante delta sans capteur n'est pas conseillé en raison du manque de précision.
ko: 또한 센서리스 원점 복귀는 프린터에 대해 충분히 정확하지 않을 수 있습니다. 직교 기계에서 X 및 Y 축의 귀환은 잘 작동할 수 있지만 Z 축의 귀환은 일반적으로 충분히 정확하지 않으며 일관되지 않은 첫 번째 레이어 높이를 초래할 수 있습니다. 센서가 없는 델타 프린터의 원점 복귀는 정확도가 떨어지므로 권장하지 않습니다.
zh_hans: 此外，无传感器归位对你的打印机来说可能不够精确。虽然笛卡尔机器上的X和Y轴归位可以很好地工作，但Z轴的归位通常不够准确，可能会导致第一层高度不一致。由于精度低，不建议在delta 打印机上使用无传感器的归位。

source: Further, the stall detection of the stepper driver is dependent on the mechanical load on the motor, the motor current and the motor temperature (coil resistance).
de: Darüber hinaus hängt die Stalldetektion des Schrittmotortreibers von der mechanischen Last am Motor, dem Motorenstrom und der Motortemperatur (Spulenwiderstand) ab.
fr: En outre, la détection de décrochage du pilote pas à pas dépend de la charge mécanique sur le moteur, du courant du moteur et de la température du moteur (résistance de la bobine).
ko: 또한 스테퍼 드라이버의 stall 감지는 모터의 기계적 부하, 모터 전류 및 모터 온도(코일 저항)에 따라 달라집니다.
zh_hans: 此外，步进驱动器的失速检测取决于电机的机械负载、电机电流和电机温度（线圈电阻）。

source: Sensorless homing works best at medium motor speeds. For very slow speeds (less than 10 RPM) the motor does not generate significant back EMF and the TMC cannot reliably detect motor stalls. Further, at very high speeds, the back EMF of the motor approaches the supply voltage of the motor, so the TMC cannot detect stalls anymore. It is advised to have a look in the datasheet of your specific TMCs. There you can also find more details on limitations of this setup.
de: Sensorloses Homing funktioniert am besten bei mittleren Motorgeschwindigkeiten. Bei sehr langsamen Geschwindigkeiten (weniger als 10 U/min) erzeugt der Motor keine signifikante Gegen-EMK und die TMC kann Motorstillstände nicht zuverlässig erkennen. Darüber hinaus nähert sich bei sehr hohen Geschwindigkeiten die Gegen-EMK des Motors der Versorgungsspannung des Motors an, sodass die TMC keine Stillstände mehr erkennen kann. Es wird empfohlen, einen Blick in das Datenblatt Ihrer spezifischen TMCs zu werfen. Dort finden Sie auch weitere Details zu den Einschränkungen dieses Setups.
fr: La mise à l'origine sans capteur fonctionne mieux à des vitesses de moteur moyennes. Pour des vitesses très lentes (moins de 10 tr/min), le moteur ne génère pas de force contre-électromotrice significative et le TMC ne peut pas détecter de manière fiable les calages du moteur. A des vitesses très élevées, la force contre-électromotrice du moteur se rapproche de la tension d'alimentation du moteur, de sorte que le TMC ne peut plus détecter les calages. Il est conseillé de consulter la fiche technique de vos TMC spécifiques. Vous y trouverez également plus de détails sur les limites de cette configuration.
ko: 센서리스 원점 복귀는 모터의 적절한 속도에서 가장 잘 작동합니다. 매우 느린 속도(10RPM 미만)의 경우 모터는 상당한 역기전력을 생성하지 않으며 TMC는 모터 stall을 안정적으로 감지할 수 없습니다. 또한 매우 빠른 속도에서 모터의 역기전력이 모터의 공급 전압에 접근하므로 TMC는 더 이상 stall을 감지할수 없습니다. TMC의 데이터시트를 살펴보는 것이 좋습니다. 여기에서 이 설정의 제한 사항에 대한 자세한 내용도 찾을 수 있습니다.
zh_hans: 无传感器归位在电机中速时效果最好。对于非常慢的速度（小于10RPM），电机不会产生明显的反电磁场，TMC芯片不能可靠地检测到电机停顿。此外，在非常高的速度下，电机的反向电动势接近电机的电源电压，所以TMC芯片也检测不到停顿。建议你看看一下对应的TMC芯片数据手册。在手册中还可以找到更多关于这种设置的限制的细节。

source: Prerequisites
de: Voraussetzungen
fr: Conditions préalables
ko: 전제조건
zh_hans: 前提条件

source: A few prerequisites are needed to use sensorless homing:
de: Einige Voraussetzungen sind erforderlich, um das sensorlose Homing zu verwenden:
fr: Quelques prérequis sont nécessaires pour utiliser la mise à l'origine sans capteur :
ko: 센서리스 원점 복귀를 사용하려면 몇 가지 전제 조건이 필요합니다:
zh_hans: 使用无传感器归位，需要一些前提条件：

source: SPI / UART interface of the TMC driver wired to micro-controller (stand-alone mode does not work).
de: SPI / UART-Schnittstelle des TMC-Treibers mit Mikrocontroller verdrahtet (Stand-alone-Modus funktioniert nicht).
fr: Interface SPI/UART du driver TMC câblé au micro-contrôleur (le mode autonome ne fonctionne pas).
ko: 마이크로 컨트롤러에 연결된 TMC 드라이버의 SPI/UART 인터페이스 (stand-alone 모드는 작동하지 않음).
zh_hans: 需要TMC驱动器的SPI / UART接口与微控制器连接（stand-alone 模式不行）。

source: The appropriate "DIAG" or "SG_TST" pin of TMC driver connected to the micro-controller.
de: Der entsprechende "DIAG"- oder "SG_TST"-Pin des TMC-Treibers ist mit dem Mikrocontroller verbunden.
fr: La broche "DIAG" ou "SG_TST" appropriée du pilote TMC doit être connectée au microcontrôleur.
ko: 마이크로 컨트롤러에 연결된 TMC 드라이버의 적절한 "DIAG" 또는 "SG_TST" 핀.
zh_hans: 需要把TMC驱动器的 "DIAG "或 "SG_TST "引脚连接到微控制器。

source: The steps in the [config checks](Config_checks.md) document must be run to confirm the stepper motors are configured and working properly.
de: Die Schritte im Dokument [config checks](Config_checks.md) müssen ausgeführt werden, um sicherzustellen, dass die Schrittmotoren konfiguriert sind und ordnungsgemäß funktionieren.
fr: Les étapes du document [vérification de la configuration](Config_checks.md) doivent être exécutées pour confirmer que les moteurs pas à pas sont configurés et fonctionnent correctement.
ko: [구성 검사](Config_checks.md) 문서의 단계를 실행하여 스테퍼 모터가 구성되고 제대로 작동하는지 확인해야 합니다.
zh_hans: 必须按照[配置检查](Config_checks.md)文件中的步骤来确认步进电机的配置和运转正常。

source: Tuning
de: Abstimmung (Tuning)
fr: Réglages
ko: 조정
zh_hans: 调整

source: The procedure described here has six major steps:
de: Das hier beschriebene Verfahren umfasst sechs Hauptschritte:
fr: La procédure décrite ici comporte six étapes principales :
ko: 여기에 설명된 절차에는 6가지 주요 단계가 있습니다:
zh_hans: 调整过程有六个主要步骤：

source: Choose a homing speed.
de: Wählen Sie eine Referenzfahrtgeschwindigkeit.
fr: Choisissez une vitesse de mise à l'origine.
ko: 원점 복귀 속도를 선택합니다.
zh_hans: 选择一个归位速度。

source: Configure the `printer.cfg` file to enable sensorless homing.
de: Konfigurieren Sie die Datei `printer.cfg`, um die sensorlose Referenzfahrt zu aktivieren.
fr: Configurez le fichier `printer.cfg` pour activer la mise à l'origine sans capteur.
ko: 센서리스 원점 복귀를 활성화하도록 `printer.cfg` 파일을 구성합니다.
zh_hans: 配置`printer.cfg`文件以启用无传感器归位。

source: Find the stallguard setting with highest sensitivity that successfully homes.
de: Finden Sie die Einstellung des Stallwächters mit der höchsten Empfindlichkeit, die erfolgreich zu Hause ist.
fr: Trouvez le meilleur réglage anti-décrochage avec la sensibilité la plus élevée.
ko: 성공적으로 홈에 도달하는 가장 높은 민감도의 stallguard 설정을 찾으십시오.
zh_hans: 找到有最高灵敏度的stallguard设置，确保其成功找到零点位置。

source: Find the stallguard setting with lowest sensitivity that successfully homes with a single touch.
de: Finden Sie die Einstellung des Stallwächters mit der geringsten Empfindlichkeit, die mit einer einzigen Berührung zum Erfolg führt.
fr: Trouvez le réglage anti-décrochage avec la sensibilité la plus faible qui fonctionne avec une seule touche en fin de course.
ko: 한번의 터치로 성공적으로 홈으로 돌아가는 최저 민감도의 stallguard 설정을 찾으십시오.
zh_hans: 找到有最低灵敏度的stallguard 设置，确保只需轻轻一碰就能成功归零。

source: Update the `printer.cfg` with the desired stallguard setting.
de: Aktualisieren Sie die Datei `printer.cfg` mit der gewünschten Stallguard-Einstellung.
fr: Mettez à jour le fichier `printer.cfg` avec le paramètre anti-décrochage souhaité.
ko: 원하는 stallguard 설정으로 `printer.cfg`를 업데이트하십시오.
zh_hans: 更新`printer.cfg`，加入所需的stallguard设置。

source: Create or update `printer.cfg` macros to home consistently.
de: Erstellen oder aktualisieren Sie Makros in der Datei `printer.cfg`, um sie konsistent zu verwenden.
fr: Créez ou mettez à jour les macros dans `printer.cfg` pour une mise à l'origine répétable.
ko: 일관되게 홈에 대한 `printer.cfg` 매크로를 생성하거나 업데이트합니다.
zh_hans: 创建或更新 `printer.cfg `宏确保稳定归位（home）。

source: Choose homing speed
de: Geschwindigkeit der Referenzfahrt wählen
fr: Choisir la vitesse de prise d'origine
ko: 원점복귀 속도 선택
zh_hans: 选择归位速度

source: The homing speed is an important choice when performing sensorless homing. It's desirable to use a slow homing speed so that the carriage does not exert excessive force on the frame when making contact with the end of the rail. However, the TMC drivers can't reliably detect a stall at very slow speeds.
de: Die Referenzfahrtgeschwindigkeit ist ein wichtiger Faktor bei der sensorlosen Referenzfahrt. Es ist wünschenswert, eine langsame Referenzfahrtgeschwindigkeit zu verwenden, damit der Wagen keine übermäßige Kraft auf den Rahmen ausübt, wenn er das Ende der Schiene berührt. Allerdings können die TMC-Treiber bei sehr langsamen Geschwindigkeiten einen Strömungsabriss nicht zuverlässig erkennen.
fr: La vitesse de mise à l'origine est importante lors de la réalisation d'une mise à l'origine sans capteur. Il est souhaitable d'utiliser une vitesse de prise d'origine lente afin que le chariot n'exerce pas de force excessive sur le châssis lorsqu'il entre en contact avec l'extrémité du rail. Cependant, les pilotes TMC ne peuvent pas détecter de manière fiable un décrochage à des vitesses très lentes.
ko: 원점복귀 속도는 센서리스 원점복귀를 수행할 때 중요한 선택입니다. 레일 끝부분에 닿을 때 캐리지가 프레임에 과도한 힘을 가하지 않도록 느린 원점복귀 속도를 사용하는 것이 바람직합니다. 그러나 TMC 드라이버는 매우 느린 속도에서는 stall을 안정적으로 감지할 수 없습니다.
zh_hans: 执行无传感器归位时，归位速度是一个重要参数。最好使用较慢的归位速度，以便滑车在与轨道限位接触时不会对框架施加过多的力。然而，TMC驱动器在非常慢的速度下并不能可靠地检测到失速。

source: A good starting point for the homing speed is for the stepper motor to make a full rotation every two seconds. For many axes this will be the `rotation_distance` divided by two. For example:
de: Ein guter Ausgangspunkt für die Referenzfahrtgeschwindigkeit ist, dass der Schrittmotor alle zwei Sekunden eine volle Umdrehung macht. Bei vielen Achsen ist dies der `Rotation_distance` geteilt durch zwei. Zum Beispiel:
fr: Un bon point de départ pour la vitesse de prise d'origine est que le moteur pas à pas effectue une rotation complète toutes les deux secondes. Pour de nombreux axes, ce sera la distance `rotation_distance` divisée par deux. Par example :
ko: 원점복귀 속도의 좋은 시작점은 스테퍼 모터가 2초마다 완전히 회전하는 것입니다. 많은 축의 경우 이는 `rotation_distance`를 2로 나눈 값입니다. 예를 들어:
zh_hans: 归位速度的最佳调整起点是步进电机每两秒转一圈。对于许多轴，这就是将是 `rotation_distance` 除以2。例如：

source: Configure printer.cfg for sensorless homing
de: Konfigurieren sie die printer.cfg für die sensorlose Referenzfahrt
fr: Configurer 'printer.cfg' pour une mise à l'origine sans capteur
ko: 센서리스 원점복귀를 위해 printer.cfg 구성
zh_hans: 为无传感器归位配置printer.cfg

source: The `homing_retract_dist` setting must be set to zero in the `stepper_x` config section to disable the second homing move. The second homing attempt does not add value when using sensorless homing, it will not work reliably, and it will confuse the tuning process.
de: Die Einstellung `homing_retract_dist` muss im Konfigurationsabschnitt `stepper_x` auf Null gesetzt werden, um die zweite Referenzfahrt zu deaktivieren. Der zweite Referenzfahrtversuch ist bei sensorloser Referenzfahrt nicht sinnvoll, funktioniert nicht zuverlässig und verwirrt den Abstimmungsprozess.
fr: Le paramètre `homing_retract_dist` doit être défini sur zéro dans la section de configuration `stepper_x` pour désactiver le deuxième mouvement de mise à l'origine. La deuxième tentative de mise à l'origine n'ajoute pas de valeur lors de l'utilisation d'une mise à l'origine sans capteur, elle ne fonctionnera pas de manière fiable et introduira des erreurs dans le processus de réglage.
ko: 두 번째 원점복귀 이동을 비활성화하려면 `stepper_x` 구성 섹션에서 `homing_retract_dist` 설정은 0으로 설정해야 합니다. 두 번째 원점복귀 시도는 센서리스 원점복귀를 사용할 때 설정값을 추가하지 않으며 안정적으로 작동하지 않으며 튜닝 프로세스를 혼란스럽게 합니다.
zh_hans: 在`stepper_x` 配置部分， `homing_retract_dist` 设置必须被设为零，以禁用第二次归位动作。在使用无传感器归位时，第二次归位尝试不会提高精度，也不会可靠地工作，而且会扰乱调整过程。

source: Be sure that a `hold_current` setting is not specified in the TMC driver section of the config. (If a hold_current is set then after contact is made, the motor stops while the carriage is pressed against the end of the rail, and reducing the current while in that position may cause the carriage to move - that results in poor performance and will confuse the tuning process.)
de: Vergewissern Sie sich, dass in der TMC-Treiber-Sektion der Konfiguration keine `hold_current`-Einstellung angegeben ist (wenn eine hold_current-Einstellung vorgenommen wird, stoppt der Motor, nachdem der Kontakt hergestellt wurde, während der Schlitten gegen das Ende der Schiene gedrückt wird, und eine Reduzierung des Stroms in dieser Position kann dazu führen, dass sich der Schlitten bewegt - das führt zu einer schlechten Leistung und verwirrt den Abstimmungsprozess).
fr: Assurez-vous que le paramètre `hold_current` n’est pas spécifié dans la section Pilote TMC de la configuration. (Si un hold_current est réglé, le moteur s’arrête lorsque le chariot est appuyé contre l’extrémité du rail, et la réduction du courant dans cette position peut entraîner le déplacement du chariot - ce qui entraînera de mauvaises performances et perturbera le processus de réglage.)
ko: config의 TMC 드라이버 섹션에 `hold_current` 설정이 지정되지 않았는지 확인하십시오. (hold_current가 설정되면 접촉 후 캐리지가 레일의 끝 부분에 대해 눌러지는 동안 모터가 정지하고 해당 위치에서 전류를 줄이면 캐리지가 움직일 수 있습니다. 이는 성능이 저하 및 튜닝과정 혼란을 초래할 수 있습니다.)
zh_hans: 确保在配置的TMC驱动部分没有指定 `hold_current`的设置。（如果设置了hold_current，那么在接触后，当滑车撞到轨道末端时，电机就会停止，在这个位置上减少电流可能会导致滑车移动--这将导致归位性能不佳，并会扰乱调整过程。）

source: It is necessary to configure the sensorless homing pins and to configure initial "stallguard" settings. A tmc2209 example configuration for an X axis might look like:
de: Es ist notwendig, die Pins für die sensorlose Referenzfahrt zu konfigurieren und die anfänglichen "stallguard"-Einstellungen zu konfigurieren. Eine tmc2209 Beispielkonfiguration für eine X-Achse könnte wie folgt aussehen:
fr: Il est nécessaire de configurer les broches du TMC pour le mode sans capteur et de configurer les paramètres initiaux de « Stallguard ». Un exemple de configuration tmc2209 pour un axe X pourrait ressembler à :
ko: 센서리스 귀환 핀을 구성하고 초기 "stallguard" 설정을 구성해야 합니다. X축에 대한 tmc2209 예제 구성은 다음과 같습니다:
zh_hans: 需要配置无传感器归位引脚，并配置初始 "stallguard "设置。一个用于X轴的tmc2209示例配置如下：

source: An example tmc2130 or tmc5160 config might look like:
de: Eine tmc2130- oder tmc5160-Konfiguration könnte beispielsweise so aussehen:
fr: Un exemple de configuration de tmc2130 ou tmc5160 pourrait ressembler à :
ko: tmc2130 또는 tmc5160 구성의 예는 다음과 같습니다:
zh_hans: 用于tmc2130或tmc5160配置的例子如下：

source: An example tmc2660 config might look like:
de: Eine Beispielkonfiguration des tmc2660 könnte wie folgt aussehen:
fr: Un exemple de configuration de tmc2660 pourrait ressembler à :
ko: tmc2660 구성의 예는 다음과 같습니다:
zh_hans: 用于tmc2660配置的例子如下：

source: The examples above only show settings specific to sensorless homing. See the [config reference](Config_Reference.md#tmc-stepper-driver-configuration) for all the available options.
de: Die obigen Beispiele zeigen nur die Einstellungen für die sensorlose Referenzfahrt. Siehe die [config reference](Config_Reference.md#tmc-stepper-driver-configuration) für alle verfügbaren Optionen.
fr: Les exemples ci-dessus ne montrent que les paramètres spécifiques à la mise à l'origine sans capteur. Voir la [référence de configuration](Config_Reference.md#tmc-stepper-driver-configuration) pour toutes les options disponibles.
ko: 위의 예는 센서리스 원점복귀와 관련된 설정만 보여줍니다. 사용 가능한 모든 옵션은 [구성 참조](Config_Reference.md#tmc-stepper-driver-configuration) 를 참조하세요.
zh_hans: 上面的例子只显示了针对无传感器归位的设置。所有可用选项请参见[配置参考](Config_Reference.md#tmc-stepper-driver-configuration)。

source: Find highest sensitivity that successfully homes
de: Finden Sie die höchste Empfindlichkeit, für eine erfolgreiche Referenzfahrt
fr: Trouvez la sensibilité la plus élevée qui fonctionne avec succès
ko: 원점복귀에 가장 높은 민감도 성공적으로 찾기
zh_hans: 找到能成功归位的最高的敏感度设定

source: Place the carriage near the center of the rail. Use the SET_TMC_FIELD command to set the highest sensitivity. For tmc2209:
de: Platzieren Sie den Schlitten in der Nähe der Mitte der Schiene. Verwenden Sie den Befehl SET_TMC_FIELD, um die höchste Empfindlichkeit einzustellen. Für tmc2209:
fr: Placez le chariot près du centre du rail. Utilisez la commande SET_TMC_FIELD pour définir la sensibilité la plus élevée. Pour un tmc2209 :
ko: 레일 중앙 근처에 캐리지를 놓습니다. SET_TMC_FIELD 명령을 사용하여 가장 높은 민감도를 설정합니다. tmc2209의 경우:
zh_hans: 将滑车放在靠近轨道中心的位置。使用SET_TMC_FIELD命令来设置最高灵敏度。对于tmc2209：

source: For tmc2130, tmc5160, and tmc2660:
de: Für tmc2130, tmc5160, und tmc2660:
fr: Pour un tmc2130, tmc5160 et tmc2660 :
ko: tmc2130, tmc5160 및 tmc2660의 경우:
zh_hans: 对于tmc2130, tmc5160, and tmc2660:
