Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/TMC_Drivers.po
Languages: de, fr, ko, zh_hans

source: After tuning is complete, when homing both X and Y, use macros to ensure that one axis is homed first, then move that carriage away from the axis limit, pause for at least 2 seconds, and then start the homing of the other carriage. The move away from the axis avoids homing one axis while the other is pressed against the axis limit (which may skew the stall detection). The pause is necessary to ensure the driver's stall flag is cleared prior to homing again.
de: Verwenden Sie nach Abschluss der Abstimmung bei der Referenzfahrt von X und Y Makros, um sicherzustellen, dass zuerst eine Achse referenziert wird, bewegen Sie dann diesen Schlitten von der Achsengrenze weg, halten Sie mindestens 2 Sekunden lang inne und starten Sie dann die Referenzfahrt des anderen Schlittens. Durch die Bewegung von der Achse weg wird vermieden, dass eine Achse referenziert wird, während die andere gegen die Achsengrenze gedrückt wird (was die Erkennung des Stillstands verfälschen könnte). Die Pause ist notwendig, um sicherzustellen, dass das Blockierflag des Fahrers vor der erneuten Referenzfahrt gelöscht wird.
fr: Une fois les réglages terminés, lors de la prise d'origine de X et Y, utilisez des macros pour vous assurer qu'un axe est pris en charge en premier, puis éloignez ce chariot de la fin de course de l'axe, faites une pause d'au moins 2 secondes, puis démarrez la prise d'origine de l'autre axe. L'éloignement de l'axe évite le référencement d'un axe alors que l'autre est plaqué contre la fin de course (ce qui peut fausser la détection de décrochage). La pause est nécessaire pour s'assurer que le drapeau de décrochage du pilote pas à pas est effacé avant de se déplacer à nouveau.
ko: 조정이 완료된 후 X와 Y를 모두 원점복귀시킬 때 매크로를 사용하여 한 축이 먼저 원점복귀되도록 한 다음 해당 캐리지를 축 제한에서 멀리 이동하고 최소 2초 동안 일시 중지한 다음 다른 캐리지의 원점복귀를 시작합니다. 축에서 멀어지면 다른 축이 축 제한에 대해 눌러지는 동안 한 축의 원점복귀를 방지합니다 (스톨 감지가 왜곡될 수 있음). 다시 원점복귀하기 전에 드라이버의 stall flag가 지워지도록 하려면 일시 중지가 필요합니다.
zh_hans: 调整完成后，当X和Y轴归位时，使用宏来确保一个轴首先被归位，然后将该滑车远离轴的极限，停顿至少2秒，然后开始另一个滑车的归位。远离轴端点的移动可以避免一个轴被归位，而另一个轴顶在轴的极限上（这可能使失速检测发生偏差）。暂停是必要的，以确保驱动器的失速标志在再次归位之前被清除。

source: Querying and diagnosing driver settings
de: Abfrage und Diagnose der Treibereinstellungen
fr: Interroger et diagnostiquer les informations du pilote pas à pas
ko: 드라이버 설정 쿼리 및 진단
zh_hans: 查询和诊断驱动程序设置

source: All of the reported fields are defined in the Trinamic datasheet for each driver. These datasheets can be found on the [Trinamic website](https://www.trinamic.com/). Obtain and review the Trinamic datasheet for the driver to interpret the results of DUMP_TMC.
de: Alle angegebenen Felder sind im Trinamic-Datenblatt für jeden Treiber definiert. Diese Datenblätter finden Sie auf der [Trinamic-Website](https://www.trinamic.com/). Besorgen Sie sich das Trinamic Datenblatt für den Treiber und prüfen Sie es, um die Ergebnisse von DUMP_TMC zu interpretieren.
fr: Tous les champs signalés sont définis dans la fiche technique de Trinamic pour chaque pilote. Ces fiches techniques sont disponibles sur le [site Internet de Trinamic](https://www.trinamic.com/). Obtenez et examinez la fiche technique de Trinamic du pilote pas à pas afin d'interpréter correctement les résultats d'un DUMP_TMC.
ko: 보고된 모든 필드는 각 드라이버에 대한 Trinamic 데이터시트에 정의되어 있습니다. 이 데이터시트는 [Trinamic 웹사이트](https://www.trinamic.com/)에서 찾을 수 있습니다. 드라이버가 DUMP_TMC의 결과를 해석할 수 있도록 Trinamic 데이터시트를 구하고 검토하십시오.
zh_hans: 所有报告的字段都定义在驱动器的Trinamic数据手册中。这些数据表可以在[Trinamic网站](https://www.trinamic.com/)上找到。请获取并查看驱动器的Trinamic数据手册来解释DUMP_TMC的结果。

source: Configuring driver_XXX settings
de: Konfigurieren der Einstellungen von driver_XXX
fr: Configuration des paramètres d'un 'driver_XXX'
ko: driver_XXX 설정 구성
zh_hans: 配置driver_XXX设置

source: Klipper supports configuring many low-level driver fields using `driver_XXX` settings. The [TMC driver config reference](Config_Reference.md#tmc-stepper-driver-configuration) has the full list of fields available for each type of driver.
de: Klipper unterstützt die Konfiguration vieler Low-Level-Treiberfelder mit `driver_XXX` Einstellungen. Die [TMC driver config reference](Config_Reference.md#tmc-stepper-driver-configuration) enthält die vollständige Liste der Felder, die für jede Art von Treiber verfügbar sind.
fr: Klipper prend en charge la configuration de nombreux paramètres de bas niveau pour les pilotes de moteurs pas à pas à l'aide des paramètres de la section `driver_XXX`. La [référence de configuration du pilote TMC](Config_Reference.md#tmc-stepper-driver-configuration) contient la liste complète des paramètres disponibles pour chaque type de pilote.
ko: Klipper는 `driver_XXX` 설정을 사용하여 많은 하위 수준 드라이버 필드 구성을 지원합니다. [TMC 드라이버 구성 참조](Config_Reference.md#tmc-stepper-driver-configuration)에는 각 드라이버 유형에 사용할 수 있는 전체 필드 목록이 있습니다.
zh_hans: Klipper支持使用`driver_XXX`设置来配置许多底层驱动程序字段。[TMC驱动配置参考](Config_Reference.md#tmc-stepper-driver-configuration)有每种类型的驱动可用字段的完整列表。

source: Each of these fields is defined in the Trinamic datasheet for each driver. These datasheets can be found on the [Trinamic website](https://www.trinamic.com/).
de: Jedes dieser Felder ist im Trinamic Datenblatt für jeden Treiber definiert. Diese Datenblätter finden Sie auf der [Trinamic website](https://www.trinamic.com/).
fr: Chacun de ces paramètres est défini dans la fiche technique de Trinamic pour chaque pilote. Ces fiches techniques sont disponibles sur le [site Internet de Trinamic](https://www.trinamic.com/).
ko: 이러한 각 필드는 각 드라이버에 대한 Trinamic 데이터시트에 정의되어 있습니다. 이 데이터시트는 [Trinamic 웹사이트](https://www.trinamic.com/)에서 찾을 수 있습니다.
zh_hans: 每一个字段都在驱动器的Trinamic数据手册中有定义。这些数据表可以在[Trinamic网站](https://www.trinamic.com/)上找到。

source: Note that the Trinamic datasheets sometime use wording that can confuse a high-level setting (such as "hysteresis end") with a low-level field value (eg, "HEND"). In Klipper, `driver_XXX` and SET_TMC_FIELD always set the low-level field value that is actually written to the driver. So, for example, if the Trinamic datasheet states that a value of 3 must be written to the HEND field to obtain a "hysteresis end" of 0, then set `driver_HEND=3` to obtain the high-level value of 0.
de: Beachten Sie, dass in den Datenblättern von Trinamic manchmal Formulierungen verwendet werden, die eine High-Level-Einstellung (z. B. "Hysteresis End") mit einem Low-Level-Feldwert (z. B. "HEND") verwechseln können. In Klipper setzen `driver_XXX` und SET_TMC_FIELD immer den Low-Level-Feldwert, der tatsächlich in den Treiber geschrieben wird. Wenn also zum Beispiel das Trinamic-Datenblatt besagt, dass ein Wert von 3 in das HEND-Feld geschrieben werden muss, um ein "Hysterese-Ende" von 0 zu erhalten, dann setzen Sie `driver_HEND=3`, um den High-Level-Wert von 0 zu erhalten.
fr: Les fiches techniques de Trinamic utilisent parfois une formulation qui peut confondre un paramètre de haut niveau (tel que "fin d'hystérésis") avec une valeur de paramètre de bas niveau (par exemple, "HEND"). Dans Klipper, `driver_XXX` et SET_TMC_FIELD définissent toujours la valeur de paramètres de bas niveau (celles qui sontt réellement écrite dans le pilote). Ainsi, par exemple, si la fiche technique Trinamic indique qu'une valeur de 3 doit être écrite dans le champ HEND pour obtenir une "fin d'hystérésis" de 0, alors définissez `driver_HEND=3` pour obtenir une valeur de haut niveau de 0.
ko: Trinamic 데이터시트는 때때로 높은 수준의 설정(예: "hysteresis end")과 낮은 수준의 필드 값(예: "HEND")을 혼동할 수 있는 문구를 사용합니다. Klipper에서 `driver_XXX`와 SET_TMC_FIELD는 항상 실제로 드라이버에 기록되는 하위 수준 필드 값을 설정합니다. 따라서 예를 들어 Trinamic 데이터시트에 "hysteresis end" 0을 얻기 위해 값 3을 HEND 필드에 기록해야 한다고 명시되어 있으면 `driver_HEND=3`을 설정하여 상위 수준 값 0을 얻습니다.
zh_hans: 请注意，Trinamic的数据表中，有时一些词可能导致在高层设置（如 "hysteresis end"）和底层字段值（如 "HEND"）的混乱。在Klipper中，`driver_XXX`和SET_TMC_FIELD总是设置实际写入驱动器的底层次字段值。例如，如果Trinamic的数据表指出，需要将3的值写入HEND字段，以使得 "hysteresis end"等于0，那么设置`driver_HEND=3`使得高层获得0的值。

source: Common Questions
de: Allgemeine Fragen
fr: Questions courantes
ko: 일반적인 질문
zh_hans: 常见问题

source: I keep getting "Unable to read tmc uart 'stepper_x' register IFCNT" errors?
de: Ich erhalte ständig die Fehlermeldung "Unable to read tmc uart 'stepper_x' register IFCNT"?
fr: J'ai des erreurs "Unable to read tmc uart 'stepper_x' register IFCNT" ?
ko: "Unable to read tmc uart 'stepper_x' register IFCNT" 오류가 계속 발생합니까?
zh_hans: 我一直得到 "Unable to read tmc uart 'stepper_x' register IFCNT "的错误？

source: This occurs when Klipper is unable to communicate with a tmc2208 or tmc2209 driver.
de: Dies tritt auf, wenn Klipper nicht in der Lage ist, mit einem tmc2208 oder tmc2209 Treiber zu kommunizieren.
fr: Cela se produit lorsque Klipper est incapable de communiquer avec un pilote tmc2208 ou tmc2209.
ko: 이것은 Klipper가 tmc2208 또는 tmc2209 드라이버와 통신할 수 없을 때 발생합니다.
zh_hans: 这种情况发生在Klipper无法与tmc2208或tmc2209驱动通信时。

source: Make sure that the motor power is enabled, as the stepper motor driver generally needs motor power before it can communicate with the micro-controller.
de: Vergewissern Sie sich, dass die Motorspannung eingeschaltet ist, da der Schrittmotortreiber in der Regel Motorspannung benötigt, bevor er mit dem Mikrocontroller kommunizieren kann.
fr: Assurez-vous que l'alimentation du moteur est activée, car le pilote du moteur pas à pas a généralement besoin de l'alimentation du moteur avant de pouvoir communiquer avec le micro-contrôleur.
ko: 스테퍼 모터 드라이버는 일반적으로 마이크로 컨트롤러와 통신하기 전에 모터 전원이 필요하므로 모터 전원이 활성화되어 있는지 확인하십시오.
zh_hans: 确保电机电源启用，因为步进电机驱动器在与微控制器通信之前一般需要确保电机先上电。

source: If this error occurs after flashing Klipper for the first time, then the stepper driver may have been previously programmed in a state that is not compatible with Klipper. To reset the state, remove all power from the printer for several seconds (physically unplug both USB and power plugs).
de: Wenn dieser Fehler nach dem ersten Flashen von Klipper auftritt, kann es sein, dass der Steppertreiber zuvor in einem Zustand programmiert wurde, der nicht mit Klipper kompatibel ist. Um den Status zurückzusetzen, trennen Sie den Drucker für einige Sekunden von der Stromversorgung (ziehen Sie sowohl den USB- als auch den Netzstecker).
fr: Si cette erreur se produit après avoir flashé Klipper pour la première fois, le pilote pas à pas peut avoir été précédemment programmé dans un état qui n'est pas compatible avec Klipper. Pour réinitialiser l'état, coupez toute alimentation de l'imprimante pendant plusieurs secondes (débranchez physiquement les prises USB et d'alimentation).
ko: 이 오류가 Klipper를 처음 깜박인 후 발생하면 스테퍼 드라이버가 이전에 Klipper와 호환되지 않는 상태로 프로그래밍되었을 수 있습니다. 상태를 재설정하려면 몇 초 동안 프린터에서 모든 전원을 제거하십시오(USB와 전원 플러그를 모두 물리적으로 분리).
zh_hans: 如果这个错误是在第一次刷写Klipper后发生的，那么步进驱动器可能处在一个状态，此状态与刚刚写入的Klipper不兼容。要重置该状态，请将打印机的所有电源拔掉几秒钟（物理上拔掉USB插头和电源插头）。

source: Otherwise, this error is typically the result of incorrect UART pin wiring or an incorrect Klipper configuration of the UART pin settings.
de: Andernfalls ist dieser Fehler typischerweise das Ergebnis einer falschen UART-Pin-Verdrahtung oder einer falschen Klipper-Konfiguration der UART-Pin-Einstellungen.
fr: Sinon, cette erreur est souvent due à un câblage incorrect des broche UART ou d'une configuration incorrecte des paramètres de broche UART dans Klipper.
ko: 그렇지 않으면 이 오류는 일반적으로 잘못된 UART 핀 배선 또는 UART 핀 설정의 잘못된 Klipper 구성의 결과입니다.
zh_hans: 否则，这种错误通常是由于UART引脚接线不正确或Klipper配置的UART引脚设置不正确造成的。

source: I keep getting "Unable to write tmc spi 'stepper_x' register ..." errors?
de: Andernfalls ist dieser Fehler typischerweise das Ergebnis einer falschen UART-Pin-Verkabelung oder einer falschen Klipper-Konfiguration der UART-Pin-Einstellungen.I keep getting "Unable to write tmc spi 'stepper_x' register ..." errors?
fr: J'ai des erreurs "Unable to write tmc spi 'stepper_x' register ..." ?
ko: "Unable to write tmc spi 'stepper_x' register ..." 오류가 계속 발생합니까?
zh_hans: 我一直得到 "Unable to write tmc spi 'stepper_x' register ..."的错误？

source: This occurs when Klipper is unable to communicate with a tmc2130 or tmc5160 driver.
de: Dies tritt auf, wenn Klipper nicht mit einem tmc2130 oder tmc5160 Treiber kommunizieren kann.
fr: Cela se produit lorsque Klipper est incapable de communiquer avec un pilote tmc2130 ou tmc5160.
ko: 이것은 Klipper가 tmc2130 또는 tmc5160 드라이버와 통신할 수 없을 때 발생합니다.
zh_hans: 当Klipper无法与tmc2130或tmc5160驱动通信时就会出现这种情况。

source: Otherwise, this error is typically the result of incorrect SPI wiring, an incorrect Klipper configuration of the SPI settings, or an incomplete configuration of devices on an SPI bus.
de: Andernfalls ist dieser Fehler typischerweise das Ergebnis einer falschen SPI-Verdrahtung, einer falschen Klipper-Konfiguration der SPI-Einstellungen oder einer unvollständigen Konfiguration von Geräten auf einem SPI-Bus.
fr: Cette erreur est souvent due à un câblage SPI incorrect, à une configuration incorrecte des paramètres SPI de Klipper ou d'une configuration incomplète des périphériques sur un bus SPI.
ko: 그렇지 않으면 이 오류는 일반적으로 잘못된 SPI 배선, SPI 설정의 잘못된 Klipper 구성 또는 SPI 버스의 장치 구성이 불완전한 결과입니다.
zh_hans: 否则，这种错误通常是由于SPI接线不正确、Klipper对SPI设置的配置不正确或SPI总线上的设备配置不完整造成的。

source: Note that if the driver is on a shared SPI bus with multiple devices then be sure to fully configure every device on that shared SPI bus in Klipper. If a device on a shared SPI bus is not configured, then it may incorrectly respond to commands not intended for it and corrupt the communication to the intended device. If there is a device on a shared SPI bus that can not be configured in Klipper, then use a [static_digital_output config section](Config_Reference.md#static_digital_output) to set the CS pin of the unused device high (so that it will not attempt to use the SPI bus). The board's schematic is often a useful reference for finding which devices are on an SPI bus and their associated pins.
de: Beachten Sie, dass, wenn der Treiber auf einem gemeinsamen SPI-Bus mit mehreren Geräten ist, stellen Sie sicher, dass Sie jedes Gerät auf diesem gemeinsamen SPI-Bus in Klipper vollständig konfigurieren. Wenn ein Gerät auf einem gemeinsam genutzten SPI-Bus nicht konfiguriert ist, kann es fälschlicherweise auf Befehle reagieren, die nicht für es bestimmt sind, und die Kommunikation mit dem vorgesehenen Gerät stören. Wenn es ein Gerät auf einem gemeinsamen SPI-Bus gibt, das nicht in Klipper konfiguriert werden kann, dann verwenden Sie einen [static_digital_output config section](Config_Reference.md#static_digital_output), um den CS-Pin des unbenutzten Geräts auf High zu setzen (so dass es nicht versucht, den SPI-Bus zu benutzen). Der Schaltplan des Boards ist oft eine nützliche Referenz, um herauszufinden, welche Geräte an einem SPI-Bus angeschlossen sind und welche Pins ihnen zugeordnet sind.
fr: Si le pilote se trouve sur un bus SPI partagé avec plusieurs périphériques, assurez-vous de configurer - dans Klipper - chaque périphérique sur ce bus SPI. Si un appareil sur un bus SPI partagé n'est pas configuré, il peut répondre de manière incorrecte à des commandes qui ne lui sont pas destinées et corrompre la communication avec l'appareil prévu. S'il y a un appareil sur un bus SPI partagé qui ne peut pas être configuré dans Klipper, utilisez la [section de configuration static_digital_output](Config_Reference.md#static_digital_output) pour régler la broche CS de l'appareil inutilisé à un niveau élevé (afin qu'il n'essaie pas d'utiliser le bus SPI). Le schéma de la carte est une référence utile (ndt et nécessaire) pour trouver les périphériques qui se trouvent sur un bus SPI et leurs broches associées.
ko: 드라이버가 여러 장치가 있는 공유 SPI 버스에 있는 경우 Klipper에서 해당 공유 SPI 버스의 모든 장치를 완전히 구성해야 합니다. 공유 SPI 버스의 장치가 구성되지 않은 경우 의도하지 않은 명령에 잘못 응답하고 의도한 장치에 대한 통신이 손상될 수 있습니다. Klipper에서 구성할 수 없는 공유 SPI 버스에 장치가 있는 경우 [static_digital_output config 섹션](Config_Reference.md#static_digital_output)을 사용하여 사용하지 않는 장치의 CS 핀을 높음으로 설정합니다. SPI 버스를 사용하기 위해 보드의 회로도는 SPI 버스 및 관련 핀에 있는 장치를 찾는 데 유용한 참조가 되는 경우가 많습니다.
zh_hans: 请注意，如果驱动器是在挂多个设备共享的SPI总线上，那么一定要在Klipper中完全配置该共享SPI总线上的每个设备。如果共享SPI总线上的一个设备没有被配置，那么它可能会错误地响应不是为它准备的命令，并破坏与目标设备的通信。如果在共享的SPI总线上有不能在Klipper中配置的设备，那么使用[static_digital_output config section](Config_Reference.md#static_digital_output)将未使用的设备的CS引脚设置为高电平（这样它就不会试图使用SPI总线）。电路板的原理图通常是一个有用的参考，原理图上可以找到哪些设备挂在SPI总线上以及它们的相关引脚。

source: Why did I get a "TMC reports error: ..." error?
de: Warum erhielt ich die Fehlermeldung "TMC meldet Fehler: ..."?
fr: Pourquoi ai-je une erreur "TMC reports error : ..." ?
ko: "TMC 보고서 오류: ..." 오류가 발생한 이유는 무엇입니까?
zh_hans: 为什么我得到一个 "TMC reports error: ..."错误？

source: This type of error indicates the TMC driver detected a problem and has disabled itself. That is, the driver stopped holding its position and ignored movement commands. If Klipper detects that an active driver has disabled itself, it will transition the printer into a "shutdown" state.
de: Diese Art von Fehler zeigt an, dass der TMC-Treiber ein Problem erkannt und sich selbst deaktiviert hat. Das heißt, der Treiber hat aufgehört, seine Position zu halten und ignoriert Bewegungsbefehle. Wenn Klipper feststellt, dass ein aktiver Treiber sich selbst deaktiviert hat, wird der Drucker in einen "Shutdown"-Zustand versetzt.
fr: Ce type d'erreur indique que le pilote TMC a détecté un problème et s'est désactivé. C'est-à-dire que le pilote de moteur pas à pas a cessé de maintenir sa position et a ignoré les commandes de mouvement. Si Klipper détecte qu'un pilote actif s'est désactivé, il fera passer l'imprimante dans un état "arrêt".
ko: 이 유형의 오류는 TMC 드라이버가 문제를 감지하고 자체적으로 비활성화 되었음을 나타냅니다. 즉, 드라이버가 위치 유지를 중지하고 이동 명령을 무시했습니다. Klipper는 활성 드라이버가 자체적으로 비활성화되었음을 감지하면 프린터를 "shutdown" 상태로 전환합니다.
zh_hans: 这类型的错误表明TMC驱动器检测到了一个问题，并且已经自我禁用。也就是说，驱动器已经停止了保持位置，并忽略了移动命令。如果Klipper检测到一个激活的驱动器已经自我禁用，它就会把打印机切换到 "关闭 "状态。

source: Some common errors and tips for diagnosing them:
de: Einige häufige Fehler und Tipps zu deren Diagnose:
fr: Quelques erreurs courantes et conseils pour les diagnostiquer :
ko: 몇 가지 일반적인 오류 및 진단 팁:
zh_hans: 一些常见的错误和诊断的技巧：

source: It's also possible that a **TMC reports error** shutdown occurs due to SPI errors that prevent communication with the driver (on tmc2130, tmc5160, or tmc2660). If this occurs, it's common for the reported driver status to show `00000000` or `ffffffff` - for example: `TMC reports error: DRV_STATUS: ffffffff ...` OR `TMC reports error: READRSP@RDSEL2: 00000000 ...`. Such a failure may be due to an SPI wiring problem or may be due to a self-reset or failure of the TMC driver.
de: Es ist auch möglich, dass ein **TMC meldet Fehler** Shutdown aufgrund von SPI-Fehlern auftritt, die die Kommunikation mit dem Treiber verhindern (bei tmc2130, tmc5160 oder tmc2660). Wenn dies geschieht, zeigt der gemeldete Treiberstatus üblicherweise `00000000` oder `ffffffff` zum Beispiel: `TMC reports error: DRV_STATUS: ffffffff ...` ODER `TMC meldet Fehler: READRSP@RDSEL2: 00000000 ...`. Ein solcher Fehler kann auf ein SPI Verdrahtungsproblem oder auf einen Selbst Reset oder einen Fehler des TMCTreibers zurückzuführen sein.
fr: Il est également possible qu'un arrêt **TMC reports error** se produise en raison d'erreurs SPI qui empêchent la communication avec le pilote (sur les tmc2130, tmc5160 ou tmc2660). Si cela se produit, il est fréquent que l'état du pilote indiqué affiche `00000000` ou `ffffffff` - par exemple : `TMC reports error : DRV_STATUS : ffffffff ...` OU [ X316X]TMC reports error : READRSP@RDSEL2 : 00000000 ...`. Une telle défaillance peut être due à un problème de câblage SPI ou à une réinitialisation automatique ou à une défaillance du pilote TMC.
ko: 드라이버와의 통신을 방해하는 SPI 오류로 인해 **TMC가 오류 보고** 종료가 발생할 수도 있습니다(tmc2130, tmc5160 또는 tmc2660에서). 이 경우 보고된 드라이버 상태가 `00000000` 또는 `ffffffff`로 표시되는 것이 일반적입니다. 예: `TMC 보고 오류: DRV_STATUS: ffffffff ...' 또는 `TMC 보고 오류: READRSP@RDSEL2: 00000000 ... `. 이러한 오류는 SPI 배선 문제로 인한 것일 수도 있고 자체 재설정 또는 TMC 드라이버의 오류로 인한 것일 수도 있습니다.
zh_hans: 也有可能由于SPI错误导致无法与驱动器通信而发生**TMC reports error**导致的关机（在tmc2130、tmc5160或tmc2660上）。如果发生这种情况，报告的驱动器状态通常会显示 "00000000 "或 "ffffff"--例如：`TMC reports error: DRV_STATUS: ffffffff ...`或者`TMC reports error: READRSP@RDSEL2: 00000000 ...`。这样的故障可能是由于SPI的接线问题，也可能是由于TMC驱动器的自复位或故障导致的。

source: The [Trinamic website](https://www.trinamic.com/) has guides on configuring the drivers. These guides are often technical, low-level, and may require specialized hardware. Regardless, they are the best source of information.
de: Auf der [Trinamic-Website](https://www.trinamic.com/) finden Sie Anleitungen zur Konfiguration der Treiber. Diese Anleitungen sind oft technisch anspruchsvoll und können spezielle Hardware erfordern. Unabhängig davon sind sie die beste Informationsquelle.
fr: Le [site Web de Trinamic](https://www.trinamic.com/) contient des guides sur la configuration des pilotes. Ces guides sont souvent techniques, de bas niveau et peuvent nécessiter du matériel spécialisé. Quoi qu'il en soit, ils sont la meilleure source d'information.
ko: [Trinamic 웹사이트](https://www.trinamic.com/)에는 드라이버 구성에 대한 가이드가 있습니다. 이 가이드는 종종 기술적이고 낮은 수준이며 특수 하드웨어가 필요할 수 있습니다. 그럼에도 불구하고 그들은 최고의 정보 소스입니다.
zh_hans: [Trinamic网站](https://www.trinamic.com/)有关于配置驱动程序的指南。这些指南通常是专业、底层且可能需要专用的硬件。不管怎么说，它们是最好的信息来源。

source: [tmc2209 stepper_x] diag_pin: ^PA1 # Set to MCU pin connected to TMC DIAG pin driver_SGTHRS: 255 # 255 is most sensitive value, 0 is least sensitive ... [stepper_x] endstop_pin: tmc2209_stepper_x:virtual_endstop homing_retract_dist: 0 ...
de: [tmc2209 stepper_x] diag_pin: ^PA1 # Einstellung auf MCU-Pin, der mit dem TMC DIAG-Pin verbunden ist driver_SGTHRS: 255 # 255 ist der empfindlichste Wert, 0 der am wenigsten empfindliche ... [stepper_x] endstop_pin: tmc2209_stepper_x:virtual_endstop homing_retract_dist: 0 ...
fr: [tmc2209 stepper_x] diag_pin: ^PA1 # Définit pour le MCU, la broche TMC DIAG driver_SGTHRS: 255 # 255 est la valeur la plus sensible, 0 la moins sensible ... [stepper_x] endstop_pin: tmc2209_stepper_x:virtual_endstop homing_retract_dist: 0 ...
zh_hans: [tmc2209 stepper_x] diag_pin: ^PA1 # 设置MCU引脚连接到TMC的DIAG引脚 driver_SGTHRS: 255 # 255是最敏感的值，0是最不敏感的值 ... [stepper_x] endstop_pin: tmc2209_stepper_x:virtual_endstop homing_retract_dist: 0 ...

source: [tmc2130 stepper_x] diag1_pin: ^!PA1 # Pin connected to TMC DIAG1 pin (or use diag0_pin / DIAG0 pin) driver_SGT: -64 # -64 is most sensitive value, 63 is least sensitive ... [stepper_x] endstop_pin: tmc2130_stepper_x:virtual_endstop homing_retract_dist: 0 ...
de: [tmc2130 stepper_x] diag1_pin: ^!PA1 # Pin verbunden mit TMC DIAG1 Pin (oder diag0_pin / DIAG0 Pin verwenden) driver_SGT: -64 # -64 ist der empfindlichste Wert, 63 der unempfindlichste ... [stepper_x] endstop_pin: tmc2130_stepper_x:virtual_endstop homing_retract_dist: 0 ...
fr: [tmc2130 stepper_x] diag1_pin: ^!PA1 # Broche connectée à TMC DIAG1 (ou utilisez diag0_pin / DIAG0 pin) driver_SGT: -64 # -64 est la valeur la plus sensible, 63 est moins sensible ... [stepper_x] endstop_pin: tmc2130_stepper_x:virtual_endstop homing_retract_dist: 0 ...
zh_hans: [tmc2130 stepper_x] diag1_pin: ^!PA1 # 连接到TMC的DIAG1引脚(或使用diag0_pin / DIAG0引脚) driver_SGT: -64 # -64是最敏感的值，63是最不敏感的值 ... [stepper_x] endstop_pin: tmc2130_stepper_x:virtual_endstop homing_retract_dist: 0 ...

source: [tmc2660 stepper_x] driver_SGT: -64 # -64 is most sensitive value, 63 is least sensitive ... [stepper_x] endstop_pin: ^PA1 # Pin connected to TMC SG_TST pin homing_retract_dist: 0 ...
de: [tmc2660 stepper_x] driver_SGT: -64 # -64 ist der empfindlichste Wert, 63 ist am wenigsten empfindlich ... [stepper_x] endstop_pin: ^PA1 # Pin verbunden mit TMC SG_TST Pin homing_retract_dist: 0 ...
fr: [tmc2660 stepper_x] driver_SGT: -64 # -64 est la valeur la plus sensible,, 63 est moins sensible ... [stepper_x] endstop_pin: ^PA1 # Broche connectée à TMC SG_TST homing_retract_dist: 0 ...
zh_hans: [tmc2660 stepper_x] driver_SGT: -64 # -64是最敏感的值，63是最不敏感的值 ... [stepper_x] endstop_pin: ^PA1 # 与TMC SG_TST引脚相连的引脚 homing_retract_dist: 0 ...

source: TMC drivers
de: TMC Treiber
fr: Pilotes de moteur pas à pas TMC
ko: TMC 드라이버
zh_hans: TMC 驱动器
