Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/TMC_Drivers.po
Languages: de, fr, ko, zh_hans

source: Next, continually decrease the sensitivity of the `VALUE` setting and run the `SET_TMC_FIELD` `G28 X0` commands again to find the highest sensitivity that results in the carriage successfully moving all the way to the endstop and halting. (For tmc2209 drivers this will be decreasing SGTHRS, for other drivers it will be increasing sgt.) Be sure to start each attempt with the carriage near the center of the rail (if needed issue `M84` and then manually move the carriage to the center). It should be possible to find the highest sensitivity that homes reliably (settings with higher sensitivity result in small or no movement). Note the found value as *maximum_sensitivity*. (If the minimum possible sensitivity (SGTHRS=0 or sgt=63) is obtained without any carriage movement then something is not correct with the diag/sg_tst pin wiring or configuration and it must be corrected before continuing.)
de: Verringern Sie dann kontinuierlich die Empfindlichkeit der `VALUE` Einstellung und führen Sie die `SET_TMC_FIELD` `G28 X0`-Befehle erneut aus, um die höchste Empfindlichkeit zu finden, die dazu führt, dass der Schlitten erfolgreich bis zum Endanschlag fährt und anhält. (Bei tmc2209-Treibern ist dies die Verringerung von SGTHRS, bei anderen Treibern die Erhöhung von sgt). Stellen Sie sicher, dass Sie jeden Versuch mit dem Wagen in der Nähe der Mitte der Schiene beginnen (geben Sie bei Bedarf `M84` aus und bewegen Sie den Wagen dann manuell in die Mitte). Es sollte möglich sein, die höchste Empfindlichkeit zu finden, die zuverlässig funktioniert (Einstellungen mit höherer Empfindlichkeit führen zu geringer oder keiner Bewegung). Notieren Sie den gefundenen Wert als *maximum_sensitivity*. (Wenn die kleinstmögliche Empfindlichkeit (SGTHRS=0 oder sgt=63) erreicht wird, ohne dass sich der Schlitten bewegt, stimmt etwas mit der Verdrahtung oder Konfiguration des diag/sg_tst-Pins nicht und muss korrigiert werden, bevor Sie fortfahren).
fr: Ensuite, diminuez continuellement la sensibilité du paramètre `VALUE` et exécutez à nouveau les commandes `SET_TMC_FIELD` `G28 X0` pour trouver la sensibilité la plus élevée qui permet au chariot de se déplacer et de s'arrêter en butée. (Pour les pilotes tmc2209, cela diminuera SGTHRS, pour les autres pilotes, cela augmentera sgt.). Il devrait être possible de trouver la sensibilité la plus élevée et fiable (les réglages avec une sensibilité plus élevée entraînant peu ou pas de mouvement). Notez la valeur trouvée comme *maximum_sensitivity*. (Si la sensibilité minimale possible (SGTHRS = 0 ou sgt = 63) est obtenue sans aucun mouvement du chariot, alors quelque chose ne fonctionne pas aun niveau câblage ou configuration de la broche diag/sg_tst et il faut corriger le problème avant de continuer.)
ko: 다음으로 `VALUE` 설정의 감도를 지속적으로 낮추고 `SET_TMC_FIELD` `G28 X0` 명령을 다시 실행하여 캐리지가 엔드스톱까지 성공적으로 이동하고 정지하게 하는 가장 높은 감도를 찾습니다. (tmc2209 드라이버의 경우 SGTHRS가 감소하고 다른 드라이버의 경우 sgt가 증가합니다.) 각 시도를 레일 중앙 근처에서 시작해야 합니다(필요한 경우 `M84`를 발행한 다음 캐리지를 수동으로 센터). 가장 높은 감도를 안정적으로 찾을 수 있어야 합니다(감도가 높은 설정은 움직임이 적거나 없음). 발견된 값을 *maximum_sensitivity*로 기록합니다. (캐리지 이동 없이 가능한 최소 감도(SGTHRS=0 또는 sgt=63)를 얻은 경우 diag/sg_tst 핀 배선 또는 구성에 문제가 있는 것이므로 계속하기 전에 수정해야 합니다.)
zh_hans: 接下来，不断降低 `VALUE` 设置的灵敏度，并再次运行 `SET_TMC_FIELD`和`G28 X0` 命令，找到能使使滑车成功地一直移动到端点并停止的最高的灵敏度。(对于TMC2209驱动，调整是减少 SGTHRS，对于其他驱动，调整是增加 sgt)。确保每次尝试都在轨道中心附近开始（如果需要，发出`M84`，然后手动将滑车移到中心）。该方法应该可以找到可靠归位的最高灵敏度（更高的灵敏度设置会导致滑车只动一小段或完全不动）。注意找到的值为*maximum_sensitivity*。(如果在最低灵敏度（SGTHRS=0或sgt=63）下滑车也不动，那么diag/sg_tst 引脚的接线或配置可能有问题，必须在继续后面操作前予以修正。）

source: When searching for maximum_sensitivity, it may be convenient to jump to different VALUE settings (so as to bisect the VALUE parameter). If doing this then be prepared to issue an `M112` command to halt the printer, as a setting with a very low sensitivity may cause the axis to repeatedly "bang" into the end of the rail.
de: Bei der Suche nach der maximalen Empfindlichkeit kann es sinnvoll sein, zu verschiedenen VALUE-Einstellungen zu springen (um den VALUE-Parameter zu halbieren). Wenn Sie dies tun, sollten Sie darauf vorbereitet sein, einen `M112`Befehl zu erteilen, um den Drucker anzuhalten, da eine Einstellung mit einer sehr niedrigen Empfindlichkeit dazu führen kann, dass die Achse wiederholt gegen das Ende der Schiene "knallt".
fr: Lors de la recherche de maximum_sensitivity, il peut être pratique de passer à différents paramètres VALUE (travaillez le paramètre VALUE par dichotomie pour plus d'efficacité). Si vous procédez ainsi, préparez-vous à émettre une commande `M112` pour arrêter l'imprimante, car un réglage avec une sensibilité trop faible peut entraîner un "cognement" répété de l'axe contre l'extrémité du rail.
ko: maximum_sensitivity를 검색할 때 다른 VALUE 설정으로 이동하는 것이 편리할 수 있습니다(VALUE 매개변수를 이등분하기 위해). 이 작업을 수행하는 경우 `M112` 명령을 실행하여 프린터를 중지할 준비를 하십시오. 매우 낮은 감도로 설정하면 축이 레일 끝에 반복적으로 "쿵"할 수 있기 때문입니다.
zh_hans: 在寻找最大灵敏度时，更方便的是跳到不同的VALUE设置（比如将VALUE参数的一半）。如果这样做，请准备好发出 `M112`命令以停止打印机，因为灵敏度很低的设置可能会导致轴反复 "撞 "到导轨的末端。

source: Be sure to wait a couple of seconds between each homing attempt. After the TMC driver detects a stall it may take a little time for it to clear its internal indicator and be capable of detecting another stall.
de: Achten Sie darauf, dass Sie zwischen den einzelnen Referenzfahrtversuchen ein paar Sekunden warten. Nachdem der TMC-Treiber einen Strömungsabriss erkannt hat, kann es einige Zeit dauern, bis er seine interne Anzeige löscht und in der Lage ist, einen weiteren Strömungsabriss zu erkennen.
fr: Assurez-vous d'attendre quelques secondes entre chaque tentative de prise d'origine. Une fois que le pilote TMC a détecté un décrochage, il peut lui falloir un peu de temps pour effacer son indicateur interne et être capable de détecter un autre décrochage.
ko: 각 원점복귀 시도 사이에 몇 초 정도 기다려야 합니다. TMC 드라이버가 stall을 감지한 후 내부 표시기를 지우고 다른 stall을 감지할 수 있을 때까지 약간의 시간이 걸릴 수 있습니다.
zh_hans: 请确保在每次归位尝试之间等待几秒钟。在TMC驱动程序检测到失速后，它可能需要一点时间来清除其内部指示器，才能够检测到下一次失速。

source: During these tuning tests, if a `G28 X0` command does not move all the way to the axis limit, then be careful with issuing any regular movement commands (eg, `G1`). Klipper will not have a correct understanding of the carriage position and a move command may cause undesirable and confusing results.
de: Wenn während dieser Abstimmungstests ein `G28 X0`-Befehl nicht bis zur Achsengrenze fährt, dann seien Sie vorsichtig mit der Ausgabe von regulären Fahrbefehlen (z.B. `G1`). Klipper kann die Position des Schlittens nicht richtig einschätzen und ein Fahrbefehl kann zu unerwünschten und verwirrenden Ergebnissen führen.
fr: Au cours de ces tests de réglage, si une commande `G28 X0` ne se déplace pas jusqu'à la limite d'axe, soyez prudent lorsque vous exécutez des commandes de mouvement 'normales' (par exemple, `G1`). Klipper ne sachant pas ou est le chariot, une commande de déplacement pourra entraîner des résultats indésirables.
ko: 이러한 튜닝 테스트 중에 `G28 X0` 명령이 축 제한까지 완전히 이동하지 않으면 일반 이동 명령(예: `G1`)을 실행할 때 주의하십시오. Klipper는 캐리지 위치를 올바르게 이해하지 못하며 이동 명령은 바람직하지 않고 혼란스러운 결과를 초래할 수 있습니다.
zh_hans: 在调整测试中，如果`G28 X0`命令不能完全移动到轴的极限位置，那么在发出任何常规移动命令（例如，`G1`）时要小心。Klipper将不能正确定位滑块的位置，移动命令可能会导致非预期和混乱的结果。

source: Find lowest sensitivity that homes with one touch
de: Finden Sie die niedrigste Empfindlichkeit, für die Home Berührung
fr: Trouver la sensibilité la plus basse qui permette la mise à l'origine en une seule fois
ko: 원터치로 원점복귀에 가장 낮은 민감도 찾기
zh_hans: 找到最低的灵敏度，只需一次接触就能归位

source: When homing with the found *maximum_sensitivity* value, the axis should move to the end of the rail and stop with a "single touch" - that is, there should not be a "clicking" or "banging" sound. (If there is a banging or clicking sound at maximum_sensitivity then the homing_speed may be too low, the driver current may be too low, or sensorless homing may not be a good choice for the axis.)
de: Bei der Referenzfahrt mit dem gefundenen Wert *maximum_sensitivity* sollte sich die Achse bis zum Ende der Schiene bewegen und mit einer "einzigen Berührung" stoppen - das heißt, es sollte kein "Klicken" oder "Knallen" zu hören sein. (Wenn bei maximaler_Empfindlichkeit ein Knall- oder Klickgeräusch zu hören ist, ist die Referenzfahrtgeschwindigkeit möglicherweise zu niedrig, der Treiberstrom zu gering oder die sensorlose Referenzfahrt ist keine gute Wahl für die Achse).
fr: Lors de la mise à l'origine avec la valeur *maximum_sensitivity*, l'axe doit se déplacer jusqu'à l'extrémité du rail et s'arrêter avec un « simple toucher » - c'est-à-dire qu'il ne doit pas y avoir de « clic » ou de « claquement ». (S'il y a un bruit de claquement ou de clic à la sensibilité maximale, la vitesse de mise à l'origine est peut-être trop faible, le courant du pilote peut être trop faible ou la mise à l'origine sans capteur n'est peut-être pas un bon choix pour cet axe.)
ko: 찾은 *maximum_sensitivity* 값으로 원점 복귀할 때 축은 레일 끝으로 이동하고 "한 번의 터치"로 정지해야 합니다. 즉, "딸깍" 또는 "쿵" 소리가 없어야 합니다. (max_sensitivity에서 두드리는 소리나 딸깍하는 소리가 나면 homing_speed가 너무 낮거나 드라이버 전류가 너무 낮거나 센서리스 homing이 축에 적합한 선택이 아닐 수 있습니다.)
zh_hans: 当用找到的*最大灵敏度*值归位时，轴应该移动到轨道的末端并 "single touch（一触即停）"--也就是说，不应该有 "咔嚓 "或 "砰 "的声音。(如果在最大灵敏度下有撞击或点击声，那么归位速度可能太低，驱动电流可能太低，或者该轴可能不适合用无传感器归位。）

source: The next step is to again continually move the carriage to a position near the center of the rail, decrease the sensitivity, and run the `SET_TMC_FIELD` `G28 X0` commands - the goal is now to find the lowest sensitivity that still results in the carriage successfully homing with a "single touch". That is, it does not "bang" or "click" when contacting the end of the rail. Note the found value as *minimum_sensitivity*.
de: Der nächste Schritt besteht darin, den Schlitten wieder kontinuierlich in eine Position nahe der Mitte der Schiene zu bewegen, die Empfindlichkeit zu verringern und die Befehle `SET_TMC_FIELD` `G28 X0` auszuführen - das Ziel ist nun, die niedrigste Empfindlichkeit zu finden, die immer noch dazu führt, dass der Schlitten mit einer "einzigen Berührung" erfolgreich referenziert. Das heißt, er "knallt" oder "klickt" nicht, wenn er das Ende der Schiene berührt. Notieren Sie den gefundenen Wert als *minimum_sensitivity*.
fr: L'étape suivante consiste à nouveau à déplacer le chariot vers une position proche du centre du rail, à diminuer la sensibilité et à exécuter les commandes `SET_TMC_FIELD` `G28 X0` - l'objectif est maintenant de trouver la sensibilité la plus faible qui permette au chariot de se mettre à l'origine correctement avec une "simple touche". C'est-à-dire qu'il ne "cogne" pas ou ne "clique" pas lorsqu'il entre en contact avec l'extrémité du rail. Notez la valeur trouvée comme *minimum_sensitivity*.
ko: 다음 단계는 캐리지를 계속해서 레일 중앙 근처의 위치로 이동하고 민감도를 낮추고 `SET_TMC_FIELD` `G28 X0` 명령을 실행하는 것입니다. 이제 목표는 여전히 캐리지가 "한 번의 터치"로 성공적으로 원점 복귀할 수 있는 가장 낮은 민감도를 찾는 것입니다. 즉, 레일 끝부분에 닿았을 때 "쾅"하거나 "딸깍"하지 않습니다. 발견된 값을 *minimum_sensitivity*로 기록합니다.
zh_hans: 下一步是再次持续移动滑块到靠近轨道中心的位置，降低灵敏度，并运行`SET_TMC_FIELD`和`G28 X0`命令 - 这次的目标是找到最低的灵敏度，仍能使滑块成功地 "一触即停"归位。也就是说，当接触到轨道的末端时，它不会发出"砰 "或 "咔"的声音。注意找到的值是*minimum_sensitivity*。

source: Update printer.cfg with sensitivity value
de: printer.cfg mit Empfindlichkeitswert aktualisieren
fr: Mettez à jour printer.cfg avec la valeur de sensibilité
ko: 민감도 값으로 printer.cfg 업데이트
zh_hans: 更新printer.cfg中的灵敏度值

source: After finding *maximum_sensitivity* and *minimum_sensitivity*, use a calculator to obtain the recommend sensitivity as *minimum_sensitivity + (maximum_sensitivity - minimum_sensitivity)/3*. The recommended sensitivity should be in the range between the minimum and maximum, but slightly closer to the minimum. Round the final value to the nearest integer value.
de: Nachdem Sie *maximale_Empfindlichkeit* und *minimale_Empfindlichkeit* ermittelt haben, verwenden Sie einen Taschenrechner, um die empfohlene Empfindlichkeit als *minimale_Empfindlichkeit + (maximale_Empfindlichkeit - minimale_Empfindlichkeit)/3* zu berechnen. Die empfohlene Empfindlichkeit sollte im Bereich zwischen dem Minimum und dem Maximum liegen, aber etwas näher am Minimum. Runden Sie den endgültigen Wert auf den nächsten ganzzahligen Wert.
fr: Après avoir trouvé *maximum_sensitivity* et *minimum_sensitivity*, utilisez une calculatrice pour obtenir la sensibilité recommandée : *minimum_sensitivity + (maximum_sensitivity - minimum_sensitivity)/3*. La sensibilité recommandée doit être comprise entre le minimum et le maximum, mais légèrement plus proche du minimum. Arrondissez la valeur finale à la valeur entière la plus proche.
ko: *maximum_sensitivity* 및 *minimum_sensitivity*를 찾은 후 계산기를 사용하여 권장 민감도를 *minimum_sensitivity + (maximum_sensitivity - minimum_sensitivity)/3*로 구합니다. 권장 민감도는 최소값과 최대값 사이의 범위에 있어야 하지만 최소값에 약간 더 가깝습니다. 최종 값을 가장 가까운 정수 값으로 반올림합니다.
zh_hans: 在找到*maximum_sensitivity*和*minimum_sensitivity*后，计算得到推荐的灵敏度为 *minimum_sensitivity +(maximum_sensitivity-minimum_sensitivity)/3*。推荐的灵敏度应该在最小值和最大值之间，但略微接近最小值。将最终值四舍五入到最近的整数值。

source: For tmc2209 set this in the config as `driver_SGTHRS`, for other TMC drivers set this in the config as `driver_SGT`.
de: Für tmc2209 setzen Sie dies in der Konfiguration als `driver_SGTHRS`, für andere TMC-Treiber setzen Sie dies in der Konfiguration als `driver_SGT`.
fr: Pour un tmc2209, définissez-le dans la configuration en tant que `driver_SGTHRS`, pour les autres pilotes TMC, définissez-le dans la configuration en tant que `driver_SGT`.
ko: tmc2209의 경우 구성에서 `driver_SGTHRS`로 설정하고 다른 TMC 드라이버의 경우 구성에서 `driver_SGT`로 설정합니다.
zh_hans: 对于TMC2209，在配置中设置`driver_SGTHRS`，对于其他TMC驱动，在配置中设置`driver_SGT`。

source: If the range between *maximum_sensitivity* and *minimum_sensitivity* is small (eg, less than 5) then it may result in unstable homing. A faster homing speed may increase the range and make the operation more stable.
de: Wenn der Bereich zwischen *maximum_sensitivity* und *minimum_sensitivity* klein ist (z. B. weniger als 5), kann dies zu einer instabilen Referenzfahrt führen. Eine schnellere Referenzfahrtgeschwindigkeit kann den Bereich vergrößern und den Betrieb stabiler machen.
fr: Si la plage entre *maximum_sensitivity* et *minimum_sensitivity* est petite (par exemple, inférieure à 5), cela peut entraîner une mise à l'origine instable. Une vitesse de mise à l'origine plus rapide peut rendre l'opération plus stable.
ko: *maximum_sensitivity*와 *minimum_sensitivity* 사이의 범위가 작으면(예: 5 미만) 불안정한 원점 복귀가 발생할 수 있습니다. 원점복귀 속도가 빠를수록 범위가 넓어지고 안정적인 작동이 가능합니다.
zh_hans: 如果*maximum_sensitivity*和*minimum_sensitivity*之间的范围很小（例如，小于5），那么可能导致不稳定的归位。更快的归位速度可以扩大范围，使操作更加稳定。

source: Note that if any change is made to driver current, homing speed, or a notable change is made to the printer hardware, then it will be necessary to run the tuning process again.
de: Beachten Sie, dass bei Änderungen des Treiberstroms, der Referenzfahrtgeschwindigkeit oder bei wesentlichen Änderungen an der Druckerhardware der Abstimmungsprozess erneut durchgeführt werden muss.
fr: Notez que si une modification est apportée au courant du pilote, à la vitesse de prise d'origine ou si une modification notable est apportée au matériel de l'imprimante, il sera alors nécessaire de refaire le processus de réglage.
ko: 드라이버 전류, 원점복귀 속도가 변경되거나 프린터 하드웨어가 눈에 띄게 변경되면 조정 프로세스를 다시 실행해야 합니다.
zh_hans: 请注意，如果对驱动电流、归位速度做了任何改变，或者对打印机硬件做了明显的改变，那么就需要再次运行这个调整过程。

source: Using Macros when Homing
de: Verwenden sie Macros für die Referenzfahrt
fr: Utilisation de macros lors de la mise à l'origine
ko: 원점 복귀 시 매크로 사용
zh_hans: 归位时使用宏

source: After sensorless homing completes the carriage will be pressed against the end of the rail and the stepper will exert a force on the frame until the carriage is moved away. It is a good idea to create a macro to home the axis and immediately move the carriage away from the end of the rail.
de: Nach Abschluss der sensorlosen Referenzfahrt wird der Schlitten gegen das Ende der Schiene gedrückt und der Stepper übt eine Kraft auf den Rahmen aus, bis der Schlitten weggefahren ist. Es ist eine gute Idee, ein Makro zu erstellen, um die Achse zu referenzieren und den Schlitten sofort vom Ende der Schiene weg zu bewegen.
fr: Une fois la mise à l'origine sans capteur terminée, le chariot sera appuyé contre l'extrémité du rail et le stepper exercera une force sur le cadre tant que le chariot ne sera pas éloigné de la fin de course. Il est préférable de créer une macro pour positionner l'axe en butée et l'éloigner immédiatement de l'extrémité du rail.
ko: 센서리스 원점복귀가 완료되면 캐리지가 레일의 끝 부분에 대해 눌려지고 스테퍼는 캐리지가 멀리 이동할 때까지 프레임에 힘을 가합니다. 축을 홈으로 이동하고 즉시 캐리지를 레일 끝에서 멀리 이동하는 매크로를 만드는 것이 좋습니다.
zh_hans: 在无传感器归位完成后，滑车将顶到导轨的末端，步进器将持续对框架施加力，直到滑车移开。最好创建一个宏来使轴归位，并立即将小车从轨道的末端移开。

source: It is a good idea for the macro to pause at least 2 seconds prior to starting sensorless homing (or otherwise ensure that there has been no movement on the stepper for 2 seconds). Without a delay it is possible for the driver's internal stall flag to still be set from a previous move.
de: Es ist ratsam, dass das Makro vor dem Start der sensorlosen Referenzfahrt mindestens 2 Sekunden pausiert (oder auf andere Weise sicherstellt, dass der Stepper 2 Sekunden lang nicht bewegt wurde). Ohne eine Verzögerung ist es möglich, dass das interne "stall"-Flag des Treibers noch von einer vorherigen Bewegung gesetzt ist.
fr: Il est préférable, dans la macro, de faire une pause d'au moins 2 secondes avant de commencer la prise d'origine sans capteur (ou de s'assurer qu'il n'y a eu aucun mouvement sur le moteur pas à pas depuis au moins 2 secondes). Sans délai, il est possible que le drapeau de décrochage interne du pilote de moteur pas à pas soit toujours activé suite à un mouvement précédent.
ko: 센서리스 원점복귀를 시작하기 최소 2초 전에 매크로를 일시 중지하는 것이 좋습니다(또는 2초 동안 스테퍼에서 움직임이 없는지 확인). 지연 없이 드라이버의 내부 stall flag가 이전 이동에서 계속 설정될 수 있습니다.
zh_hans: 在开始无传感器归位之前，宏最好暂停至少2秒（或确保步进在2秒内没有移动）。如果没有延迟，驱动器的内部失速标志有可能在之前的移动中被设置了。

source: An example macro might look something like:
de: Ein Beispielmakro könnte so aussehen:
fr: Un exemple de macro pourrait ressembler à :
ko: 예제 매크로는 다음과 같습니다:
zh_hans: 一个宏的例子如下：

source: The resulting macro can be called from a [homing_override config section](Config_Reference.md#homing_override) or from a [START_PRINT macro](Slicers.md#klipper-gcode_macro).
de: Das resultierende Makro kann von einem [homing_override config section](Config_Reference.md#homing_override) oder von einem [START_PRINT macro](Slicers.md#klipper-gcode_macro) aufgerufen werden.
fr: La macro peut être appelée depuis une [section de configuration homing_override](Config_Reference.md#homing_override) ou depuis une [macro START_PRINT](Slicers.md#klipper-gcode_macro).
ko: 결과 매크로는 [homing_override 구성 섹션](Config_Reference.md#homing_override) 또는 [START_PRINT 매크로](Slicers.md#klipper-gcode_macro)에서 호출할 수 있습니다.
zh_hans: 产生的宏可以从[homing_override配置部分](Config_Reference.md#homing_override)或[START_PRINT宏](Slicers.md#klipper-gcode_macro)中调用。

source: Note that if the driver current during homing is changed, then the tuning process should be run again.
de: Wenn der Treiberstrom während der Referenzfahrt geändert wird, sollte der Abstimmungsprozess erneut durchgeführt werden.
fr: Notez que si le courant du pilote pas à pas lors de la mise à l'origine est modifié, le processus de réglage doit être entièrement refait.
ko: 원점복귀 중 드라이버 전류가 변경되면 튜닝 프로세스를 다시 실행해야 합니다.
zh_hans: 请注意，如果归位期间的驱动电流发生变化，则应重新运行调整过程。

source: Tips for sensorless homing on CoreXY
de: Tipps zur sensorlosen Referenzfahrt mit CoreXY
fr: Conseils pour la mise à l'origine sans capteur sur CoreXY
ko: CoreXY에서 센서리스 원점복귀를 위한 팁
zh_hans: 在CoreXY上进行无传感器归位的技巧

source: It is possible to use sensorless homing on the X and Y carriages of a CoreXY printer. Klipper uses the `[stepper_x]` stepper to detect stalls when homing the X carriage and uses the `[stepper_y]` stepper to detect stalls when homing the Y carriage.
de: Es ist möglich, die sensorlose Referenzfahrt auf den X- und Y-Schlitten eines CoreXY-Druckers zu verwenden. Klipper verwendet den `[stepper_x]` Stepper, um bei der Referenzfahrt des X-Schlittens einen Stillstand zu erkennen, und den `[stepper_y]` Stepper, um bei der Referenzfahrt des Y-Schlittens einen Stillstand zu erkennen.
fr: Il est possible d'utiliser la mise à l'origine sans capteur sur les chariots X et Y d'une imprimante CoreXY. Klipper utilise le stepper `[stepper_x]` pour détecter les décrochages lors de la mise à l'origine du chariot X et utilise le stepper `[stepper_y]` pour détecter les décrochages lors de la mise à l'origine du chariot Y.
ko: CoreXY 프린터의 X 및 Y 캐리지에서 센서리스 원점복귀를 사용할 수 있습니다. Klipper는 `[stepper_x]` 스테퍼를 사용하여 X 캐리지를 원점복귀할 때 stall을 감지하고 `[stepper_y]` 스테퍼를 사용하여 Y 캐리지를 원점복귀할 때 stall을 감지합니다.
zh_hans: 可以在CoreXY打印机的X和Y行车上使用无传感器归位。Klipper使用`[stepper_x]`步进器来检测X滑车归位时的失速，使用`[stepper_y]`步进器来检测Y滑车归位时的失速。

source: Use the tuning guide described above to find the appropriate "stall sensitivity" for each carriage, but be aware of the following restrictions:
de: Verwenden Sie die oben beschriebene Abstimmungsanleitung, um die geeignete "Überzieh-Empfindlichkeit" für jeden Wagen zu finden, aber beachten Sie die folgenden Einschränkungen:
fr: Utilisez le guide de réglage décrit ci-dessus pour trouver la "sensibilité au décrochage" appropriée pour chaque chariot, mais soyez conscient des restrictions suivantes :
ko: 위에서 설명한 조정 가이드를 사용하여 각 캐리지에 적절한 "stall 민감도"를 찾으십시오. 단, 다음 제한 사항에 유의하십시오:
zh_hans: 使用上述的调谐指南，为每个滑车找到合适的 "失速灵敏度"，但要注意以下限制：

source: While tuning, make sure both the X and Y carriages are near the center of their rails before each home attempt.
de: Vergewissern Sie sich bei der Einstellung, dass sich sowohl der X- als auch der Y-Wagen vor jedem Startversuch in der Mitte ihrer Schienen befinden.
fr: Pendant le réglage, assurez-vous que les chariots X et Y sont proches du centre de leurs rails avant chaque tentative de mise à l'origine.
ko: 조정하는 동안 각 원점복귀 시도 전에 X 및 Y 캐리지가 레일 중앙 근처에 있는지 확인하십시오.
zh_hans: 在调整时，确保X和Y车架在每次归位尝试前都接近其轨道的中心。
