Repository: Klipper3d/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Using_PWM_Tools.po
Languages: bg, hu, pt, ru, zh_hans, zh_hant

source: This document describes how to setup a PWM-controlled laser or spindle using `output_pin` and some macros.
bg: Този документ описва как да настроите лазер или шпиндел с ШИМ управление, като използвате `output_pin` и някои макроси.
hu: Ez a dokumentum leírja, hogyan állíthat be egy PWM-vezérelt lézert vagy orsót az `output_pin` és néhány makró segítségével.
pt: Este documento descreve como configurar um laser ou spindle controlado por PWM utilizando `output_pin` e algumas macros.
ru: В этом документе описывается, как настроить лазер или шпиндель с ШИМ-управлением, используя `output_pin` и некоторые макросы.
zh_hans: 该文档介绍如何配置 `output_pin` 和宏命令以实现使用 PWM 信号对激光器或主轴进行控制。
zh_hant: 該文件介紹如何配置 `output_pin` 和宏命令以實現使用 PWM 訊號對鐳射器或主軸進行控制。

source: How does it work?
bg: Как работи?
hu: Hogyan működik?
pt: Como funciona?
ru: Как это работает?
zh_hans: 它如何运作？
zh_hant: 它如何運作？

source: With re-purposing the printhead's fan pwm output, you can control lasers or spindles. This is useful if you use switchable print heads, for example the E3D toolchanger or a DIY solution. Usually, cam-tools such as LaserWeb can be configured to use `M3-M5` commands, which stand for *spindle speed CW* (`M3 S[0-255]`), *spindle speed CCW* (`M4 S[0-255]`) and *spindle stop* (`M5`).
bg: С повторното използване на изхода pwm на вентилатора на печатащата глава можете да управлявате лазери или шпиндели. Това е полезно, ако използвате превключваеми печатащи глави, например E3D toolchanger или решение "Направи си сам". Обикновено cam-инструментите, като LaserWeb, могат да бъдат конфигурирани да използват команди `M3-M5`, които означават *скорост на шпиндела CW* (`M3 S[0-255]`), *скорост на шпиндела CCW* (`M4 S[0-255]`) и *спиране на шпиндела* (`M5`).
hu: A nyomtatófej ventilátor pwm kimenetének felhasználásával lézereket vagy orsókat vezérelhet. Ez akkor hasznos, ha kapcsolható nyomtatófejeket használ, például az E3D toolchanger vagy egy barkácsmegoldás. Általában az olyan cam-toolok, mint a LaserWeb, úgy konfigurálhatók, hogy `M3-M5` parancsokat használjanak, amelyek *spindle speed CW* (`M3 S[0-255]`), *orsó fordulatszám * (`M4 S[0-255]`) és *orsóstop* (`M5`).
pt: Ao reutilizar a saída pwm da ventoinha da cabeça de impressão, pode controlar lasers ou fusos. Isto é útil se utilizar cabeças de impressão comutáveis, por exemplo, o permutador de ferramentas E3D ou uma solução DIY. Normalmente, as ferramentas de cames como o LaserWeb podem ser configuradas para usar comandos `M3-M5`, que significam *velocidade do fuso CW* (`M3 S[0-255]`), *velocidade do fuso CCW* (`M4 S[0-255]`) e *paragem do fuso* (`M5`).
ru: Перенастроив ШИМ-выход вентилятора печатающей головки, вы можете управлять лазерами или шпинделями. Это полезно, если вы используете переключаемые печатающие головки, например, E3D устройство для смены инструмента или решение "Сделай сам". Обычно кулачковые инструменты, такие как LaserWeb, могут быть сконфигурированы для использования команд `M3-M5`, которые обозначают *скорость вращения шпинделя CW * (`M3 S[0-255]`), * скорость вращения шпинделя CCW* (`M4 S[0-255]`) и * остановка шпинделя* (`M5`).
zh_hans: 通过重用打印头模型风扇(part fan)的PWM输出信号，我们可以实现对激光头或转轴的控制。对使用可更换打印头的设备，如E3D toolchanger 或其他DIY项目，这是十分有用的功能。通常，cam软件，例如LaserWeb，会使用`M3-M5`命令，它们分别是 主轴顺时针转速*spindle speed CW* (`M3 S[0-255]`)， 主轴逆时针转速*spindle speed CCW* (`M4 S[0-255]`) 和转轴停止 *spindle stop* (`M5`)。
zh_hant: 通過重用列印頭模型風扇(part fan)的PWM輸出訊號，我們可以實現對鐳射頭或轉軸的控制。對使用可更換列印頭的裝置，如E3D toolchanger 或其他DIY專案，這是十分有用的功能。通常，cam軟體，例如LaserWeb，會使用`M3-M5`命令，它們分別是 主軸順時針轉速*spindle speed CW* (`M3 S[0-255]`)， 主軸逆時針轉速*spindle speed CCW* (`M4 S[0-255]`) 和轉軸停止 *spindle stop* (`M5`)。

source: **Warning:** When driving a laser, keep all security precautions that you can think of! Diode lasers are usually inverted. This means, that when the MCU restarts, the laser will be *fully on* for the time it takes the MCU to start up again. For good measure, it is recommended to *always* wear appropriate laser-goggles of the right wavelength if the laser is powered; and to disconnect the laser when it is not needed. Also, you should configure a safety timeout, so that when your host or MCU encounters an error, the tool will stop.
bg: **Предупреждение:** Когато управлявате лазер, спазвайте всички мерки за сигурност, за които можете да се сетите! Диодните лазери обикновено са инвертирани. Това означава, че когато MCU се рестартира, лазерът ще бъде *изцяло на* за времето, необходимо на MCU да се стартира отново. За добра мярка се препоръчва винаги ** да носите подходящи лазерни очила с подходяща дължина на вълната, ако лазерът е захранен; и да изключвате лазера, когато не е необходим. Също така трябва да конфигурирате безопасно време за прекъсване, така че когато вашият хост или MCU се сблъска с грешка, инструментът да спре.
hu: **Figyelmeztetés:** A lézer vezetésekor tartson be minden biztonsági óvintézkedést, ami csak eszébe jut! A diódalézerek általában invertáltak. Ez azt jelenti, hogy amikor az MCU újraindul, a lézer *teljesen be lesz kapcsolva* arra az időre, amíg az MCU újraindul. A biztonság kedvéért ajánlott *mindig* megfelelő hullámhosszúságú lézerszemüveget viselni, ha a lézer be van kapcsolva; és a lézert le kell kapcsolni, ha nincs rá szükség. Emellett be kell állítania egy biztonsági időkorlátot, hogy ha a gazdagép vagy az MCU hibát észlel, a szerszám leálljon.
pt: **Aviso:** Ao acionar um laser, tome todas as precauções de segurança de que se possa lembrar! Os lasers de díodo são normalmente invertidos. Isto significa que, quando a MCU reinicia, o laser estará *completamente ligado* durante o tempo que a MCU demora a arrancar novamente. Para uma boa medida, recomenda-se *sempre* usar óculos de proteção contra laser adequados com o comprimento de onda correto se o laser estiver ligado; e desligar o laser quando não for necessário. Além disso, deve configurar um tempo limite de segurança, para que, quando o anfitrião ou a MCU encontrar um erro, a ferramenta pare.
ru: ** Внимание: ** При управлении лазером соблюдайте все возможные меры предосторожности! Диодные лазеры обычно инвертируются. Это означает, что при перезапуске MCU лазер будет * полностью включен * в течение времени, необходимого MCU для повторного запуска. Для достижения наилучших результатов рекомендуется * всегда * надевать соответствующие лазерные очки с нужной длиной волны, если лазер включен; и отключать лазер, когда он не нужен. Кроме того, вы должны настроить тайм-аут безопасности, чтобы, когда ваш хост или MCU столкнутся с ошибкой, инструмент остановится.
zh_hans: **警告：** 在驱动激光器时，应采用一切可能的预防措施。二极管激光一般是使用反信号的，即当微控制器重启时，激光将会*全功率输出*，直至微处理器恢复正常运作。 慎重而言，建议在激光器上电期间*始终*佩戴合适波长的护目镜；并在不使用激光时对激光器断电。同时，应该为激光器设置安全定时，保证在上位机和微控制器发生错误时，激光器能自动停止。
zh_hant: **警告：** 在驅動鐳射器時，應採用一切可能的預防措施。二極管鐳射一般是使用反訊號的，即當微控制器重啟時，鐳射將會*全功率輸出*，直至微處理器恢復正常運作。 慎重而言，建議在鐳射器上電期間*始終*佩戴合適波長的護目鏡；並在不使用鐳射時對鐳射器斷電。同時，應該為鐳射器設定安全定時，保證在上位機和微控制器發生錯誤時，鐳射器能自動停止。

source: Current Limitations
bg: Текущи ограничения
hu: Jelenlegi korlátozások
pt: Limitações atuais
ru: Текущие ограничения
zh_hans: 电流限制
zh_hant: 電流限制

source: There is a limitation of how frequent PWM updates may occur. While being very precise, a PWM update may only occur every 0.1 seconds, rendering it almost useless for raster engraving. However, there exists an [experimental branch](https://github.com/Cirromulus/klipper/tree/laser_tool) with its own tradeoffs. In long term, it is planned to add this functionality to main-line klipper.
bg: Съществува ограничение за това колко често могат да се извършват актуализации на ШИМ. Въпреки че е много прецизна, PWM актуализация може да се извършва само на всеки 0,1 секунди, което я прави почти безполезна за растерно гравиране. Съществува обаче [експериментален клон](https://github.com/Cirromulus/klipper/tree/laser_tool) със собствени компромиси. В дългосрочен план се планира добавяне на тази функционалност в клипъра от основната линия.
hu: Korlátozott, hogy milyen gyakoriak lehetnek a PWM-frissítések. Bár nagyon pontos, a PWM frissítés csak 0,1 másodpercenként fordulhat elő, így szinte használhatatlanná válik a rasztergravírozáshoz. Létezik azonban egy [kísérleti ág](https://github.com/Cirromulus/klipper/tree/laser_tool), amelynek saját kompromisszumai vannak. Hosszú távon azt tervezik, hogy ezt a funkciót hozzáadják a fővonali klipperhez.
pt: Existe uma limitação quanto à frequência com que as actualizações PWM podem ocorrer. Embora seja muito precisa, uma atualização PWM só pode ocorrer a cada 0,1 segundos, o que a torna quase inútil para a gravação raster. No entanto, existe um [ramo experimental] (https://github.com/Cirromulus/klipper/tree/laser_tool) com as suas próprias desvantagens. A longo prazo, está planeado adicionar esta funcionalidade ao klipper de linha principal.
ru: Существует ограничение на частоту обновления ШИМ. Несмотря на высокую точность, обновление ШИМ может происходить только раз в 0,1 секунды, что делает его практически бесполезным для растровой гравировки. Однако существует [экспериментальная ветвь](https://github.com/Cirromulus/klipper/tree/laser_tool) со своими собственными недостатками. В перспективе планируется добавить эту функциональность в основной klipper main-line klipper.
zh_hans: PWM脉冲发生的频率存在上限。尽管相当精确，但每隔0.1秒才能生成一个PWM脉冲，因而几乎无法用作光栅蚀刻。相对地，可使用以下[测试分支](https://github.com/Cirromulus/klipper/tree/laser_tool) 。它与主分支各有考量。长期计划中将上述功能加入到 Klipper 的主分支中。
zh_hant: PWM脈衝發生的頻率存在上限。儘管相當精確，但每隔0.1秒才能產生一個PWM脈衝，因而幾乎無法用作光柵蝕刻。相對地，可使用以下[測試分支](https://github.com/Cirromulus/klipper/tree/laser_tool) 。它與主分支各有考量。長期計劃中將上述功能加入到 Klipper 的主分支中。

source: Commands
bg: Команди
hu: Parancsok
pt: Comandos
ru: Команды
zh_hans: 命令
zh_hant: 命令

source: `M3/M4 S<value>` : Set PWM duty-cycle. Values between 0 and 255. `M5` : Stop PWM output to shutdown value.
bg: `M3/M4 S<стойност>`: Задайте работния цикъл на ШИМ. Стойности между 0 и 255. `M5`: Спиране на ШИМ изхода до стойност за изключване.
hu: `M3/M4 S<value>` : PWM-üzemmód beállítása. Értékek 0 és 255 között. `M5` : PWM kimenet leállítása a kikapcsolási értékre.
pt: `M3/M4 S<value>` : Define o ciclo de trabalho PWM. Valores entre 0 e 255. M5` : Parar a saída PWM para o valor de paragem.
ru: `M3/M4 S<значение>` : Установка длительности цикла ШИМ. Значения от 0 до 255. `M5` : Остановка вывода ШИМ на значение отключения.
zh_hans: `M3/M4 S<值>` ：设置 PWM 占空比。占空比数值应在0和255之间。 `M5` : 停止 PWM 信号输出。
zh_hant: `M3/M4 S<值>` ：設定 PWM 占空比。占空比數值應在0和255之間。 `M5` : 停止 PWM 訊號輸出。

source: Laserweb Configuration
bg: Конфигурация на Laserweb
hu: Laserweb konfiguráció
pt: Configuração Laserweb
ru: Конфигурация лазерной сети
zh_hans: LaserWeb 端配置
zh_hant: LaserWeb 端配置

source: If you use Laserweb, a working configuration would be:
bg: Ако използвате Laserweb, една работеща конфигурация би била:
hu: Ha a Laserwebet használja, akkor a következő konfiguráció működhet:
pt: Se utilizar o Laserweb, uma configuração funcional seria a seguinte:
ru: Если вы используете Laserweb, то рабочей конфигурацией будет следующая:
zh_hans: 如果你使用的是 LaserWeb 软件，一个可用的配置为：
zh_hant: 如果你使用的是 LaserWeb 軟體，一個可用的配置為：

source: GCODE START: M5 ; Disable Laser G21 ; Set units to mm G90 ; Absolute positioning G0 Z0 F7000 ; Set Non-Cutting speed GCODE END: M5 ; Disable Laser G91 ; relative G0 Z+20 F4000 ; G90 ; absolute GCODE HOMING: M5 ; Disable Laser G28 ; Home all axis TOOL ON: M3 $INTENSITY TOOL OFF: M5 ; Disable Laser LASER INTENSITY: S
hu: GCODE START: M5 ; Lézer kikapcsolása G21 ; Egységek beállítása mm-re G90 ; Abszolút pozicionálás G0 Z0 F7000 ; Nem vágási sebesség beállítása GCODE END: M5 ; Lézer kikapcsolása G91 ; relatív G0 Z+20 F4000 ; G90 ; abszolút GCODE HOMING: M5 ; Lézer kikapcsolása G28 ; Minden tengely alaphelyzetbe állítása TOOL ON: M3 $INTENSITY TOOL OFF: M5 ; Lézer kikapcsolása LASER INTENSITY: S
pt: GCODE START: M5 ; Desativar laser G21 ; Definir unidades para mm G90 ; Posicionamento absoluto G0 Z0 F7000 ; Ajustar velocidade de não corte GCODE END: M5 ; Desativar o laser G91 ; relativo G0 Z+20 F4000 ; G90 ; absoluto GCODE HOMING: M5 ; Desativar laser G28 ; Colocar todos os eixos em posição inicial TOOL ON: M3 $INTENSITY TOOL OFF: M5 ; Desativar laser LASER INTENSITY: S
ru: GCODE START: M5 ; Отключить лазер G21 ; Установить единицы измерения на мм G90 ; Абсолютное позиционирование G0 Z0 F7000 ; Установить скорость отсутствия резания GCODE END: M5 ; Отключить лазер G91 ; относительное G0 Z+20 F4000 ; G90 ; абсолютный GCODE HOMING: M5 ; Отключить лазер G28 ; Вывод всех осей в исходное положение TOOL ON: M3 $INTENSITY TOOL OFF: M5 ; Отключить лазер ИНТЕНСИВНОСТЬ ЛАЗЕРА: S
zh_hans: GCODE START: 启动 G 代码 M5 ; 停用激光 G21 ; 使用mm作为单位 G90 ; 使用绝对坐标 G0 Z0 F7000 ; 设置空走速度 GCODE END: 结束 G 代码 M5 ; 停用激光 G91 ; 使用相对坐标 G0 Z+20 F4000 ; G90 ; 使用绝对坐标 GCODE HOMING: 归零 G 代码 M5 ; 停用激光 G28 ; 全轴归零 TOOL ON: 开启工具 M3 $INTENSITY TOOL OFF: 关闭工具 M5 ; 停用激光 LASER INTENSITY: 激光强度 S
zh_hant: GCODE START: 啟動 G 程式碼 M5 ; 停用鐳射 G21 ; 使用mm作為單位 G90 ; 使用絕對座標 G0 Z0 F7000 ; 設定空走速度 GCODE END: 結束 G 程式碼 M5 ; 停用鐳射 G91 ; 使用相對座標 G0 Z+20 F4000 ; G90 ; 使用絕對座標 GCODE HOMING: 歸零 G 程式碼 M5 ; 停用鐳射 G28 ; 全軸歸零 TOOL ON: 開啟工具 M3 $INTENSITY TOOL OFF: 關閉工具 M5 ; 停用鐳射 LASER INTENSITY: 鐳射強度 S

source: Using PWM tools
bg: Използване на инструменти за ШИМ
hu: PWM eszközök használata
pt: Utilização de ferramentas PWM
ru: Использование инструментов ШИМ
zh_hans: 使用 PWM 工具
zh_hant: 使用 PWM 工具

source: For an example configuration, see [config/sample-pwm-tool.cfg](/config/sample-pwm-tool.cfg).
bg: За примерна конфигурация вижте [config/sample-pwm-tool.cfg](/config/sample-pwm-tool.cfg).
hu: Egy példakonfigurációért lásd [config/sample-pwm-tool.cfg](/config/sample-pwm-tool.cfg).
pt: Para um exemplo de configuração, consulte [config/sample-pwm-tool.cfg](/config/sample-pwm-tool.cfg).
ru: Пример конфигурации приведен в разделе [config/sample-pwm-tool.cfg](/config/sample-pwm-tool.cfg).
zh_hant: 有關示例配置，請參閱 [config/sample-pwm-tool.cfg](/config/sample-pwm-tool.cfg)。
